#pragma once 
#include "SDK.h" 
 
 
// Function ABP_Prisoner_SpineLeaning.ABP_Prisoner_SpineLeaning_C.ExecuteUbergraph_ABP_Prisoner_SpineLeaning
// Size: 0x5C(Inherited: 0x0) 
struct FExecuteUbergraph_ABP_Prisoner_SpineLeaning
{
	int32_t EntryPoint;  // 0x0(0x4)
	float CallFunc_Abs_ReturnValue;  // 0x4(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue;  // 0x8(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_2;  // 0xC(0x4)
	struct FVector CallFunc_MakeVector_ReturnValue;  // 0x10(0xC)
	float CallFunc_Multiply_FloatFloat_ReturnValue_3;  // 0x1C(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_4;  // 0x20(0x4)
	struct FRotator CallFunc_MakeRotator_ReturnValue;  // 0x24(0xC)
	struct FRotator CallFunc_MakeRotator_ReturnValue_2;  // 0x30(0xC)
	float CallFunc_Multiply_FloatFloat_ReturnValue_5;  // 0x3C(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_6;  // 0x40(0x4)
	struct FRotator CallFunc_MakeRotator_ReturnValue_3;  // 0x44(0xC)
	struct FRotator CallFunc_MakeRotator_ReturnValue_4;  // 0x50(0xC)

}; 
// Function ABP_Prisoner_SpineLeaning.ABP_Prisoner_SpineLeaning_C.AnimGraph
// Size: 0x20(Inherited: 0x0) 
struct FAnimGraph
{
	struct FPoseLink InPose;  // 0x0(0x10)
	struct FPoseLink AnimGraph;  // 0x10(0x10)

}; 
