#pragma once 
#include "SDK.h" 
 
 
// Function ABP_MH_Bartender.ABP_MH_Bartender_C.BlueprintUpdateAnimation
// Size: 0x4(Inherited: 0x4) 
struct FBlueprintUpdateAnimation : public FBlueprintUpdateAnimation
{
	float DeltaTimeX;  // 0x0(0x4)

}; 
// Function ABP_MH_Bartender.ABP_MH_Bartender_C.ExecuteUbergraph_ABP_MH_Bartender
// Size: 0x364(Inherited: 0x0) 
struct FExecuteUbergraph_ABP_MH_Bartender
{
	int32_t EntryPoint;  // 0x0(0x4)
	struct FVector CallFunc_BreakTransform_Location;  // 0x4(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation;  // 0x10(0xC)
	struct FVector CallFunc_BreakTransform_Scale;  // 0x1C(0xC)
	struct FVector CallFunc_BreakTransform_Location_2;  // 0x28(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_2;  // 0x34(0xC)
	struct FVector CallFunc_BreakTransform_Scale_2;  // 0x40(0xC)
	struct FVector CallFunc_BreakTransform_Location_3;  // 0x4C(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_3;  // 0x58(0xC)
	struct FVector CallFunc_BreakTransform_Scale_3;  // 0x64(0xC)
	struct FVector CallFunc_BreakTransform_Location_4;  // 0x70(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_4;  // 0x7C(0xC)
	struct FVector CallFunc_BreakTransform_Scale_4;  // 0x88(0xC)
	float K2Node_Event_DeltaTimeX;  // 0x94(0x4)
	struct APawn* CallFunc_TryGetPawnOwner_ReturnValue;  // 0x98(0x8)
	struct ACharacter* K2Node_DynamicCast_AsCharacter;  // 0xA0(0x8)
	char pad_168_1 : 7;  // 0xA8(0x1)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0xA8(0x1)
	char pad_169[7];  // 0xA9(0x7)
	struct ACharacter* CallFunc_GetPlayerCharacter_ReturnValue;  // 0xB0(0x8)
	char pad_184_1 : 7;  // 0xB8(0x1)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0xB8(0x1)
	char pad_185[7];  // 0xB9(0x7)
	struct FTransform CallFunc_GetSocketTransform_ReturnValue;  // 0xC0(0x30)
	struct FTransform CallFunc_InvertTransform_ReturnValue;  // 0xF0(0x30)
	struct FVector CallFunc_GetActorEyesViewPoint_OutLocation;  // 0x120(0xC)
	struct FRotator CallFunc_GetActorEyesViewPoint_OutRotation;  // 0x12C(0xC)
	struct FVector CallFunc_TransformLocation_ReturnValue;  // 0x138(0xC)
	char pad_324[12];  // 0x144(0xC)
	struct FTransform CallFunc_GetSocketTransform_ReturnValue_2;  // 0x150(0x30)
	float CallFunc_BreakVector_X;  // 0x180(0x4)
	float CallFunc_BreakVector_Y;  // 0x184(0x4)
	float CallFunc_BreakVector_Z;  // 0x188(0x4)
	struct FVector CallFunc_MakeVector_ReturnValue;  // 0x18C(0xC)
	float CallFunc_Subtract_FloatFloat_ReturnValue;  // 0x198(0x4)
	struct FVector CallFunc_Normal_ReturnValue;  // 0x19C(0xC)
	struct FVector CallFunc_MakeVector_ReturnValue_2;  // 0x1A8(0xC)
	char pad_436[12];  // 0x1B4(0xC)
	struct FTransform CallFunc_GetSocketTransform_ReturnValue_3;  // 0x1C0(0x30)
	struct FVector CallFunc_Normal_ReturnValue_2;  // 0x1F0(0xC)
	char pad_508[4];  // 0x1FC(0x4)
	struct FTransform CallFunc_GetSocketTransform_ReturnValue_4;  // 0x200(0x30)
	struct FTransform CallFunc_GetSocketTransform_ReturnValue_5;  // 0x230(0x30)
	struct FTransform CallFunc_GetSocketTransform_ReturnValue_6;  // 0x260(0x30)
	struct FVector CallFunc_BreakTransform_Location_5;  // 0x290(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_5;  // 0x29C(0xC)
	struct FVector CallFunc_BreakTransform_Scale_5;  // 0x2A8(0xC)
	struct FVector CallFunc_MakeVector_ReturnValue_3;  // 0x2B4(0xC)
	struct FVector CallFunc_MakeVector_ReturnValue_4;  // 0x2C0(0xC)
	float CallFunc_Dot_VectorVector_ReturnValue;  // 0x2CC(0x4)
	float CallFunc_Dot_VectorVector_ReturnValue_2;  // 0x2D0(0x4)
	float CallFunc_DegAcos_ReturnValue;  // 0x2D4(0x4)
	float CallFunc_SignOfFloat_ReturnValue;  // 0x2D8(0x4)
	struct FVector CallFunc_MakeVector_ReturnValue_5;  // 0x2DC(0xC)
	float CallFunc_Multiply_FloatFloat_ReturnValue;  // 0x2E8(0x4)
	float CallFunc_Dot_VectorVector_ReturnValue_3;  // 0x2EC(0x4)
	float CallFunc_FClamp_ReturnValue;  // 0x2F0(0x4)
	float CallFunc_DegAcos_ReturnValue_2;  // 0x2F4(0x4)
	struct FRotator CallFunc_MakeRotator_ReturnValue;  // 0x2F8(0xC)
	char pad_772[4];  // 0x304(0x4)
	struct FString CallFunc_Conv_FloatToString_ReturnValue;  // 0x308(0x10)
	struct FVector CallFunc_MakeVector_ReturnValue_6;  // 0x318(0xC)
	float CallFunc_Dot_VectorVector_ReturnValue_4;  // 0x324(0x4)
	float CallFunc_GetGameTimeInSeconds_ReturnValue;  // 0x328(0x4)
	float CallFunc_SignOfFloat_ReturnValue_2;  // 0x32C(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_2;  // 0x330(0x4)
	float CallFunc_FClamp_ReturnValue_2;  // 0x334(0x4)
	struct FRotator CallFunc_MakeRotator_ReturnValue_2;  // 0x338(0xC)
	char pad_836[4];  // 0x344(0x4)
	struct FString CallFunc_Conv_FloatToString_ReturnValue_2;  // 0x348(0x10)
	struct FRotator CallFunc_ComposeRotators_ReturnValue;  // 0x358(0xC)

}; 
// Function ABP_MH_Bartender.ABP_MH_Bartender_C.AnimGraph
// Size: 0x10(Inherited: 0x0) 
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0(0x10)

}; 
