#pragma once 
#include "SDK.h" 
 
 
// Function ABP_Prisoner.ABP_Prisoner_C.ShouldSkipStandWalkOrJogOrRunStart
// Size: 0x11(Inherited: 0x0) 
struct FShouldSkipStandWalkOrJogOrRunStart
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Result : 1;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue : 1;  // 0x1(0x1)
	char pad_2_1 : 7;  // 0x2(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_2 : 1;  // 0x2(0x1)
	char pad_3_1 : 7;  // 0x3(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_3 : 1;  // 0x3(0x1)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_4 : 1;  // 0x4(0x1)
	char pad_5_1 : 7;  // 0x5(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_5 : 1;  // 0x5(0x1)
	char pad_6_1 : 7;  // 0x6(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_6 : 1;  // 0x6(0x1)
	char pad_7_1 : 7;  // 0x7(0x1)
	bool CallFunc_IsCourseAngleSupportedByStartAndStopAnimations_ReturnValue : 1;  // 0x7(0x1)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool CallFunc_Not_PreBool_ReturnValue : 1;  // 0x8(0x1)
	char pad_9_1 : 7;  // 0x9(0x1)
	bool CallFunc_BooleanOR_ReturnValue : 1;  // 0x9(0x1)
	char pad_10_1 : 7;  // 0xA(0x1)
	bool CallFunc_BooleanOR_ReturnValue_2 : 1;  // 0xA(0x1)
	char pad_11_1 : 7;  // 0xB(0x1)
	bool CallFunc_BooleanOR_ReturnValue_3 : 1;  // 0xB(0x1)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool CallFunc_BooleanOR_ReturnValue_4 : 1;  // 0xC(0x1)
	char pad_13_1 : 7;  // 0xD(0x1)
	bool CallFunc_BooleanOR_ReturnValue_5 : 1;  // 0xD(0x1)
	char pad_14_1 : 7;  // 0xE(0x1)
	bool CallFunc_BooleanOR_ReturnValue_6 : 1;  // 0xE(0x1)
	char pad_15_1 : 7;  // 0xF(0x1)
	bool CallFunc_BooleanOR_ReturnValue_7 : 1;  // 0xF(0x1)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool CallFunc_BooleanOR_ReturnValue_8 : 1;  // 0x10(0x1)

}; 
// Function ABP_Prisoner.ABP_Prisoner_C.DrawDebugOutput
// Size: 0x10(Inherited: 0x0) 
struct FDrawDebugOutput
{
	struct FString CallFunc_Conv_BoolToString_ReturnValue;  // 0x0(0x10)

}; 
// Function ABP_Prisoner.ABP_Prisoner_C.ExecuteUbergraph_ABP_Prisoner
// Size: 0x2568(Inherited: 0x0) 
struct FExecuteUbergraph_ABP_Prisoner
{
	int32_t EntryPoint;  // 0x0(0x4)
	float Temp_float_Variable;  // 0x4(0x4)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue : 1;  // 0x8(0x1)
	char pad_9_1 : 7;  // 0x9(0x1)
	bool CallFunc_Not_PreBool_ReturnValue : 1;  // 0x9(0x1)
	char pad_10_1 : 7;  // 0xA(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_2 : 1;  // 0xA(0x1)
	char pad_11_1 : 7;  // 0xB(0x1)
	bool CallFunc_BooleanAND_ReturnValue : 1;  // 0xB(0x1)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue : 1;  // 0xC(0x1)
	char pad_13_1 : 7;  // 0xD(0x1)
	bool CallFunc_BooleanAND_ReturnValue_2 : 1;  // 0xD(0x1)
	char pad_14[2];  // 0xE(0x2)
	float CallFunc_SelectFloat_ReturnValue;  // 0x10(0x4)
	char pad_20_1 : 7;  // 0x14(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_3 : 1;  // 0x14(0x1)
	char pad_21_1 : 7;  // 0x15(0x1)
	bool CallFunc_BooleanAND_ReturnValue_3 : 1;  // 0x15(0x1)
	char pad_22[2];  // 0x16(0x2)
	float CallFunc_SelectFloat_ReturnValue_2;  // 0x18(0x4)
	char pad_28_1 : 7;  // 0x1C(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_4 : 1;  // 0x1C(0x1)
	char pad_29_1 : 7;  // 0x1D(0x1)
	bool CallFunc_BooleanAND_ReturnValue_4 : 1;  // 0x1D(0x1)
	char pad_30_1 : 7;  // 0x1E(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_2 : 1;  // 0x1E(0x1)
	char pad_31_1 : 7;  // 0x1F(0x1)
	bool CallFunc_IsCourseAngleSupportedByStartAndStopAnimations_ReturnValue : 1;  // 0x1F(0x1)
	char pad_32_1 : 7;  // 0x20(0x1)
	bool CallFunc_BooleanOR_ReturnValue : 1;  // 0x20(0x1)
	char pad_33_1 : 7;  // 0x21(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_3 : 1;  // 0x21(0x1)
	char pad_34_1 : 7;  // 0x22(0x1)
	bool CallFunc_BooleanOR_ReturnValue_2 : 1;  // 0x22(0x1)
	char pad_35_1 : 7;  // 0x23(0x1)
	bool CallFunc_BooleanOR_ReturnValue_3 : 1;  // 0x23(0x1)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue;  // 0x24(0x4)
	char pad_40_1 : 7;  // 0x28(0x1)
	bool CallFunc_BooleanAND_ReturnValue_5 : 1;  // 0x28(0x1)
	char pad_41_1 : 7;  // 0x29(0x1)
	bool CallFunc_BooleanAND_ReturnValue_6 : 1;  // 0x29(0x1)
	char pad_42[2];  // 0x2A(0x2)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue;  // 0x2C(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue;  // 0x30(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue;  // 0x34(0x4)
	float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue;  // 0x38(0x4)
	char pad_60_1 : 7;  // 0x3C(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_5 : 1;  // 0x3C(0x1)
	char pad_61_1 : 7;  // 0x3D(0x1)
	bool CallFunc_LessEqual_FloatFloat_ReturnValue : 1;  // 0x3D(0x1)
	char pad_62[2];  // 0x3E(0x2)
	float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2;  // 0x40(0x4)
	char pad_68_1 : 7;  // 0x44(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_6 : 1;  // 0x44(0x1)
	char pad_69_1 : 7;  // 0x45(0x1)
	bool CallFunc_LessEqual_FloatFloat_ReturnValue_2 : 1;  // 0x45(0x1)
	char pad_70[2];  // 0x46(0x2)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_2;  // 0x48(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_2;  // 0x4C(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_2;  // 0x50(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_2;  // 0x54(0x4)
	float CallFunc_SelectFloat_ReturnValue_3;  // 0x58(0x4)
	float CallFunc_RandomFloatInRangeFromStream_ReturnValue;  // 0x5C(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue;  // 0x60(0x4)
	float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3;  // 0x64(0x4)
	char pad_104_1 : 7;  // 0x68(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_7 : 1;  // 0x68(0x1)
	char pad_105_1 : 7;  // 0x69(0x1)
	bool CallFunc_LessEqual_FloatFloat_ReturnValue_3 : 1;  // 0x69(0x1)
	char pad_106[2];  // 0x6A(0x2)
	float CallFunc_GetInstanceStateWeight_ReturnValue;  // 0x6C(0x4)
	char pad_112_1 : 7;  // 0x70(0x1)
	bool CallFunc_BooleanAND_ReturnValue_7 : 1;  // 0x70(0x1)
	char pad_113_1 : 7;  // 0x71(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_2 : 1;  // 0x71(0x1)
	char pad_114[2];  // 0x72(0x2)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_3;  // 0x74(0x4)
	char pad_120_1 : 7;  // 0x78(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_8 : 1;  // 0x78(0x1)
	char pad_121[3];  // 0x79(0x3)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_3;  // 0x7C(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_3;  // 0x80(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_3;  // 0x84(0x4)
	char pad_136_1 : 7;  // 0x88(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_9 : 1;  // 0x88(0x1)
	char pad_137_1 : 7;  // 0x89(0x1)
	bool CallFunc_IsCourseAngleSupportedByStartAndStopAnimations_ReturnValue_2 : 1;  // 0x89(0x1)
	char pad_138[2];  // 0x8A(0x2)
	float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4;  // 0x8C(0x4)
	char pad_144_1 : 7;  // 0x90(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_4 : 1;  // 0x90(0x1)
	char pad_145_1 : 7;  // 0x91(0x1)
	bool CallFunc_LessEqual_FloatFloat_ReturnValue_4 : 1;  // 0x91(0x1)
	char pad_146_1 : 7;  // 0x92(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_10 : 1;  // 0x92(0x1)
	char pad_147_1 : 7;  // 0x93(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_11 : 1;  // 0x93(0x1)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_4;  // 0x94(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_4;  // 0x98(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_4;  // 0x9C(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_4;  // 0xA0(0x4)
	float CallFunc_SelectFloat_ReturnValue_4;  // 0xA4(0x4)
	float CallFunc_RandomFloatInRangeFromStream_ReturnValue_2;  // 0xA8(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_2;  // 0xAC(0x4)
	char pad_176_1 : 7;  // 0xB0(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_12 : 1;  // 0xB0(0x1)
	char pad_177_1 : 7;  // 0xB1(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_13 : 1;  // 0xB1(0x1)
	char pad_178[2];  // 0xB2(0x2)
	float CallFunc_GetKnownCurveValueOnWorkerThread_ReturnValue;  // 0xB4(0x4)
	float CallFunc_SelectFloat_ReturnValue_5;  // 0xB8(0x4)
	char pad_188_1 : 7;  // 0xBC(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_3 : 1;  // 0xBC(0x1)
	char pad_189_1 : 7;  // 0xBD(0x1)
	bool CallFunc_BooleanOR_ReturnValue_4 : 1;  // 0xBD(0x1)
	char pad_190_1 : 7;  // 0xBE(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_14 : 1;  // 0xBE(0x1)
	char pad_191_1 : 7;  // 0xBF(0x1)
	bool CallFunc_BooleanOR_ReturnValue_5 : 1;  // 0xBF(0x1)
	char pad_192_1 : 7;  // 0xC0(0x1)
	bool CallFunc_BooleanAND_ReturnValue_8 : 1;  // 0xC0(0x1)
	char pad_193_1 : 7;  // 0xC1(0x1)
	bool CallFunc_BooleanAND_ReturnValue_9 : 1;  // 0xC1(0x1)
	char pad_194[2];  // 0xC2(0x2)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_5;  // 0xC4(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_5;  // 0xC8(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_5;  // 0xCC(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_5;  // 0xD0(0x4)
	float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5;  // 0xD4(0x4)
	char pad_216_1 : 7;  // 0xD8(0x1)
	bool CallFunc_LessEqual_FloatFloat_ReturnValue_5 : 1;  // 0xD8(0x1)
	char pad_217_1 : 7;  // 0xD9(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_15 : 1;  // 0xD9(0x1)
	char pad_218_1 : 7;  // 0xDA(0x1)
	bool CallFunc_BooleanAND_ReturnValue_10 : 1;  // 0xDA(0x1)
	char pad_219[1];  // 0xDB(0x1)
	struct FVector CallFunc_BreakTransform_Location;  // 0xDC(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation;  // 0xE8(0xC)
	struct FVector CallFunc_BreakTransform_Scale;  // 0xF4(0xC)
	char pad_256_1 : 7;  // 0x100(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_16 : 1;  // 0x100(0x1)
	char pad_257[3];  // 0x101(0x3)
	float CallFunc_SelectFloat_ReturnValue_6;  // 0x104(0x4)
	char pad_264_1 : 7;  // 0x108(0x1)
	bool CallFunc_BooleanAND_ReturnValue_11 : 1;  // 0x108(0x1)
	char pad_265_1 : 7;  // 0x109(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_17 : 1;  // 0x109(0x1)
	char pad_266_1 : 7;  // 0x10A(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_18 : 1;  // 0x10A(0x1)
	char pad_267_1 : 7;  // 0x10B(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_5 : 1;  // 0x10B(0x1)
	char pad_268_1 : 7;  // 0x10C(0x1)
	bool CallFunc_BooleanAND_ReturnValue_12 : 1;  // 0x10C(0x1)
	char pad_269_1 : 7;  // 0x10D(0x1)
	bool CallFunc_BooleanOR_ReturnValue_6 : 1;  // 0x10D(0x1)
	char pad_270[2];  // 0x10E(0x2)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_6;  // 0x110(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_6;  // 0x114(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_6;  // 0x118(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_6;  // 0x11C(0x4)
	float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_6;  // 0x120(0x4)
	char pad_292_1 : 7;  // 0x124(0x1)
	bool CallFunc_LessEqual_FloatFloat_ReturnValue_6 : 1;  // 0x124(0x1)
	char pad_293_1 : 7;  // 0x125(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_19 : 1;  // 0x125(0x1)
	char pad_294_1 : 7;  // 0x126(0x1)
	bool CallFunc_BooleanAND_ReturnValue_13 : 1;  // 0x126(0x1)
	char pad_295[1];  // 0x127(0x1)
	struct FVector CallFunc_BreakTransform_Location_2;  // 0x128(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_2;  // 0x134(0xC)
	struct FVector CallFunc_BreakTransform_Scale_2;  // 0x140(0xC)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_7;  // 0x14C(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_7;  // 0x150(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_7;  // 0x154(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_7;  // 0x158(0x4)
	struct FVector CallFunc_BreakTransform_Location_3;  // 0x15C(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_3;  // 0x168(0xC)
	struct FVector CallFunc_BreakTransform_Scale_3;  // 0x174(0xC)
	float CallFunc_SelectFloat_ReturnValue_7;  // 0x180(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_8;  // 0x184(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_8;  // 0x188(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_8;  // 0x18C(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_8;  // 0x190(0x4)
	struct FVector CallFunc_BreakTransform_Location_4;  // 0x194(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_4;  // 0x1A0(0xC)
	struct FVector CallFunc_BreakTransform_Scale_4;  // 0x1AC(0xC)
	char pad_440_1 : 7;  // 0x1B8(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_20 : 1;  // 0x1B8(0x1)
	char pad_441[3];  // 0x1B9(0x3)
	float CallFunc_SelectFloat_ReturnValue_8;  // 0x1BC(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_9;  // 0x1C0(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_9;  // 0x1C4(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_9;  // 0x1C8(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_9;  // 0x1CC(0x4)
	struct FVector CallFunc_BreakTransform_Location_5;  // 0x1D0(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_5;  // 0x1DC(0xC)
	struct FVector CallFunc_BreakTransform_Scale_5;  // 0x1E8(0xC)
	uint8_t  CallFunc_GetCardinalDirectionFromCourseAngle_ReturnValue;  // 0x1F4(0x1)
	char pad_501_1 : 7;  // 0x1F5(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_21 : 1;  // 0x1F5(0x1)
	char pad_502_1 : 7;  // 0x1F6(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_22 : 1;  // 0x1F6(0x1)
	char pad_503[1];  // 0x1F7(0x1)
	float CallFunc_SelectFloat_ReturnValue_9;  // 0x1F8(0x4)
	float CallFunc_SelectFloat_ReturnValue_10;  // 0x1FC(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_10;  // 0x200(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_10;  // 0x204(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_10;  // 0x208(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_10;  // 0x20C(0x4)
	struct FVector CallFunc_BreakTransform_Location_6;  // 0x210(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_6;  // 0x21C(0xC)
	struct FVector CallFunc_BreakTransform_Scale_6;  // 0x228(0xC)
	char pad_564_1 : 7;  // 0x234(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_6 : 1;  // 0x234(0x1)
	char pad_565_1 : 7;  // 0x235(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_23 : 1;  // 0x235(0x1)
	char pad_566[2];  // 0x236(0x2)
	float CallFunc_SelectFloat_ReturnValue_11;  // 0x238(0x4)
	char pad_572_1 : 7;  // 0x23C(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_7 : 1;  // 0x23C(0x1)
	char pad_573[3];  // 0x23D(0x3)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_11;  // 0x240(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_11;  // 0x244(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_11;  // 0x248(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_11;  // 0x24C(0x4)
	struct FVector CallFunc_BreakTransform_Location_7;  // 0x250(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_7;  // 0x25C(0xC)
	struct FVector CallFunc_BreakTransform_Scale_7;  // 0x268(0xC)
	char pad_628_1 : 7;  // 0x274(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_24 : 1;  // 0x274(0x1)
	char pad_629_1 : 7;  // 0x275(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_25 : 1;  // 0x275(0x1)
	char pad_630[2];  // 0x276(0x2)
	float CallFunc_SelectFloat_ReturnValue_12;  // 0x278(0x4)
	char pad_636_1 : 7;  // 0x27C(0x1)
	bool CallFunc_BooleanOR_ReturnValue_7 : 1;  // 0x27C(0x1)
	char pad_637[3];  // 0x27D(0x3)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_12;  // 0x280(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_12;  // 0x284(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_12;  // 0x288(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_12;  // 0x28C(0x4)
	struct FVector CallFunc_BreakTransform_Location_8;  // 0x290(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_8;  // 0x29C(0xC)
	struct FVector CallFunc_BreakTransform_Scale_8;  // 0x2A8(0xC)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_13;  // 0x2B4(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_13;  // 0x2B8(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_13;  // 0x2BC(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_13;  // 0x2C0(0x4)
	struct FVector CallFunc_BreakTransform_Location_9;  // 0x2C4(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_9;  // 0x2D0(0xC)
	struct FVector CallFunc_BreakTransform_Scale_9;  // 0x2DC(0xC)
	char pad_744_1 : 7;  // 0x2E8(0x1)
	bool CallFunc_BooleanOR_ReturnValue_8 : 1;  // 0x2E8(0x1)
	char pad_745_1 : 7;  // 0x2E9(0x1)
	bool CallFunc_BooleanAND_ReturnValue_14 : 1;  // 0x2E9(0x1)
	char pad_746_1 : 7;  // 0x2EA(0x1)
	bool CallFunc_BooleanAND_ReturnValue_15 : 1;  // 0x2EA(0x1)
	char pad_747_1 : 7;  // 0x2EB(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_26 : 1;  // 0x2EB(0x1)
	char pad_748_1 : 7;  // 0x2EC(0x1)
	bool CallFunc_BooleanAND_ReturnValue_16 : 1;  // 0x2EC(0x1)
	char pad_749[3];  // 0x2ED(0x3)
	float CallFunc_SelectFloat_ReturnValue_13;  // 0x2F0(0x4)
	char pad_756_1 : 7;  // 0x2F4(0x1)
	bool CallFunc_BooleanAND_ReturnValue_17 : 1;  // 0x2F4(0x1)
	char pad_757[3];  // 0x2F5(0x3)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_14;  // 0x2F8(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_14;  // 0x2FC(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_14;  // 0x300(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_14;  // 0x304(0x4)
	struct FVector CallFunc_BreakTransform_Location_10;  // 0x308(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_10;  // 0x314(0xC)
	struct FVector CallFunc_BreakTransform_Scale_10;  // 0x320(0xC)
	char pad_812_1 : 7;  // 0x32C(0x1)
	bool CallFunc_BooleanOR_ReturnValue_9 : 1;  // 0x32C(0x1)
	char pad_813_1 : 7;  // 0x32D(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_27 : 1;  // 0x32D(0x1)
	char pad_814[2];  // 0x32E(0x2)
	float CallFunc_SelectFloat_ReturnValue_14;  // 0x330(0x4)
	float CallFunc_SelectFloat_ReturnValue_15;  // 0x334(0x4)
	float CallFunc_SelectFloat_ReturnValue_16;  // 0x338(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_15;  // 0x33C(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_15;  // 0x340(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_15;  // 0x344(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_15;  // 0x348(0x4)
	struct FVector CallFunc_BreakTransform_Location_11;  // 0x34C(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_11;  // 0x358(0xC)
	struct FVector CallFunc_BreakTransform_Scale_11;  // 0x364(0xC)
	float CallFunc_SelectFloat_ReturnValue_17;  // 0x370(0x4)
	struct FVector CallFunc_BreakTransform_Location_12;  // 0x374(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_12;  // 0x380(0xC)
	struct FVector CallFunc_BreakTransform_Scale_12;  // 0x38C(0xC)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_16;  // 0x398(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_16;  // 0x39C(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_16;  // 0x3A0(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_16;  // 0x3A4(0x4)
	struct FVector CallFunc_BreakTransform_Location_13;  // 0x3A8(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_13;  // 0x3B4(0xC)
	struct FVector CallFunc_BreakTransform_Scale_13;  // 0x3C0(0xC)
	float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_7;  // 0x3CC(0x4)
	char pad_976_1 : 7;  // 0x3D0(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_28 : 1;  // 0x3D0(0x1)
	char pad_977_1 : 7;  // 0x3D1(0x1)
	bool CallFunc_LessEqual_FloatFloat_ReturnValue_7 : 1;  // 0x3D1(0x1)
	char pad_978[2];  // 0x3D2(0x2)
	float CallFunc_SelectFloat_ReturnValue_18;  // 0x3D4(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_17;  // 0x3D8(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_17;  // 0x3DC(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_17;  // 0x3E0(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_17;  // 0x3E4(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_18;  // 0x3E8(0x4)
	struct FVector CallFunc_BreakTransform_Location_14;  // 0x3EC(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_14;  // 0x3F8(0xC)
	struct FVector CallFunc_BreakTransform_Scale_14;  // 0x404(0xC)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_18;  // 0x410(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_18;  // 0x414(0x4)
	float CallFunc_GetRelevantAnimTime_ReturnValue;  // 0x418(0x4)
	char pad_1052_1 : 7;  // 0x41C(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_29 : 1;  // 0x41C(0x1)
	char pad_1053_1 : 7;  // 0x41D(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_4 : 1;  // 0x41D(0x1)
	char pad_1054[2];  // 0x41E(0x2)
	float CallFunc_SelectFloat_ReturnValue_19;  // 0x420(0x4)
	char pad_1060_1 : 7;  // 0x424(0x1)
	bool CallFunc_BooleanOR_ReturnValue_10 : 1;  // 0x424(0x1)
	char pad_1061[3];  // 0x425(0x3)
	float CallFunc_SelectFloat_ReturnValue_20;  // 0x428(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_18;  // 0x42C(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_19;  // 0x430(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_19;  // 0x434(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_19;  // 0x438(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_19;  // 0x43C(0x4)
	struct FVector CallFunc_BreakTransform_Location_15;  // 0x440(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_15;  // 0x44C(0xC)
	struct FVector CallFunc_BreakTransform_Scale_15;  // 0x458(0xC)
	char pad_1124_1 : 7;  // 0x464(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_30 : 1;  // 0x464(0x1)
	char pad_1125[3];  // 0x465(0x3)
	float CallFunc_SelectFloat_ReturnValue_21;  // 0x468(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_20;  // 0x46C(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_20;  // 0x470(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_20;  // 0x474(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_20;  // 0x478(0x4)
	struct FVector CallFunc_BreakTransform_Location_16;  // 0x47C(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_16;  // 0x488(0xC)
	struct FVector CallFunc_BreakTransform_Scale_16;  // 0x494(0xC)
	char pad_1184_1 : 7;  // 0x4A0(0x1)
	bool CallFunc_BooleanAND_ReturnValue_18 : 1;  // 0x4A0(0x1)
	char pad_1185_1 : 7;  // 0x4A1(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_31 : 1;  // 0x4A1(0x1)
	char pad_1186[2];  // 0x4A2(0x2)
	float CallFunc_SelectFloat_ReturnValue_22;  // 0x4A4(0x4)
	float CallFunc_GetInstanceStateWeight_ReturnValue_2;  // 0x4A8(0x4)
	char pad_1196_1 : 7;  // 0x4AC(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_5 : 1;  // 0x4AC(0x1)
	char pad_1197[3];  // 0x4AD(0x3)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_21;  // 0x4B0(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_21;  // 0x4B4(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_21;  // 0x4B8(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_21;  // 0x4BC(0x4)
	char pad_1216_1 : 7;  // 0x4C0(0x1)
	bool CallFunc_BooleanAND_ReturnValue_19 : 1;  // 0x4C0(0x1)
	char pad_1217[3];  // 0x4C1(0x3)
	struct FVector CallFunc_BreakTransform_Location_17;  // 0x4C4(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_17;  // 0x4D0(0xC)
	struct FVector CallFunc_BreakTransform_Scale_17;  // 0x4DC(0xC)
	float CallFunc_SelectFloat_ReturnValue_23;  // 0x4E8(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_22;  // 0x4EC(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_22;  // 0x4F0(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_22;  // 0x4F4(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_22;  // 0x4F8(0x4)
	struct FVector CallFunc_BreakTransform_Location_18;  // 0x4FC(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_18;  // 0x508(0xC)
	struct FVector CallFunc_BreakTransform_Scale_18;  // 0x514(0xC)
	struct FVector CallFunc_BreakTransform_Location_19;  // 0x520(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_19;  // 0x52C(0xC)
	struct FVector CallFunc_BreakTransform_Scale_19;  // 0x538(0xC)
	char pad_1348_1 : 7;  // 0x544(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_32 : 1;  // 0x544(0x1)
	char pad_1349_1 : 7;  // 0x545(0x1)
	bool CallFunc_NotEqual_ByteByte_ReturnValue : 1;  // 0x545(0x1)
	char pad_1350[2];  // 0x546(0x2)
	float CallFunc_SelectFloat_ReturnValue_24;  // 0x548(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_23;  // 0x54C(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_23;  // 0x550(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_23;  // 0x554(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_23;  // 0x558(0x4)
	struct FVector CallFunc_BreakTransform_Location_20;  // 0x55C(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_20;  // 0x568(0xC)
	struct FVector CallFunc_BreakTransform_Scale_20;  // 0x574(0xC)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_24;  // 0x580(0x4)
	char pad_1412_1 : 7;  // 0x584(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_33 : 1;  // 0x584(0x1)
	char pad_1413[3];  // 0x585(0x3)
	float CallFunc_SelectFloat_ReturnValue_25;  // 0x588(0x4)
	float CallFunc_SelectFloat_ReturnValue_26;  // 0x58C(0x4)
	float CallFunc_GetKnownCurveValueOnWorkerThread_ReturnValue_2;  // 0x590(0x4)
	char pad_1428_1 : 7;  // 0x594(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_6 : 1;  // 0x594(0x1)
	char pad_1429_1 : 7;  // 0x595(0x1)
	bool CallFunc_BooleanOR_ReturnValue_11 : 1;  // 0x595(0x1)
	char pad_1430[2];  // 0x596(0x2)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_24;  // 0x598(0x4)
	char pad_1436_1 : 7;  // 0x59C(0x1)
	bool CallFunc_BooleanOR_ReturnValue_12 : 1;  // 0x59C(0x1)
	char pad_1437_1 : 7;  // 0x59D(0x1)
	bool CallFunc_BooleanAND_ReturnValue_20 : 1;  // 0x59D(0x1)
	char pad_1438[2];  // 0x59E(0x2)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_24;  // 0x5A0(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_24;  // 0x5A4(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_25;  // 0x5A8(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_25;  // 0x5AC(0x4)
	struct FVector CallFunc_BreakTransform_Location_21;  // 0x5B0(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_21;  // 0x5BC(0xC)
	struct FVector CallFunc_BreakTransform_Scale_21;  // 0x5C8(0xC)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_25;  // 0x5D4(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_25;  // 0x5D8(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_26;  // 0x5DC(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_26;  // 0x5E0(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_26;  // 0x5E4(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_26;  // 0x5E8(0x4)
	struct FVector CallFunc_BreakTransform_Location_22;  // 0x5EC(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_22;  // 0x5F8(0xC)
	struct FVector CallFunc_BreakTransform_Scale_22;  // 0x604(0xC)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_27;  // 0x610(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_27;  // 0x614(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_27;  // 0x618(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_27;  // 0x61C(0x4)
	struct FVector CallFunc_BreakTransform_Location_23;  // 0x620(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_23;  // 0x62C(0xC)
	struct FVector CallFunc_BreakTransform_Scale_23;  // 0x638(0xC)
	char pad_1604_1 : 7;  // 0x644(0x1)
	bool CallFunc_BooleanAND_ReturnValue_21 : 1;  // 0x644(0x1)
	char pad_1605[3];  // 0x645(0x3)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_28;  // 0x648(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_28;  // 0x64C(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_28;  // 0x650(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_28;  // 0x654(0x4)
	struct FVector CallFunc_BreakTransform_Location_24;  // 0x658(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_24;  // 0x664(0xC)
	struct FVector CallFunc_BreakTransform_Scale_24;  // 0x670(0xC)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_29;  // 0x67C(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_29;  // 0x680(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_29;  // 0x684(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_29;  // 0x688(0x4)
	struct FVector CallFunc_BreakTransform_Location_25;  // 0x68C(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_25;  // 0x698(0xC)
	struct FVector CallFunc_BreakTransform_Scale_25;  // 0x6A4(0xC)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_30;  // 0x6B0(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_30;  // 0x6B4(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_30;  // 0x6B8(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_30;  // 0x6BC(0x4)
	struct FVector CallFunc_BreakTransform_Location_26;  // 0x6C0(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_26;  // 0x6CC(0xC)
	struct FVector CallFunc_BreakTransform_Scale_26;  // 0x6D8(0xC)
	char pad_1764_1 : 7;  // 0x6E4(0x1)
	bool CallFunc_BooleanAND_ReturnValue_22 : 1;  // 0x6E4(0x1)
	char pad_1765_1 : 7;  // 0x6E5(0x1)
	bool CallFunc_BooleanOR_ReturnValue_13 : 1;  // 0x6E5(0x1)
	char pad_1766_1 : 7;  // 0x6E6(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_34 : 1;  // 0x6E6(0x1)
	char pad_1767_1 : 7;  // 0x6E7(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_8 : 1;  // 0x6E7(0x1)
	char pad_1768_1 : 7;  // 0x6E8(0x1)
	bool CallFunc_BooleanAND_ReturnValue_23 : 1;  // 0x6E8(0x1)
	char pad_1769[3];  // 0x6E9(0x3)
	float CallFunc_GetLeanBlendWeights_left;  // 0x6EC(0x4)
	float CallFunc_GetLeanBlendWeights_right;  // 0x6F0(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue;  // 0x6F4(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_2;  // 0x6F8(0x4)
	char pad_1788_1 : 7;  // 0x6FC(0x1)
	bool CallFunc_BooleanAND_ReturnValue_24 : 1;  // 0x6FC(0x1)
	char pad_1789_1 : 7;  // 0x6FD(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_9 : 1;  // 0x6FD(0x1)
	char pad_1790_1 : 7;  // 0x6FE(0x1)
	bool CallFunc_BooleanAND_ReturnValue_25 : 1;  // 0x6FE(0x1)
	char pad_1791[1];  // 0x6FF(0x1)
	float CallFunc_SelectFloat_ReturnValue_27;  // 0x700(0x4)
	char pad_1796_1 : 7;  // 0x704(0x1)
	bool CallFunc_BooleanAND_ReturnValue_26 : 1;  // 0x704(0x1)
	char pad_1797[3];  // 0x705(0x3)
	float CallFunc_GetLeanBlendWeights_left_2;  // 0x708(0x4)
	float CallFunc_GetLeanBlendWeights_right_2;  // 0x70C(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_3;  // 0x710(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_4;  // 0x714(0x4)
	char pad_1816_1 : 7;  // 0x718(0x1)
	bool CallFunc_BooleanOR_ReturnValue_14 : 1;  // 0x718(0x1)
	char pad_1817_1 : 7;  // 0x719(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_35 : 1;  // 0x719(0x1)
	char pad_1818[2];  // 0x71A(0x2)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_5;  // 0x71C(0x4)
	char pad_1824_1 : 7;  // 0x720(0x1)
	bool CallFunc_BooleanAND_ReturnValue_27 : 1;  // 0x720(0x1)
	char pad_1825[3];  // 0x721(0x3)
	float CallFunc_GetLeanBlendWeights_left_3;  // 0x724(0x4)
	float CallFunc_GetLeanBlendWeights_right_3;  // 0x728(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_6;  // 0x72C(0x4)
	float CallFunc_GetLeanBlendWeights_left_4;  // 0x730(0x4)
	float CallFunc_GetLeanBlendWeights_right_4;  // 0x734(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_7;  // 0x738(0x4)
	struct FVector CallFunc_BreakTransform_Location_27;  // 0x73C(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_27;  // 0x748(0xC)
	struct FVector CallFunc_BreakTransform_Scale_27;  // 0x754(0xC)
	float CallFunc_SelectFloat_ReturnValue_28;  // 0x760(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_8;  // 0x764(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_9;  // 0x768(0x4)
	struct FVector CallFunc_BreakTransform_Location_28;  // 0x76C(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_28;  // 0x778(0xC)
	struct FVector CallFunc_BreakTransform_Scale_28;  // 0x784(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_10;  // 0x790(0x4)
	struct FVector CallFunc_BreakTransform_Location_29;  // 0x794(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_29;  // 0x7A0(0xC)
	struct FVector CallFunc_BreakTransform_Scale_29;  // 0x7AC(0xC)
	float CallFunc_GetLeanBlendWeights_left_5;  // 0x7B8(0x4)
	float CallFunc_GetLeanBlendWeights_right_5;  // 0x7BC(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_11;  // 0x7C0(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_12;  // 0x7C4(0x4)
	struct FVector CallFunc_BreakTransform_Location_30;  // 0x7C8(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_30;  // 0x7D4(0xC)
	struct FVector CallFunc_BreakTransform_Scale_30;  // 0x7E0(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_13;  // 0x7EC(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_14;  // 0x7F0(0x4)
	uint8_t  CallFunc_GetCardinalDirectionFromCourseAngle_ReturnValue_2;  // 0x7F4(0x1)
	char pad_2037[3];  // 0x7F5(0x3)
	float CallFunc_Abs_ReturnValue;  // 0x7F8(0x4)
	char pad_2044_1 : 7;  // 0x7FC(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_36 : 1;  // 0x7FC(0x1)
	char pad_2045_1 : 7;  // 0x7FD(0x1)
	bool CallFunc_Less_FloatFloat_ReturnValue : 1;  // 0x7FD(0x1)
	char pad_2046_1 : 7;  // 0x7FE(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_10 : 1;  // 0x7FE(0x1)
	char pad_2047_1 : 7;  // 0x7FF(0x1)
	bool CallFunc_BooleanAND_ReturnValue_28 : 1;  // 0x7FF(0x1)
	char pad_2048_1 : 7;  // 0x800(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_11 : 1;  // 0x800(0x1)
	char pad_2049_1 : 7;  // 0x801(0x1)
	bool CallFunc_BooleanAND_ReturnValue_29 : 1;  // 0x801(0x1)
	char pad_2050_1 : 7;  // 0x802(0x1)
	bool CallFunc_BooleanAND_ReturnValue_30 : 1;  // 0x802(0x1)
	char pad_2051[1];  // 0x803(0x1)
	struct FVector CallFunc_BreakTransform_Location_31;  // 0x804(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_31;  // 0x810(0xC)
	struct FVector CallFunc_BreakTransform_Scale_31;  // 0x81C(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_15;  // 0x828(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_16;  // 0x82C(0x4)
	char pad_2096_1 : 7;  // 0x830(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_12 : 1;  // 0x830(0x1)
	char pad_2097_1 : 7;  // 0x831(0x1)
	bool CallFunc_BooleanAND_ReturnValue_31 : 1;  // 0x831(0x1)
	char pad_2098[2];  // 0x832(0x2)
	struct FVector CallFunc_BreakTransform_Location_32;  // 0x834(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_32;  // 0x840(0xC)
	struct FVector CallFunc_BreakTransform_Scale_32;  // 0x84C(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_17;  // 0x858(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_18;  // 0x85C(0x4)
	float CallFunc_SelectFloat_ReturnValue_29;  // 0x860(0x4)
	char pad_2148_1 : 7;  // 0x864(0x1)
	bool CallFunc_NotEqual_ByteByte_ReturnValue_2 : 1;  // 0x864(0x1)
	char pad_2149_1 : 7;  // 0x865(0x1)
	bool CallFunc_BooleanOR_ReturnValue_15 : 1;  // 0x865(0x1)
	char pad_2150_1 : 7;  // 0x866(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_13 : 1;  // 0x866(0x1)
	char pad_2151_1 : 7;  // 0x867(0x1)
	bool CallFunc_BooleanAND_ReturnValue_32 : 1;  // 0x867(0x1)
	float CallFunc_GetLeanBlendWeights_left_6;  // 0x868(0x4)
	float CallFunc_GetLeanBlendWeights_right_6;  // 0x86C(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_19;  // 0x870(0x4)
	struct FVector CallFunc_BreakTransform_Location_33;  // 0x874(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_33;  // 0x880(0xC)
	struct FVector CallFunc_BreakTransform_Scale_33;  // 0x88C(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_20;  // 0x898(0x4)
	char pad_2204_1 : 7;  // 0x89C(0x1)
	bool CallFunc_BooleanAND_ReturnValue_33 : 1;  // 0x89C(0x1)
	char pad_2205[3];  // 0x89D(0x3)
	struct FVector CallFunc_BreakTransform_Location_34;  // 0x8A0(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_34;  // 0x8AC(0xC)
	struct FVector CallFunc_BreakTransform_Scale_34;  // 0x8B8(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_21;  // 0x8C4(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_22;  // 0x8C8(0x4)
	float CallFunc_SelectFloat_ReturnValue_30;  // 0x8CC(0x4)
	char pad_2256_1 : 7;  // 0x8D0(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_14 : 1;  // 0x8D0(0x1)
	char pad_2257[3];  // 0x8D1(0x3)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_23;  // 0x8D4(0x4)
	char pad_2264_1 : 7;  // 0x8D8(0x1)
	bool CallFunc_BooleanAND_ReturnValue_34 : 1;  // 0x8D8(0x1)
	char pad_2265[3];  // 0x8D9(0x3)
	struct FVector CallFunc_BreakTransform_Location_35;  // 0x8DC(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_35;  // 0x8E8(0xC)
	struct FVector CallFunc_BreakTransform_Scale_35;  // 0x8F4(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_24;  // 0x900(0x4)
	float CallFunc_GetLeanBlendWeights_left_7;  // 0x904(0x4)
	float CallFunc_GetLeanBlendWeights_right_7;  // 0x908(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_25;  // 0x90C(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_26;  // 0x910(0x4)
	struct FVector CallFunc_BreakTransform_Location_36;  // 0x914(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_36;  // 0x920(0xC)
	struct FVector CallFunc_BreakTransform_Scale_36;  // 0x92C(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_27;  // 0x938(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_28;  // 0x93C(0x4)
	char pad_2368_1 : 7;  // 0x940(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_15 : 1;  // 0x940(0x1)
	char pad_2369_1 : 7;  // 0x941(0x1)
	bool CallFunc_BooleanAND_ReturnValue_35 : 1;  // 0x941(0x1)
	char pad_2370[2];  // 0x942(0x2)
	struct FVector CallFunc_BreakTransform_Location_37;  // 0x944(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_37;  // 0x950(0xC)
	struct FVector CallFunc_BreakTransform_Scale_37;  // 0x95C(0xC)
	struct FVector CallFunc_BreakTransform_Location_38;  // 0x968(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_38;  // 0x974(0xC)
	struct FVector CallFunc_BreakTransform_Scale_38;  // 0x980(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_29;  // 0x98C(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_30;  // 0x990(0x4)
	float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_8;  // 0x994(0x4)
	char pad_2456_1 : 7;  // 0x998(0x1)
	bool CallFunc_Less_FloatFloat_ReturnValue_2 : 1;  // 0x998(0x1)
	char pad_2457_1 : 7;  // 0x999(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_16 : 1;  // 0x999(0x1)
	char pad_2458_1 : 7;  // 0x99A(0x1)
	bool CallFunc_BooleanAND_ReturnValue_36 : 1;  // 0x99A(0x1)
	char pad_2459[1];  // 0x99B(0x1)
	struct FVector CallFunc_BreakTransform_Location_39;  // 0x99C(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_39;  // 0x9A8(0xC)
	struct FVector CallFunc_BreakTransform_Scale_39;  // 0x9B4(0xC)
	float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_9;  // 0x9C0(0x4)
	char pad_2500_1 : 7;  // 0x9C4(0x1)
	bool CallFunc_LessEqual_FloatFloat_ReturnValue_8 : 1;  // 0x9C4(0x1)
	char pad_2501[3];  // 0x9C5(0x3)
	float CallFunc_GetRelevantAnimTime_ReturnValue_2;  // 0x9C8(0x4)
	char pad_2508_1 : 7;  // 0x9CC(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_7 : 1;  // 0x9CC(0x1)
	char pad_2509_1 : 7;  // 0x9CD(0x1)
	bool CallFunc_BooleanOR_ReturnValue_16 : 1;  // 0x9CD(0x1)
	char pad_2510_1 : 7;  // 0x9CE(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_17 : 1;  // 0x9CE(0x1)
	char pad_2511_1 : 7;  // 0x9CF(0x1)
	bool CallFunc_BooleanAND_ReturnValue_37 : 1;  // 0x9CF(0x1)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_31;  // 0x9D0(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_32;  // 0x9D4(0x4)
	struct FVector CallFunc_BreakTransform_Location_40;  // 0x9D8(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_40;  // 0x9E4(0xC)
	struct FVector CallFunc_BreakTransform_Scale_40;  // 0x9F0(0xC)
	float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_10;  // 0x9FC(0x4)
	char pad_2560_1 : 7;  // 0xA00(0x1)
	bool CallFunc_Less_FloatFloat_ReturnValue_3 : 1;  // 0xA00(0x1)
	char pad_2561[3];  // 0xA01(0x3)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_33;  // 0xA04(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_34;  // 0xA08(0x4)
	struct FVector CallFunc_BreakTransform_Location_41;  // 0xA0C(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_41;  // 0xA18(0xC)
	struct FVector CallFunc_BreakTransform_Scale_41;  // 0xA24(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_35;  // 0xA30(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_36;  // 0xA34(0x4)
	char pad_2616_1 : 7;  // 0xA38(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_37 : 1;  // 0xA38(0x1)
	char pad_2617_1 : 7;  // 0xA39(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_18 : 1;  // 0xA39(0x1)
	char pad_2618_1 : 7;  // 0xA3A(0x1)
	bool CallFunc_BooleanAND_ReturnValue_38 : 1;  // 0xA3A(0x1)
	char pad_2619_1 : 7;  // 0xA3B(0x1)
	bool CallFunc_BooleanAND_ReturnValue_39 : 1;  // 0xA3B(0x1)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_37;  // 0xA3C(0x4)
	struct FVector CallFunc_BreakTransform_Location_42;  // 0xA40(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_42;  // 0xA4C(0xC)
	struct FVector CallFunc_BreakTransform_Scale_42;  // 0xA58(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_38;  // 0xA64(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_39;  // 0xA68(0x4)
	char pad_2668_1 : 7;  // 0xA6C(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_19 : 1;  // 0xA6C(0x1)
	char pad_2669_1 : 7;  // 0xA6D(0x1)
	bool CallFunc_BooleanAND_ReturnValue_40 : 1;  // 0xA6D(0x1)
	char pad_2670[2];  // 0xA6E(0x2)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_40;  // 0xA70(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_41;  // 0xA74(0x4)
	struct FVector CallFunc_BreakTransform_Location_43;  // 0xA78(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_43;  // 0xA84(0xC)
	struct FVector CallFunc_BreakTransform_Scale_43;  // 0xA90(0xC)
	float CallFunc_GetInstanceStateWeight_ReturnValue_3;  // 0xA9C(0x4)
	char pad_2720_1 : 7;  // 0xAA0(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_8 : 1;  // 0xAA0(0x1)
	char pad_2721[3];  // 0xAA1(0x3)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_42;  // 0xAA4(0x4)
	char pad_2728_1 : 7;  // 0xAA8(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_38 : 1;  // 0xAA8(0x1)
	char pad_2729_1 : 7;  // 0xAA9(0x1)
	bool CallFunc_BooleanAND_ReturnValue_41 : 1;  // 0xAA9(0x1)
	char pad_2730[2];  // 0xAAA(0x2)
	struct FVector CallFunc_BreakTransform_Location_44;  // 0xAAC(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_44;  // 0xAB8(0xC)
	struct FVector CallFunc_BreakTransform_Scale_44;  // 0xAC4(0xC)
	struct FVector CallFunc_BreakTransform_Location_45;  // 0xAD0(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_45;  // 0xADC(0xC)
	struct FVector CallFunc_BreakTransform_Scale_45;  // 0xAE8(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_43;  // 0xAF4(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_44;  // 0xAF8(0x4)
	char pad_2812_1 : 7;  // 0xAFC(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_20 : 1;  // 0xAFC(0x1)
	char pad_2813_1 : 7;  // 0xAFD(0x1)
	bool CallFunc_BooleanAND_ReturnValue_42 : 1;  // 0xAFD(0x1)
	char pad_2814[2];  // 0xAFE(0x2)
	struct FVector CallFunc_BreakTransform_Location_46;  // 0xB00(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_46;  // 0xB0C(0xC)
	struct FVector CallFunc_BreakTransform_Scale_46;  // 0xB18(0xC)
	char pad_2852_1 : 7;  // 0xB24(0x1)
	bool CallFunc_NotEqual_ByteByte_ReturnValue_3 : 1;  // 0xB24(0x1)
	char pad_2853[3];  // 0xB25(0x3)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_45;  // 0xB28(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_46;  // 0xB2C(0x4)
	char pad_2864_1 : 7;  // 0xB30(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_39 : 1;  // 0xB30(0x1)
	char pad_2865_1 : 7;  // 0xB31(0x1)
	bool CallFunc_BooleanAND_ReturnValue_43 : 1;  // 0xB31(0x1)
	char pad_2866[2];  // 0xB32(0x2)
	float CallFunc_SelectFloat_ReturnValue_31;  // 0xB34(0x4)
	struct FVector CallFunc_BreakTransform_Location_47;  // 0xB38(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_47;  // 0xB44(0xC)
	struct FVector CallFunc_BreakTransform_Scale_47;  // 0xB50(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_47;  // 0xB5C(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_48;  // 0xB60(0x4)
	char pad_2916_1 : 7;  // 0xB64(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_21 : 1;  // 0xB64(0x1)
	char pad_2917_1 : 7;  // 0xB65(0x1)
	bool CallFunc_BooleanAND_ReturnValue_44 : 1;  // 0xB65(0x1)
	char pad_2918[2];  // 0xB66(0x2)
	struct FVector CallFunc_BreakTransform_Location_48;  // 0xB68(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_48;  // 0xB74(0xC)
	struct FVector CallFunc_BreakTransform_Scale_48;  // 0xB80(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_49;  // 0xB8C(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_50;  // 0xB90(0x4)
	char pad_2964_1 : 7;  // 0xB94(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_40 : 1;  // 0xB94(0x1)
	char pad_2965_1 : 7;  // 0xB95(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_22 : 1;  // 0xB95(0x1)
	char pad_2966_1 : 7;  // 0xB96(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_41 : 1;  // 0xB96(0x1)
	char pad_2967_1 : 7;  // 0xB97(0x1)
	bool CallFunc_BooleanOR_ReturnValue_17 : 1;  // 0xB97(0x1)
	char pad_2968_1 : 7;  // 0xB98(0x1)
	bool CallFunc_BooleanAND_ReturnValue_45 : 1;  // 0xB98(0x1)
	char pad_2969[3];  // 0xB99(0x3)
	struct FVector CallFunc_BreakTransform_Location_49;  // 0xB9C(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_49;  // 0xBA8(0xC)
	struct FVector CallFunc_BreakTransform_Scale_49;  // 0xBB4(0xC)
	float CallFunc_SelectFloat_ReturnValue_32;  // 0xBC0(0x4)
	float CallFunc_GetLeanBlendWeights_left_8;  // 0xBC4(0x4)
	float CallFunc_GetLeanBlendWeights_right_8;  // 0xBC8(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_51;  // 0xBCC(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_52;  // 0xBD0(0x4)
	char pad_3028_1 : 7;  // 0xBD4(0x1)
	bool CallFunc_BooleanAND_ReturnValue_46 : 1;  // 0xBD4(0x1)
	char pad_3029[3];  // 0xBD5(0x3)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_53;  // 0xBD8(0x4)
	struct FVector CallFunc_BreakTransform_Location_50;  // 0xBDC(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_50;  // 0xBE8(0xC)
	struct FVector CallFunc_BreakTransform_Scale_50;  // 0xBF4(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_54;  // 0xC00(0x4)
	float CallFunc_GetLeanBlendWeights_left_9;  // 0xC04(0x4)
	float CallFunc_GetLeanBlendWeights_right_9;  // 0xC08(0x4)
	float CallFunc_GetCurveValue_ReturnValue;  // 0xC0C(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_3;  // 0xC10(0x4)
	float CallFunc_GetKnownCurveValueOnWorkerThread_ReturnValue_3;  // 0xC14(0x4)
	char pad_3096_1 : 7;  // 0xC18(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_9 : 1;  // 0xC18(0x1)
	char pad_3097_1 : 7;  // 0xC19(0x1)
	bool CallFunc_BooleanOR_ReturnValue_18 : 1;  // 0xC19(0x1)
	char pad_3098[2];  // 0xC1A(0x2)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue;  // 0xC1C(0x4)
	char pad_3104_1 : 7;  // 0xC20(0x1)
	bool CallFunc_BooleanOR_ReturnValue_19 : 1;  // 0xC20(0x1)
	char pad_3105_1 : 7;  // 0xC21(0x1)
	bool CallFunc_BooleanAND_ReturnValue_47 : 1;  // 0xC21(0x1)
	char pad_3106[2];  // 0xC22(0x2)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_2;  // 0xC24(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_3;  // 0xC28(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_4;  // 0xC2C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_5;  // 0xC30(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_6;  // 0xC34(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_7;  // 0xC38(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_8;  // 0xC3C(0x4)
	float CallFunc_GetInstanceStateWeight_ReturnValue_4;  // 0xC40(0x4)
	float CallFunc_SelectFloat_ReturnValue_33;  // 0xC44(0x4)
	float CallFunc_Subtract_FloatFloat_ReturnValue;  // 0xC48(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_9;  // 0xC4C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_10;  // 0xC50(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_11;  // 0xC54(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_12;  // 0xC58(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_13;  // 0xC5C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_14;  // 0xC60(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_15;  // 0xC64(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_16;  // 0xC68(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_17;  // 0xC6C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_18;  // 0xC70(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_19;  // 0xC74(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_20;  // 0xC78(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_21;  // 0xC7C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_22;  // 0xC80(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_23;  // 0xC84(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_24;  // 0xC88(0x4)
	float CallFunc_Subtract_FloatFloat_ReturnValue_2;  // 0xC8C(0x4)
	struct FVector CallFunc_GetIKLegsRootOffsetVectorFromCardinalDirection_ReturnValue;  // 0xC90(0xC)
	struct FVector CallFunc_Multiply_VectorFloat_ReturnValue;  // 0xC9C(0xC)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_25;  // 0xCA8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_26;  // 0xCAC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_27;  // 0xCB0(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_28;  // 0xCB4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_29;  // 0xCB8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_30;  // 0xCBC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_31;  // 0xCC0(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_32;  // 0xCC4(0x4)
	float CallFunc_SelectFloat_ReturnValue_34;  // 0xCC8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_33;  // 0xCCC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_34;  // 0xCD0(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_35;  // 0xCD4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_36;  // 0xCD8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_37;  // 0xCDC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_38;  // 0xCE0(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_39;  // 0xCE4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_40;  // 0xCE8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_41;  // 0xCEC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_42;  // 0xCF0(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_43;  // 0xCF4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_44;  // 0xCF8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_45;  // 0xCFC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_46;  // 0xD00(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_47;  // 0xD04(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_48;  // 0xD08(0x4)
	char pad_3340_1 : 7;  // 0xD0C(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_42 : 1;  // 0xD0C(0x1)
	char pad_3341_1 : 7;  // 0xD0D(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_23 : 1;  // 0xD0D(0x1)
	char pad_3342_1 : 7;  // 0xD0E(0x1)
	bool CallFunc_BooleanOR_ReturnValue_20 : 1;  // 0xD0E(0x1)
	char pad_3343[1];  // 0xD0F(0x1)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_49;  // 0xD10(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_50;  // 0xD14(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_51;  // 0xD18(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_52;  // 0xD1C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_53;  // 0xD20(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_54;  // 0xD24(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_55;  // 0xD28(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_56;  // 0xD2C(0x4)
	char pad_3376_1 : 7;  // 0xD30(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_43 : 1;  // 0xD30(0x1)
	char pad_3377_1 : 7;  // 0xD31(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_24 : 1;  // 0xD31(0x1)
	char pad_3378_1 : 7;  // 0xD32(0x1)
	bool CallFunc_BooleanAND_ReturnValue_48 : 1;  // 0xD32(0x1)
	char pad_3379[1];  // 0xD33(0x1)
	float CallFunc_SelectFloat_ReturnValue_35;  // 0xD34(0x4)
	float CallFunc_SelectFloat_ReturnValue_36;  // 0xD38(0x4)
	char pad_3388_1 : 7;  // 0xD3C(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_44 : 1;  // 0xD3C(0x1)
	char pad_3389[3];  // 0xD3D(0x3)
	float CallFunc_SelectFloat_ReturnValue_37;  // 0xD40(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_31;  // 0xD44(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_4;  // 0xD48(0x4)
	char pad_3404_1 : 7;  // 0xD4C(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_25 : 1;  // 0xD4C(0x1)
	char pad_3405[3];  // 0xD4D(0x3)
	float CallFunc_GetLeanBlendWeights_left_10;  // 0xD50(0x4)
	float CallFunc_GetLeanBlendWeights_right_10;  // 0xD54(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_55;  // 0xD58(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_31;  // 0xD5C(0x4)
	char pad_3424_1 : 7;  // 0xD60(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_45 : 1;  // 0xD60(0x1)
	char pad_3425_1 : 7;  // 0xD61(0x1)
	bool CallFunc_BooleanOR_ReturnValue_21 : 1;  // 0xD61(0x1)
	char pad_3426[2];  // 0xD62(0x2)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_31;  // 0xD64(0x4)
	float CallFunc_GetLeanBlendWeights_left_11;  // 0xD68(0x4)
	float CallFunc_GetLeanBlendWeights_right_11;  // 0xD6C(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_56;  // 0xD70(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_31;  // 0xD74(0x4)
	struct FVector CallFunc_BreakTransform_Location_51;  // 0xD78(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_51;  // 0xD84(0xC)
	struct FVector CallFunc_BreakTransform_Scale_51;  // 0xD90(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_57;  // 0xD9C(0x4)
	char pad_3488_1 : 7;  // 0xDA0(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_46 : 1;  // 0xDA0(0x1)
	char pad_3489_1 : 7;  // 0xDA1(0x1)
	bool CallFunc_BooleanOR_ReturnValue_22 : 1;  // 0xDA1(0x1)
	char pad_3490[2];  // 0xDA2(0x2)
	float CallFunc_GetLeanBlendWeights_left_12;  // 0xDA4(0x4)
	float CallFunc_GetLeanBlendWeights_right_12;  // 0xDA8(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_58;  // 0xDAC(0x4)
	struct FVector CallFunc_BreakTransform_Location_52;  // 0xDB0(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_52;  // 0xDBC(0xC)
	struct FVector CallFunc_BreakTransform_Scale_52;  // 0xDC8(0xC)
	char pad_3540_1 : 7;  // 0xDD4(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_47 : 1;  // 0xDD4(0x1)
	char pad_3541_1 : 7;  // 0xDD5(0x1)
	bool CallFunc_BooleanOR_ReturnValue_23 : 1;  // 0xDD5(0x1)
	char pad_3542[2];  // 0xDD6(0x2)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_59;  // 0xDD8(0x4)
	char pad_3548_1 : 7;  // 0xDDC(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_48 : 1;  // 0xDDC(0x1)
	char pad_3549[3];  // 0xDDD(0x3)
	float CallFunc_GetLeanBlendWeights_left_13;  // 0xDE0(0x4)
	float CallFunc_GetLeanBlendWeights_right_13;  // 0xDE4(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_60;  // 0xDE8(0x4)
	struct FVector CallFunc_BreakTransform_Location_53;  // 0xDEC(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_53;  // 0xDF8(0xC)
	struct FVector CallFunc_BreakTransform_Scale_53;  // 0xE04(0xC)
	float CallFunc_SelectFloat_ReturnValue_38;  // 0xE10(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_61;  // 0xE14(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_5;  // 0xE18(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_62;  // 0xE1C(0x4)
	float CallFunc_SelectFloat_ReturnValue_39;  // 0xE20(0x4)
	struct FVector CallFunc_BreakTransform_Location_54;  // 0xE24(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_54;  // 0xE30(0xC)
	struct FVector CallFunc_BreakTransform_Scale_54;  // 0xE3C(0xC)
	float CallFunc_GetLeanBlendWeights_left_14;  // 0xE48(0x4)
	float CallFunc_GetLeanBlendWeights_right_14;  // 0xE4C(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_63;  // 0xE50(0x4)
	struct FVector CallFunc_BreakTransform_Location_55;  // 0xE54(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_55;  // 0xE60(0xC)
	struct FVector CallFunc_BreakTransform_Scale_55;  // 0xE6C(0xC)
	char pad_3704_1 : 7;  // 0xE78(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_49 : 1;  // 0xE78(0x1)
	char pad_3705[3];  // 0xE79(0x3)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_64;  // 0xE7C(0x4)
	float CallFunc_SelectFloat_ReturnValue_40;  // 0xE80(0x4)
	char pad_3716_1 : 7;  // 0xE84(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_50 : 1;  // 0xE84(0x1)
	char pad_3717[3];  // 0xE85(0x3)
	float CallFunc_GetLeanBlendWeights_left_15;  // 0xE88(0x4)
	float CallFunc_GetLeanBlendWeights_right_15;  // 0xE8C(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_65;  // 0xE90(0x4)
	float CallFunc_GetCurveValue_ReturnValue_2;  // 0xE94(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_6;  // 0xE98(0x4)
	float CallFunc_GetInstanceStateWeight_ReturnValue_5;  // 0xE9C(0x4)
	float CallFunc_Subtract_FloatFloat_ReturnValue_3;  // 0xEA0(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_57;  // 0xEA4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_58;  // 0xEA8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_59;  // 0xEAC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_60;  // 0xEB0(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_61;  // 0xEB4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_62;  // 0xEB8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_63;  // 0xEBC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_64;  // 0xEC0(0x4)
	char pad_3780_1 : 7;  // 0xEC4(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_51 : 1;  // 0xEC4(0x1)
	char pad_3781_1 : 7;  // 0xEC5(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_52 : 1;  // 0xEC5(0x1)
	char pad_3782[2];  // 0xEC6(0x2)
	float CallFunc_SelectFloat_ReturnValue_41;  // 0xEC8(0x4)
	char pad_3788_1 : 7;  // 0xECC(0x1)
	bool CallFunc_BooleanOR_ReturnValue_24 : 1;  // 0xECC(0x1)
	char pad_3789[3];  // 0xECD(0x3)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_65;  // 0xED0(0x4)
	float CallFunc_Subtract_FloatFloat_ReturnValue_4;  // 0xED4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_66;  // 0xED8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_67;  // 0xEDC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_68;  // 0xEE0(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_69;  // 0xEE4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_70;  // 0xEE8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_71;  // 0xEEC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_72;  // 0xEF0(0x4)
	struct FVector CallFunc_GetIKLegsRootOffsetVectorFromCardinalDirection_ReturnValue_2;  // 0xEF4(0xC)
	struct FVector CallFunc_Multiply_VectorFloat_ReturnValue_2;  // 0xF00(0xC)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_73;  // 0xF0C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_74;  // 0xF10(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_75;  // 0xF14(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_76;  // 0xF18(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_77;  // 0xF1C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_78;  // 0xF20(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_79;  // 0xF24(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_80;  // 0xF28(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_32;  // 0xF2C(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_7;  // 0xF30(0x4)
	char pad_3892_1 : 7;  // 0xF34(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_53 : 1;  // 0xF34(0x1)
	char pad_3893_1 : 7;  // 0xF35(0x1)
	bool CallFunc_BooleanOR_ReturnValue_25 : 1;  // 0xF35(0x1)
	char pad_3894_1 : 7;  // 0xF36(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_54 : 1;  // 0xF36(0x1)
	char pad_3895[1];  // 0xF37(0x1)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_81;  // 0xF38(0x4)
	char pad_3900_1 : 7;  // 0xF3C(0x1)
	bool CallFunc_BooleanOR_ReturnValue_26 : 1;  // 0xF3C(0x1)
	char pad_3901_1 : 7;  // 0xF3D(0x1)
	bool CallFunc_BooleanAND_ReturnValue_49 : 1;  // 0xF3D(0x1)
	char pad_3902[2];  // 0xF3E(0x2)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_82;  // 0xF40(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_83;  // 0xF44(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_84;  // 0xF48(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_85;  // 0xF4C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_86;  // 0xF50(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_87;  // 0xF54(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_88;  // 0xF58(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_32;  // 0xF5C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_89;  // 0xF60(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_90;  // 0xF64(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_91;  // 0xF68(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_92;  // 0xF6C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_93;  // 0xF70(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_94;  // 0xF74(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_95;  // 0xF78(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_96;  // 0xF7C(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_32;  // 0xF80(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_32;  // 0xF84(0x4)
	float CallFunc_SelectFloat_ReturnValue_42;  // 0xF88(0x4)
	char pad_3980_1 : 7;  // 0xF8C(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_55 : 1;  // 0xF8C(0x1)
	char pad_3981[3];  // 0xF8D(0x3)
	float CallFunc_SelectFloat_ReturnValue_43;  // 0xF90(0x4)
	float CallFunc_SelectFloat_ReturnValue_44;  // 0xF94(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_97;  // 0xF98(0x4)
	char pad_3996_1 : 7;  // 0xF9C(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_56 : 1;  // 0xF9C(0x1)
	char pad_3997[3];  // 0xF9D(0x3)
	float CallFunc_SelectFloat_ReturnValue_45;  // 0xFA0(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_98;  // 0xFA4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_99;  // 0xFA8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_100;  // 0xFAC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_101;  // 0xFB0(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_102;  // 0xFB4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_103;  // 0xFB8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_104;  // 0xFBC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_105;  // 0xFC0(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_106;  // 0xFC4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_107;  // 0xFC8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_108;  // 0xFCC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_109;  // 0xFD0(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_110;  // 0xFD4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_111;  // 0xFD8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_112;  // 0xFDC(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_33;  // 0xFE0(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_113;  // 0xFE4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_114;  // 0xFE8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_115;  // 0xFEC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_116;  // 0xFF0(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_117;  // 0xFF4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_118;  // 0xFF8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_119;  // 0xFFC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_120;  // 0x1000(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_33;  // 0x1004(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_121;  // 0x1008(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_122;  // 0x100C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_123;  // 0x1010(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_124;  // 0x1014(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_125;  // 0x1018(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_126;  // 0x101C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_127;  // 0x1020(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_128;  // 0x1024(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_33;  // 0x1028(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_33;  // 0x102C(0x4)
	char pad_4144_1 : 7;  // 0x1030(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_57 : 1;  // 0x1030(0x1)
	char pad_4145[3];  // 0x1031(0x3)
	float CallFunc_SelectFloat_ReturnValue_46;  // 0x1034(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_129;  // 0x1038(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_130;  // 0x103C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_131;  // 0x1040(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_132;  // 0x1044(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_133;  // 0x1048(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_134;  // 0x104C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_135;  // 0x1050(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_136;  // 0x1054(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_137;  // 0x1058(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_138;  // 0x105C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_139;  // 0x1060(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_140;  // 0x1064(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_141;  // 0x1068(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_142;  // 0x106C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_143;  // 0x1070(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_144;  // 0x1074(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_34;  // 0x1078(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_145;  // 0x107C(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_8;  // 0x1080(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_146;  // 0x1084(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_147;  // 0x1088(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_148;  // 0x108C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_149;  // 0x1090(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_150;  // 0x1094(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_151;  // 0x1098(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_152;  // 0x109C(0x4)
	float CallFunc_GetRelevantAnimTime_ReturnValue_3;  // 0x10A0(0x4)
	char pad_4260_1 : 7;  // 0x10A4(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_10 : 1;  // 0x10A4(0x1)
	char pad_4261[3];  // 0x10A5(0x3)
	float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_11;  // 0x10A8(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_34;  // 0x10AC(0x4)
	char pad_4272_1 : 7;  // 0x10B0(0x1)
	bool CallFunc_LessEqual_FloatFloat_ReturnValue_9 : 1;  // 0x10B0(0x1)
	char pad_4273_1 : 7;  // 0x10B1(0x1)
	bool CallFunc_BooleanOR_ReturnValue_27 : 1;  // 0x10B1(0x1)
	char pad_4274[2];  // 0x10B2(0x2)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_34;  // 0x10B4(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_34;  // 0x10B8(0x4)
	float CallFunc_SelectFloat_ReturnValue_47;  // 0x10BC(0x4)
	float CallFunc_SelectFloat_ReturnValue_48;  // 0x10C0(0x4)
	char pad_4292_1 : 7;  // 0x10C4(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_58 : 1;  // 0x10C4(0x1)
	char pad_4293[3];  // 0x10C5(0x3)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_35;  // 0x10C8(0x4)
	float CallFunc_SelectFloat_ReturnValue_49;  // 0x10CC(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_9;  // 0x10D0(0x4)
	char pad_4308_1 : 7;  // 0x10D4(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_26 : 1;  // 0x10D4(0x1)
	char pad_4309_1 : 7;  // 0x10D5(0x1)
	bool CallFunc_BooleanAND_ReturnValue_50 : 1;  // 0x10D5(0x1)
	char pad_4310_1 : 7;  // 0x10D6(0x1)
	bool CallFunc_NearlyEqual_FloatFloat_ReturnValue : 1;  // 0x10D6(0x1)
	char pad_4311[1];  // 0x10D7(0x1)
	float CallFunc_VSize_ReturnValue;  // 0x10D8(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_35;  // 0x10DC(0x4)
	char pad_4320_1 : 7;  // 0x10E0(0x1)
	bool CallFunc_LessEqual_FloatFloat_ReturnValue_10 : 1;  // 0x10E0(0x1)
	char pad_4321_1 : 7;  // 0x10E1(0x1)
	bool CallFunc_BooleanAND_ReturnValue_51 : 1;  // 0x10E1(0x1)
	char pad_4322[2];  // 0x10E2(0x2)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_35;  // 0x10E4(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_35;  // 0x10E8(0x4)
	float CallFunc_GetInstanceStateWeight_ReturnValue_6;  // 0x10EC(0x4)
	char pad_4336_1 : 7;  // 0x10F0(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_11 : 1;  // 0x10F0(0x1)
	char pad_4337[3];  // 0x10F1(0x3)
	float CallFunc_GetLeanBlendWeights_left_16;  // 0x10F4(0x4)
	float CallFunc_GetLeanBlendWeights_right_16;  // 0x10F8(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_66;  // 0x10FC(0x4)
	char pad_4352_1 : 7;  // 0x1100(0x1)
	bool CallFunc_BooleanAND_ReturnValue_52 : 1;  // 0x1100(0x1)
	char pad_4353_1 : 7;  // 0x1101(0x1)
	bool CallFunc_NotEqual_ByteByte_ReturnValue_4 : 1;  // 0x1101(0x1)
	char pad_4354[2];  // 0x1102(0x2)
	float CallFunc_GetLeanBlendWeights_left_17;  // 0x1104(0x4)
	float CallFunc_GetLeanBlendWeights_right_17;  // 0x1108(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_67;  // 0x110C(0x4)
	float CallFunc_SelectFloat_ReturnValue_50;  // 0x1110(0x4)
	float CallFunc_SelectFloat_ReturnValue_51;  // 0x1114(0x4)
	char pad_4376_1 : 7;  // 0x1118(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_59 : 1;  // 0x1118(0x1)
	char pad_4377[3];  // 0x1119(0x3)
	float CallFunc_SelectFloat_ReturnValue_52;  // 0x111C(0x4)
	float CallFunc_GetLeanBlendWeights_left_18;  // 0x1120(0x4)
	float CallFunc_GetLeanBlendWeights_right_18;  // 0x1124(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_68;  // 0x1128(0x4)
	struct FVector CallFunc_BreakTransform_Location_56;  // 0x112C(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_56;  // 0x1138(0xC)
	struct FVector CallFunc_BreakTransform_Scale_56;  // 0x1144(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_69;  // 0x1150(0x4)
	struct FVector CallFunc_BreakTransform_Location_57;  // 0x1154(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_57;  // 0x1160(0xC)
	struct FVector CallFunc_BreakTransform_Scale_57;  // 0x116C(0xC)
	float CallFunc_GetLeanBlendWeights_left_19;  // 0x1178(0x4)
	float CallFunc_GetLeanBlendWeights_right_19;  // 0x117C(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_70;  // 0x1180(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_71;  // 0x1184(0x4)
	struct FVector CallFunc_BreakTransform_Location_58;  // 0x1188(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_58;  // 0x1194(0xC)
	struct FVector CallFunc_BreakTransform_Scale_58;  // 0x11A0(0xC)
	char pad_4524_1 : 7;  // 0x11AC(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_27 : 1;  // 0x11AC(0x1)
	char pad_4525_1 : 7;  // 0x11AD(0x1)
	bool CallFunc_BooleanAND_ReturnValue_53 : 1;  // 0x11AD(0x1)
	char pad_4526_1 : 7;  // 0x11AE(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_60 : 1;  // 0x11AE(0x1)
	char pad_4527_1 : 7;  // 0x11AF(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_61 : 1;  // 0x11AF(0x1)
	char pad_4528_1 : 7;  // 0x11B0(0x1)
	bool CallFunc_BooleanOR_ReturnValue_28 : 1;  // 0x11B0(0x1)
	char pad_4529[3];  // 0x11B1(0x3)
	struct FVector CallFunc_BreakTransform_Location_59;  // 0x11B4(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_59;  // 0x11C0(0xC)
	struct FVector CallFunc_BreakTransform_Scale_59;  // 0x11CC(0xC)
	char pad_4568_1 : 7;  // 0x11D8(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_28 : 1;  // 0x11D8(0x1)
	char pad_4569_1 : 7;  // 0x11D9(0x1)
	bool CallFunc_BooleanAND_ReturnValue_54 : 1;  // 0x11D9(0x1)
	char pad_4570[2];  // 0x11DA(0x2)
	float CallFunc_GetKnownCurveValueOnWorkerThread_ReturnValue_4;  // 0x11DC(0x4)
	struct FVector CallFunc_BreakTransform_Location_60;  // 0x11E0(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_60;  // 0x11EC(0xC)
	struct FVector CallFunc_BreakTransform_Scale_60;  // 0x11F8(0xC)
	char pad_4612_1 : 7;  // 0x1204(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_12 : 1;  // 0x1204(0x1)
	char pad_4613_1 : 7;  // 0x1205(0x1)
	bool CallFunc_BooleanOR_ReturnValue_29 : 1;  // 0x1205(0x1)
	char pad_4614_1 : 7;  // 0x1206(0x1)
	bool CallFunc_BooleanOR_ReturnValue_30 : 1;  // 0x1206(0x1)
	char pad_4615_1 : 7;  // 0x1207(0x1)
	bool CallFunc_BooleanAND_ReturnValue_55 : 1;  // 0x1207(0x1)
	char pad_4616_1 : 7;  // 0x1208(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_29 : 1;  // 0x1208(0x1)
	char pad_4617_1 : 7;  // 0x1209(0x1)
	bool CallFunc_BooleanAND_ReturnValue_56 : 1;  // 0x1209(0x1)
	char pad_4618[2];  // 0x120A(0x2)
	float CallFunc_GetLeanBlendWeights_left_20;  // 0x120C(0x4)
	float CallFunc_GetLeanBlendWeights_right_20;  // 0x1210(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_72;  // 0x1214(0x4)
	struct FVector CallFunc_BreakTransform_Location_61;  // 0x1218(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_61;  // 0x1224(0xC)
	struct FVector CallFunc_BreakTransform_Scale_61;  // 0x1230(0xC)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_36;  // 0x123C(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_73;  // 0x1240(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_10;  // 0x1244(0x4)
	float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_12;  // 0x1248(0x4)
	char pad_4684_1 : 7;  // 0x124C(0x1)
	bool CallFunc_Less_FloatFloat_ReturnValue_4 : 1;  // 0x124C(0x1)
	char pad_4685[3];  // 0x124D(0x3)
	float CallFunc_SelectFloat_ReturnValue_53;  // 0x1250(0x4)
	struct FVector CallFunc_BreakTransform_Location_62;  // 0x1254(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_62;  // 0x1260(0xC)
	struct FVector CallFunc_BreakTransform_Scale_62;  // 0x126C(0xC)
	char pad_4728_1 : 7;  // 0x1278(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_30 : 1;  // 0x1278(0x1)
	char pad_4729[3];  // 0x1279(0x3)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_74;  // 0x127C(0x4)
	char pad_4736_1 : 7;  // 0x1280(0x1)
	bool CallFunc_BooleanAND_ReturnValue_57 : 1;  // 0x1280(0x1)
	char pad_4737[3];  // 0x1281(0x3)
	float CallFunc_Multiply_FloatFloat_ReturnValue_11;  // 0x1284(0x4)
	struct FVector CallFunc_BreakTransform_Location_63;  // 0x1288(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_63;  // 0x1294(0xC)
	struct FVector CallFunc_BreakTransform_Scale_63;  // 0x12A0(0xC)
	float CallFunc_GetLeanBlendWeights_left_21;  // 0x12AC(0x4)
	float CallFunc_GetLeanBlendWeights_right_21;  // 0x12B0(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_36;  // 0x12B4(0x4)
	struct FVector CallFunc_BreakTransform_Location_64;  // 0x12B8(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_64;  // 0x12C4(0xC)
	struct FVector CallFunc_BreakTransform_Scale_64;  // 0x12D0(0xC)
	char pad_4828_1 : 7;  // 0x12DC(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_31 : 1;  // 0x12DC(0x1)
	char pad_4829_1 : 7;  // 0x12DD(0x1)
	bool CallFunc_BooleanAND_ReturnValue_58 : 1;  // 0x12DD(0x1)
	char pad_4830[2];  // 0x12DE(0x2)
	struct FVector CallFunc_BreakTransform_Location_65;  // 0x12E0(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_65;  // 0x12EC(0xC)
	struct FVector CallFunc_BreakTransform_Scale_65;  // 0x12F8(0xC)
	char pad_4868_1 : 7;  // 0x1304(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_32 : 1;  // 0x1304(0x1)
	char pad_4869[3];  // 0x1305(0x3)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_75;  // 0x1308(0x4)
	char pad_4876_1 : 7;  // 0x130C(0x1)
	bool CallFunc_BooleanAND_ReturnValue_59 : 1;  // 0x130C(0x1)
	char pad_4877[3];  // 0x130D(0x3)
	float CallFunc_SelectFloat_ReturnValue_54;  // 0x1310(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_12;  // 0x1314(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_76;  // 0x1318(0x4)
	float CallFunc_SelectFloat_ReturnValue_55;  // 0x131C(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_77;  // 0x1320(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_13;  // 0x1324(0x4)
	float CallFunc_SelectFloat_ReturnValue_56;  // 0x1328(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_36;  // 0x132C(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_14;  // 0x1330(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_78;  // 0x1334(0x4)
	float CallFunc_SelectFloat_ReturnValue_57;  // 0x1338(0x4)
	float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_13;  // 0x133C(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_15;  // 0x1340(0x4)
	char pad_4932_1 : 7;  // 0x1344(0x1)
	bool CallFunc_Less_FloatFloat_ReturnValue_5 : 1;  // 0x1344(0x1)
	char pad_4933[3];  // 0x1345(0x3)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_79;  // 0x1348(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_80;  // 0x134C(0x4)
	float CallFunc_GetLeanBlendWeights_left_22;  // 0x1350(0x4)
	float CallFunc_GetLeanBlendWeights_right_22;  // 0x1354(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_81;  // 0x1358(0x4)
	struct FVector CallFunc_BreakTransform_Location_66;  // 0x135C(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_66;  // 0x1368(0xC)
	struct FVector CallFunc_BreakTransform_Scale_66;  // 0x1374(0xC)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_36;  // 0x1380(0x4)
	struct FVector CallFunc_BreakTransform_Location_67;  // 0x1384(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_67;  // 0x1390(0xC)
	struct FVector CallFunc_BreakTransform_Scale_67;  // 0x139C(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_82;  // 0x13A8(0x4)
	float CallFunc_SelectFloat_ReturnValue_58;  // 0x13AC(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_83;  // 0x13B0(0x4)
	float CallFunc_SelectFloat_ReturnValue_59;  // 0x13B4(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_16;  // 0x13B8(0x4)
	float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_14;  // 0x13BC(0x4)
	char pad_5056_1 : 7;  // 0x13C0(0x1)
	bool CallFunc_Less_FloatFloat_ReturnValue_6 : 1;  // 0x13C0(0x1)
	char pad_5057[3];  // 0x13C1(0x3)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_84;  // 0x13C4(0x4)
	float CallFunc_SelectFloat_ReturnValue_60;  // 0x13C8(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_17;  // 0x13CC(0x4)
	float CallFunc_SelectFloat_ReturnValue_61;  // 0x13D0(0x4)
	struct FVector CallFunc_BreakTransform_Location_68;  // 0x13D4(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_68;  // 0x13E0(0xC)
	struct FVector CallFunc_BreakTransform_Scale_68;  // 0x13EC(0xC)
	char pad_5112_1 : 7;  // 0x13F8(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_62 : 1;  // 0x13F8(0x1)
	char pad_5113[3];  // 0x13F9(0x3)
	float CallFunc_SelectFloat_ReturnValue_62;  // 0x13FC(0x4)
	float CallFunc_GetLeanBlendWeights_left_23;  // 0x1400(0x4)
	float CallFunc_GetLeanBlendWeights_right_23;  // 0x1404(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_85;  // 0x1408(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_86;  // 0x140C(0x4)
	float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_15;  // 0x1410(0x4)
	char pad_5140_1 : 7;  // 0x1414(0x1)
	bool CallFunc_Less_FloatFloat_ReturnValue_7 : 1;  // 0x1414(0x1)
	char pad_5141[3];  // 0x1415(0x3)
	struct FVector CallFunc_BreakTransform_Location_69;  // 0x1418(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_69;  // 0x1424(0xC)
	struct FVector CallFunc_BreakTransform_Scale_69;  // 0x1430(0xC)
	float CallFunc_GetLeanBlendWeights_left_24;  // 0x143C(0x4)
	float CallFunc_GetLeanBlendWeights_right_24;  // 0x1440(0x4)
	float CallFunc_SelectFloat_ReturnValue_63;  // 0x1444(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_87;  // 0x1448(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_88;  // 0x144C(0x4)
	struct FVector CallFunc_BreakTransform_Location_70;  // 0x1450(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_70;  // 0x145C(0xC)
	struct FVector CallFunc_BreakTransform_Scale_70;  // 0x1468(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_89;  // 0x1474(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_18;  // 0x1478(0x4)
	float CallFunc_GetCurveValue_ReturnValue_3;  // 0x147C(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_19;  // 0x1480(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_37;  // 0x1484(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_153;  // 0x1488(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_154;  // 0x148C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_155;  // 0x1490(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_156;  // 0x1494(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_157;  // 0x1498(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_158;  // 0x149C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_159;  // 0x14A0(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_160;  // 0x14A4(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_37;  // 0x14A8(0x4)
	float CallFunc_GetInstanceStateWeight_ReturnValue_7;  // 0x14AC(0x4)
	float CallFunc_Subtract_FloatFloat_ReturnValue_5;  // 0x14B0(0x4)
	char pad_5300_1 : 7;  // 0x14B4(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_63 : 1;  // 0x14B4(0x1)
	char pad_5301[3];  // 0x14B5(0x3)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_37;  // 0x14B8(0x4)
	float CallFunc_SelectFloat_ReturnValue_64;  // 0x14BC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_161;  // 0x14C0(0x4)
	float CallFunc_Subtract_FloatFloat_ReturnValue_6;  // 0x14C4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_162;  // 0x14C8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_163;  // 0x14CC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_164;  // 0x14D0(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_165;  // 0x14D4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_166;  // 0x14D8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_167;  // 0x14DC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_168;  // 0x14E0(0x4)
	struct FVector CallFunc_GetIKLegsRootOffsetVectorFromCardinalDirection_ReturnValue_3;  // 0x14E4(0xC)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_37;  // 0x14F0(0x4)
	struct FVector CallFunc_Multiply_VectorFloat_ReturnValue_3;  // 0x14F4(0xC)
	char pad_5376_1 : 7;  // 0x1500(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_33 : 1;  // 0x1500(0x1)
	char pad_5377[3];  // 0x1501(0x3)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_169;  // 0x1504(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_170;  // 0x1508(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_171;  // 0x150C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_172;  // 0x1510(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_173;  // 0x1514(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_174;  // 0x1518(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_175;  // 0x151C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_176;  // 0x1520(0x4)
	char pad_5412_1 : 7;  // 0x1524(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_64 : 1;  // 0x1524(0x1)
	char pad_5413_1 : 7;  // 0x1525(0x1)
	bool CallFunc_BooleanOR_ReturnValue_31 : 1;  // 0x1525(0x1)
	char pad_5414[2];  // 0x1526(0x2)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_177;  // 0x1528(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_178;  // 0x152C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_179;  // 0x1530(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_180;  // 0x1534(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_181;  // 0x1538(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_182;  // 0x153C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_183;  // 0x1540(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_184;  // 0x1544(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_185;  // 0x1548(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_186;  // 0x154C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_187;  // 0x1550(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_188;  // 0x1554(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_189;  // 0x1558(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_190;  // 0x155C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_191;  // 0x1560(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_192;  // 0x1564(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_38;  // 0x1568(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_20;  // 0x156C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_193;  // 0x1570(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_194;  // 0x1574(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_195;  // 0x1578(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_196;  // 0x157C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_197;  // 0x1580(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_198;  // 0x1584(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_199;  // 0x1588(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_200;  // 0x158C(0x4)
	char pad_5520_1 : 7;  // 0x1590(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_65 : 1;  // 0x1590(0x1)
	char pad_5521[3];  // 0x1591(0x3)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_201;  // 0x1594(0x4)
	float CallFunc_SelectFloat_ReturnValue_65;  // 0x1598(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_202;  // 0x159C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_203;  // 0x15A0(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_204;  // 0x15A4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_205;  // 0x15A8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_206;  // 0x15AC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_207;  // 0x15B0(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_208;  // 0x15B4(0x4)
	char pad_5560_1 : 7;  // 0x15B8(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_34 : 1;  // 0x15B8(0x1)
	char pad_5561_1 : 7;  // 0x15B9(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_66 : 1;  // 0x15B9(0x1)
	char pad_5562[2];  // 0x15BA(0x2)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_209;  // 0x15BC(0x4)
	char pad_5568_1 : 7;  // 0x15C0(0x1)
	bool CallFunc_BooleanOR_ReturnValue_32 : 1;  // 0x15C0(0x1)
	char pad_5569[3];  // 0x15C1(0x3)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_210;  // 0x15C4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_211;  // 0x15C8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_212;  // 0x15CC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_213;  // 0x15D0(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_214;  // 0x15D4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_215;  // 0x15D8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_216;  // 0x15DC(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_38;  // 0x15E0(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_38;  // 0x15E4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_217;  // 0x15E8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_218;  // 0x15EC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_219;  // 0x15F0(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_220;  // 0x15F4(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_221;  // 0x15F8(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_222;  // 0x15FC(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_223;  // 0x1600(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_224;  // 0x1604(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_38;  // 0x1608(0x4)
	char pad_5644_1 : 7;  // 0x160C(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_67 : 1;  // 0x160C(0x1)
	char pad_5645_1 : 7;  // 0x160D(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_68 : 1;  // 0x160D(0x1)
	char pad_5646[2];  // 0x160E(0x2)
	float CallFunc_SelectFloat_ReturnValue_66;  // 0x1610(0x4)
	char pad_5652_1 : 7;  // 0x1614(0x1)
	bool CallFunc_BooleanOR_ReturnValue_33 : 1;  // 0x1614(0x1)
	char pad_5653[3];  // 0x1615(0x3)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_39;  // 0x1618(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_225;  // 0x161C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_226;  // 0x1620(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_227;  // 0x1624(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_228;  // 0x1628(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_229;  // 0x162C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_230;  // 0x1630(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_231;  // 0x1634(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_232;  // 0x1638(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_39;  // 0x163C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_233;  // 0x1640(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_234;  // 0x1644(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_235;  // 0x1648(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_236;  // 0x164C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_237;  // 0x1650(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_238;  // 0x1654(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_239;  // 0x1658(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_240;  // 0x165C(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_39;  // 0x1660(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_39;  // 0x1664(0x4)
	char pad_5736_1 : 7;  // 0x1668(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_69 : 1;  // 0x1668(0x1)
	char pad_5737_1 : 7;  // 0x1669(0x1)
	bool CallFunc_BooleanOR_ReturnValue_34 : 1;  // 0x1669(0x1)
	char pad_5738[2];  // 0x166A(0x2)
	float CallFunc_VSize_ReturnValue_2;  // 0x166C(0x4)
	char pad_5744_1 : 7;  // 0x1670(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_13 : 1;  // 0x1670(0x1)
	char pad_5745_1 : 7;  // 0x1671(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_70 : 1;  // 0x1671(0x1)
	char pad_5746[2];  // 0x1672(0x2)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_241;  // 0x1674(0x4)
	char pad_5752_1 : 7;  // 0x1678(0x1)
	bool CallFunc_BooleanOR_ReturnValue_35 : 1;  // 0x1678(0x1)
	char pad_5753[3];  // 0x1679(0x3)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_242;  // 0x167C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_243;  // 0x1680(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_244;  // 0x1684(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_245;  // 0x1688(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_246;  // 0x168C(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_247;  // 0x1690(0x4)
	float CallFunc_FindTimeAtStoppingDistance_ReturnValue_248;  // 0x1694(0x4)
	char pad_5784_1 : 7;  // 0x1698(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_71 : 1;  // 0x1698(0x1)
	char pad_5785_1 : 7;  // 0x1699(0x1)
	bool CallFunc_BooleanOR_ReturnValue_36 : 1;  // 0x1699(0x1)
	char pad_5786_1 : 7;  // 0x169A(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_72 : 1;  // 0x169A(0x1)
	char pad_5787_1 : 7;  // 0x169B(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_73 : 1;  // 0x169B(0x1)
	char pad_5788_1 : 7;  // 0x169C(0x1)
	bool CallFunc_BooleanOR_ReturnValue_37 : 1;  // 0x169C(0x1)
	char pad_5789_1 : 7;  // 0x169D(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_74 : 1;  // 0x169D(0x1)
	char pad_5790_1 : 7;  // 0x169E(0x1)
	bool CallFunc_BooleanOR_ReturnValue_38 : 1;  // 0x169E(0x1)
	char pad_5791[1];  // 0x169F(0x1)
	float CallFunc_VSizeSquared_ReturnValue;  // 0x16A0(0x4)
	char pad_5796_1 : 7;  // 0x16A4(0x1)
	bool CallFunc_BooleanOR_ReturnValue_39 : 1;  // 0x16A4(0x1)
	char pad_5797_1 : 7;  // 0x16A5(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_14 : 1;  // 0x16A5(0x1)
	char pad_5798_1 : 7;  // 0x16A6(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_75 : 1;  // 0x16A6(0x1)
	char pad_5799_1 : 7;  // 0x16A7(0x1)
	bool CallFunc_BooleanOR_ReturnValue_40 : 1;  // 0x16A7(0x1)
	char pad_5800_1 : 7;  // 0x16A8(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_76 : 1;  // 0x16A8(0x1)
	char pad_5801_1 : 7;  // 0x16A9(0x1)
	bool CallFunc_BooleanOR_ReturnValue_41 : 1;  // 0x16A9(0x1)
	char pad_5802_1 : 7;  // 0x16AA(0x1)
	bool CallFunc_BooleanAND_ReturnValue_60 : 1;  // 0x16AA(0x1)
	char pad_5803_1 : 7;  // 0x16AB(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_77 : 1;  // 0x16AB(0x1)
	float CallFunc_GetLeanBlendWeights_left_25;  // 0x16AC(0x4)
	float CallFunc_GetLeanBlendWeights_right_25;  // 0x16B0(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_90;  // 0x16B4(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_91;  // 0x16B8(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_92;  // 0x16BC(0x4)
	char pad_5824_1 : 7;  // 0x16C0(0x1)
	bool CallFunc_BooleanOR_ReturnValue_42 : 1;  // 0x16C0(0x1)
	char pad_5825_1 : 7;  // 0x16C1(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_78 : 1;  // 0x16C1(0x1)
	char pad_5826_1 : 7;  // 0x16C2(0x1)
	bool CallFunc_BooleanAND_ReturnValue_61 : 1;  // 0x16C2(0x1)
	char pad_5827[1];  // 0x16C3(0x1)
	float CallFunc_GetLeanBlendWeights_left_26;  // 0x16C4(0x4)
	float CallFunc_GetLeanBlendWeights_right_26;  // 0x16C8(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_93;  // 0x16CC(0x4)
	char pad_5840_1 : 7;  // 0x16D0(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_79 : 1;  // 0x16D0(0x1)
	char pad_5841[3];  // 0x16D1(0x3)
	float CallFunc_VSizeSquared_ReturnValue_2;  // 0x16D4(0x4)
	char pad_5848_1 : 7;  // 0x16D8(0x1)
	bool CallFunc_LessEqual_FloatFloat_ReturnValue_11 : 1;  // 0x16D8(0x1)
	char pad_5849[3];  // 0x16D9(0x3)
	float CallFunc_GetLeanBlendWeights_left_27;  // 0x16DC(0x4)
	float CallFunc_GetLeanBlendWeights_right_27;  // 0x16E0(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_94;  // 0x16E4(0x4)
	float CallFunc_GetLeanBlendWeights_left_28;  // 0x16E8(0x4)
	float CallFunc_GetLeanBlendWeights_right_28;  // 0x16EC(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_95;  // 0x16F0(0x4)
	char pad_5876_1 : 7;  // 0x16F4(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_80 : 1;  // 0x16F4(0x1)
	char pad_5877[3];  // 0x16F5(0x3)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_96;  // 0x16F8(0x4)
	struct FVector CallFunc_BreakTransform_Location_71;  // 0x16FC(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_71;  // 0x1708(0xC)
	struct FVector CallFunc_BreakTransform_Scale_71;  // 0x1714(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_97;  // 0x1720(0x4)
	float CallFunc_Divide_FloatFloat_ReturnValue;  // 0x1724(0x4)
	struct FVector CallFunc_BreakTransform_Location_72;  // 0x1728(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_72;  // 0x1734(0xC)
	struct FVector CallFunc_BreakTransform_Scale_72;  // 0x1740(0xC)
	float CallFunc_GetLeanBlendWeights_left_29;  // 0x174C(0x4)
	float CallFunc_GetLeanBlendWeights_right_29;  // 0x1750(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_98;  // 0x1754(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_99;  // 0x1758(0x4)
	struct FVector CallFunc_BreakTransform_Location_73;  // 0x175C(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_73;  // 0x1768(0xC)
	struct FVector CallFunc_BreakTransform_Scale_73;  // 0x1774(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_100;  // 0x1780(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_101;  // 0x1784(0x4)
	char pad_6024_1 : 7;  // 0x1788(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_35 : 1;  // 0x1788(0x1)
	char pad_6025_1 : 7;  // 0x1789(0x1)
	bool CallFunc_BooleanAND_ReturnValue_62 : 1;  // 0x1789(0x1)
	char pad_6026[2];  // 0x178A(0x2)
	float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_16;  // 0x178C(0x4)
	char pad_6032_1 : 7;  // 0x1790(0x1)
	bool CallFunc_Less_FloatFloat_ReturnValue_8 : 1;  // 0x1790(0x1)
	char pad_6033[3];  // 0x1791(0x3)
	float CallFunc_GetRelevantAnimTime_ReturnValue_4;  // 0x1794(0x4)
	char pad_6040_1 : 7;  // 0x1798(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_15 : 1;  // 0x1798(0x1)
	char pad_6041[3];  // 0x1799(0x3)
	struct FVector CallFunc_BreakTransform_Location_74;  // 0x179C(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_74;  // 0x17A8(0xC)
	struct FVector CallFunc_BreakTransform_Scale_74;  // 0x17B4(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_102;  // 0x17C0(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_103;  // 0x17C4(0x4)
	float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_17;  // 0x17C8(0x4)
	char pad_6092_1 : 7;  // 0x17CC(0x1)
	bool CallFunc_Less_FloatFloat_ReturnValue_9 : 1;  // 0x17CC(0x1)
	char pad_6093_1 : 7;  // 0x17CD(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_36 : 1;  // 0x17CD(0x1)
	char pad_6094_1 : 7;  // 0x17CE(0x1)
	bool CallFunc_BooleanAND_ReturnValue_63 : 1;  // 0x17CE(0x1)
	char pad_6095[1];  // 0x17CF(0x1)
	float CallFunc_Multiply_FloatFloat_ReturnValue_21;  // 0x17D0(0x4)
	struct FVector CallFunc_BreakTransform_Location_75;  // 0x17D4(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_75;  // 0x17E0(0xC)
	struct FVector CallFunc_BreakTransform_Scale_75;  // 0x17EC(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_104;  // 0x17F8(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_105;  // 0x17FC(0x4)
	float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_18;  // 0x1800(0x4)
	char pad_6148_1 : 7;  // 0x1804(0x1)
	bool CallFunc_Less_FloatFloat_ReturnValue_10 : 1;  // 0x1804(0x1)
	char pad_6149_1 : 7;  // 0x1805(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_37 : 1;  // 0x1805(0x1)
	char pad_6150_1 : 7;  // 0x1806(0x1)
	bool CallFunc_BooleanAND_ReturnValue_64 : 1;  // 0x1806(0x1)
	char pad_6151[1];  // 0x1807(0x1)
	struct FVector CallFunc_BreakTransform_Location_76;  // 0x1808(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_76;  // 0x1814(0xC)
	struct FVector CallFunc_BreakTransform_Scale_76;  // 0x1820(0xC)
	float CallFunc_Multiply_FloatFloat_ReturnValue_22;  // 0x182C(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_106;  // 0x1830(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_107;  // 0x1834(0x4)
	float CallFunc_GetKnownCurveValueOnWorkerThread_ReturnValue_5;  // 0x1838(0x4)
	char pad_6204_1 : 7;  // 0x183C(0x1)
	bool CallFunc_LessEqual_FloatFloat_ReturnValue_12 : 1;  // 0x183C(0x1)
	char pad_6205_1 : 7;  // 0x183D(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_38 : 1;  // 0x183D(0x1)
	char pad_6206[2];  // 0x183E(0x2)
	float CallFunc_GetRelevantAnimTime_ReturnValue_5;  // 0x1840(0x4)
	char pad_6212_1 : 7;  // 0x1844(0x1)
	bool CallFunc_BooleanAND_ReturnValue_65 : 1;  // 0x1844(0x1)
	char pad_6213_1 : 7;  // 0x1845(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_16 : 1;  // 0x1845(0x1)
	char pad_6214_1 : 7;  // 0x1846(0x1)
	bool CallFunc_BooleanAND_ReturnValue_66 : 1;  // 0x1846(0x1)
	char pad_6215[1];  // 0x1847(0x1)
	float CallFunc_GetLeanBlendWeights_left_30;  // 0x1848(0x4)
	float CallFunc_GetLeanBlendWeights_right_30;  // 0x184C(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_108;  // 0x1850(0x4)
	struct FVector CallFunc_BreakTransform_Location_77;  // 0x1854(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_77;  // 0x1860(0xC)
	struct FVector CallFunc_BreakTransform_Scale_77;  // 0x186C(0xC)
	float CallFunc_Divide_FloatFloat_ReturnValue_2;  // 0x1878(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_109;  // 0x187C(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_110;  // 0x1880(0x4)
	struct FVector CallFunc_BreakTransform_Location_78;  // 0x1884(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_78;  // 0x1890(0xC)
	struct FVector CallFunc_BreakTransform_Scale_78;  // 0x189C(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_111;  // 0x18A8(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_112;  // 0x18AC(0x4)
	char pad_6320_1 : 7;  // 0x18B0(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_39 : 1;  // 0x18B0(0x1)
	char pad_6321[3];  // 0x18B1(0x3)
	float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_19;  // 0x18B4(0x4)
	char pad_6328_1 : 7;  // 0x18B8(0x1)
	bool CallFunc_BooleanAND_ReturnValue_67 : 1;  // 0x18B8(0x1)
	char pad_6329_1 : 7;  // 0x18B9(0x1)
	bool CallFunc_Less_FloatFloat_ReturnValue_11 : 1;  // 0x18B9(0x1)
	char pad_6330[2];  // 0x18BA(0x2)
	struct FVector CallFunc_BreakTransform_Location_79;  // 0x18BC(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_79;  // 0x18C8(0xC)
	struct FVector CallFunc_BreakTransform_Scale_79;  // 0x18D4(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_113;  // 0x18E0(0x4)
	float CallFunc_GetLeanBlendWeights_left_31;  // 0x18E4(0x4)
	float CallFunc_GetLeanBlendWeights_right_31;  // 0x18E8(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_114;  // 0x18EC(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_115;  // 0x18F0(0x4)
	float CallFunc_GetKnownCurveValueOnWorkerThread_ReturnValue_6;  // 0x18F4(0x4)
	char pad_6392_1 : 7;  // 0x18F8(0x1)
	bool CallFunc_LessEqual_FloatFloat_ReturnValue_13 : 1;  // 0x18F8(0x1)
	char pad_6393[3];  // 0x18F9(0x3)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_116;  // 0x18FC(0x4)
	struct FVector CallFunc_BreakTransform_Location_80;  // 0x1900(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_80;  // 0x190C(0xC)
	struct FVector CallFunc_BreakTransform_Scale_80;  // 0x1918(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_117;  // 0x1924(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_118;  // 0x1928(0x4)
	float CallFunc_GetRelevantAnimTime_ReturnValue_6;  // 0x192C(0x4)
	char pad_6448_1 : 7;  // 0x1930(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_17 : 1;  // 0x1930(0x1)
	char pad_6449_1 : 7;  // 0x1931(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_40 : 1;  // 0x1931(0x1)
	char pad_6450_1 : 7;  // 0x1932(0x1)
	bool CallFunc_BooleanAND_ReturnValue_68 : 1;  // 0x1932(0x1)
	char pad_6451_1 : 7;  // 0x1933(0x1)
	bool CallFunc_BooleanAND_ReturnValue_69 : 1;  // 0x1933(0x1)
	struct FVector CallFunc_BreakTransform_Location_81;  // 0x1934(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_81;  // 0x1940(0xC)
	struct FVector CallFunc_BreakTransform_Scale_81;  // 0x194C(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_119;  // 0x1958(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_120;  // 0x195C(0x4)
	float CallFunc_GetKnownCurveValueOnWorkerThread_ReturnValue_7;  // 0x1960(0x4)
	float CallFunc_GetRelevantAnimTime_ReturnValue_7;  // 0x1964(0x4)
	char pad_6504_1 : 7;  // 0x1968(0x1)
	bool CallFunc_LessEqual_FloatFloat_ReturnValue_14 : 1;  // 0x1968(0x1)
	char pad_6505_1 : 7;  // 0x1969(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_18 : 1;  // 0x1969(0x1)
	char pad_6506_1 : 7;  // 0x196A(0x1)
	bool CallFunc_BooleanAND_ReturnValue_70 : 1;  // 0x196A(0x1)
	char pad_6507_1 : 7;  // 0x196B(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_41 : 1;  // 0x196B(0x1)
	char pad_6508_1 : 7;  // 0x196C(0x1)
	bool CallFunc_BooleanAND_ReturnValue_71 : 1;  // 0x196C(0x1)
	char pad_6509[3];  // 0x196D(0x3)
	struct FVector CallFunc_BreakTransform_Location_82;  // 0x1970(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_82;  // 0x197C(0xC)
	struct FVector CallFunc_BreakTransform_Scale_82;  // 0x1988(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_121;  // 0x1994(0x4)
	float CallFunc_GetLeanBlendWeights_left_32;  // 0x1998(0x4)
	float CallFunc_GetLeanBlendWeights_right_32;  // 0x199C(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_122;  // 0x19A0(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_123;  // 0x19A4(0x4)
	struct FVector CallFunc_BreakTransform_Location_83;  // 0x19A8(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_83;  // 0x19B4(0xC)
	struct FVector CallFunc_BreakTransform_Scale_83;  // 0x19C0(0xC)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_124;  // 0x19CC(0x4)
	float CallFunc_GetLeanBlendWeights_left_33;  // 0x19D0(0x4)
	float CallFunc_GetLeanBlendWeights_right_33;  // 0x19D4(0x4)
	float CallFunc_GetBoxingInPlaceTurningElapsedTimeLeft_ReturnValue;  // 0x19D8(0x4)
	float CallFunc_GetBoxingInPlaceTurningElapsedTimeRight_ReturnValue;  // 0x19DC(0x4)
	float CallFunc_GetBoxingInPlaceTurningDirectionBlendAlpha_ReturnValue;  // 0x19E0(0x4)
	float CallFunc_GetBoxingInPlaceTurningBlendAlpha_ReturnValue;  // 0x19E4(0x4)
	float CallFunc_SelectFloat_ReturnValue_67;  // 0x19E8(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_23;  // 0x19EC(0x4)
	char pad_6640_1 : 7;  // 0x19F0(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_19 : 1;  // 0x19F0(0x1)
	char pad_6641[3];  // 0x19F1(0x3)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_40;  // 0x19F4(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_40;  // 0x19F8(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_40;  // 0x19FC(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_40;  // 0x1A00(0x4)
	float CallFunc_SelectFloat_ReturnValue_68;  // 0x1A04(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_24;  // 0x1A08(0x4)
	char pad_6668_1 : 7;  // 0x1A0C(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_81 : 1;  // 0x1A0C(0x1)
	char pad_6669_1 : 7;  // 0x1A0D(0x1)
	bool CallFunc_BooleanAND_ReturnValue_72 : 1;  // 0x1A0D(0x1)
	char pad_6670[2];  // 0x1A0E(0x2)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_125;  // 0x1A10(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_41;  // 0x1A14(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_41;  // 0x1A18(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_41;  // 0x1A1C(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_41;  // 0x1A20(0x4)
	float CallFunc_SelectFloat_ReturnValue_69;  // 0x1A24(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_25;  // 0x1A28(0x4)
	float CallFunc_Divide_FloatFloat_ReturnValue_3;  // 0x1A2C(0x4)
	float CallFunc_GetPlayRateFromSpeed_ReturnValue_126;  // 0x1A30(0x4)
	float CallFunc_Divide_FloatFloat_ReturnValue_4;  // 0x1A34(0x4)
	float CallFunc_GetBoxingInPlaceTurningElapsedTimeLeft_ReturnValue_2;  // 0x1A38(0x4)
	float CallFunc_GetBoxingInPlaceTurningElapsedTimeRight_ReturnValue_2;  // 0x1A3C(0x4)
	float CallFunc_GetBoxingInPlaceTurningDirectionBlendAlpha_ReturnValue_2;  // 0x1A40(0x4)
	float CallFunc_GetBoxingInPlaceTurningBlendAlpha_ReturnValue_2;  // 0x1A44(0x4)
	float CallFunc_SelectFloat_ReturnValue_70;  // 0x1A48(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_42;  // 0x1A4C(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_26;  // 0x1A50(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_42;  // 0x1A54(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_42;  // 0x1A58(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_42;  // 0x1A5C(0x4)
	float CallFunc_SelectFloat_ReturnValue_71;  // 0x1A60(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_27;  // 0x1A64(0x4)
	char pad_6760_1 : 7;  // 0x1A68(0x1)
	bool CallFunc_BooleanAND_ReturnValue_73 : 1;  // 0x1A68(0x1)
	char pad_6761[3];  // 0x1A69(0x3)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_43;  // 0x1A6C(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_43;  // 0x1A70(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_43;  // 0x1A74(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_43;  // 0x1A78(0x4)
	float CallFunc_SelectFloat_ReturnValue_72;  // 0x1A7C(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_28;  // 0x1A80(0x4)
	char pad_6788_1 : 7;  // 0x1A84(0x1)
	bool CallFunc_BooleanAND_ReturnValue_74 : 1;  // 0x1A84(0x1)
	char pad_6789_1 : 7;  // 0x1A85(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_82 : 1;  // 0x1A85(0x1)
	char pad_6790_1 : 7;  // 0x1A86(0x1)
	bool CallFunc_BooleanAND_ReturnValue_75 : 1;  // 0x1A86(0x1)
	char pad_6791_1 : 7;  // 0x1A87(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_83 : 1;  // 0x1A87(0x1)
	char pad_6792_1 : 7;  // 0x1A88(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_84 : 1;  // 0x1A88(0x1)
	char pad_6793_1 : 7;  // 0x1A89(0x1)
	bool CallFunc_BooleanOR_ReturnValue_43 : 1;  // 0x1A89(0x1)
	char pad_6794_1 : 7;  // 0x1A8A(0x1)
	bool CallFunc_BooleanOR_ReturnValue_44 : 1;  // 0x1A8A(0x1)
	char pad_6795_1 : 7;  // 0x1A8B(0x1)
	bool CallFunc_BooleanAND_ReturnValue_76 : 1;  // 0x1A8B(0x1)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_44;  // 0x1A8C(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_44;  // 0x1A90(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_44;  // 0x1A94(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_44;  // 0x1A98(0x4)
	struct FVector CallFunc_BreakTransform_Location_84;  // 0x1A9C(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_84;  // 0x1AA8(0xC)
	struct FVector CallFunc_BreakTransform_Scale_84;  // 0x1AB4(0xC)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_45;  // 0x1AC0(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_45;  // 0x1AC4(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_45;  // 0x1AC8(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_45;  // 0x1ACC(0x4)
	struct FVector CallFunc_BreakTransform_Location_85;  // 0x1AD0(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_85;  // 0x1ADC(0xC)
	struct FVector CallFunc_BreakTransform_Scale_85;  // 0x1AE8(0xC)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_46;  // 0x1AF4(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_46;  // 0x1AF8(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_46;  // 0x1AFC(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_46;  // 0x1B00(0x4)
	struct FVector CallFunc_BreakTransform_Location_86;  // 0x1B04(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_86;  // 0x1B10(0xC)
	struct FVector CallFunc_BreakTransform_Scale_86;  // 0x1B1C(0xC)
	float CallFunc_SelectFloat_ReturnValue_73;  // 0x1B28(0x4)
	char pad_6956_1 : 7;  // 0x1B2C(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_85 : 1;  // 0x1B2C(0x1)
	char pad_6957[3];  // 0x1B2D(0x3)
	float CallFunc_SelectFloat_ReturnValue_74;  // 0x1B30(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_47;  // 0x1B34(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_47;  // 0x1B38(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_47;  // 0x1B3C(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_47;  // 0x1B40(0x4)
	struct FVector CallFunc_BreakTransform_Location_87;  // 0x1B44(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_87;  // 0x1B50(0xC)
	struct FVector CallFunc_BreakTransform_Scale_87;  // 0x1B5C(0xC)
	char pad_7016_1 : 7;  // 0x1B68(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_20 : 1;  // 0x1B68(0x1)
	char pad_7017[3];  // 0x1B69(0x3)
	float CallFunc_Multiply_FloatFloat_ReturnValue_29;  // 0x1B6C(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_48;  // 0x1B70(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_48;  // 0x1B74(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_48;  // 0x1B78(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_48;  // 0x1B7C(0x4)
	struct FVector CallFunc_BreakTransform_Location_88;  // 0x1B80(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_88;  // 0x1B8C(0xC)
	struct FVector CallFunc_BreakTransform_Scale_88;  // 0x1B98(0xC)
	float CallFunc_Multiply_FloatFloat_ReturnValue_30;  // 0x1BA4(0x4)
	float CallFunc_GetBoxingInPlaceTurningBlendAlpha_ReturnValue_3;  // 0x1BA8(0x4)
	float CallFunc_GetBoxingInPlaceTurningDirectionBlendAlpha_ReturnValue_3;  // 0x1BAC(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_31;  // 0x1BB0(0x4)
	char pad_7092_1 : 7;  // 0x1BB4(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_86 : 1;  // 0x1BB4(0x1)
	char pad_7093[3];  // 0x1BB5(0x3)
	float CallFunc_SelectFloat_ReturnValue_75;  // 0x1BB8(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_49;  // 0x1BBC(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_49;  // 0x1BC0(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_49;  // 0x1BC4(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_49;  // 0x1BC8(0x4)
	float CallFunc_GetBoxingInPlaceTurningElapsedTimeRight_ReturnValue_3;  // 0x1BCC(0x4)
	struct FVector CallFunc_BreakTransform_Location_89;  // 0x1BD0(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_89;  // 0x1BDC(0xC)
	struct FVector CallFunc_BreakTransform_Scale_89;  // 0x1BE8(0xC)
	char pad_7156_1 : 7;  // 0x1BF4(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_42 : 1;  // 0x1BF4(0x1)
	char pad_7157[3];  // 0x1BF5(0x3)
	float CallFunc_GetBoxingInPlaceTurningElapsedTimeLeft_ReturnValue_3;  // 0x1BF8(0x4)
	char pad_7164_1 : 7;  // 0x1BFC(0x1)
	bool CallFunc_BooleanAND_ReturnValue_77 : 1;  // 0x1BFC(0x1)
	char pad_7165_1 : 7;  // 0x1BFD(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_87 : 1;  // 0x1BFD(0x1)
	char pad_7166[2];  // 0x1BFE(0x2)
	float CallFunc_SelectFloat_ReturnValue_76;  // 0x1C00(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_50;  // 0x1C04(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_50;  // 0x1C08(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_50;  // 0x1C0C(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_50;  // 0x1C10(0x4)
	struct FVector CallFunc_BreakTransform_Location_90;  // 0x1C14(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_90;  // 0x1C20(0xC)
	struct FVector CallFunc_BreakTransform_Scale_90;  // 0x1C2C(0xC)
	char pad_7224_1 : 7;  // 0x1C38(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_88 : 1;  // 0x1C38(0x1)
	char pad_7225_1 : 7;  // 0x1C39(0x1)
	bool CallFunc_BooleanAND_ReturnValue_78 : 1;  // 0x1C39(0x1)
	char pad_7226[2];  // 0x1C3A(0x2)
	float CallFunc_SelectFloat_ReturnValue_77;  // 0x1C3C(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_51;  // 0x1C40(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_51;  // 0x1C44(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_51;  // 0x1C48(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_51;  // 0x1C4C(0x4)
	float CallFunc_SelectFloat_ReturnValue_78;  // 0x1C50(0x4)
	struct FVector CallFunc_BreakTransform_Location_91;  // 0x1C54(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_91;  // 0x1C60(0xC)
	struct FVector CallFunc_BreakTransform_Scale_91;  // 0x1C6C(0xC)
	char pad_7288_1 : 7;  // 0x1C78(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_89 : 1;  // 0x1C78(0x1)
	char pad_7289[3];  // 0x1C79(0x3)
	float CallFunc_Subtract_FloatFloat_ReturnValue_7;  // 0x1C7C(0x4)
	float CallFunc_SelectFloat_ReturnValue_79;  // 0x1C80(0x4)
	float CallFunc_Abs_ReturnValue_2;  // 0x1C84(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_32;  // 0x1C88(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_52;  // 0x1C8C(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_52;  // 0x1C90(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_52;  // 0x1C94(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_52;  // 0x1C98(0x4)
	struct FVector CallFunc_BreakTransform_Location_92;  // 0x1C9C(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_92;  // 0x1CA8(0xC)
	struct FVector CallFunc_BreakTransform_Scale_92;  // 0x1CB4(0xC)
	char pad_7360_1 : 7;  // 0x1CC0(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_90 : 1;  // 0x1CC0(0x1)
	char pad_7361[3];  // 0x1CC1(0x3)
	float CallFunc_SelectFloat_ReturnValue_80;  // 0x1CC4(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_53;  // 0x1CC8(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_53;  // 0x1CCC(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_53;  // 0x1CD0(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_53;  // 0x1CD4(0x4)
	float CallFunc_GetBoxingInPlaceTurningBlendAlpha_ReturnValue_4;  // 0x1CD8(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_33;  // 0x1CDC(0x4)
	struct FVector CallFunc_BreakTransform_Location_93;  // 0x1CE0(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_93;  // 0x1CEC(0xC)
	struct FVector CallFunc_BreakTransform_Scale_93;  // 0x1CF8(0xC)
	float CallFunc_GetBoxingInPlaceTurningDirectionBlendAlpha_ReturnValue_4;  // 0x1D04(0x4)
	float CallFunc_GetBoxingInPlaceTurningElapsedTimeRight_ReturnValue_4;  // 0x1D08(0x4)
	float Temp_float_Variable_2;  // 0x1D0C(0x4)
	char pad_7440_1 : 7;  // 0x1D10(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_91 : 1;  // 0x1D10(0x1)
	char pad_7441[3];  // 0x1D11(0x3)
	float CallFunc_SelectFloat_ReturnValue_81;  // 0x1D14(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_54;  // 0x1D18(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_54;  // 0x1D1C(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_54;  // 0x1D20(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_54;  // 0x1D24(0x4)
	float CallFunc_GetBoxingInPlaceTurningElapsedTimeLeft_ReturnValue_4;  // 0x1D28(0x4)
	struct FVector CallFunc_BreakTransform_Location_94;  // 0x1D2C(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_94;  // 0x1D38(0xC)
	struct FVector CallFunc_BreakTransform_Scale_94;  // 0x1D44(0xC)
	float Temp_float_Variable_3;  // 0x1D50(0x4)
	char pad_7508_1 : 7;  // 0x1D54(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_92 : 1;  // 0x1D54(0x1)
	char pad_7509[3];  // 0x1D55(0x3)
	float CallFunc_SelectFloat_ReturnValue_82;  // 0x1D58(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_55;  // 0x1D5C(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_55;  // 0x1D60(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_55;  // 0x1D64(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_55;  // 0x1D68(0x4)
	float Temp_float_Variable_4;  // 0x1D6C(0x4)
	struct FVector CallFunc_BreakTransform_Location_95;  // 0x1D70(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_95;  // 0x1D7C(0xC)
	struct FVector CallFunc_BreakTransform_Scale_95;  // 0x1D88(0xC)
	float CallFunc_GetInPlaceTurningElapsedTimeLeft_ReturnValue_56;  // 0x1D94(0x4)
	float CallFunc_GetInPlaceTurningElapsedTimeRight_ReturnValue_56;  // 0x1D98(0x4)
	float CallFunc_GetInPlaceTurningDirectionBlendAlpha_ReturnValue_56;  // 0x1D9C(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_56;  // 0x1DA0(0x4)
	float Temp_float_Variable_5;  // 0x1DA4(0x4)
	struct FVector CallFunc_BreakTransform_Location_96;  // 0x1DA8(0xC)
	struct FRotator CallFunc_BreakTransform_Rotation_96;  // 0x1DB4(0xC)
	struct FVector CallFunc_BreakTransform_Scale_96;  // 0x1DC0(0xC)
	float Temp_float_Variable_6;  // 0x1DCC(0x4)
	float CallFunc_Conv_BoolToFloat_ReturnValue;  // 0x1DD0(0x4)
	struct FRotator CallFunc_GetUpperEyelidRotationDelta_ReturnValue;  // 0x1DD4(0xC)
	struct FRotator CallFunc_GetLowerEyelidRotationDelta_ReturnValue;  // 0x1DE0(0xC)
	float Temp_float_Variable_7;  // 0x1DEC(0x4)
	float Temp_float_Variable_8;  // 0x1DF0(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_34;  // 0x1DF4(0x4)
	float CallFunc_Abs_ReturnValue_3;  // 0x1DF8(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_35;  // 0x1DFC(0x4)
	float CallFunc_FClamp_ReturnValue;  // 0x1E00(0x4)
	struct FVector CallFunc_MakeVector_ReturnValue;  // 0x1E04(0xC)
	float CallFunc_FClamp_ReturnValue_2;  // 0x1E10(0x4)
	char pad_7700_1 : 7;  // 0x1E14(0x1)
	bool CallFunc_NotEqual_FloatFloat_ReturnValue : 1;  // 0x1E14(0x1)
	char pad_7701[3];  // 0x1E15(0x3)
	float Temp_float_Variable_9;  // 0x1E18(0x4)
	float Temp_float_Variable_10;  // 0x1E1C(0x4)
	float Temp_float_Variable_11;  // 0x1E20(0x4)
	float Temp_float_Variable_12;  // 0x1E24(0x4)
	float CallFunc_SelectFloat_ReturnValue_83;  // 0x1E28(0x4)
	float Temp_float_Variable_13;  // 0x1E2C(0x4)
	float Temp_float_Variable_14;  // 0x1E30(0x4)
	char pad_7732_1 : 7;  // 0x1E34(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_93 : 1;  // 0x1E34(0x1)
	char pad_7733[3];  // 0x1E35(0x3)
	float Temp_float_Variable_15;  // 0x1E38(0x4)
	char pad_7740_1 : 7;  // 0x1E3C(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_43 : 1;  // 0x1E3C(0x1)
	char pad_7741_1 : 7;  // 0x1E3D(0x1)
	bool CallFunc_Less_FloatFloat_ReturnValue_12 : 1;  // 0x1E3D(0x1)
	char pad_7742_1 : 7;  // 0x1E3E(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_94 : 1;  // 0x1E3E(0x1)
	char pad_7743_1 : 7;  // 0x1E3F(0x1)
	bool CallFunc_BooleanOR_ReturnValue_45 : 1;  // 0x1E3F(0x1)
	char pad_7744_1 : 7;  // 0x1E40(0x1)
	bool CallFunc_BooleanOR_ReturnValue_46 : 1;  // 0x1E40(0x1)
	char pad_7745_1 : 7;  // 0x1E41(0x1)
	bool CallFunc_GreaterEqual_FloatFloat_ReturnValue : 1;  // 0x1E41(0x1)
	char pad_7746_1 : 7;  // 0x1E42(0x1)
	bool CallFunc_BooleanAND_ReturnValue_79 : 1;  // 0x1E42(0x1)
	char pad_7747_1 : 7;  // 0x1E43(0x1)
	bool CallFunc_BooleanOR_ReturnValue_47 : 1;  // 0x1E43(0x1)
	char pad_7748[4];  // 0x1E44(0x4)
	struct UAnimSequenceBase* CallFunc_GetWeaponAnimationPoseOnWorkerThread_ReturnValue;  // 0x1E48(0x8)
	char pad_7760_1 : 7;  // 0x1E50(0x1)
	bool CallFunc_BooleanOR_ReturnValue_48 : 1;  // 0x1E50(0x1)
	char pad_7761[7];  // 0x1E51(0x7)
	struct UAnimSequenceBase* CallFunc_GetWeaponAnimationPoseOnWorkerThread_ReturnValue_2;  // 0x1E58(0x8)
	struct UAnimSequenceBase* CallFunc_GetWeaponAnimationPoseOnWorkerThread_ReturnValue_3;  // 0x1E60(0x8)
	struct UAnimSequenceBase* CallFunc_GetWeaponAnimationPoseOnWorkerThread_ReturnValue_4;  // 0x1E68(0x8)
	struct UAnimSequenceBase* CallFunc_GetWeaponAnimationPoseOnWorkerThread_ReturnValue_5;  // 0x1E70(0x8)
	char pad_7800_1 : 7;  // 0x1E78(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue : 1;  // 0x1E78(0x1)
	char pad_7801_1 : 7;  // 0x1E79(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_2 : 1;  // 0x1E79(0x1)
	char pad_7802[6];  // 0x1E7A(0x6)
	struct UAnimSequenceBase* CallFunc_GetWeaponAnimationPoseOnWorkerThread_ReturnValue_6;  // 0x1E80(0x8)
	char pad_7816_1 : 7;  // 0x1E88(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_3 : 1;  // 0x1E88(0x1)
	char pad_7817[3];  // 0x1E89(0x3)
	float Temp_float_Variable_16;  // 0x1E8C(0x4)
	char pad_7824_1 : 7;  // 0x1E90(0x1)
	bool CallFunc_BooleanOR_ReturnValue_49 : 1;  // 0x1E90(0x1)
	char pad_7825[3];  // 0x1E91(0x3)
	float Temp_float_Variable_17;  // 0x1E94(0x4)
	float CallFunc_GetInstanceStateWeight_ReturnValue_8;  // 0x1E98(0x4)
	float Temp_float_Variable_18;  // 0x1E9C(0x4)
	float CallFunc_Subtract_FloatFloat_ReturnValue_8;  // 0x1EA0(0x4)
	float Temp_float_Variable_19;  // 0x1EA4(0x4)
	float Temp_float_Variable_20;  // 0x1EA8(0x4)
	char pad_7852_1 : 7;  // 0x1EAC(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_4 : 1;  // 0x1EAC(0x1)
	char pad_7853_1 : 7;  // 0x1EAD(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_5 : 1;  // 0x1EAD(0x1)
	char pad_7854_1 : 7;  // 0x1EAE(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_6 : 1;  // 0x1EAE(0x1)
	char pad_7855_1 : 7;  // 0x1EAF(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_7 : 1;  // 0x1EAF(0x1)
	char pad_7856_1 : 7;  // 0x1EB0(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_8 : 1;  // 0x1EB0(0x1)
	char pad_7857_1 : 7;  // 0x1EB1(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_9 : 1;  // 0x1EB1(0x1)
	char pad_7858[2];  // 0x1EB2(0x2)
	float Temp_float_Variable_21;  // 0x1EB4(0x4)
	char pad_7864_1 : 7;  // 0x1EB8(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_10 : 1;  // 0x1EB8(0x1)
	char pad_7865[3];  // 0x1EB9(0x3)
	float Temp_float_Variable_22;  // 0x1EBC(0x4)
	float Temp_float_Variable_23;  // 0x1EC0(0x4)
	uint8_t  Temp_byte_Variable;  // 0x1EC4(0x1)
	char pad_7877[3];  // 0x1EC5(0x3)
	float CallFunc_Multiply_FloatFloat_ReturnValue_36;  // 0x1EC8(0x4)
	float CallFunc_Subtract_FloatFloat_ReturnValue_9;  // 0x1ECC(0x4)
	float CallFunc_Divide_FloatFloat_ReturnValue_5;  // 0x1ED0(0x4)
	float CallFunc_FClamp_ReturnValue_3;  // 0x1ED4(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_37;  // 0x1ED8(0x4)
	float CallFunc_Add_FloatFloat_ReturnValue;  // 0x1EDC(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_38;  // 0x1EE0(0x4)
	float CallFunc_Subtract_FloatFloat_ReturnValue_10;  // 0x1EE4(0x4)
	char pad_7912_1 : 7;  // 0x1EE8(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_11 : 1;  // 0x1EE8(0x1)
	char pad_7913[3];  // 0x1EE9(0x3)
	float CallFunc_GetCurveValue_ReturnValue_4;  // 0x1EEC(0x4)
	char pad_7920_1 : 7;  // 0x1EF0(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_21 : 1;  // 0x1EF0(0x1)
	char pad_7921[3];  // 0x1EF1(0x3)
	float CallFunc_GetCurveValue_ReturnValue_5;  // 0x1EF4(0x4)
	struct FVector CallFunc_MakeVector_ReturnValue_2;  // 0x1EF8(0xC)
	char pad_7940_1 : 7;  // 0x1F04(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_44 : 1;  // 0x1F04(0x1)
	char pad_7941_1 : 7;  // 0x1F05(0x1)
	bool CallFunc_BooleanAND_ReturnValue_80 : 1;  // 0x1F05(0x1)
	char pad_7942[2];  // 0x1F06(0x2)
	float CallFunc_GetInstanceStateWeight_ReturnValue_9;  // 0x1F08(0x4)
	char pad_7948_1 : 7;  // 0x1F0C(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_22 : 1;  // 0x1F0C(0x1)
	char pad_7949[3];  // 0x1F0D(0x3)
	float CallFunc_Multiply_FloatFloat_ReturnValue_39;  // 0x1F10(0x4)
	char pad_7956_1 : 7;  // 0x1F14(0x1)
	bool CallFunc_BooleanAND_ReturnValue_81 : 1;  // 0x1F14(0x1)
	char pad_7957_1 : 7;  // 0x1F15(0x1)
	bool CallFunc_BooleanOR_ReturnValue_50 : 1;  // 0x1F15(0x1)
	char pad_7958[2];  // 0x1F16(0x2)
	float Temp_float_Variable_24;  // 0x1F18(0x4)
	float Temp_float_Variable_25;  // 0x1F1C(0x4)
	float Temp_float_Variable_26;  // 0x1F20(0x4)
	float Temp_float_Variable_27;  // 0x1F24(0x4)
	float Temp_float_Variable_28;  // 0x1F28(0x4)
	float CallFunc_GetInstanceStateWeight_ReturnValue_10;  // 0x1F2C(0x4)
	float CallFunc_Subtract_FloatFloat_ReturnValue_11;  // 0x1F30(0x4)
	char pad_7988_1 : 7;  // 0x1F34(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_12 : 1;  // 0x1F34(0x1)
	char pad_7989[3];  // 0x1F35(0x3)
	float Temp_float_Variable_29;  // 0x1F38(0x4)
	char pad_7996_1 : 7;  // 0x1F3C(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_13 : 1;  // 0x1F3C(0x1)
	char pad_7997_1 : 7;  // 0x1F3D(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_14 : 1;  // 0x1F3D(0x1)
	char pad_7998[2];  // 0x1F3E(0x2)
	float Temp_float_Variable_30;  // 0x1F40(0x4)
	float Temp_float_Variable_31;  // 0x1F44(0x4)
	float Temp_float_Variable_32;  // 0x1F48(0x4)
	float Temp_float_Variable_33;  // 0x1F4C(0x4)
	char pad_8016_1 : 7;  // 0x1F50(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_15 : 1;  // 0x1F50(0x1)
	char pad_8017_1 : 7;  // 0x1F51(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_16 : 1;  // 0x1F51(0x1)
	char pad_8018_1 : 7;  // 0x1F52(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_17 : 1;  // 0x1F52(0x1)
	char pad_8019_1 : 7;  // 0x1F53(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_18 : 1;  // 0x1F53(0x1)
	char pad_8020_1 : 7;  // 0x1F54(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_19 : 1;  // 0x1F54(0x1)
	char pad_8021[3];  // 0x1F55(0x3)
	float Temp_float_Variable_34;  // 0x1F58(0x4)
	char pad_8028[4];  // 0x1F5C(0x4)
	struct FTransform CallFunc_Conv_VectorToTransform_ReturnValue;  // 0x1F60(0x30)
	struct FTransform CallFunc_Conv_VectorToTransform_ReturnValue_2;  // 0x1F90(0x30)
	struct UAnimSequenceBase* CallFunc_GetWeaponAnimationPoseOnWorkerThread_ReturnValue_7;  // 0x1FC0(0x8)
	struct UAnimSequenceBase* CallFunc_GetWeaponAnimationPoseOnWorkerThread_ReturnValue_8;  // 0x1FC8(0x8)
	struct UAnimSequenceBase* CallFunc_GetWeaponAnimationPoseOnWorkerThread_ReturnValue_9;  // 0x1FD0(0x8)
	struct UAnimSequenceBase* CallFunc_GetBowArmsShakeAnimationOnGameThread_ReturnValue;  // 0x1FD8(0x8)
	float Temp_float_Variable_35;  // 0x1FE0(0x4)
	char pad_8164[4];  // 0x1FE4(0x4)
	struct UAnimSequenceBase* CallFunc_GetBowArmsShakeAnimationOnGameThread_ReturnValue_2;  // 0x1FE8(0x8)
	struct UAnimSequenceBase* CallFunc_GetBowArmsShakeAnimationOnGameThread_ReturnValue_3;  // 0x1FF0(0x8)
	float Temp_float_Variable_36;  // 0x1FF8(0x4)
	float Temp_float_Variable_37;  // 0x1FFC(0x4)
	float Temp_float_Variable_38;  // 0x2000(0x4)
	float Temp_float_Variable_39;  // 0x2004(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_40;  // 0x2008(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_41;  // 0x200C(0x4)
	struct FRotator CallFunc_MakeRotator_ReturnValue;  // 0x2010(0xC)
	struct FRotator CallFunc_MakeRotator_ReturnValue_2;  // 0x201C(0xC)
	float Temp_float_Variable_40;  // 0x2028(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_42;  // 0x202C(0x4)
	struct FVector CallFunc_MakeVector_ReturnValue_3;  // 0x2030(0xC)
	float CallFunc_Multiply_FloatFloat_ReturnValue_43;  // 0x203C(0x4)
	struct FVector CallFunc_MakeVector_ReturnValue_4;  // 0x2040(0xC)
	float Temp_float_Variable_41;  // 0x204C(0x4)
	struct UAnimSequenceBase* CallFunc_GetWeaponAnimationPoseOnWorkerThread_ReturnValue_10;  // 0x2050(0x8)
	struct UAnimSequenceBase* CallFunc_GetWeaponAnimationPoseOnWorkerThread_ReturnValue_11;  // 0x2058(0x8)
	struct UAnimSequenceBase* CallFunc_GetWeaponAnimationPoseOnWorkerThread_ReturnValue_12;  // 0x2060(0x8)
	float CallFunc_GetInstanceStateWeight_ReturnValue_11;  // 0x2068(0x4)
	char pad_8300[4];  // 0x206C(0x4)
	struct UAnimSequenceBase* CallFunc_GetWeaponAnimationPoseOnWorkerThread_ReturnValue_13;  // 0x2070(0x8)
	char pad_8312_1 : 7;  // 0x2078(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_20 : 1;  // 0x2078(0x1)
	char pad_8313[7];  // 0x2079(0x7)
	struct UAnimSequenceBase* CallFunc_GetWeaponAnimationPoseOnWorkerThread_ReturnValue_14;  // 0x2080(0x8)
	struct UAnimSequenceBase* CallFunc_GetWeaponAnimationPoseOnWorkerThread_ReturnValue_15;  // 0x2088(0x8)
	char pad_8336_1 : 7;  // 0x2090(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_21 : 1;  // 0x2090(0x1)
	char pad_8337_1 : 7;  // 0x2091(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_22 : 1;  // 0x2091(0x1)
	char pad_8338[6];  // 0x2092(0x6)
	struct UBlendSpace* CallFunc_GetWeaponAimOffsetOnGameThread_ReturnValue;  // 0x2098(0x8)
	char pad_8352_1 : 7;  // 0x20A0(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_23 : 1;  // 0x20A0(0x1)
	char pad_8353[3];  // 0x20A1(0x3)
	float Temp_float_Variable_42;  // 0x20A4(0x4)
	char pad_8360_1 : 7;  // 0x20A8(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_95 : 1;  // 0x20A8(0x1)
	char pad_8361[3];  // 0x20A9(0x3)
	float CallFunc_GetInstanceStateWeight_ReturnValue_12;  // 0x20AC(0x4)
	char pad_8368_1 : 7;  // 0x20B0(0x1)
	bool CallFunc_Greater_FloatFloat_ReturnValue_23 : 1;  // 0x20B0(0x1)
	char pad_8369[3];  // 0x20B1(0x3)
	float Temp_float_Variable_43;  // 0x20B4(0x4)
	char pad_8376_1 : 7;  // 0x20B8(0x1)
	bool CallFunc_BooleanAND_ReturnValue_82 : 1;  // 0x20B8(0x1)
	char pad_8377_1 : 7;  // 0x20B9(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_45 : 1;  // 0x20B9(0x1)
	char pad_8378[2];  // 0x20BA(0x2)
	struct FVector CallFunc_MakeVector_ReturnValue_5;  // 0x20BC(0xC)
	float CallFunc_Divide_FloatFloat_ReturnValue_6;  // 0x20C8(0x4)
	struct FVector CallFunc_MakeVector_ReturnValue_6;  // 0x20CC(0xC)
	struct UAnimSequenceBase* CallFunc_GetWeaponAnimationPoseOnWorkerThread_ReturnValue_16;  // 0x20D8(0x8)
	struct UAnimSequenceBase* CallFunc_GetWeaponAnimationPoseOnWorkerThread_ReturnValue_17;  // 0x20E0(0x8)
	struct UAnimSequenceBase* CallFunc_GetWeaponAnimationPoseOnWorkerThread_ReturnValue_18;  // 0x20E8(0x8)
	float Temp_float_Variable_44;  // 0x20F0(0x4)
	char pad_8436_1 : 7;  // 0x20F4(0x1)
	bool CallFunc_BooleanAND_ReturnValue_83 : 1;  // 0x20F4(0x1)
	char pad_8437_1 : 7;  // 0x20F5(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_24 : 1;  // 0x20F5(0x1)
	char pad_8438[2];  // 0x20F6(0x2)
	float Temp_float_Variable_45;  // 0x20F8(0x4)
	uint8_t  Temp_byte_Variable_2;  // 0x20FC(0x1)
	char pad_8445_1 : 7;  // 0x20FD(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_25 : 1;  // 0x20FD(0x1)
	char pad_8446_1 : 7;  // 0x20FE(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_26 : 1;  // 0x20FE(0x1)
	char pad_8447[1];  // 0x20FF(0x1)
	struct UBlendSpace* CallFunc_GetWeaponAimOffsetOnGameThread_ReturnValue_2;  // 0x2100(0x8)
	char pad_8456_1 : 7;  // 0x2108(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_27 : 1;  // 0x2108(0x1)
	char pad_8457[3];  // 0x2109(0x3)
	float Temp_float_Variable_46;  // 0x210C(0x4)
	struct UBlendSpace* CallFunc_GetWeaponAimOffsetOnGameThread_ReturnValue_3;  // 0x2110(0x8)
	char pad_8472_1 : 7;  // 0x2118(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_28 : 1;  // 0x2118(0x1)
	char pad_8473[3];  // 0x2119(0x3)
	float Temp_float_Variable_47;  // 0x211C(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_44;  // 0x2120(0x4)
	struct FRotator CallFunc_MakeRotator_ReturnValue_3;  // 0x2124(0xC)
	float Temp_float_Variable_48;  // 0x2130(0x4)
	float Temp_float_Variable_49;  // 0x2134(0x4)
	float Temp_float_Variable_50;  // 0x2138(0x4)
	float Temp_float_Variable_51;  // 0x213C(0x4)
	float Temp_float_Variable_52;  // 0x2140(0x4)
	float Temp_float_Variable_53;  // 0x2144(0x4)
	char pad_8520_1 : 7;  // 0x2148(0x1)
	bool CallFunc_BooleanOR_ReturnValue_51 : 1;  // 0x2148(0x1)
	char pad_8521_1 : 7;  // 0x2149(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_46 : 1;  // 0x2149(0x1)
	uint8_t  Temp_byte_Variable_3;  // 0x214A(0x1)
	char pad_8523[1];  // 0x214B(0x1)
	float Temp_float_Variable_54;  // 0x214C(0x4)
	float CallFunc_GetStandLookBlendAlpha_ReturnValue;  // 0x2150(0x4)
	char pad_8532_1 : 7;  // 0x2154(0x1)
	bool CallFunc_BooleanOR_ReturnValue_52 : 1;  // 0x2154(0x1)
	char pad_8533_1 : 7;  // 0x2155(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_47 : 1;  // 0x2155(0x1)
	char pad_8534_1 : 7;  // 0x2156(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_96 : 1;  // 0x2156(0x1)
	char pad_8535[1];  // 0x2157(0x1)
	float Temp_float_Variable_55;  // 0x2158(0x4)
	char pad_8540_1 : 7;  // 0x215C(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_97 : 1;  // 0x215C(0x1)
	char pad_8541[3];  // 0x215D(0x3)
	float Temp_float_Variable_56;  // 0x2160(0x4)
	float Temp_float_Variable_57;  // 0x2164(0x4)
	float Temp_float_Variable_58;  // 0x2168(0x4)
	float Temp_float_Variable_59;  // 0x216C(0x4)
	float Temp_float_Variable_60;  // 0x2170(0x4)
	float CallFunc_GetInstanceStateWeight_ReturnValue_13;  // 0x2174(0x4)
	float CallFunc_GetInPlaceTurningBlendAlpha_ReturnValue_57;  // 0x2178(0x4)
	char pad_8572_1 : 7;  // 0x217C(0x1)
	bool CallFunc_NotEqual_ByteByte_ReturnValue_5 : 1;  // 0x217C(0x1)
	char pad_8573[3];  // 0x217D(0x3)
	float CallFunc_Subtract_FloatFloat_ReturnValue_12;  // 0x2180(0x4)
	float CallFunc_SelectFloat_ReturnValue_84;  // 0x2184(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_45;  // 0x2188(0x4)
	char pad_8588_1 : 7;  // 0x218C(0x1)
	bool CallFunc_GreaterEqual_FloatFloat_ReturnValue_2 : 1;  // 0x218C(0x1)
	char pad_8589_1 : 7;  // 0x218D(0x1)
	bool CallFunc_BooleanOR_ReturnValue_53 : 1;  // 0x218D(0x1)
	char pad_8590_1 : 7;  // 0x218E(0x1)
	bool CallFunc_BooleanAND_ReturnValue_84 : 1;  // 0x218E(0x1)
	char pad_8591[1];  // 0x218F(0x1)
	float Temp_float_Variable_61;  // 0x2190(0x4)
	struct FRotator CallFunc_MakeRotator_ReturnValue_4;  // 0x2194(0xC)
	struct FRotator CallFunc_MakeRotator_ReturnValue_5;  // 0x21A0(0xC)
	float Temp_float_Variable_62;  // 0x21AC(0x4)
	float CallFunc_Conv_BoolToFloat_ReturnValue_2;  // 0x21B0(0x4)
	float Temp_float_Variable_63;  // 0x21B4(0x4)
	uint8_t  Temp_byte_Variable_4;  // 0x21B8(0x1)
	char pad_8633[3];  // 0x21B9(0x3)
	float Temp_float_Variable_64;  // 0x21BC(0x4)
	uint8_t  Temp_byte_Variable_5;  // 0x21C0(0x1)
	char pad_8641[3];  // 0x21C1(0x3)
	float Temp_float_Variable_65;  // 0x21C4(0x4)
	uint8_t  Temp_byte_Variable_6;  // 0x21C8(0x1)
	char pad_8649[3];  // 0x21C9(0x3)
	float Temp_float_Variable_66;  // 0x21CC(0x4)
	float K2Node_Select_Default;  // 0x21D0(0x4)
	struct FRotator CallFunc_MakeRotator_ReturnValue_6;  // 0x21D4(0xC)
	uint8_t  Temp_byte_Variable_7;  // 0x21E0(0x1)
	char pad_8673[3];  // 0x21E1(0x3)
	float K2Node_Select_Default_2;  // 0x21E4(0x4)
	float Temp_float_Variable_67;  // 0x21E8(0x4)
	float Temp_float_Variable_68;  // 0x21EC(0x4)
	char pad_8688_1 : 7;  // 0x21F0(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_29 : 1;  // 0x21F0(0x1)
	char pad_8689_1 : 7;  // 0x21F1(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_30 : 1;  // 0x21F1(0x1)
	char pad_8690_1 : 7;  // 0x21F2(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_31 : 1;  // 0x21F2(0x1)
	char pad_8691_1 : 7;  // 0x21F3(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue_32 : 1;  // 0x21F3(0x1)
	float Temp_float_Variable_69;  // 0x21F4(0x4)
	float Temp_float_Variable_70;  // 0x21F8(0x4)
	float Temp_float_Variable_71;  // 0x21FC(0x4)
	float Temp_float_Variable_72;  // 0x2200(0x4)
	float Temp_float_Variable_73;  // 0x2204(0x4)
	float Temp_float_Variable_74;  // 0x2208(0x4)
	float Temp_float_Variable_75;  // 0x220C(0x4)
	float Temp_float_Variable_76;  // 0x2210(0x4)
	char pad_8724_1 : 7;  // 0x2214(0x1)
	bool CallFunc_GreaterEqual_FloatFloat_ReturnValue_3 : 1;  // 0x2214(0x1)
	char pad_8725[3];  // 0x2215(0x3)
	float Temp_float_Variable_77;  // 0x2218(0x4)
	float K2Node_Select_Default_3;  // 0x221C(0x4)
	float CallFunc_Divide_FloatFloat_ReturnValue_7;  // 0x2220(0x4)
	float CallFunc_FClamp_ReturnValue_4;  // 0x2224(0x4)
	char pad_8744[8];  // 0x2228(0x8)
	struct FTransform CallFunc_MakeTransform_ReturnValue;  // 0x2230(0x30)
	float CallFunc_Multiply_FloatFloat_ReturnValue_46;  // 0x2260(0x4)
	struct FVector CallFunc_MakeVector_ReturnValue_7;  // 0x2264(0xC)
	float CallFunc_Multiply_FloatFloat_ReturnValue_47;  // 0x2270(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_48;  // 0x2274(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_49;  // 0x2278(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_50;  // 0x227C(0x4)
	struct FRotator CallFunc_MakeRotator_ReturnValue_7;  // 0x2280(0xC)
	float CallFunc_Multiply_FloatFloat_ReturnValue_51;  // 0x228C(0x4)
	struct FRotator CallFunc_MakeRotator_ReturnValue_8;  // 0x2290(0xC)
	float CallFunc_Multiply_FloatFloat_ReturnValue_52;  // 0x229C(0x4)
	struct FRotator CallFunc_MakeRotator_ReturnValue_9;  // 0x22A0(0xC)
	float CallFunc_Multiply_FloatFloat_ReturnValue_53;  // 0x22AC(0x4)
	struct FRotator CallFunc_MakeRotator_ReturnValue_10;  // 0x22B0(0xC)
	float CallFunc_Multiply_FloatFloat_ReturnValue_54;  // 0x22BC(0x4)
	struct FRotator CallFunc_MakeRotator_ReturnValue_11;  // 0x22C0(0xC)
	float CallFunc_SelectFloat_ReturnValue_85;  // 0x22CC(0x4)
	float CallFunc_SelectFloat_ReturnValue_86;  // 0x22D0(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_55;  // 0x22D4(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_56;  // 0x22D8(0x4)
	float Temp_float_Variable_78;  // 0x22DC(0x4)
	struct FVector CallFunc_MakeVector_ReturnValue_8;  // 0x22E0(0xC)
	struct FVector CallFunc_SelectVector_ReturnValue;  // 0x22EC(0xC)
	char pad_8952_1 : 7;  // 0x22F8(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_48 : 1;  // 0x22F8(0x1)
	char pad_8953[7];  // 0x22F9(0x7)
	struct FTransform CallFunc_MakeTransform_ReturnValue_2;  // 0x2300(0x30)
	char pad_9008_1 : 7;  // 0x2330(0x1)
	bool CallFunc_BooleanAND_ReturnValue_85 : 1;  // 0x2330(0x1)
	char pad_9009_1 : 7;  // 0x2331(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_49 : 1;  // 0x2331(0x1)
	char pad_9010_1 : 7;  // 0x2332(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_98 : 1;  // 0x2332(0x1)
	char pad_9011_1 : 7;  // 0x2333(0x1)
	bool CallFunc_BooleanAND_ReturnValue_86 : 1;  // 0x2333(0x1)
	char pad_9012_1 : 7;  // 0x2334(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_99 : 1;  // 0x2334(0x1)
	char pad_9013_1 : 7;  // 0x2335(0x1)
	bool CallFunc_BooleanOR_ReturnValue_54 : 1;  // 0x2335(0x1)
	char pad_9014_1 : 7;  // 0x2336(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_100 : 1;  // 0x2336(0x1)
	char pad_9015_1 : 7;  // 0x2337(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_101 : 1;  // 0x2337(0x1)
	char pad_9016_1 : 7;  // 0x2338(0x1)
	bool CallFunc_BooleanOR_ReturnValue_55 : 1;  // 0x2338(0x1)
	char pad_9017[3];  // 0x2339(0x3)
	float Temp_float_Variable_79;  // 0x233C(0x4)
	char pad_9024_1 : 7;  // 0x2340(0x1)
	bool CallFunc_BooleanOR_ReturnValue_56 : 1;  // 0x2340(0x1)
	char pad_9025[3];  // 0x2341(0x3)
	float Temp_float_Variable_80;  // 0x2344(0x4)
	uint8_t  Temp_byte_Variable_8;  // 0x2348(0x1)
	char pad_9033[3];  // 0x2349(0x3)
	float Temp_float_Variable_81;  // 0x234C(0x4)
	float Temp_float_Variable_82;  // 0x2350(0x4)
	char pad_9044[12];  // 0x2354(0xC)
	struct FTransform CallFunc_Conv_VectorToTransform_ReturnValue_3;  // 0x2360(0x30)
	float CallFunc_GetCurveValue_ReturnValue_6;  // 0x2390(0x4)
	float CallFunc_GetKnownCurveValueOnWorkerThread_ReturnValue_8;  // 0x2394(0x4)
	float CallFunc_GetKnownCurveValueOnWorkerThread_ReturnValue_9;  // 0x2398(0x4)
	float CallFunc_GetCurveValue_ReturnValue_7;  // 0x239C(0x4)
	float CallFunc_FMax_ReturnValue;  // 0x23A0(0x4)
	float Temp_float_Variable_83;  // 0x23A4(0x4)
	float Temp_float_Variable_84;  // 0x23A8(0x4)
	float K2Node_Event_DeltaTimeX;  // 0x23AC(0x4)
	float Temp_float_Variable_85;  // 0x23B0(0x4)
	char pad_9140[4];  // 0x23B4(0x4)
	struct APawn* CallFunc_TryGetPawnOwner_ReturnValue;  // 0x23B8(0x8)
	char pad_9152_1 : 7;  // 0x23C0(0x1)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x23C0(0x1)
	char pad_9153_1 : 7;  // 0x23C1(0x1)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0x23C1(0x1)
	char pad_9154[6];  // 0x23C2(0x6)
	struct ABP_Prisoner_C* K2Node_DynamicCast_AsBP_Prisoner;  // 0x23C8(0x8)
	char pad_9168_1 : 7;  // 0x23D0(0x1)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x23D0(0x1)
	char pad_9169[3];  // 0x23D1(0x3)
	float CallFunc_Multiply_FloatFloat_ReturnValue_57;  // 0x23D4(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_58;  // 0x23D8(0x4)
	struct FVector CallFunc_MakeVector_ReturnValue_9;  // 0x23DC(0xC)
	struct FVector CallFunc_MakeVector_ReturnValue_10;  // 0x23E8(0xC)
	float Temp_float_Variable_86;  // 0x23F4(0x4)
	char pad_9208[8];  // 0x23F8(0x8)
	struct FTransform CallFunc_GetSocketTransform_ReturnValue;  // 0x2400(0x30)
	float Temp_float_Variable_87;  // 0x2430(0x4)
	char pad_9268_1 : 7;  // 0x2434(0x1)
	bool CallFunc_ShouldSkipStandWalkOrJogOrRunStart_Result : 1;  // 0x2434(0x1)
	char pad_9269[3];  // 0x2435(0x3)
	float CallFunc_Multiply_FloatFloat_ReturnValue_59;  // 0x2438(0x4)
	float Temp_float_Variable_88;  // 0x243C(0x4)
	struct FVector CallFunc_GetActorUpVector_ReturnValue;  // 0x2440(0xC)
	struct FVector CallFunc_Multiply_VectorFloat_ReturnValue_4;  // 0x244C(0xC)
	float K2Node_Select_Default_4;  // 0x2458(0x4)
	struct FVector CallFunc_GetActorRightVector_ReturnValue;  // 0x245C(0xC)
	struct FVector CallFunc_Multiply_VectorFloat_ReturnValue_5;  // 0x2468(0xC)
	char pad_9332[12];  // 0x2474(0xC)
	struct FTransform CallFunc_GetTransform_ReturnValue;  // 0x2480(0x30)
	struct USkeletalMeshComponent* CallFunc_GetPenisSkeletalMeshComponent_ReturnValue;  // 0x24B0(0x8)
	struct FVector CallFunc_TransformLocation_ReturnValue;  // 0x24B8(0xC)
	char pad_9412_1 : 7;  // 0x24C4(0x1)
	bool CallFunc_IsValid_ReturnValue_3 : 1;  // 0x24C4(0x1)
	char pad_9413[3];  // 0x24C5(0x3)
	struct FVector CallFunc_Add_VectorVector_ReturnValue;  // 0x24C8(0xC)
	struct FVector CallFunc_Add_VectorVector_ReturnValue_2;  // 0x24D4(0xC)
	struct FVector CallFunc_GetSocketLocation_ReturnValue;  // 0x24E0(0xC)
	struct FVector CallFunc_GetSocketLocation_ReturnValue_2;  // 0x24EC(0xC)
	struct FVector CallFunc_Add_VectorVector_ReturnValue_3;  // 0x24F8(0xC)
	struct FVector CallFunc_GetSocketLocation_ReturnValue_3;  // 0x2504(0xC)
	struct FVector CallFunc_Add_VectorVector_ReturnValue_4;  // 0x2510(0xC)
	struct FVector CallFunc_Add_VectorVector_ReturnValue_5;  // 0x251C(0xC)
	struct FVector CallFunc_Divide_VectorFloat_ReturnValue;  // 0x2528(0xC)
	char pad_9524_1 : 7;  // 0x2534(0x1)
	bool CallFunc_IsDedicatedServer_ReturnValue : 1;  // 0x2534(0x1)
	char pad_9525_1 : 7;  // 0x2535(0x1)
	bool CallFunc_Not_PreBool_ReturnValue_50 : 1;  // 0x2535(0x1)
	char pad_9526_1 : 7;  // 0x2536(0x1)
	bool CallFunc_BooleanAND_ReturnValue_87 : 1;  // 0x2536(0x1)
	char pad_9527[1];  // 0x2537(0x1)
	float CallFunc_GetPenisSize_ReturnValue;  // 0x2538(0x4)
	float CallFunc_Divide_FloatFloat_ReturnValue_8;  // 0x253C(0x4)
	float CallFunc_Divide_FloatFloat_ReturnValue_9;  // 0x2540(0x4)
	struct FRotator CallFunc_RLerp_ReturnValue;  // 0x2544(0xC)
	struct FVector CallFunc_VLerp_ReturnValue;  // 0x2550(0xC)
	struct FVector CallFunc_Add_VectorVector_ReturnValue_6;  // 0x255C(0xC)

}; 
// Function ABP_Prisoner.ABP_Prisoner_C.BlueprintUpdateAnimation
// Size: 0x4(Inherited: 0x4) 
struct FBlueprintUpdateAnimation : public FBlueprintUpdateAnimation
{
	float DeltaTimeX;  // 0x0(0x4)

}; 
// Function ABP_Prisoner.ABP_Prisoner_C.AnimGraph
// Size: 0x10(Inherited: 0x0) 
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0(0x10)

}; 
// Function ABP_Prisoner.ABP_Prisoner_C.VehicleLayer
// Size: 0x10(Inherited: 0x0) 
struct FVehicleLayer
{
	struct FPoseLink VehicleLayer;  // 0x0(0x10)

}; 
