#pragma once 
#include "SDK.h" 
 
 
// Function ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C.ExecuteUbergraph_ABP_Prisoner_Aerial
// Size: 0x60(Inherited: 0x0) 
struct FExecuteUbergraph_ABP_Prisoner_Aerial
{
	int32_t EntryPoint;  // 0x0(0x4)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool CallFunc_GreaterEqual_FloatFloat_ReturnValue : 1;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)
	float CallFunc_Subtract_FloatFloat_ReturnValue;  // 0x8(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue;  // 0xC(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_2;  // 0x10(0x4)
	char pad_20_1 : 7;  // 0x14(0x1)
	bool CallFunc_GreaterEqual_FloatFloat_ReturnValue_2 : 1;  // 0x14(0x1)
	char pad_21[3];  // 0x15(0x3)
	float CallFunc_Multiply_FloatFloat_ReturnValue_3;  // 0x18(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_4;  // 0x1C(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_5;  // 0x20(0x4)
	char pad_36_1 : 7;  // 0x24(0x1)
	bool CallFunc_GreaterEqual_FloatFloat_ReturnValue_3 : 1;  // 0x24(0x1)
	char pad_37[3];  // 0x25(0x3)
	float CallFunc_Subtract_FloatFloat_ReturnValue_2;  // 0x28(0x4)
	char pad_44_1 : 7;  // 0x2C(0x1)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue : 1;  // 0x2C(0x1)
	char pad_45[3];  // 0x2D(0x3)
	float CallFunc_SelectFloat_ReturnValue;  // 0x30(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_6;  // 0x34(0x4)
	char pad_56_1 : 7;  // 0x38(0x1)
	bool CallFunc_GreaterEqual_FloatFloat_ReturnValue_4 : 1;  // 0x38(0x1)
	char pad_57_1 : 7;  // 0x39(0x1)
	bool CallFunc_GreaterEqual_FloatFloat_ReturnValue_5 : 1;  // 0x39(0x1)
	char pad_58_1 : 7;  // 0x3A(0x1)
	bool CallFunc_GreaterEqual_FloatFloat_ReturnValue_6 : 1;  // 0x3A(0x1)
	char pad_59[1];  // 0x3B(0x1)
	float CallFunc_Conv_BoolToFloat_ReturnValue;  // 0x3C(0x4)
	float CallFunc_Conv_BoolToFloat_ReturnValue_2;  // 0x40(0x4)
	float CallFunc_FindJumpTime_ReturnValue;  // 0x44(0x4)
	float CallFunc_FindJumpTime_ReturnValue_2;  // 0x48(0x4)
	float CallFunc_FindJumpTime_ReturnValue_3;  // 0x4C(0x4)
	float CallFunc_FindJumpTime_ReturnValue_4;  // 0x50(0x4)
	float CallFunc_FindJumpTime_ReturnValue_5;  // 0x54(0x4)
	float CallFunc_FindJumpTime_ReturnValue_6;  // 0x58(0x4)
	float CallFunc_FindJumpTime_ReturnValue_7;  // 0x5C(0x4)

}; 
// Function ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C.AnimGraph
// Size: 0x10(Inherited: 0x0) 
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0(0x10)

}; 
