#pragma once 
#include "SDK.h" 
 
 
// Function ABP_Prisoner_WeightLoad.ABP_Prisoner_WeightLoad_C.ExecuteUbergraph_ABP_Prisoner_WeightLoad
// Size: 0x78(Inherited: 0x0) 
struct FExecuteUbergraph_ABP_Prisoner_WeightLoad
{
	int32_t EntryPoint;  // 0x0(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue;  // 0x4(0x4)
	float CallFunc_Lerp_ReturnValue;  // 0x8(0x4)
	struct FRotator CallFunc_MakeRotator_ReturnValue;  // 0xC(0xC)
	float CallFunc_Multiply_FloatFloat_ReturnValue_2;  // 0x18(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_3;  // 0x1C(0x4)
	struct FRotator CallFunc_MakeRotator_ReturnValue_2;  // 0x20(0xC)
	struct FRotator CallFunc_MakeRotator_ReturnValue_3;  // 0x2C(0xC)
	float CallFunc_Multiply_FloatFloat_ReturnValue_4;  // 0x38(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_5;  // 0x3C(0x4)
	struct FRotator CallFunc_MakeRotator_ReturnValue_4;  // 0x40(0xC)
	struct FRotator CallFunc_MakeRotator_ReturnValue_5;  // 0x4C(0xC)
	float CallFunc_Multiply_FloatFloat_ReturnValue_6;  // 0x58(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_7;  // 0x5C(0x4)
	struct FRotator CallFunc_MakeRotator_ReturnValue_6;  // 0x60(0xC)
	struct FRotator CallFunc_MakeRotator_ReturnValue_7;  // 0x6C(0xC)

}; 
// Function ABP_Prisoner_WeightLoad.ABP_Prisoner_WeightLoad_C.AnimGraph
// Size: 0x20(Inherited: 0x0) 
struct FAnimGraph
{
	struct FPoseLink InPose;  // 0x0(0x10)
	struct FPoseLink AnimGraph;  // 0x10(0x10)

}; 
