#pragma once 
#include "SDK.h" 
 
 
// Function BP_ChristmasGhost.BP_ChristmasGhost_C.OnBlendOut_BD830BA54751BA88132EE8B90C969374
// Size: 0x8(Inherited: 0x0) 
struct FOnBlendOut_BD830BA54751BA88132EE8B90C969374
{
	struct FName NotifyName;  // 0x0(0x8)

}; 
// Function BP_ChristmasGhost.BP_ChristmasGhost_C.ExecuteUbergraph_BP_ChristmasGhost
// Size: 0xA9(Inherited: 0x0) 
struct FExecuteUbergraph_BP_ChristmasGhost
{
	int32_t EntryPoint;  // 0x0(0x4)
	struct FName K2Node_CustomEvent_NotifyName_4;  // 0x4(0x8)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0xC(0x10)
	struct FName K2Node_CustomEvent_NotifyName_3;  // 0x1C(0x8)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x24(0x10)
	struct FName K2Node_CustomEvent_NotifyName_2;  // 0x34(0x8)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_3;  // 0x3C(0x10)
	struct FName K2Node_CustomEvent_NotifyName;  // 0x4C(0x8)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_4;  // 0x54(0x10)
	struct FName Temp_name_Variable;  // 0x64(0x8)
	struct FName K2Node_CustomEvent_NotifyName_5;  // 0x6C(0x8)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x74(0x4)
	int32_t CallFunc_RandomInteger_ReturnValue;  // 0x78(0x4)
	char pad_124_1 : 7;  // 0x7C(0x1)
	bool CallFunc_Greater_IntInt_ReturnValue : 1;  // 0x7C(0x1)
	char pad_125[3];  // 0x7D(0x3)
	struct USkeletalMesh* CallFunc_Array_Get_Item;  // 0x80(0x8)
	char pad_136_1 : 7;  // 0x88(0x1)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x88(0x1)
	char pad_137[3];  // 0x89(0x3)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_5;  // 0x8C(0x10)
	char pad_156[4];  // 0x9C(0x4)
	struct UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue;  // 0xA0(0x8)
	char pad_168_1 : 7;  // 0xA8(0x1)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0xA8(0x1)

}; 
// Function BP_ChristmasGhost.BP_ChristmasGhost_C.OnCompleted_BD830BA54751BA88132EE8B90C969374
// Size: 0x8(Inherited: 0x0) 
struct FOnCompleted_BD830BA54751BA88132EE8B90C969374
{
	struct FName NotifyName;  // 0x0(0x8)

}; 
// Function BP_ChristmasGhost.BP_ChristmasGhost_C.OnNotifyBegin_BD830BA54751BA88132EE8B90C969374
// Size: 0x8(Inherited: 0x0) 
struct FOnNotifyBegin_BD830BA54751BA88132EE8B90C969374
{
	struct FName NotifyName;  // 0x0(0x8)

}; 
// Function BP_ChristmasGhost.BP_ChristmasGhost_C.OnInterrupted_BD830BA54751BA88132EE8B90C969374
// Size: 0x8(Inherited: 0x0) 
struct FOnInterrupted_BD830BA54751BA88132EE8B90C969374
{
	struct FName NotifyName;  // 0x0(0x8)

}; 
// Function BP_ChristmasGhost.BP_ChristmasGhost_C.OnNotifyEnd_BD830BA54751BA88132EE8B90C969374
// Size: 0x8(Inherited: 0x0) 
struct FOnNotifyEnd_BD830BA54751BA88132EE8B90C969374
{
	struct FName NotifyName;  // 0x0(0x8)

}; 
