#pragma once 
#include "SDK.h" 
 
 
// Function BP_Menu_Design.BP_Menu_Design_C.ExecuteUbergraph_BP_Menu_Design
// Size: 0x20C(Inherited: 0x0) 
struct FExecuteUbergraph_BP_Menu_Design
{
	int32_t EntryPoint;  // 0x0(0x4)
	struct FName K2Node_ComponentBoundEvent_EventName;  // 0x4(0x8)
	float K2Node_ComponentBoundEvent_EmitterTime;  // 0xC(0x4)
	int32_t K2Node_ComponentBoundEvent_ParticleCount;  // 0x10(0x4)
	float K2Node_Event_DeltaSeconds;  // 0x14(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue;  // 0x18(0x4)
	float CallFunc_Add_FloatFloat_ReturnValue;  // 0x1C(0x4)
	float CallFunc_BreakRotator_Roll;  // 0x20(0x4)
	float CallFunc_BreakRotator_Pitch;  // 0x24(0x4)
	float CallFunc_BreakRotator_Yaw;  // 0x28(0x4)
	struct FRotator CallFunc_MakeRotator_ReturnValue;  // 0x2C(0xC)
	char pad_56_1 : 7;  // 0x38(0x1)
	bool K2Node_CustomEvent_backwards : 1;  // 0x38(0x1)
	char pad_57[3];  // 0x39(0x3)
	struct FHitResult CallFunc_K2_SetRelativeRotation_SweepHitResult;  // 0x3C(0x88)
	char pad_196_1 : 7;  // 0xC4(0x1)
	bool CallFunc_Not_PreBool_ReturnValue : 1;  // 0xC4(0x1)
	char pad_197[3];  // 0xC5(0x3)
	struct ADoubleSlidingDoorStatic* K2Node_DynamicCast_AsDouble_Sliding_Door_Static;  // 0xC8(0x8)
	char pad_208_1 : 7;  // 0xD0(0x1)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0xD0(0x1)
	char pad_209[3];  // 0xD1(0x3)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue;  // 0xD4(0xC)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_2;  // 0xE0(0xC)
	struct FRotator CallFunc_K2_GetActorRotation_ReturnValue;  // 0xEC(0xC)
	struct FVector CallFunc_VLerp_ReturnValue;  // 0xF8(0xC)
	char pad_260_1 : 7;  // 0x104(0x1)
	bool CallFunc_K2_TeleportTo_ReturnValue : 1;  // 0x104(0x1)
	char pad_261[3];  // 0x105(0x3)
	struct FVector CallFunc_K2_GetComponentLocation_ReturnValue;  // 0x108(0xC)
	int32_t CallFunc_PostEventAtLocation_ReturnValue;  // 0x114(0x4)
	struct FVector CallFunc_K2_GetComponentLocation_ReturnValue_2;  // 0x118(0xC)
	struct FVector CallFunc_K2_GetComponentLocation_ReturnValue_3;  // 0x124(0xC)
	int32_t CallFunc_PostEventAtLocation_ReturnValue_2;  // 0x130(0x4)
	int32_t CallFunc_PostEventAtLocation_ReturnValue_3;  // 0x134(0x4)
	char pad_312_1 : 7;  // 0x138(0x1)
	bool CallFunc_EqualEqual_BoolBool_ReturnValue : 1;  // 0x138(0x1)
	char pad_313[3];  // 0x139(0x3)
	struct FName K2Node_ComponentBoundEvent_EventName_7;  // 0x13C(0x8)
	float K2Node_ComponentBoundEvent_EmitterTime_7;  // 0x144(0x4)
	int32_t K2Node_ComponentBoundEvent_ParticleCount_7;  // 0x148(0x4)
	struct FName K2Node_ComponentBoundEvent_EventName_6;  // 0x14C(0x8)
	float K2Node_ComponentBoundEvent_EmitterTime_6;  // 0x154(0x4)
	int32_t K2Node_ComponentBoundEvent_ParticleCount_6;  // 0x158(0x4)
	struct FName K2Node_ComponentBoundEvent_EventName_5;  // 0x15C(0x8)
	float K2Node_ComponentBoundEvent_EmitterTime_5;  // 0x164(0x4)
	int32_t K2Node_ComponentBoundEvent_ParticleCount_5;  // 0x168(0x4)
	struct FVector CallFunc_K2_GetComponentLocation_ReturnValue_4;  // 0x16C(0xC)
	struct FVector CallFunc_K2_GetComponentLocation_ReturnValue_5;  // 0x178(0xC)
	int32_t CallFunc_PostEventAtLocation_ReturnValue_4;  // 0x184(0x4)
	int32_t CallFunc_PostEventAtLocation_ReturnValue_5;  // 0x188(0x4)
	struct FVector CallFunc_K2_GetComponentLocation_ReturnValue_6;  // 0x18C(0xC)
	struct FVector CallFunc_K2_GetComponentLocation_ReturnValue_7;  // 0x198(0xC)
	int32_t CallFunc_PostEventAtLocation_ReturnValue_6;  // 0x1A4(0x4)
	int32_t CallFunc_PostEventAtLocation_ReturnValue_7;  // 0x1A8(0x4)
	struct FVector CallFunc_K2_GetComponentLocation_ReturnValue_8;  // 0x1AC(0xC)
	struct FVector CallFunc_K2_GetComponentLocation_ReturnValue_9;  // 0x1B8(0xC)
	int32_t CallFunc_PostEventAtLocation_ReturnValue_8;  // 0x1C4(0x4)
	int32_t CallFunc_PostEventAtLocation_ReturnValue_9;  // 0x1C8(0x4)
	struct FName K2Node_ComponentBoundEvent_EventName_4;  // 0x1CC(0x8)
	float K2Node_ComponentBoundEvent_EmitterTime_4;  // 0x1D4(0x4)
	int32_t K2Node_ComponentBoundEvent_ParticleCount_4;  // 0x1D8(0x4)
	struct FVector CallFunc_K2_GetComponentLocation_ReturnValue_10;  // 0x1DC(0xC)
	struct FName K2Node_ComponentBoundEvent_EventName_3;  // 0x1E8(0x8)
	float K2Node_ComponentBoundEvent_EmitterTime_3;  // 0x1F0(0x4)
	int32_t K2Node_ComponentBoundEvent_ParticleCount_3;  // 0x1F4(0x4)
	int32_t CallFunc_PostEventAtLocation_ReturnValue_10;  // 0x1F8(0x4)
	struct FName K2Node_ComponentBoundEvent_EventName_2;  // 0x1FC(0x8)
	float K2Node_ComponentBoundEvent_EmitterTime_2;  // 0x204(0x4)
	int32_t K2Node_ComponentBoundEvent_ParticleCount_2;  // 0x208(0x4)

}; 
// Function BP_Menu_Design.BP_Menu_Design_C.BndEvt__Smoke2_K2Node_ComponentBoundEvent_1_ParticleBurstSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FBndEvt__Smoke2_K2Node_ComponentBoundEvent_1_ParticleBurstSignature__DelegateSignature
{
	struct FName EventName;  // 0x0(0x8)
	float EmitterTime;  // 0x8(0x4)
	int32_t ParticleCount;  // 0xC(0x4)

}; 
// Function BP_Menu_Design.BP_Menu_Design_C.BndEvt__Sparks3_K2Node_ComponentBoundEvent_3_ParticleBurstSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FBndEvt__Sparks3_K2Node_ComponentBoundEvent_3_ParticleBurstSignature__DelegateSignature
{
	struct FName EventName;  // 0x0(0x8)
	float EmitterTime;  // 0x8(0x4)
	int32_t ParticleCount;  // 0xC(0x4)

}; 
// Function BP_Menu_Design.BP_Menu_Design_C.BndEvt__Smoke1_K2Node_ComponentBoundEvent_0_ParticleBurstSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FBndEvt__Smoke1_K2Node_ComponentBoundEvent_0_ParticleBurstSignature__DelegateSignature
{
	struct FName EventName;  // 0x0(0x8)
	float EmitterTime;  // 0x8(0x4)
	int32_t ParticleCount;  // 0xC(0x4)

}; 
// Function BP_Menu_Design.BP_Menu_Design_C.BndEvt__Smoke4_K2Node_ComponentBoundEvent_3_ParticleBurstSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FBndEvt__Smoke4_K2Node_ComponentBoundEvent_3_ParticleBurstSignature__DelegateSignature
{
	struct FName EventName;  // 0x0(0x8)
	float EmitterTime;  // 0x8(0x4)
	int32_t ParticleCount;  // 0xC(0x4)

}; 
// Function BP_Menu_Design.BP_Menu_Design_C.BndEvt__Smoke3_K2Node_ComponentBoundEvent_2_ParticleBurstSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FBndEvt__Smoke3_K2Node_ComponentBoundEvent_2_ParticleBurstSignature__DelegateSignature
{
	struct FName EventName;  // 0x0(0x8)
	float EmitterTime;  // 0x8(0x4)
	int32_t ParticleCount;  // 0xC(0x4)

}; 
// Function BP_Menu_Design.BP_Menu_Design_C.BndEvt__Sparks2_K2Node_ComponentBoundEvent_2_ParticleBurstSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FBndEvt__Sparks2_K2Node_ComponentBoundEvent_2_ParticleBurstSignature__DelegateSignature
{
	struct FName EventName;  // 0x0(0x8)
	float EmitterTime;  // 0x8(0x4)
	int32_t ParticleCount;  // 0xC(0x4)

}; 
// Function BP_Menu_Design.BP_Menu_Design_C.BndEvt__Sparks1_K2Node_ComponentBoundEvent_1_ParticleBurstSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FBndEvt__Sparks1_K2Node_ComponentBoundEvent_1_ParticleBurstSignature__DelegateSignature
{
	struct FName EventName;  // 0x0(0x8)
	float EmitterTime;  // 0x8(0x4)
	int32_t ParticleCount;  // 0xC(0x4)

}; 
// Function BP_Menu_Design.BP_Menu_Design_C.StartPrisonerEnterSequence
// Size: 0x1(Inherited: 0x0) 
struct FStartPrisonerEnterSequence
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool backwards : 1;  // 0x0(0x1)

}; 
// Function BP_Menu_Design.BP_Menu_Design_C.ReceiveTick
// Size: 0x4(Inherited: 0x4) 
struct FReceiveTick : public FReceiveTick
{
	float DeltaSeconds;  // 0x0(0x4)

}; 
