#pragma once 
#include <BP_MugshotRoom_Structs.h>
 
 
 
// BlueprintGeneratedClass BP_MugshotRoom.BP_MugshotRoom_C
// Size: 0x280(Inherited: 0x240) 
struct ABP_MugshotRoom_C : public AMugshotRoom
{
	struct UStaticMeshComponent* Cube5;  // 0x240(0x8)
	struct UStaticMeshComponent* Cube;  // 0x248(0x8)
	struct UStaticMeshComponent* Height graph;  // 0x250(0x8)
	struct UPointLightComponent* Light;  // 0x258(0x8)
	struct UStaticMeshComponent* Cube4;  // 0x260(0x8)
	struct UStaticMeshComponent* Cube3;  // 0x268(0x8)
	struct UStaticMeshComponent* Cube2;  // 0x270(0x8)
	struct UStaticMeshComponent* Cube1;  // 0x278(0x8)

}; 



