#pragma once 
#include <BP_OperationRoom_Interior_Structs.h>
 
 
 
// BlueprintGeneratedClass BP_OperationRoom_Interior.BP_OperationRoom_Interior_C
// Size: 0x330(Inherited: 0x220) 
struct ABP_OperationRoom_Interior_C : public AActor
{
	struct UStaticMeshComponent* SM_Cable_Mess_02;  // 0x220(0x8)
	struct UStaticMeshComponent* SM_Locker05_Closed;  // 0x228(0x8)
	struct UStaticMeshComponent* SM_Cable_Mess_03;  // 0x230(0x8)
	struct USceneComponent* Surroundings;  // 0x238(0x8)
	struct UDecalComponent* MI_Blood_Stain_03;  // 0x240(0x8)
	struct UDecalComponent* MI_Blood_Stain_06;  // 0x248(0x8)
	struct UDecalComponent* MI_Blood_Stain_02;  // 0x250(0x8)
	struct UStaticMeshComponent* SM_Hospital_Curtain_02_OPR;  // 0x258(0x8)
	struct UStaticMeshComponent* SM_Tarp_Outpost_04_OPR;  // 0x260(0x8)
	struct UStaticMeshComponent* SM_Artificial_Respirator_01_OPR2;  // 0x268(0x8)
	struct UStaticMeshComponent* SM_Health_Monitoring_01_OPR;  // 0x270(0x8)
	struct UStaticMeshComponent* SM_Confolder;  // 0x278(0x8)
	struct UStaticMeshComponent* SM_Patch;  // 0x280(0x8)
	struct UStaticMeshComponent* SM_emergencyBangadeBig1;  // 0x288(0x8)
	struct UStaticMeshComponent* SM_emergencyBangadeBig;  // 0x290(0x8)
	struct UInstancedStaticMeshComponent* ISMA_emergencyBangadeFabric;  // 0x298(0x8)
	struct UStaticMeshComponent* SM_Locker06_Open1;  // 0x2A0(0x8)
	struct UStaticMeshComponent* SM_deadbody_02_a;  // 0x2A8(0x8)
	struct UStaticMeshComponent* SM_TrashCan2;  // 0x2B0(0x8)
	struct UInstancedStaticMeshComponent* InstancedStaticMesh;  // 0x2B8(0x8)
	struct UStaticMeshComponent* SM_Health_Monitoring_04_OPR2;  // 0x2C0(0x8)
	struct UStaticMeshComponent* SM_Hospital_Lamp_01;  // 0x2C8(0x8)
	struct UStaticMeshComponent* SM_Artificial_Respirator_01_OPR;  // 0x2D0(0x8)
	struct UStaticMeshComponent* SM_syringe_A2;  // 0x2D8(0x8)
	struct UStaticMeshComponent* SM_syringe_A;  // 0x2E0(0x8)
	struct UStaticMeshComponent* SM_scalpel2;  // 0x2E8(0x8)
	struct UStaticMeshComponent* SM_scalpel;  // 0x2F0(0x8)
	struct UStaticMeshComponent* SM_scissorsMetal;  // 0x2F8(0x8)
	struct UStaticMeshComponent* SM_MedCart;  // 0x300(0x8)
	struct UStaticMeshComponent* SM_MedCart_Cloth_OPR1;  // 0x308(0x8)
	struct UStaticMeshComponent* SM_Surgical_lamp_01_LightOn_OPR;  // 0x310(0x8)
	struct UStaticMeshComponent* SM_Merged_Operating_Table_01_OPR;  // 0x318(0x8)
	struct USceneComponent* OperatingTable;  // 0x320(0x8)
	struct USceneComponent* DefaultSceneRoot;  // 0x328(0x8)

}; 



