#pragma once 
#include <BP_Prisoner_Structs.h>
 
 
 
// BlueprintGeneratedClass BP_Prisoner.BP_Prisoner_C
// Size: 0x20A0(Inherited: 0x1EF0) 
struct ABP_Prisoner_C : public APrisoner
{
	struct USkeletalMeshComponent* EditorPreview;  // 0x1EF0(0x8)
	struct UPrisonerFirstPersonSubviewComponent* FPV_Mounted;  // 0x1EF8(0x8)
	struct USpringArmComponent* VehicleSpringArm;  // 0x1F00(0x8)
	struct UPrisonerThirdPersonAerialSubviewComponent* TPV_Falling;  // 0x1F08(0x8)
	struct UPrisonerThirdPersonSubviewComponent* TPV_Grappled;  // 0x1F10(0x8)
	struct UPrisonerFirstPersonVehicleAimingSubviewComponent* FPV_MountedLeaningStanceAimingDownTheSights;  // 0x1F18(0x8)
	struct UPrisonerFirstPersonVehicleAimingSubviewComponent* FPV_MountedDefaultStanceAimingDownTheSights;  // 0x1F20(0x8)
	struct UPrisonerFirstPersonVehicleAimingSubviewComponent* FPV_MountedLeaningStanceAiming;  // 0x1F28(0x8)
	struct UPrisonerFirstPersonVehicleAimingSubviewComponent* FPV_MountedDefaultStanceAiming;  // 0x1F30(0x8)
	struct USceneComponent* FPViewsMouintedAiming;  // 0x1F38(0x8)
	struct UPrisonerThirdPersonSubviewComponent* TPV_Throwing;  // 0x1F40(0x8)
	struct UPrisonerFirstPersonSubviewComponent* FPV_Lying;  // 0x1F48(0x8)
	struct UPrisonerThirdPersonSubviewComponent* TPV_Swimming;  // 0x1F50(0x8)
	struct USphereComponent* DangerDetectionSphere;  // 0x1F58(0x8)
	struct UVoiceAudioComponent* VoiceAudio;  // 0x1F60(0x8)
	struct UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleFoot_R;  // 0x1F68(0x8)
	struct UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleFoot_L;  // 0x1F70(0x8)
	struct UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleHead;  // 0x1F78(0x8)
	struct UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleLeg_R;  // 0x1F80(0x8)
	struct UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleLeg_L;  // 0x1F88(0x8)
	struct UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleHand_R;  // 0x1F90(0x8)
	struct UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleHand_L;  // 0x1F98(0x8)
	struct USphereComponent* BulletFlyBySoundCollision;  // 0x1FA0(0x8)
	struct UVisionEffectsComponent* VisionEffectsComponent;  // 0x1FA8(0x8)
	struct UPrisonerThirdPersonSubviewComponent* TPV_Defecating;  // 0x1FB0(0x8)
	struct UPrisonerFirstPersonSubviewComponent* FPV_ClimbingWindow;  // 0x1FB8(0x8)
	struct UPrisonerThirdPersonSubviewComponent* TPV_ClimbingWindow;  // 0x1FC0(0x8)
	struct UPrisonerThirdPersonSubviewComponent* TPV_Diving;  // 0x1FC8(0x8)
	struct USceneComponent* TPViews;  // 0x1FD0(0x8)
	struct UPrisonerThirdPersonSubviewComponent* TPV_NarrowLadder;  // 0x1FD8(0x8)
	struct UPrisonerThirdPersonSubviewComponent* TPV_Ragdoll;  // 0x1FE0(0x8)
	struct UWidgetComponent* NameWidget;  // 0x1FE8(0x8)
	struct UPrisonerThirdPersonSubviewComponent* TPV_StandingMelee;  // 0x1FF0(0x8)
	struct UPrisonerFirstPersonSubviewComponent* FPV_StandingMelee;  // 0x1FF8(0x8)
	struct UPrisonerFirstPersonSubviewComponent* FPV_ProneAimingDownTheSights;  // 0x2000(0x8)
	struct UPrisonerFirstPersonSubviewComponent* FPV_CrouchingAimingDownTheSights;  // 0x2008(0x8)
	struct UPrisonerFirstPersonSubviewComponent* FPV_StandingAimingDownTheSights;  // 0x2010(0x8)
	struct UPrisonerFirstPersonSubviewComponent* FPV_ProneAiming;  // 0x2018(0x8)
	struct UPrisonerFirstPersonSubviewComponent* FPV_CrouchingAiming;  // 0x2020(0x8)
	struct UPrisonerFirstPersonSubviewComponent* FPV_StandingAiming;  // 0x2028(0x8)
	struct USceneComponent* FPViewsAiming;  // 0x2030(0x8)
	struct UPrisonerThirdPersonSubviewComponent* TPV_ProneAiming;  // 0x2038(0x8)
	struct UPrisonerThirdPersonSubviewComponent* TPV_CrouchingAiming;  // 0x2040(0x8)
	struct UPrisonerThirdPersonSubviewComponent* TPV_StandingAiming;  // 0x2048(0x8)
	struct UPrisonerFirstPersonSubviewComponent* FPV_Prone;  // 0x2050(0x8)
	struct UPrisonerFirstPersonSubviewComponent* FPV_Crouching;  // 0x2058(0x8)
	struct UPrisonerFirstPersonSubviewComponent* FPV_Standing;  // 0x2060(0x8)
	struct USceneComponent* FPViews;  // 0x2068(0x8)
	struct UPrisonerThirdPersonSubviewComponent* TPV_Standing;  // 0x2070(0x8)
	struct UPrisonerThirdPersonSubviewComponent* TPV_Prone;  // 0x2078(0x8)
	struct UPrisonerThirdPersonSubviewComponent* TPV_Crouching;  // 0x2080(0x8)
	struct UPrisonerFirstPersonViewComponent* FirstPersonView;  // 0x2088(0x8)
	struct UPrisonerThirdPersonViewComponent* ThirdPersonView;  // 0x2090(0x8)
	struct UPrimitiveComponent* BodyToMove;  // 0x2098(0x8)

}; 



