#pragma once 
#include <BP_SurgeryRoom_Structs.h>
 
 
 
// BlueprintGeneratedClass BP_SurgeryRoom.BP_SurgeryRoom_C
// Size: 0x2D8(Inherited: 0x278) 
struct ABP_SurgeryRoom_C : public ASurgeryRoom
{
	struct UPointLightComponent* Spec_Lips;  // 0x278(0x8)
	struct UPointLightComponent* Spec;  // 0x280(0x8)
	struct UPointLightComponent* RimLight_2;  // 0x288(0x8)
	struct UPointLightComponent* MainLight;  // 0x290(0x8)
	struct URectLightComponent* RectLight;  // 0x298(0x8)
	struct USceneComponent* Lights_5;  // 0x2A0(0x8)
	struct USpotLightComponent* SpotLight;  // 0x2A8(0x8)
	struct USpotLightComponent* SpotLight1;  // 0x2B0(0x8)
	struct USceneComponent* Lights_Surroundings;  // 0x2B8(0x8)
	struct UChildActorComponent* Doctor;  // 0x2C0(0x8)
	struct UChildActorComponent* Interior;  // 0x2C8(0x8)
	struct UChildActorComponent* Walls;  // 0x2D0(0x8)

}; 



