#pragma once 
#include "SDK.h" 
 
 
// Function BP_WeaponScopeWidget.BP_WeaponScopeWidget_C.ExecuteUbergraph_BP_WeaponScopeWidget
// Size: 0xC0(Inherited: 0x0) 
struct FExecuteUbergraph_BP_WeaponScopeWidget
{
	int32_t EntryPoint;  // 0x0(0x4)
	struct FGeometry K2Node_Event_MyGeometry;  // 0x4(0x38)
	float K2Node_Event_InDeltaTime;  // 0x3C(0x4)
	struct FVector2D CallFunc_GetLocalSize_ReturnValue;  // 0x40(0x8)
	struct FLinearColor K2Node_MakeStruct_LinearColor;  // 0x48(0x10)
	float CallFunc_BreakVector2D_X;  // 0x58(0x4)
	float CallFunc_BreakVector2D_Y;  // 0x5C(0x4)
	float CallFunc_BreakVector2D_X_2;  // 0x60(0x4)
	float CallFunc_BreakVector2D_Y_2;  // 0x64(0x4)
	float CallFunc_Divide_FloatFloat_ReturnValue;  // 0x68(0x4)
	float CallFunc_Divide_FloatFloat_ReturnValue_2;  // 0x6C(0x4)
	struct FVector2D CallFunc_MakeVector2D_ReturnValue;  // 0x70(0x8)
	struct UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue;  // 0x78(0x8)
	char pad_128_1 : 7;  // 0x80(0x1)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x80(0x1)
	char pad_129_1 : 7;  // 0x81(0x1)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0x81(0x1)
	char pad_130[2];  // 0x82(0x2)
	int32_t CallFunc_Blueprint_GetSizeY_ReturnValue;  // 0x84(0x4)
	int32_t CallFunc_Blueprint_GetSizeX_ReturnValue;  // 0x88(0x4)
	float CallFunc_Conv_IntToFloat_ReturnValue;  // 0x8C(0x4)
	float CallFunc_Conv_IntToFloat_ReturnValue_2;  // 0x90(0x4)
	float CallFunc_Divide_FloatFloat_ReturnValue_3;  // 0x94(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue;  // 0x98(0x4)
	char pad_156[4];  // 0x9C(0x4)
	struct UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue;  // 0xA0(0x8)
	float CallFunc_Subtract_FloatFloat_ReturnValue;  // 0xA8(0x4)
	float CallFunc_Multiply_FloatFloat_ReturnValue_2;  // 0xAC(0x4)
	struct FVector2D CallFunc_MakeVector2D_ReturnValue_2;  // 0xB0(0x8)
	struct UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_2;  // 0xB8(0x8)

}; 
// Function BP_WeaponScopeWidget.BP_WeaponScopeWidget_C.Tick
// Size: 0x3C(Inherited: 0x3C) 
struct FTick : public FTick
{
	struct FGeometry MyGeometry;  // 0x0(0x38)
	float InDeltaTime;  // 0x38(0x4)

}; 
