#pragma once 
#include "SDK.h" 
 
 
// Function ConZ.ItemObstructionStatics.ChooseItemObstructionSide
// Size: 0x10(Inherited: 0x0) 
struct FChooseItemObstructionSide
{
	struct ACharacter* Character;  // 0x0(0x8)
	float existingSide;  // 0x8(0x4)
	float ReturnValue;  // 0xC(0x4)

}; 
// Function ConZ.PrisonerInventoryComponent.AddStack
// Size: 0x10(Inherited: 0x0) 
struct FAddStack
{
	struct TScriptInterface<IInventoryNode> Item;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.GearboxHandlingParameters
// Size: 0xC(Inherited: 0x0) 
struct FGearboxHandlingParameters
{
	float GearChangeDelayMultiplier;  // 0x0(0x4)
	float GearUpRatioMultiplier;  // 0x4(0x4)
	float GearDownRatioMultiplier;  // 0x8(0x4)

}; 
// Function ConZ.ItemWidget2.OnDropOperation
// Size: 0x8(Inherited: 0x0) 
struct FOnDropOperation
{
	struct UDragDropOperation* Operation;  // 0x0(0x8)

}; 
// Function ConZ.Zombie2.Server_PlayMontage
// Size: 0x8(Inherited: 0x0) 
struct FServer_PlayMontage
{
	struct UAnimMontage* Montage;  // 0x0(0x8)

}; 
// Function ConZ.Weapon.GetRangedWeaponsSkill
// Size: 0x8(Inherited: 0x0) 
struct FGetRangedWeaponsSkill
{
	struct URangedWeaponsSkill* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.GetTargetCrouchStage
// Size: 0x4(Inherited: 0x0) 
struct FGetTargetCrouchStage
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.SpawnMenuWidget.Prisoner_GetComaDuration
// Size: 0x10(Inherited: 0x0) 
struct FPrisoner_GetComaDuration
{
	struct APrisoner* Prisoner;  // 0x0(0x8)
	float ReturnValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function ConZ.PlayerRpcChannel.Client_UpdateTraderData
// Size: 0x90(Inherited: 0x0) 
struct FClient_UpdateTraderData
{
	struct FPriceUpdateData PriceUpdateData;  // 0x0(0x90)

}; 
// Function ConZ.Prisoner.GetFishingComponent
// Size: 0x8(Inherited: 0x0) 
struct FGetFishingComponent
{
	struct UPrisonerFishingComponent* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.BankAccountRegistryRequestData
// Size: 0x1C(Inherited: 0x0) 
struct FBankAccountRegistryRequestData
{
	char pad_0[28];  // 0x0(0x1C)

}; 
// Function ConZ.Wettable.GetWaterWeight
// Size: 0x4(Inherited: 0x0) 
struct FGetWaterWeight
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.TakeItemInHandsOnServer
// Size: 0x8(Inherited: 0x0) 
struct FTakeItemInHandsOnServer
{
	struct AItem* Item;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.CharacterLegsImpactSoundData
// Size: 0x28(Inherited: 0x0) 
struct FCharacterLegsImpactSoundData
{
	struct TArray<uint8_t > ImpactSourceCategories;  // 0x0(0x10)
	struct TArray<uint8_t > ImpactTargetCategories;  // 0x10(0x10)
	struct FCharacterImpactSounds Sounds;  // 0x20(0x8)

}; 
// Function ConZ.Item.AttachToCharacterHands
// Size: 0x10(Inherited: 0x0) 
struct FAttachToCharacterHands
{
	struct AConZCharacter* Character;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.ConZBase.AwardFamePointsToOnlineFlagOwners
// Size: 0xC(Inherited: 0x0) 
struct FAwardFamePointsToOnlineFlagOwners
{
	int32_t flagIndex;  // 0x0(0x4)
	float totalFlagInterval;  // 0x4(0x4)
	float fameInterval;  // 0x8(0x4)

}; 
// ScriptStruct ConZ.ContainerItemDescriptorData
// Size: 0x60(Inherited: 0x0) 
struct FContainerItemDescriptorData
{
	char pad_0[56];  // 0x0(0x38)
	struct UTexture2D* Icon;  // 0x38(0x8)
	char pad_64[32];  // 0x40(0x20)

}; 
// Function ConZ.Item.CanAutoAddItem
// Size: 0x10(Inherited: 0x0) 
struct FCanAutoAddItem
{
	struct AItem* Item;  // 0x0(0x8)
	char column;  // 0x8(0x1)
	char row;  // 0x9(0x1)
	char pad_10_1 : 7;  // 0xA(0x1)
	bool ReturnValue : 1;  // 0xA(0x1)
	char pad_11[5];  // 0xB(0x5)

}; 
// ScriptStruct ConZ.VehicleAttachmentSlot
// Size: 0x48(Inherited: 0x0) 
struct FVehicleAttachmentSlot
{
	struct TArray<struct FPrimaryAssetId> PossibleAttachmentAssetIds;  // 0x0(0x10)
	struct FGameplayTagContainer StateTags;  // 0x10(0x20)
	char pad_48[8];  // 0x30(0x8)
	struct UMaterialInstanceDynamic* ServiceModeMaterial;  // 0x38(0x8)
	struct UMeshComponent* _previewMesh;  // 0x40(0x8)

}; 
// Function ConZ.Item.GetWeightPerUse
// Size: 0x4(Inherited: 0x0) 
struct FGetWeightPerUse
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Item.GetNoiseLoudnessWhenPickedUp
// Size: 0x4(Inherited: 0x0) 
struct FGetNoiseLoudnessWhenPickedUp
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.PlayerRpcChannel.Server_UnlockedAchievement
// Size: 0x18(Inherited: 0x0) 
struct FServer_UnlockedAchievement
{
	struct APlayerController* PlayerController;  // 0x0(0x8)
	struct FString AchievementID;  // 0x8(0x10)

}; 
// Function ConZ.Item.AutoAddItemToInventoryNode
// Size: 0x18(Inherited: 0x0) 
struct FAutoAddItemToInventoryNode
{
	struct TScriptInterface<IInventoryNode> Item;  // 0x0(0x10)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// Function ConZ.InventoryContainer2D.OnActorItemDestroyed
// Size: 0x8(Inherited: 0x0) 
struct FOnActorItemDestroyed
{
	struct AActor* Actor;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.PlayerLoginInfo
// Size: 0x40(Inherited: 0x0) 
struct FPlayerLoginInfo
{
	struct FString UserId;  // 0x0(0x10)
	struct FDbIntegerId UserProfileId;  // 0x10(0x8)
	struct FString UserProfileName;  // 0x18(0x10)
	char pad_40_1 : 7;  // 0x28(0x1)
	bool IsUserAdmin : 1;  // 0x28(0x1)
	char pad_41_1 : 7;  // 0x29(0x1)
	bool IsUserServerSettingsAdmin : 1;  // 0x29(0x1)
	char pad_42_1 : 7;  // 0x2A(0x1)
	bool PlayAsDrone : 1;  // 0x2A(0x1)
	struct FDeluxeVersion DeluxeVersion;  // 0x2B(0x5)
	int32_t ServerResponsePort;  // 0x30(0x4)
	char pad_52[4];  // 0x34(0x4)
	struct FDbIntegerId ServerUserProfileId;  // 0x38(0x8)

}; 
// Function ConZ.PrisonerBodyCondition_KillBoxGasPoisoning.Client_TriggerDamagedEffect
// Size: 0x8(Inherited: 0x0) 
struct FClient_TriggerDamagedEffect
{
	float Duration;  // 0x0(0x4)
	float Intensity;  // 0x4(0x4)

}; 
// ScriptStruct ConZ.EventsRankingStats
// Size: 0x30(Inherited: 0x0) 
struct FEventsRankingStats
{
	char pad_0[8];  // 0x0(0x8)
	float FamePoints;  // 0x8(0x4)
	int32_t FameLevel;  // 0xC(0x4)
	float EventScore;  // 0x10(0x4)
	int32_t EventKills;  // 0x14(0x4)
	int32_t EventTeamKills;  // 0x18(0x4)
	int32_t EventDeaths;  // 0x1C(0x4)
	int32_t EventSuicides;  // 0x20(0x4)
	int32_t EventAssists;  // 0x24(0x4)
	int32_t EventHeadshots;  // 0x28(0x4)
	char pad_44_1 : 7;  // 0x2C(0x1)
	bool IsBanned : 1;  // 0x2C(0x1)
	char pad_45[3];  // 0x2D(0x3)

}; 
// Function ConZ.AIDetectionTimerHandler.OnDestroyedEvent
// Size: 0x8(Inherited: 0x0) 
struct FOnDestroyedEvent
{
	struct AActor* DestroyedActor;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.VisibilityReplication
// Size: 0x8(Inherited: 0x0) 
struct FVisibilityReplication
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	int32_t RepHelper;  // 0x4(0x4)

}; 
// ScriptStruct ConZ.InventoryItemComponentReplicatedPageData
// Size: 0x18(Inherited: 0x0) 
struct FInventoryItemComponentReplicatedPageData
{
	struct TArray<struct FInventoryItemComponentElement> Elements;  // 0x0(0x10)
	int32_t Version;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function ConZ.Prisoner.IsAliveInGameEvent
// Size: 0x1(Inherited: 0x0) 
struct FIsAliveInGameEvent
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.MultiplierByClass
// Size: 0x10(Inherited: 0x0) 
struct FMultiplierByClass
{
	UObject* ObjectClass;  // 0x0(0x8)
	float Multiplier;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function ConZ.AttributeMapInterface.GetBoolAttribute
// Size: 0x18(Inherited: 0x0) 
struct FGetBoolAttribute
{
	struct FString Name;  // 0x0(0x10)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// Function ConZ.ComplexAnimal2.TurnAwayFromActor
// Size: 0x10(Inherited: 0x0) 
struct FTurnAwayFromActor
{
	struct AActor* foe;  // 0x0(0x8)
	float ReturnValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function ConZ.Item.DropAt
// Size: 0x1C(Inherited: 0x0) 
struct FDropAt
{
	struct FVector dropLocation;  // 0x0(0xC)
	struct FRotator dropRotation;  // 0xC(0xC)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool ReturnValue : 1;  // 0x18(0x1)
	char pad_25[3];  // 0x19(0x3)

}; 
// Function ConZ.Item.Blink
// Size: 0x4(Inherited: 0x0) 
struct FBlink
{
	float Duration;  // 0x0(0x4)

}; 
// Function ConZ.AudioStatics.GetMotionIntensitySwitchName
// Size: 0x8(Inherited: 0x0) 
struct FGetMotionIntensitySwitchName
{
	struct FName ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Item.CanBeCraftedByCharactrer
// Size: 0x10(Inherited: 0x0) 
struct FCanBeCraftedByCharactrer
{
	struct ACharacter* Character;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.Item.GetWidgetDisplayInfo
// Size: 0xC(Inherited: 0x0) 
struct FGetWidgetDisplayInfo
{
	struct FWidgetDisplayInfo ReturnValue;  // 0x0(0xC)

}; 
// Function ConZ.Objective.GetDescription
// Size: 0x18(Inherited: 0x0) 
struct FGetDescription
{
	struct FText ReturnValue;  // 0x0(0x18)

}; 
// ScriptStruct ConZ.MeleeAttackCapsuleHitInfo
// Size: 0x130(Inherited: 0x0) 
struct FMeleeAttackCapsuleHitInfo
{
	struct FMeleeAttackCapsule MeleeAttackCapsule;  // 0x0(0x80)
	struct FHitResult HitResult;  // 0x80(0x88)
	uint8_t  HitSeverity;  // 0x108(0x1)
	uint8_t  AttackType;  // 0x109(0x1)
	char pad_266[2];  // 0x10A(0x2)
	struct FVector_NetQuantize100 AttackerLocation;  // 0x10C(0xC)
	struct FVector_NetQuantize100 VictimLocation;  // 0x118(0xC)
	char pad_292[12];  // 0x124(0xC)

}; 
// Function ConZ.FishingAttachment.Equip
// Size: 0x8(Inherited: 0x0) 
struct FEquip
{
	struct AFishingRod* FishingRod;  // 0x0(0x8)

}; 
// Function ConZ.PrisonerInventoryComponent.CanAddItem
// Size: 0x10(Inherited: 0x0) 
struct FCanAddItem
{
	struct AItem* Item;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool tryToJoinItems : 1;  // 0x8(0x1)
	char pad_9_1 : 7;  // 0x9(0x1)
	bool ReturnValue : 1;  // 0x9(0x1)
	char pad_10[6];  // 0xA(0x6)

}; 
// Function ConZ.FishingRod.Server_AddAttachment
// Size: 0x8(Inherited: 0x0) 
struct FServer_AddAttachment
{
	struct AFishingAttachment* Attachment;  // 0x0(0x8)

}; 
// Function ConZ.Item.NetMulticast_SetActorDropLocationAndRotation
// Size: 0x18(Inherited: 0x0) 
struct FNetMulticast_SetActorDropLocationAndRotation
{
	struct FVector Location;  // 0x0(0xC)
	struct FRotator Rotation;  // 0xC(0xC)

}; 
// Function ConZ.Prisoner.AddToSquadOnServer
// Size: 0x8(Inherited: 0x0) 
struct FAddToSquadOnServer
{
	struct FDbIntegerId squadId;  // 0x0(0x8)

}; 
// Function ConZ.Lockpickable.CanInitiateLockpickingFor
// Size: 0x10(Inherited: 0x0) 
struct FCanInitiateLockpickingFor
{
	struct APrisoner* Prisoner;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.Item.CanBeDroppedBy
// Size: 0x10(Inherited: 0x0) 
struct FCanBeDroppedBy
{
	struct AConZCharacter* Character;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.Item.CanBeMeleeWeapon
// Size: 0x1(Inherited: 0x0) 
struct FCanBeMeleeWeapon
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Zombie2.Server_PlayTurnMontage
// Size: 0x8(Inherited: 0x0) 
struct FServer_PlayTurnMontage
{
	uint8_t  turnMontage;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float turnAngle;  // 0x4(0x4)

}; 
// Function ConZ.Prisoner.NetMulticast_SpawnUrinationEffects
// Size: 0x1(Inherited: 0x0) 
struct FNetMulticast_SpawnUrinationEffects
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool isForced : 1;  // 0x0(0x1)

}; 
// Function ConZ.Item.GetObstructionTestCapsules
// Size: 0x10(Inherited: 0x0) 
struct FGetObstructionTestCapsules
{
	struct TArray<struct FItemObstructionTestCapsule> capsules;  // 0x0(0x10)

}; 
// Function ConZ.ConZGameMode.GetLadderMarkersReplicator
// Size: 0x8(Inherited: 0x0) 
struct FGetLadderMarkersReplicator
{
	struct ALadderMarkersReplicator* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.PrisonerInventoryComponent.CanStack
// Size: 0x1(Inherited: 0x0) 
struct FCanStack
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.SwitchToVehicleSeatIndex
// Size: 0x4(Inherited: 0x0) 
struct FSwitchToVehicleSeatIndex
{
	int32_t Index;  // 0x0(0x4)

}; 
// Function ConZ.PrisonerInventoryComponent.CanStackWith
// Size: 0x10(Inherited: 0x0) 
struct FCanStackWith
{
	struct UObject* Item;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// ScriptStruct ConZ.GameResourceMixingRule
// Size: 0x18(Inherited: 0x0) 
struct FGameResourceMixingRule
{
	UGameResourceType* Source;  // 0x0(0x8)
	UGameResourceType* Destination;  // 0x8(0x8)
	UGameResourceType* Result;  // 0x10(0x8)

}; 
// Function ConZ.Item.GetOutsideInventoryIcon
// Size: 0x8(Inherited: 0x0) 
struct FGetOutsideInventoryIcon
{
	struct UTexture2D* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.WeaponAttachmentMagazine.Server_InsertCartridgeIntoMagazine
// Size: 0x8(Inherited: 0x0) 
struct FServer_InsertCartridgeIntoMagazine
{
	struct AAmmunitionItem* ammo;  // 0x0(0x8)

}; 
// DelegateFunction ConZ.Item.DebugTextChangedDelegate__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FDebugTextChangedDelegate__DelegateSignature
{
	struct AItem* Item;  // 0x0(0x8)

}; 
// Function ConZ.HuntingManager.NetMulticast_PlayClueSound
// Size: 0x40(Inherited: 0x0) 
struct FNetMulticast_PlayClueSound
{
	struct TSoftObjectPtr<UAkAudioEvent> clueAudioEvent;  // 0x0(0x28)
	struct FVector clueLocation;  // 0x28(0xC)
	float clueHearingDistance;  // 0x34(0x4)
	float clueMinApparentDistance;  // 0x38(0x4)
	char pad_60[4];  // 0x3C(0x4)

}; 
// ScriptStruct ConZ.ConZSquadEmblemElement
// Size: 0x4(Inherited: 0x0) 
struct FConZSquadEmblemElement
{
	char ShapeIndex;  // 0x0(0x1)
	char PrimaryColorIndex;  // 0x1(0x1)
	char SecondaryColorIndex;  // 0x2(0x1)
	char TertiaryColorIndex;  // 0x3(0x1)

}; 
// Function ConZ.Item.Repair
// Size: 0x4(Inherited: 0x0) 
struct FRepair
{
	float healthToRepair;  // 0x0(0x4)

}; 
// Function ConZ.ConZPlayerController.Client_SetGameEventCooldown
// Size: 0x4(Inherited: 0x0) 
struct FClient_SetGameEventCooldown
{
	float cooldown;  // 0x0(0x4)

}; 
// Function ConZ.WeaponAction.AddAttachmentToWeapon
// Size: 0x10(Inherited: 0x0) 
struct FAddAttachmentToWeapon
{
	struct AWeapon* Weapon;  // 0x0(0x8)
	struct AWeaponAttachment* Attachment;  // 0x8(0x8)

}; 
// Function ConZ.HoverPanelWidget.SetScreenPosition
// Size: 0x8(Inherited: 0x0) 
struct FSetScreenPosition
{
	struct FVector2D position;  // 0x0(0x8)

}; 
// Function ConZ.Item.Drop
// Size: 0x2(Inherited: 0x0) 
struct FDrop
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool wasThrown : 1;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool dropDown : 1;  // 0x1(0x1)

}; 
// ScriptStruct ConZ.GameEventRewardPoints
// Size: 0xC(Inherited: 0x0) 
struct FGameEventRewardPoints
{
	int32_t Cash;  // 0x0(0x4)
	int32_t Score;  // 0x4(0x4)
	float FamePoints;  // 0x8(0x4)

}; 
// Function ConZ.Item.DropAround
// Size: 0x10(Inherited: 0x0) 
struct FDropAround
{
	struct AActor* Actor;  // 0x0(0x8)
	float Radius;  // 0x8(0x4)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool ReturnValue : 1;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)

}; 
// Function ConZ.WeaponAttachmentMagazine.GetAmmo
// Size: 0x10(Inherited: 0x0) 
struct FGetAmmo
{
	struct TArray<struct FAmmunitionData> ammo;  // 0x0(0x10)

}; 
// Function ConZ.Prisoner.Server_RemoveInventoryNode
// Size: 0x38(Inherited: 0x0) 
struct FServer_RemoveInventoryNode
{
	struct UObject* Item;  // 0x0(0x8)
	struct UObject* container;  // 0x8(0x8)
	struct FInventoryPositionDataRepHelper position;  // 0x10(0x20)
	struct UObject* Target;  // 0x30(0x8)

}; 
// ScriptStruct ConZ.PlayerUnsubscribeData
// Size: 0x78(Inherited: 0x0) 
struct FPlayerUnsubscribeData
{
	char pad_0[120];  // 0x0(0x78)

}; 
// Function ConZ.Item.FindAnimationMontage
// Size: 0x18(Inherited: 0x0) 
struct FFindAnimationMontage
{
	struct UObject* Context;  // 0x0(0x8)
	uint8_t  prisonerMontageType;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)
	struct UAnimMontage* ReturnValue;  // 0x10(0x8)

}; 
// DelegateFunction ConZ.CCSliderDeselected__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FCCSliderDeselected__DelegateSignature
{
	struct UCCSkillSliderWidget* Slider;  // 0x0(0x8)

}; 
// Function ConZ.Item.GetSizeY
// Size: 0x4(Inherited: 0x0) 
struct FGetSizeY
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.ConZPlayerController.GetRespawnOptionTime
// Size: 0x8(Inherited: 0x0) 
struct FGetRespawnOptionTime
{
	uint8_t  option;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float ReturnValue;  // 0x4(0x4)

}; 
// ScriptStruct ConZ.ConZGerstnerWavesParameters
// Size: 0x10(Inherited: 0x0) 
struct FConZGerstnerWavesParameters
{
	float angle;  // 0x0(0x4)
	float Height;  // 0x4(0x4)
	float Length;  // 0x8(0x4)
	float Steepness;  // 0xC(0x4)

}; 
// Function ConZ.Weapon.GetMuzzleLocation
// Size: 0xC(Inherited: 0x0) 
struct FGetMuzzleLocation
{
	struct FVector ReturnValue;  // 0x0(0xC)

}; 
// Function ConZ.Prisoner.IsInFishingMinigame
// Size: 0x1(Inherited: 0x0) 
struct FIsInFishingMinigame
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.IsInDanger
// Size: 0x1(Inherited: 0x0) 
struct FIsInDanger
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.PrisonerInventoryComponent.DropItemOnClient
// Size: 0x8(Inherited: 0x0) 
struct FDropItemOnClient
{
	struct AItem* Item;  // 0x0(0x8)

}; 
// Function ConZ.Weapon.IsMalfunctionSupported
// Size: 0x2(Inherited: 0x0) 
struct FIsMalfunctionSupported
{
	uint8_t  malfunction;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool ReturnValue : 1;  // 0x1(0x1)

}; 
// Function ConZ.PlayerRpcChannel.Admin_Server_TeleportTo
// Size: 0x18(Inherited: 0x0) 
struct FAdmin_Server_TeleportTo
{
	struct APlayerController* Controller;  // 0x0(0x8)
	struct FString teleportToUserId;  // 0x8(0x10)

}; 
// Function ConZ.GameEventBase.GetRoundTimeLeft
// Size: 0x4(Inherited: 0x0) 
struct FGetRoundTimeLeft
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.KillboxComponent.AddTimerWidget
// Size: 0x8(Inherited: 0x0) 
struct FAddTimerWidget
{
	struct UKillBoxTimerWidget* timerWidget;  // 0x0(0x8)

}; 
// Function ConZ.TextInputWidget.OnTextBoxTextChanged
// Size: 0x18(Inherited: 0x0) 
struct FOnTextBoxTextChanged
{
	struct FText Text;  // 0x0(0x18)

}; 
// ScriptStruct ConZ.WeaponMalfunctionData
// Size: 0xA8(Inherited: 0x0) 
struct FWeaponMalfunctionData
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool UseCustomProbabilityCurve : 1;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct FRuntimeFloatCurve ProbabilityCurve;  // 0x8(0x88)
	UWeaponActionClearMalfunctionSequence* ClearMalfunctionSequence;  // 0x90(0x8)
	struct TArray<UWeaponActionClearMalfunctionSequence*> ClearMalfunctionSequences;  // 0x98(0x10)

}; 
// ScriptStruct ConZ.PrisonerActionDifficultyCurve
// Size: 0x18(Inherited: 0x0) 
struct FPrisonerActionDifficultyCurve
{
	float _resting;  // 0x0(0x4)
	float _idle;  // 0x4(0x4)
	float _easy;  // 0x8(0x4)
	float _demanding;  // 0xC(0x4)
	float _veryDemanding;  // 0x10(0x4)
	float _extremelyDemanding;  // 0x14(0x4)

}; 
// Function ConZ.Item.GetPrisonerAnimationSet
// Size: 0x1(Inherited: 0x0) 
struct FGetPrisonerAnimationSet
{
	uint8_t  ReturnValue;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.MeleeHitDetectionMarker
// Size: 0x80(Inherited: 0x0) 
struct FMeleeHitDetectionMarker
{
	float Time;  // 0x0(0x4)
	char pad_4[12];  // 0x4(0xC)
	struct FTransform Transform;  // 0x10(0x30)
	struct FTransform RootMotion;  // 0x40(0x30)
	float DamageMultiplier;  // 0x70(0x4)
	float SelectionWeight;  // 0x74(0x4)
	char pad_120[8];  // 0x78(0x8)

}; 
// ScriptStruct ConZ.CombinationLockUnlockAttemptRequestData
// Size: 0x3C(Inherited: 0x0) 
struct FCombinationLockUnlockAttemptRequestData
{
	char pad_0[60];  // 0x0(0x3C)

}; 
// Function ConZ.TeamDeathmatchGameEvent.SetTeamDeathmatchParameters
// Size: 0x14(Inherited: 0x0) 
struct FSetTeamDeathmatchParameters
{
	struct FTeamDeathmatchParameters Params;  // 0x0(0x14)

}; 
// Function ConZ.Item.FindCharacterAndItemAnimation
// Size: 0x20(Inherited: 0x0) 
struct FFindCharacterAndItemAnimation
{
	struct UObject* Context;  // 0x0(0x8)
	uint8_t  prisonerMontageType;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)
	struct FCharacterAndItemAnimation ReturnValue;  // 0x10(0x10)

}; 
// ScriptStruct ConZ.ActiveHit
// Size: 0xC(Inherited: 0x0) 
struct FActiveHit
{
	char pad_0[12];  // 0x0(0xC)

}; 
// Function ConZ.Prisoner.GetPrisonWalletComponent
// Size: 0x8(Inherited: 0x0) 
struct FGetPrisonWalletComponent
{
	struct UPrisonerPrisonWalletComponent* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.CharacterAndItemAnimation
// Size: 0x10(Inherited: 0x0) 
struct FCharacterAndItemAnimation
{
	struct UAnimMontage* CharacterMontage;  // 0x0(0x8)
	struct UAnimMontage* ItemMontage;  // 0x8(0x8)

}; 
// Function ConZ.InspectedItemWidget.SetIsToolForSomething
// Size: 0x1(Inherited: 0x0) 
struct FSetIsToolForSomething
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool IsTool : 1;  // 0x0(0x1)

}; 
// Function ConZ.PlayerDrone.Server_TeleportToNextOrPreviousPlayer
// Size: 0x1(Inherited: 0x0) 
struct FServer_TeleportToNextOrPreviousPlayer
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Next : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.Client_Interact
// Size: 0x78(Inherited: 0x0) 
struct FClient_Interact
{
	struct UObject* interactable;  // 0x0(0x8)
	uint8_t  interactionType;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)
	struct FInteractionData InteractionData;  // 0x10(0x68)

}; 
// Function ConZ.Weapon.GetOverrideUseWeaponAnimationPose
// Size: 0x1(Inherited: 0x0) 
struct FGetOverrideUseWeaponAnimationPose
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.InventoryStackData
// Size: 0x80(Inherited: 0x0) 
struct FInventoryStackData
{
	UObject* _stackClass;  // 0x0(0x8)
	float _approximateCount;  // 0x8(0x4)
	float _approximateMaxCount;  // 0xC(0x4)
	float _weight;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)
	struct TArray<char> _data;  // 0x18(0x10)
	char pad_40[88];  // 0x28(0x58)

}; 
// Function ConZ.Item.GetAllContainedItems
// Size: 0x18(Inherited: 0x0) 
struct FGetAllContainedItems
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool recursive : 1;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct TArray<struct AItem*> ReturnValue;  // 0x8(0x10)

}; 
// Function ConZ.CharacterSpawnerSpawnee.SetupCharacter
// Size: 0x10(Inherited: 0x0) 
struct FSetupCharacter
{
	struct FCharacterSpawneeInfo spawneeInfo;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.ScopeZoomLevelSettings
// Size: 0x570(Inherited: 0x0) 
struct FScopeZoomLevelSettings
{
	float Magnification;  // 0x0(0x4)
	float DisplayedMagnification;  // 0x4(0x4)
	char pad_8[8];  // 0x8(0x8)
	struct FPostProcessSettings PostProcessSettings;  // 0x10(0x560)

}; 
// Function ConZ.Item.GetInventoryGridSizeY
// Size: 0x4(Inherited: 0x0) 
struct FGetInventoryGridSizeY
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Zombie2.GetAimOffset
// Size: 0xC(Inherited: 0x0) 
struct FGetAimOffset
{
	struct FRotator ReturnValue;  // 0x0(0xC)

}; 
// Function ConZ.CraftingRecipeWidget.GetCaption
// Size: 0x18(Inherited: 0x0) 
struct FGetCaption
{
	struct FText ReturnValue;  // 0x0(0x18)

}; 
// Function ConZ.ConZPlayerController.Client_UpdateRespawnSettings
// Size: 0x6C(Inherited: 0x0) 
struct FClient_UpdateRespawnSettings
{
	struct FRespawnParameters parameters;  // 0x0(0x6C)

}; 
// Function ConZ.ItemTooltipPanelElement.OnNumberDataChanged
// Size: 0x4(Inherited: 0x0) 
struct FOnNumberDataChanged
{
	float Value;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.CharacterLegsImpactSoundsData
// Size: 0x18(Inherited: 0x0) 
struct FCharacterLegsImpactSoundsData
{
	struct TArray<struct FCharacterLegsImpactSoundData> SoundsData;  // 0x0(0x10)
	struct FCharacterImpactSounds FallbackSounds;  // 0x10(0x8)

}; 
// Function ConZ.BaseItemContainerWidget.GetSlotsForPanel
// Size: 0x38(Inherited: 0x0) 
struct FGetSlotsForPanel
{
	struct UGridSlot* GridSlot;  // 0x0(0x8)
	int32_t Width;  // 0x8(0x4)
	int32_t Height;  // 0xC(0x4)
	struct TArray<struct UInventorySlotUserWidget*> Slots;  // 0x10(0x10)
	struct UGridPanel* panel;  // 0x20(0x8)
	int32_t numColumns;  // 0x28(0x4)
	int32_t numRows;  // 0x2C(0x4)
	char pad_48_1 : 7;  // 0x30(0x1)
	bool ReturnValue : 1;  // 0x30(0x1)
	char pad_49[7];  // 0x31(0x7)

}; 
// Function ConZ.Item.GetMeshComponentForAttachmentToItem
// Size: 0x10(Inherited: 0x0) 
struct FGetMeshComponentForAttachmentToItem
{
	struct AItem* Item;  // 0x0(0x8)
	struct UMeshComponent* ReturnValue;  // 0x8(0x8)

}; 
// Function ConZ.ConZGameInstance.GetLastNetworkError
// Size: 0x18(Inherited: 0x0) 
struct FGetLastNetworkError
{
	struct FText ReturnValue;  // 0x0(0x18)

}; 
// Function ConZ.TextInputWidget.OnTextBoxTextCommitted
// Size: 0x20(Inherited: 0x0) 
struct FOnTextBoxTextCommitted
{
	struct FText Text;  // 0x0(0x18)
	char ETextCommit CommitMethod;  // 0x18(0x1)
	char pad_25[7];  // 0x19(0x7)

}; 
// Function ConZ.Prisoner.SetFreeLookEnabled
// Size: 0x1(Inherited: 0x0) 
struct FSetFreeLookEnabled
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// Function ConZ.Item.GetContainerDamagePercentage
// Size: 0x4(Inherited: 0x0) 
struct FGetContainerDamagePercentage
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.GetCurrentHitReactType
// Size: 0x8(Inherited: 0x0) 
struct FGetCurrentHitReactType
{
	struct FGameplayTag ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Zombie2.OnRep_Stance
// Size: 0x1(Inherited: 0x0) 
struct FOnRep_Stance
{
	uint8_t  oldValue;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.IsActorMeleeTargetCandidate
// Size: 0x10(Inherited: 0x0) 
struct FIsActorMeleeTargetCandidate
{
	struct AActor* Actor;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.Item.GetDefaultMaxHealth
// Size: 0x4(Inherited: 0x0) 
struct FGetDefaultMaxHealth
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.ConZPlayerController.Server_RequestSquadRankingData
// Size: 0x18(Inherited: 0x0) 
struct FServer_RequestSquadRankingData
{
	uint32_t ID;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct FDbIntegerId squadId;  // 0x8(0x8)
	int32_t Count;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// ScriptStruct ConZ.PossibleChoppingTools
// Size: 0x10(Inherited: 0x0) 
struct FPossibleChoppingTools
{
	struct TArray<struct FChoppingTool2> PossibleTools;  // 0x0(0x10)

}; 
// Function ConZ.Zombie2.GetHealth
// Size: 0x4(Inherited: 0x0) 
struct FGetHealth
{
	float ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.FoliageAIPerceptionData
// Size: 0x2(Inherited: 0x0) 
struct FFoliageAIPerceptionData
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool CanCoverPrisoner : 1;  // 0x0(0x1)
	uint8_t  MaxUndetectedPrisonerStance;  // 0x1(0x1)

}; 
// Function ConZ.Prisoner.Client_LoadAmmoIntoMagazine
// Size: 0x18(Inherited: 0x0) 
struct FClient_LoadAmmoIntoMagazine
{
	struct AWeaponAttachmentMagazine* magazine;  // 0x0(0x8)
	struct TArray<struct FAmmunitionData> ammoData;  // 0x8(0x10)

}; 
// Function ConZ.ConZGameInstance.OnPreLoadMap
// Size: 0x10(Inherited: 0x0) 
struct FOnPreLoadMap
{
	struct FString mapName;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.PrisonerAppearance_Tattoo
// Size: 0x58(Inherited: 0x0) 
struct FPrisonerAppearance_Tattoo
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool RequiresGameUpgrade : 1;  // 0x0(0x1)
	uint8_t  GameUpgradeRequired;  // 0x1(0x1)
	char pad_2[6];  // 0x2(0x6)
	struct TMap<struct FName, struct TSoftObjectPtr<UTexture2D>> TattooTextures;  // 0x8(0x50)

}; 
// ScriptStruct ConZ.ProximityReplenishedResourceDescription
// Size: 0x10(Inherited: 0x0) 
struct FProximityReplenishedResourceDescription
{
	float ReplenishChance;  // 0x0(0x4)
	struct FFloatInterval ReplenishAmount;  // 0x4(0x8)
	float ReplenishTimeout;  // 0xC(0x4)

}; 
// Function ConZ.Item.SetHealthAndUsage
// Size: 0x8(Inherited: 0x0) 
struct FSetHealthAndUsage
{
	float health;  // 0x0(0x4)
	int32_t Usage;  // 0x4(0x4)

}; 
// Function ConZ.Item.GetMeshComponent
// Size: 0x8(Inherited: 0x0) 
struct FGetMeshComponent
{
	struct UMeshComponent* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.ChargeAttackData
// Size: 0x20(Inherited: 0x0) 
struct FChargeAttackData
{
	struct UAnimMontage* Montage;  // 0x0(0x8)
	float RegainControlDurationModifier;  // 0x8(0x4)
	float Range;  // 0xC(0x4)
	float Speed;  // 0x10(0x4)
	float Height;  // 0x14(0x4)
	float lengthOverride;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)

}; 
// Function ConZ.Item.GetIgnoreSupportingHandIK
// Size: 0x1(Inherited: 0x0) 
struct FGetIgnoreSupportingHandIK
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.MissionData
// Size: 0xB8(Inherited: 0x0) 
struct FMissionData
{
	struct FText MissionName;  // 0x0(0x18)
	struct FText MissionCategory;  // 0x18(0x18)
	struct FText MissionDescription;  // 0x30(0x18)
	uint8_t  MissionType;  // 0x48(0x1)
	char pad_73[3];  // 0x49(0x3)
	int32_t MissionOrdinalNumber;  // 0x4C(0x4)
	uint8_t  MissionState;  // 0x50(0x1)
	uint8_t  MissionFaction;  // 0x51(0x1)
	char pad_82[6];  // 0x52(0x6)
	struct TArray<struct TSoftObjectPtr<ALocationTrigger>> MissionStartingLocations;  // 0x58(0x10)
	int32_t IntendedNumberOfPlayers;  // 0x68(0x4)
	float MissionCooldown;  // 0x6C(0x4)
	char pad_112[8];  // 0x70(0x8)
	struct FString MissionAssetId;  // 0x78(0x10)
	struct TArray<struct FObjectiveData> ObjectivesData;  // 0x88(0x10)
	struct FMissionReward MissionReward;  // 0x98(0x18)
	struct UTexture2D* MissionBannerImage;  // 0xB0(0x8)

}; 
// Function ConZ.Prisoner.Server_SyncWeaponState
// Size: 0x50(Inherited: 0x0) 
struct FServer_SyncWeaponState
{
	struct AWeapon* Weapon;  // 0x0(0x8)
	struct FWeaponStateSyncData Data;  // 0x8(0x48)

}; 
// Function ConZ.Prisoner.Server_SetVehicleWeaponAimingStance
// Size: 0x1(Inherited: 0x0) 
struct FServer_SetVehicleWeaponAimingStance
{
	uint8_t  stance;  // 0x0(0x1)

}; 
// Function ConZ.Item.GetInventoryGridSizeX
// Size: 0x4(Inherited: 0x0) 
struct FGetInventoryGridSizeX
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.KeyboardIllumination.PrintSCUM
// Size: 0x4(Inherited: 0x0) 
struct FPrintSCUM
{
	struct FColor Color;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.Server_InstrumentPlayTone
// Size: 0xC(Inherited: 0x0) 
struct FServer_InstrumentPlayTone
{
	uint8_t  tone;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float timeOffset;  // 0x4(0x4)
	int32_t octave;  // 0x8(0x4)

}; 
// Function ConZ.CursedScrollBar.CallSetToUpdateFromValue
// Size: 0xC(Inherited: 0x0) 
struct FCallSetToUpdateFromValue
{
	float Value;  // 0x0(0x4)
	float MaxCountOnScreen;  // 0x4(0x4)
	float MaxValue;  // 0x8(0x4)

}; 
// Function ConZ.Item.GetInventoryIcon
// Size: 0x8(Inherited: 0x0) 
struct FGetInventoryIcon
{
	struct UTexture2D* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Item.GetInventoryIconInHands
// Size: 0x8(Inherited: 0x0) 
struct FGetInventoryIconInHands
{
	struct UTexture2D* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.PrisonerHUD.SetHUDMode
// Size: 0x1(Inherited: 0x0) 
struct FSetHUDMode
{
	uint8_t  NewMode;  // 0x0(0x1)

}; 
// Function ConZ.ItemTooltipPanel.UpdateVisuals
// Size: 0x10(Inherited: 0x0) 
struct FUpdateVisuals
{
	struct TArray<struct FInventoryNodeWidgetData> widgetData;  // 0x0(0x10)

}; 
// Function ConZ.Prisoner.DemoteSquadMemberOnServer
// Size: 0x8(Inherited: 0x0) 
struct FDemoteSquadMemberOnServer
{
	struct FDbIntegerId UserProfileId;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.Bandage
// Size: 0xC(Inherited: 0x0) 
struct FBandage
{
	float _ratio;  // 0x0(0x4)
	float _asepsis;  // 0x4(0x4)
	float _stabilizationDurationReduction;  // 0x8(0x4)

}; 
// Function ConZ.ConZBaseManager.NetMulticast_ExecuteFlagOvertake
// Size: 0x28(Inherited: 0x0) 
struct FNetMulticast_ExecuteFlagOvertake
{
	int32_t dataVersion;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	int64_t ElementID;  // 0x8(0x8)
	struct FVector elementLocation;  // 0x10(0xC)
	char pad_28[4];  // 0x1C(0x4)
	struct FDbIntegerId PlayerId;  // 0x20(0x8)

}; 
// Function ConZ.Prisoner.DidGameEventRoundStarted
// Size: 0x1(Inherited: 0x0) 
struct FDidGameEventRoundStarted
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.TradeableClassAndQuantity
// Size: 0x30(Inherited: 0x0) 
struct FTradeableClassAndQuantity
{
	char pad_0[48];  // 0x0(0x30)

}; 
// Function ConZ.Zombie2.GetMaxHealth
// Size: 0x4(Inherited: 0x0) 
struct FGetMaxHealth
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.ConZPlayerController.IsUserAdmin
// Size: 0x1(Inherited: 0x0) 
struct FIsUserAdmin
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.TrashSliderWidget.SetValue
// Size: 0x4(Inherited: 0x0) 
struct FSetValue
{
	float Value;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.WeaponReloadData
// Size: 0x30(Inherited: 0x0) 
struct FWeaponReloadData
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool IsQuick : 1;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct AItem* Item;  // 0x8(0x8)
	struct AItem* Item2;  // 0x10(0x8)
	int32_t Count;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)
	UObject* ReloadSequenceClass;  // 0x20(0x8)
	float AnimationPlayRate;  // 0x28(0x4)
	char pad_44[4];  // 0x2C(0x4)

}; 
// Function ConZ.GameEventBase.NetMulticast_UpdateScoreboard
// Size: 0xC(Inherited: 0x0) 
struct FNetMulticast_UpdateScoreboard
{
	int32_t victimIndex;  // 0x0(0x4)
	int32_t killerIndex;  // 0x4(0x4)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool IsHeadShot : 1;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)

}; 
// Function ConZ.Item.GetNormalizedHealth
// Size: 0x4(Inherited: 0x0) 
struct FGetNormalizedHealth
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.ClockFaceWidget.SetMinutes
// Size: 0x4(Inherited: 0x0) 
struct FSetMinutes
{
	int32_t Minutes;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.Client_OnNoiseInstigated
// Size: 0x4(Inherited: 0x0) 
struct FClient_OnNoiseInstigated
{
	float noiseLevel;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.PrisonerBodySimulationData_ConsumableDigestionHandlersForValueRange
// Size: 0x28(Inherited: 0x0) 
struct FPrisonerBodySimulationData_ConsumableDigestionHandlersForValueRange
{
	struct FFloatRange ValueRange;  // 0x0(0x10)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool IsConstrainedByConsumptionMethod : 1;  // 0x10(0x1)
	uint8_t  ConsumptionMethodConstraint;  // 0x11(0x1)
	char pad_18[6];  // 0x12(0x6)
	struct TArray<struct UConsumableDigestionHandler*> DigestionHandlers;  // 0x18(0x10)

}; 
// Function ConZ.ChangeTextWidget.OnCurrentInputTextChanged
// Size: 0x18(Inherited: 0x0) 
struct FOnCurrentInputTextChanged
{
	struct FText Text;  // 0x0(0x18)

}; 
// Function ConZ.User.GetProfileNames
// Size: 0x18(Inherited: 0x0) 
struct FGetProfileNames
{
	uint8_t  Type;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct TArray<struct FString> ReturnValue;  // 0x8(0x10)

}; 
// Function ConZ.Item.GetNoiseLoudnessOnGroundImpact
// Size: 0x4(Inherited: 0x0) 
struct FGetNoiseLoudnessOnGroundImpact
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.SwingItemComponent.NetMulticast_SetSwingSpeedLevel
// Size: 0x8(Inherited: 0x0) 
struct FNetMulticast_SetSwingSpeedLevel
{
	int32_t Value;  // 0x0(0x4)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool shouldPlaySwingMontageEndSection : 1;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)

}; 
// Function ConZ.Prisoner.GetWetness
// Size: 0x4(Inherited: 0x0) 
struct FGetWetness
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.ConZPlayerController.SetCommitSuicideOptionTime
// Size: 0x4(Inherited: 0x0) 
struct FSetCommitSuicideOptionTime
{
	float Time;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.SpamConsequences
// Size: 0x8(Inherited: 0x0) 
struct FSpamConsequences
{
	float Timeout;  // 0x0(0x4)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool PermanentTimeout : 1;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)

}; 
// Function ConZ.Item.GetNoiseLoudnessWhenDropped
// Size: 0x4(Inherited: 0x0) 
struct FGetNoiseLoudnessWhenDropped
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.ConZPlayerController.SetGameEventCooldown
// Size: 0x4(Inherited: 0x0) 
struct FSetGameEventCooldown
{
	float cooldown;  // 0x0(0x4)

}; 
// Function ConZ.Item.Multicast_Throw
// Size: 0x24(Inherited: 0x0) 
struct FMulticast_Throw
{
	struct FVector ZeroBasedStartPosition;  // 0x0(0xC)
	struct FRotator StartRotation;  // 0xC(0xC)
	struct FVector StartVelocity;  // 0x18(0xC)

}; 
// ScriptStruct ConZ.ItemSpawnerPreset_Node
// Size: 0x28(Inherited: 0x0) 
struct FItemSpawnerPreset_Node
{
	struct FGameplayTagContainer Nodes;  // 0x0(0x20)
	uint8_t  Rarity;  // 0x20(0x1)
	char pad_33[7];  // 0x21(0x7)

}; 
// Function ConZ.ConZBorderBase.SetColor
// Size: 0x10(Inherited: 0x0) 
struct FSetColor
{
	struct FLinearColor Color;  // 0x0(0x10)

}; 
// Function ConZ.Item.GetNormalizedMaxHealth
// Size: 0x4(Inherited: 0x0) 
struct FGetNormalizedMaxHealth
{
	float ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.MetabolismConfiguration
// Size: 0x460(Inherited: 0x0) 
struct FMetabolismConfiguration
{
	float InitialAbsorbedEnergyRatio;  // 0x0(0x4)
	float InitialAbsorbedWaterRatio;  // 0x4(0x4)
	float InitialAbsorbedVitaminsRatio;  // 0x8(0x4)
	float InitialAbsorbedMineralsRatio;  // 0xC(0x4)
	float InitialColonFullness;  // 0x10(0x4)
	float InitialBladderFullness;  // 0x14(0x4)
	float MaxStomachVolume;  // 0x18(0x4)
	float MaxIntestineVolume;  // 0x1C(0x4)
	float MaxColonVolume;  // 0x20(0x4)
	float MaxBladderVolume;  // 0x24(0x4)
	float EnergyAbsorptionCapacityMultiplier;  // 0x28(0x4)
	float WaterAbsorptionCapacityMultiplier;  // 0x2C(0x4)
	float AlcoholAbsorptionBaseCapacity;  // 0x30(0x4)
	float AbsorbedAlcoholDiscardRate;  // 0x34(0x4)
	float MaxEnergyToRecoverFromFatPerHour;  // 0x38(0x4)
	float MaxAbsorbedEnergyExcessToStoreAsFatPerHour;  // 0x3C(0x4)
	struct FSubstancesData NutrientsAbsorptionRateModifier;  // 0x40(0xD0)
	float MinSubstancesToAbsorbRatio;  // 0x110(0x4)
	char pad_276[4];  // 0x114(0x4)
	struct FSubstancesData AbsorbedNonEnergyProvidingNutrientsExcessDiscardRateMultiplier;  // 0x118(0xD0)
	struct FSubstancesData AdditionalRequiredWaterPerNutrientAbsorbed;  // 0x1E8(0xD0)
	float IntestineToColonFecesTransferRate;  // 0x2B8(0x4)
	char pad_700[4];  // 0x2BC(0x4)
	struct FSubstancesData NutrientAbsorptionWasteFecesRatios;  // 0x2C0(0xD0)
	struct FSubstancesData NutrientAbsorptionWasteUrineRatios;  // 0x390(0xD0)

}; 
// ScriptStruct ConZ.ItemObstructionTestCapsule
// Size: 0x50(Inherited: 0x0) 
struct FItemObstructionTestCapsule
{
	char pad_0[80];  // 0x0(0x50)

}; 
// Function ConZ.VehicleHitZoneManager.SetVehicleDoorWindowHitMeshAttached
// Size: 0x8(Inherited: 0x0) 
struct FSetVehicleDoorWindowHitMeshAttached
{
	int32_t doorIndex;  // 0x0(0x4)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool Value : 1;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)

}; 
// ScriptStruct ConZ.CharacterMeshManagerPerSlotData
// Size: 0x10(Inherited: 0x0) 
struct FCharacterMeshManagerPerSlotData
{
	struct TArray<UCharacterMesh*> CharacterMeshLayers;  // 0x0(0x10)

}; 
// Function ConZ.Item.GetSizeX
// Size: 0x4(Inherited: 0x0) 
struct FGetSizeX
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.GameEventFriendlyFireCheck
// Size: 0x10(Inherited: 0x0) 
struct FGameEventFriendlyFireCheck
{
	struct APrisoner* Other;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.ChangeTextWidget.SetCurrentInputText_BP
// Size: 0x18(Inherited: 0x0) 
struct FSetCurrentInputText_BP
{
	struct FText Text;  // 0x0(0x18)

}; 
// Function ConZ.PrisonerInventoryComponent.UnEquipStolenClothesItemOnServer
// Size: 0x10(Inherited: 0x0) 
struct FUnEquipStolenClothesItemOnServer
{
	struct APrisoner* stolenPrisoner;  // 0x0(0x8)
	struct AClothesItem* Item;  // 0x8(0x8)

}; 
// ScriptStruct ConZ.SentryDamageEffectData
// Size: 0x18(Inherited: 0x0) 
struct FSentryDamageEffectData
{
	struct UNiagaraSystem* ParticleSystem;  // 0x0(0x8)
	float EffectsScaleDistanceStart;  // 0x8(0x4)
	float EffectsScaleDistanceRange;  // 0xC(0x4)
	float EffectsScaleByDistanceFactor;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function ConZ.InteractionComponent.Server_RemoveLockOnServer
// Size: 0x8(Inherited: 0x0) 
struct FServer_RemoveLockOnServer
{
	struct UObject* Lockpickable;  // 0x0(0x8)

}; 
// Function ConZ.Vehicle.SetVehicleLightsActive
// Size: 0x1(Inherited: 0x0) 
struct FSetVehicleLightsActive
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// Function ConZ.ConZCharacter.CharacterAction_EndHandle
// Size: 0x8(Inherited: 0x0) 
struct FCharacterAction_EndHandle
{
	struct UCharacterAction* Action;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.WidgetDisplayInfo
// Size: 0xC(Inherited: 0x0) 
struct FWidgetDisplayInfo
{
	uint8_t  DisplayType;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	int32_t First;  // 0x4(0x4)
	int32_t Second;  // 0x8(0x4)

}; 
// Function ConZ.Weapon.SetIsChambering
// Size: 0x1(Inherited: 0x0) 
struct FSetIsChambering
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// Function ConZ.GameEventLocationMarker.CreateGameEvent
// Size: 0x8(Inherited: 0x0) 
struct FCreateGameEvent
{
	struct AGameEventBase* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Tournament.IsInSuddenDeath
// Size: 0x1(Inherited: 0x0) 
struct FIsInSuddenDeath
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.PrisonerSkillComponent.GetSkills
// Size: 0x10(Inherited: 0x0) 
struct FGetSkills
{
	struct TArray<struct USkill*> ReturnValue;  // 0x0(0x10)

}; 
// Function ConZ.BaseItemWidget.GetStacksCount
// Size: 0x4(Inherited: 0x0) 
struct FGetStacksCount
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.KillboxComponent.OnElectricDoorsDefusedDelegate
// Size: 0x8(Inherited: 0x0) 
struct FOnElectricDoorsDefusedDelegate
{
	struct ADoor* Door;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.IsLimping
// Size: 0x1(Inherited: 0x0) 
struct FIsLimping
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.CamouflageSkillParametersPerSkillLevel
// Size: 0x10(Inherited: 0x0) 
struct FCamouflageSkillParametersPerSkillLevel
{
	float Modifier;  // 0x0(0x4)
	float Bonus;  // 0x4(0x4)
	float FoliageAIPerceptionOuterRadius;  // 0x8(0x4)
	float FoliageAIPerceptionInnerRadius;  // 0xC(0x4)

}; 
// ScriptStruct ConZ.BankCardOwnershipPayloadData
// Size: 0x10(Inherited: 0x0) 
struct FBankCardOwnershipPayloadData
{
	char pad_0[16];  // 0x0(0x10)

}; 
// Function ConZ.ConZPlayerController.GetFamePointsRounded
// Size: 0x4(Inherited: 0x0) 
struct FGetFamePointsRounded
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.BaseInteractionEvent
// Size: 0x8(Inherited: 0x0) 
struct FBaseInteractionEvent
{
	char pad_0[8];  // 0x0(0x8)

}; 
// Function ConZ.TeleportComponent.Server_ReportClientReadyToFinishTeleport
// Size: 0x1(Inherited: 0x0) 
struct FServer_ReportClientReadyToFinishTeleport
{
	char RequestID;  // 0x0(0x1)

}; 
// Function ConZ.Item.GetSupportingHandIKLocation
// Size: 0xC(Inherited: 0x0) 
struct FGetSupportingHandIKLocation
{
	struct FVector ReturnValue;  // 0x0(0xC)

}; 
// Function ConZ.WeaponBow.GetDrawWeightDefaultsByStrength
// Size: 0x8(Inherited: 0x0) 
struct FGetDrawWeightDefaultsByStrength
{
	float Strength;  // 0x0(0x4)
	float ReturnValue;  // 0x4(0x4)

}; 
// Function ConZ.Item.GetTotalUses
// Size: 0x4(Inherited: 0x0) 
struct FGetTotalUses
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.EngineeringSkillExperienceAwards
// Size: 0x10(Inherited: 0x0) 
struct FEngineeringSkillExperienceAwards
{
	float RepairExperienceMultiplier;  // 0x0(0x4)
	float FillFuelExperienceMultiplier;  // 0x4(0x4)
	float DrainFuelExperienceMultiplier;  // 0x8(0x4)
	float ChargeBatteryExperienceMultiplier;  // 0xC(0x4)

}; 
// ScriptStruct ConZ.ServerCraftableItem
// Size: 0xA8(Inherited: 0x0) 
struct FServerCraftableItem
{
	uint32_t ID;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	AItem* ItemClass;  // 0x8(0x8)
	int32_t CraftedItemCount;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)
	struct TArray<AItem*> BonusItemClasses;  // 0x18(0x10)
	struct TArray<struct FServerUsedItem> MandatoryItems;  // 0x28(0x10)
	struct TArray<struct FServerUsedItem> MandatoryParts;  // 0x38(0x10)
	struct TArray<struct FServerUsedItem> OptionalItems;  // 0x48(0x10)
	struct TArray<struct FServerUsedItem> OptionalParts;  // 0x58(0x10)
	struct TArray<struct FServerUsedItem> ToolsNeeded;  // 0x68(0x10)
	struct UAnimMontage* CustomCraftingMontage;  // 0x78(0x8)
	struct UAkAudioEvent* StartCraftingAudioEvent;  // 0x80(0x8)
	struct UAkAudioEvent* StopCraftingAudioEvent;  // 0x88(0x8)
	char pad_144[24];  // 0x90(0x18)

}; 
// Function ConZ.Item.GetTotalWeight
// Size: 0x4(Inherited: 0x0) 
struct FGetTotalWeight
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Item.GetTypes
// Size: 0x10(Inherited: 0x0) 
struct FGetTypes
{
	struct TArray<UCraftingIngredientType*> ReturnValue;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.PrisonerMovementSettings_Ground_Crouching_Walking
// Size: 0x24(Inherited: 0x0) 
struct FPrisonerMovementSettings_Ground_Crouching_Walking
{
	struct FPrisonerGroundMovementParameters Default;  // 0x0(0xC)
	struct FPrisonerGroundMovementParameters WeaponAiming;  // 0xC(0xC)
	struct FPrisonerGroundMovementParameters WeaponAimingDownTheSights;  // 0x18(0xC)

}; 
// ScriptStruct ConZ.ItemMotionNoise
// Size: 0x8(Inherited: 0x0) 
struct FItemMotionNoise
{
	struct UAkAudioEvent* AudioEvent;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.FishSpawnData
// Size: 0x10(Inherited: 0x0) 
struct FFishSpawnData
{
	struct UFishSpeciesData* FishSpeciesData;  // 0x0(0x8)
	float SpawningWeight;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function ConZ.Item.GetUsedMass
// Size: 0x4(Inherited: 0x0) 
struct FGetUsedMass
{
	float ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.ParameterVector
// Size: 0x20(Inherited: 0x10) 
struct FParameterVector : public FEditableParameter
{
	struct FVector Value;  // 0x10(0xC)
	char pad_28[4];  // 0x1C(0x4)

}; 
// Function ConZ.Item.GetUsedSlots
// Size: 0x4(Inherited: 0x0) 
struct FGetUsedSlots
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.GetDesiredLeanAmount
// Size: 0x4(Inherited: 0x0) 
struct FGetDesiredLeanAmount
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Item.GetWeight
// Size: 0x4(Inherited: 0x0) 
struct FGetWeight
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.HasLadderMarkersInterface.GetLadderMarkers
// Size: 0x10(Inherited: 0x0) 
struct FGetLadderMarkers
{
	struct TArray<struct FLadderMarker> Result;  // 0x0(0x10)

}; 
// Function ConZ.Item.GetWeightRemained
// Size: 0x4(Inherited: 0x0) 
struct FGetWeightRemained
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.SetTargetCrouchStage
// Size: 0x4(Inherited: 0x0) 
struct FSetTargetCrouchStage
{
	float Value;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.Server_SpawnAmmunitionArrow
// Size: 0xB8(Inherited: 0x0) 
struct FServer_SpawnAmmunitionArrow
{
	struct FHitResult HitResult;  // 0x0(0x88)
	struct FAmmunitionArrowSpawningParamsHelper AmmunitionArrowSpawningParamsHelper;  // 0x88(0x18)
	struct FVector Location;  // 0xA0(0xC)
	struct FRotator Rotation;  // 0xAC(0xC)

}; 
// Function ConZ.Weapon.Server_SwapAttachments
// Size: 0x10(Inherited: 0x0) 
struct FServer_SwapAttachments
{
	struct AWeaponAttachment* oldAttachment;  // 0x0(0x8)
	struct AWeaponAttachment* newAttachment;  // 0x8(0x8)

}; 
// ScriptStruct ConZ.ParameterFloat
// Size: 0x18(Inherited: 0x10) 
struct FParameterFloat : public FEditableParameter
{
	float Value;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function ConZ.Item.GetWeightUsed
// Size: 0x4(Inherited: 0x0) 
struct FGetWeightUsed
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.IsActivelyParticipatingInGameEvent
// Size: 0x1(Inherited: 0x0) 
struct FIsActivelyParticipatingInGameEvent
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.NetworkStatics.GetAuthTokenForUser
// Size: 0x30(Inherited: 0x0) 
struct FGetAuthTokenForUser
{
	struct UUser* User;  // 0x0(0x8)
	struct FString ServerIp;  // 0x8(0x10)
	int32_t ServerResponsePort;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)
	struct FString ReturnValue;  // 0x20(0x10)

}; 
// ScriptStruct ConZ.AttachmentSocketDataItem
// Size: 0x18(Inherited: 0x0) 
struct FAttachmentSocketDataItem
{
	struct FName BoneName;  // 0x0(0x8)
	UAttachmentSocketMountType* MountType;  // 0x8(0x8)
	struct AActor* MountedItem;  // 0x10(0x8)

}; 
// ScriptStruct ConZ.VehicleHitZoneData
// Size: 0x30(Inherited: 0x0) 
struct FVehicleHitZoneData
{
	struct UStaticMesh* HitMesh;  // 0x0(0x8)
	char pad_8[8];  // 0x8(0x8)
	struct FName SocketName;  // 0x10(0x8)
	struct UMaterialInterface* HitZoneMaterial;  // 0x18(0x8)
	struct UMaterialInterface* DeactivatedHitZoneMaterial;  // 0x20(0x8)
	char pad_40[4];  // 0x28(0x4)
	char pad_44_1 : 7;  // 0x2C(0x1)
	bool IsHitMeshAttached : 1;  // 0x2C(0x1)
	char pad_45[3];  // 0x2D(0x3)

}; 
// Function ConZ.FishingRod.Server_RemoveAttachment
// Size: 0x8(Inherited: 0x0) 
struct FServer_RemoveAttachment
{
	struct AFishingAttachment* Attachment;  // 0x0(0x8)

}; 
// Function ConZ.Item.HasPriorityForContainerItem
// Size: 0x10(Inherited: 0x0) 
struct FHasPriorityForContainerItem
{
	struct AItem* containerItem;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// ScriptStruct ConZ.NetPackedProjectileDamageEvent
// Size: 0x108(Inherited: 0xB0) 
struct FNetPackedProjectileDamageEvent : public FScumPointDamageEvent
{
	struct FVector_NetQuantize100 DealerLocation;  // 0xB0(0xC)
	struct FVector_NetQuantize100 TargetLocation;  // 0xBC(0xC)
	float ProjectileMass;  // 0xC8(0x4)
	float ProjectileSpeed;  // 0xCC(0x4)
	float ProjectileMuzzleVelocity;  // 0xD0(0x4)
	char SharpnessHardnessPacked;  // 0xD4(0x1)
	char ArmorPiercingFactorPacked;  // 0xD5(0x1)
	char EventDataPacked;  // 0xD6(0x1)
	char pad_215[1];  // 0xD7(0x1)
	AActor* WeaponClass;  // 0xD8(0x8)
	struct UObject* DamageDealer;  // 0xE0(0x8)
	struct UVehicleAttachment* DamageReceiverVehicleAttachment;  // 0xE8(0x8)
	float DistanceTravelled;  // 0xF0(0x4)
	float ExperienceMultiplier;  // 0xF4(0x4)
	char pad_248_1 : 7;  // 0xF8(0x1)
	bool IsVehicleCollision : 1;  // 0xF8(0x1)
	char pad_249[7];  // 0xF9(0x7)
	int64_t BaseElementId;  // 0x100(0x8)

}; 
// Function ConZ.Prisoner.SetDesiredPaceOnServer
// Size: 0x1(Inherited: 0x0) 
struct FSetDesiredPaceOnServer
{
	char Value;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.EventsRankingStatsItem
// Size: 0x48(Inherited: 0x0) 
struct FEventsRankingStatsItem
{
	int32_t Rank;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct FString PlayerName;  // 0x8(0x10)
	struct FEventsRankingStats CharacterStats;  // 0x18(0x30)

}; 
// Function ConZ.KillboxComponent.NetMulticast_ActivateGasParticles
// Size: 0x1(Inherited: 0x0) 
struct FNetMulticast_ActivateGasParticles
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Activate : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.NetMulticast_TurnPrisonerInPlace
// Size: 0x4(Inherited: 0x0) 
struct FNetMulticast_TurnPrisonerInPlace
{
	float turnAngle;  // 0x0(0x4)

}; 
// Function ConZ.Item.OnAttachedToItem
// Size: 0x8(Inherited: 0x0) 
struct FOnAttachedToItem
{
	struct AItem* Item;  // 0x0(0x8)

}; 
// Function ConZ.Item.OnContainedItemDestroyed
// Size: 0x8(Inherited: 0x0) 
struct FOnContainedItemDestroyed
{
	struct AActor* containedItem;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.ZombieTurnMontageDescription
// Size: 0x28(Inherited: 0x0) 
struct FZombieTurnMontageDescription
{
	struct UAnimMontage* MontageL90;  // 0x0(0x8)
	struct UAnimMontage* MontageL180;  // 0x8(0x8)
	struct UAnimMontage* MontageR90;  // 0x10(0x8)
	struct UAnimMontage* MontageR180;  // 0x18(0x8)
	struct FName TurnAngleCurveName;  // 0x20(0x8)

}; 
// Function ConZ.CustomZoneSettingsConfigurationsList.RemoveConfiguration
// Size: 0x4(Inherited: 0x0) 
struct FRemoveConfiguration
{
	int32_t ConfigurationIndex;  // 0x0(0x4)

}; 
// Function ConZ.ClothesItem.GetCapacityX
// Size: 0x4(Inherited: 0x0) 
struct FGetCapacityX
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.GetMeleeTargetSelectionMode
// Size: 0x1(Inherited: 0x0) 
struct FGetMeleeTargetSelectionMode
{
	uint8_t  ReturnValue;  // 0x0(0x1)

}; 
// Function ConZ.WeaponAttachment.GetShakinessModifier
// Size: 0x4(Inherited: 0x0) 
struct FGetShakinessModifier
{
	float ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.GardenSlotArray
// Size: 0x120(Inherited: 0x108) 
struct FGardenSlotArray : public FFastArraySerializer
{
	struct TArray<struct FGardenSlot> _gardenSlots;  // 0x108(0x10)
	char pad_280[8];  // 0x118(0x8)

}; 
// Function ConZ.ConZCharacter.NetMulticast_CharacterActionAck
// Size: 0x10(Inherited: 0x0) 
struct FNetMulticast_CharacterActionAck
{
	struct FCharacterActionAck ack;  // 0x0(0xC)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool ignoreAutonomousProxy : 1;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)

}; 
// Function ConZ.Item.OnDetachedFromItem
// Size: 0x8(Inherited: 0x0) 
struct FOnDetachedFromItem
{
	struct AItem* Item;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.PlantGrowthStageData
// Size: 0x60(Inherited: 0x0) 
struct FPlantGrowthStageData
{
	float MinWaterMililiters;  // 0x0(0x4)
	float MinSunHours;  // 0x4(0x4)
	struct FFloatInterval OptimalAvgTemperature;  // 0x8(0x8)
	float WaterDeficiencyGrowthExtendHours;  // 0x10(0x4)
	float WaterDeficiencyDeathTimeHours;  // 0x14(0x4)
	float TemperatureDeficiencyGrowthExtendHours;  // 0x18(0x4)
	float TemperatureDeficiencyDeathTimeHours;  // 0x1C(0x4)
	float SunDeficiencyGrowthExtendHours;  // 0x20(0x4)
	float PlantPestGrowthExtendPercentage;  // 0x24(0x4)
	float DeathFromPlantPestTimeHours;  // 0x28(0x4)
	float PlantDiseaseGrowthExendPercentage;  // 0x2C(0x4)
	float DeathFromPlantDiseaseTimeHours;  // 0x30(0x4)
	float WeedGrowthExtendPercentage;  // 0x34(0x4)
	float RecoveryTimeHours;  // 0x38(0x4)
	float WeedHarvestingReductionPercentage;  // 0x3C(0x4)
	float OrganicFertilizerHarvestingIncreasePercentage;  // 0x40(0x4)
	float IndustrialFertilizerHarvestingIncreasePercentage;  // 0x44(0x4)
	float WaterDeficiencyHarvestingDecreasePercentage;  // 0x48(0x4)
	float TemperatureDeficiencyHarvestingDecreasePercentage;  // 0x4C(0x4)
	float WaterDeficiencyHarvestingSearchTimeIncrease;  // 0x50(0x4)
	float TemperatureDeficiencyHarvestingSearchTimeIncrease;  // 0x54(0x4)
	float PlantHealthAtWhichProduceStartsDecaying;  // 0x58(0x4)
	float HarvestedProduceMinHealthPercentage;  // 0x5C(0x4)

}; 
// ScriptStruct ConZ.PrisonerBodySimulationData_BodyPartMappingArray
// Size: 0x10(Inherited: 0x0) 
struct FPrisonerBodySimulationData_BodyPartMappingArray
{
	struct TArray<uint8_t > BodyParts;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.ReplenishableResourceSlotDescription
// Size: 0x1C(Inherited: 0x0) 
struct FReplenishableResourceSlotDescription
{
	char pad_0[28];  // 0x0(0x1C)

}; 
// Function ConZ.Item.OnProjectileStop
// Size: 0x88(Inherited: 0x0) 
struct FOnProjectileStop
{
	struct FHitResult ImpactResult;  // 0x0(0x88)

}; 
// Function ConZ.PrisonerMovementComponent.GetDivingDepth
// Size: 0x4(Inherited: 0x0) 
struct FGetDivingDepth
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.ConZPlayerController.ShowKillFeedMessage
// Size: 0x38(Inherited: 0x0) 
struct FShowKillFeedMessage
{
	struct FString prefix;  // 0x0(0x10)
	struct FString characterName;  // 0x10(0x10)
	struct FString suffix;  // 0x20(0x10)
	char pad_48_1 : 7;  // 0x30(0x1)
	bool ping : 1;  // 0x30(0x1)
	char pad_49[7];  // 0x31(0x7)

}; 
// Function ConZ.Item.SetInventoryIconInHands
// Size: 0x8(Inherited: 0x0) 
struct FSetInventoryIconInHands
{
	struct UTexture2D* Value;  // 0x0(0x8)

}; 
// Function ConZ.ConZPlayerController.GetCurrencyBalanceText
// Size: 0x20(Inherited: 0x0) 
struct FGetCurrencyBalanceText
{
	uint8_t  CurrencyType;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct FText ReturnValue;  // 0x8(0x18)

}; 
// ScriptStruct ConZ.RadialDamageDescription
// Size: 0x24(Inherited: 0x0) 
struct FRadialDamageDescription
{
	float RandomDamageMultiplier;  // 0x0(0x4)
	float MinRandomMultiplierChance;  // 0x4(0x4)
	float MaxRandomMultiplierChance;  // 0x8(0x4)
	struct FVector BlastDirection;  // 0xC(0xC)
	float BlastInnerAngle;  // 0x18(0x4)
	float BlastOuterAngle;  // 0x1C(0x4)
	float BlastAngleDamageFalloff;  // 0x20(0x4)

}; 
// ScriptStruct ConZ.AttackedByMeleeData
// Size: 0x18(Inherited: 0x0) 
struct FAttackedByMeleeData
{
	struct TWeakObjectPtr<AActor> attacker;  // 0x0(0x8)
	struct TWeakObjectPtr<UAnimMontage> Montage;  // 0x8(0x8)
	float PlayRate;  // 0x10(0x4)
	float Duration;  // 0x14(0x4)

}; 
// Function ConZ.InteractableInterface.Interact
// Size: 0x78(Inherited: 0x0) 
struct FInteract
{
	struct APrisoner* User;  // 0x0(0x8)
	uint8_t  interactionType;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)
	struct FInteractionData InteractionData;  // 0x10(0x68)

}; 
// Function ConZ.Prisoner.Server_DamageLockpickingTools
// Size: 0x10(Inherited: 0x0) 
struct FServer_DamageLockpickingTools
{
	struct AItem* lockpick;  // 0x0(0x8)
	struct AItem* tensionTool;  // 0x8(0x8)

}; 
// DelegateFunction ConZ.Item.PickedUpStateDelegate__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FPickedUpStateDelegate__DelegateSignature
{
	struct AItem* Item;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool pickedUp : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.ActionProgressWidget.SetProgress
// Size: 0x4(Inherited: 0x0) 
struct FSetProgress
{
	float progress;  // 0x0(0x4)

}; 
// Function ConZ.AudioStatics.GetHitSeveritySwitchValue
// Size: 0xC(Inherited: 0x0) 
struct FGetHitSeveritySwitchValue
{
	uint8_t  Value;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	struct FName ReturnValue;  // 0x4(0x8)

}; 
// Function ConZ.GameEventBase.GetParticipantInfo
// Size: 0x10(Inherited: 0x0) 
struct FGetParticipantInfo
{
	struct TArray<struct FGameEventParticipantInfo> ReturnValue;  // 0x0(0x10)

}; 
// Function ConZ.TrapItem.IsBuried
// Size: 0x1(Inherited: 0x0) 
struct FIsBuried
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.PrisonerInventoryComponent.RemoveStacks
// Size: 0x18(Inherited: 0x0) 
struct FRemoveStacks
{
	int32_t stacksToSplit;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct TScriptInterface<IInventoryNode> ReturnValue;  // 0x8(0x10)

}; 
// Function ConZ.ConZPlayerController.Server_RequestEventsRankingStats
// Size: 0x18(Inherited: 0x0) 
struct FServer_RequestEventsRankingStats
{
	uint32_t ID;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct FDbIntegerId UserProfileId;  // 0x8(0x8)
	int32_t Count;  // 0x10(0x4)
	uint8_t  orderByField;  // 0x14(0x1)
	uint8_t  sortOrder;  // 0x15(0x1)
	char pad_22[2];  // 0x16(0x2)

}; 
// Function ConZ.GameEventBase.InitEvent
// Size: 0x10(Inherited: 0x0) 
struct FInitEvent
{
	struct AGameEventLocationMarker* marker;  // 0x0(0x8)
	struct AGameEventManager* manager;  // 0x8(0x8)

}; 
// Function ConZ.Prisoner.NetMulticast_RemoveNearbyFoliageInstances
// Size: 0x10(Inherited: 0x0) 
struct FNetMulticast_RemoveNearbyFoliageInstances
{
	struct TArray<struct FPrisonerNearbyFoliageInstanceInfoReplicated> replicatedInstanceInfo;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.WeaponStateSyncData
// Size: 0x48(Inherited: 0x0) 
struct FWeaponStateSyncData
{
	int32_t ZeroRange;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct TArray<struct FAmmunitionData> LoadedAmmoData;  // 0x8(0x10)
	struct TArray<struct FAmmunitionData> InternalMagazineAmmoData;  // 0x18(0x10)
	UObject* LoadedAmmunitionItemClass;  // 0x28(0x8)
	AProjectile* LoadedProjectileClass;  // 0x30(0x8)
	uint8_t  FiringMode;  // 0x38(0x1)
	char pad_57[3];  // 0x39(0x3)
	int32_t malfunction;  // 0x3C(0x4)
	char pad_64_1 : 7;  // 0x40(0x1)
	bool IsChamberOpened : 1;  // 0x40(0x1)
	char pad_65[7];  // 0x41(0x7)

}; 
// Function ConZ.Item.Server_Throw
// Size: 0x24(Inherited: 0x0) 
struct FServer_Throw
{
	struct FVector ZeroBasedStartPosition;  // 0x0(0xC)
	struct FRotator StartRotation;  // 0xC(0xC)
	struct FVector StartVelocity;  // 0x18(0xC)

}; 
// Function ConZ.Prisoner.GetPartWaterWeight
// Size: 0x8(Inherited: 0x0) 
struct FGetPartWaterWeight
{
	uint8_t  part;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float ReturnValue;  // 0x4(0x4)

}; 
// Function ConZ.Zombie2.GetStance
// Size: 0x1(Inherited: 0x0) 
struct FGetStance
{
	uint8_t  ReturnValue;  // 0x0(0x1)

}; 
// Function ConZ.Item.SetCaption
// Size: 0x18(Inherited: 0x0) 
struct FSetCaption
{
	struct FText Value;  // 0x0(0x18)

}; 
// ScriptStruct ConZ.PrisonerMovementSettings_Ground
// Size: 0x16C(Inherited: 0x0) 
struct FPrisonerMovementSettings_Ground
{
	struct FPrisonerMovementSettings_Ground_Standing Standing;  // 0x0(0xB4)
	struct FPrisonerMovementSettings_Ground_Crouching Crouching;  // 0xB4(0x6C)
	struct FPrisonerMovementSettings_Ground_Prone Prone;  // 0x120(0x24)
	struct FFloatInterval MaxSpeedMultiplierVsPerformanceRatio;  // 0x144(0x8)
	struct FFloatInterval AccelerationMultiplierVsPerformanceRatio;  // 0x14C(0x8)
	struct FFloatInterval DecelerationMultiplierVsPerformanceRatio;  // 0x154(0x8)
	struct FFloatInterval MaxSpeedWhenImmersedInWaterVsPerformanceRatio;  // 0x15C(0x8)
	float AccelerationMultiplierWhenImmersedInWater;  // 0x164(0x4)
	float DecelerationMultiplierWhenImmersedInWater;  // 0x168(0x4)

}; 
// Function ConZ.GameEventParticipantStats.GetAssists
// Size: 0x4(Inherited: 0x0) 
struct FGetAssists
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Item.SetHealth
// Size: 0x4(Inherited: 0x0) 
struct FSetHealth
{
	float health;  // 0x0(0x4)

}; 
// Function ConZ.Item.SetInventoryIcon
// Size: 0x8(Inherited: 0x0) 
struct FSetInventoryIcon
{
	struct UTexture2D* Value;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.CharacterArmsImpactSoundData
// Size: 0x28(Inherited: 0x0) 
struct FCharacterArmsImpactSoundData
{
	struct TArray<uint8_t > ImpactSourceCategories;  // 0x0(0x10)
	struct TArray<uint8_t > ImpactTargetCategories;  // 0x10(0x10)
	struct FCharacterImpactSounds Sounds;  // 0x20(0x8)

}; 
// Function ConZ.Item.SetMaxHealth
// Size: 0x4(Inherited: 0x0) 
struct FSetMaxHealth
{
	float MaxHealth;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.ConsumableDigestionHandlerSave
// Size: 0x10(Inherited: 0x0) 
struct FConsumableDigestionHandlerSave
{
	struct TArray<char> Data;  // 0x0(0x10)

}; 
// Function ConZ.InventoryNode.GetInventoryNodeDescription
// Size: 0x18(Inherited: 0x0) 
struct FGetInventoryNodeDescription
{
	struct FText ReturnValue;  // 0x0(0x18)

}; 
// Function ConZ.GameEventBase.RegisterParticipant
// Size: 0x10(Inherited: 0x0) 
struct FRegisterParticipant
{
	struct APrisoner* Prisoner;  // 0x0(0x8)
	int32_t preferredTeam;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// DelegateFunction ConZ.Door.OnLocked__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FOnLocked__DelegateSignature
{
	struct ADoor* Door;  // 0x0(0x8)

}; 
// Function ConZ.Item.SetOutsideInventoryIcon
// Size: 0x8(Inherited: 0x0) 
struct FSetOutsideInventoryIcon
{
	struct UTexture2D* Value;  // 0x0(0x8)

}; 
// Function ConZ.WeaponCrossbow.Multicast_HandleFiringEffects
// Size: 0x1(Inherited: 0x0) 
struct FMulticast_HandleFiringEffects
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool shotFired : 1;  // 0x0(0x1)

}; 
// Function ConZ.MetalDetector.Server_SetDetectionFactor
// Size: 0x4(Inherited: 0x0) 
struct FServer_SetDetectionFactor
{
	float newDetectionFactor;  // 0x0(0x4)

}; 
// Function ConZ.ConZGameState.GetSquadForUserProfileId
// Size: 0x10(Inherited: 0x0) 
struct FGetSquadForUserProfileId
{
	struct FDbIntegerId ID;  // 0x0(0x8)
	struct AConZSquad* ReturnValue;  // 0x8(0x8)

}; 
// Function ConZ.Vehicle.GetVehicleHealth
// Size: 0x4(Inherited: 0x0) 
struct FGetVehicleHealth
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.ConZPlayerController.CanAddServerToFavorites
// Size: 0x1(Inherited: 0x0) 
struct FCanAddServerToFavorites
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Item.SetWeight
// Size: 0x4(Inherited: 0x0) 
struct FSetWeight
{
	float Value;  // 0x0(0x4)

}; 
// Function ConZ.PlayerRpcChannel.Cooking_Server_BeginCooking
// Size: 0x38(Inherited: 0x0) 
struct FCooking_Server_BeginCooking
{
	int32_t SlotId;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct APrisoner* User;  // 0x8(0x8)
	struct UCookingRecipe* recipe;  // 0x10(0x8)
	struct TArray<struct AItem*> MainIngredients;  // 0x18(0x10)
	struct TArray<struct AItem*> OptionalIngredients;  // 0x28(0x10)

}; 
// Function ConZ.Prisoner.OpenTabMode
// Size: 0x1(Inherited: 0x0) 
struct FOpenTabMode
{
	uint8_t  mode;  // 0x0(0x1)

}; 
// Function ConZ.FishingRod.Server_SetShouldShortCast
// Size: 0x1(Inherited: 0x0) 
struct FServer_SetShouldShortCast
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// DelegateFunction ConZ.Item.SkeletalMeshChangedDelegate__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FSkeletalMeshChangedDelegate__DelegateSignature
{
	struct AItem* Item;  // 0x0(0x8)

}; 
// Function ConZ.PlayerRpcChannel.ResourceLockingManager_Server_UnlockResource
// Size: 0x8(Inherited: 0x0) 
struct FResourceLockingManager_Server_UnlockResource
{
	struct FResourceNetworkGUID ResourceGUID;  // 0x0(0x4)
	int32_t ResourceId;  // 0x4(0x4)

}; 
// DelegateFunction ConZ.Item.StateChangedDelegate__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FStateChangedDelegate__DelegateSignature
{
	struct AItem* Item;  // 0x0(0x8)

}; 
// Function ConZ.ComplexAnimalAIController.OnActionChangedHandler
// Size: 0x2(Inherited: 0x0) 
struct FOnActionChangedHandler
{
	uint8_t  CurrentAction;  // 0x0(0x1)
	uint8_t  PrevAction;  // 0x1(0x1)

}; 
// ScriptStruct ConZ.HuntingClueVisuals
// Size: 0xA0(Inherited: 0x0) 
struct FHuntingClueVisuals
{
	float Weight;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct UStaticMesh* ClueStaticMesh;  // 0x8(0x8)
	struct UMaterialInstance* ClueStaticMeshMaterial;  // 0x10(0x8)
	char pad_24[8];  // 0x18(0x8)
	struct FTransform StaticMeshOverrideRelativeTransform;  // 0x20(0x30)
	struct UMaterialInstance* ClueDecalMaterials;  // 0x50(0x8)
	char pad_88[8];  // 0x58(0x8)
	struct FTransform ClueDecalOverrideRelativeTransform;  // 0x60(0x30)
	char pad_144_1 : 7;  // 0x90(0x1)
	bool ShouldOverrideBoxDimensions : 1;  // 0x90(0x1)
	char pad_145[3];  // 0x91(0x3)
	struct FVector ClueDecalOverrideBoxDimensions;  // 0x94(0xC)

}; 
// Function ConZ.Prisoner.SendSquadInvitationOnClient
// Size: 0x18(Inherited: 0x0) 
struct FSendSquadInvitationOnClient
{
	struct APrisoner* invitor;  // 0x0(0x8)
	struct FString invitorName;  // 0x8(0x10)

}; 
// DelegateFunction ConZ.Item.StaticMeshChangedDelegate__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FStaticMeshChangedDelegate__DelegateSignature
{
	struct AItem* Item;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.GenitalsExposed
// Size: 0x1(Inherited: 0x0) 
struct FGenitalsExposed
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.IsEnabled
// Size: 0x1(Inherited: 0x0) 
struct FIsEnabled
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.ConZItemElementData
// Size: 0x1(Inherited: 0x0) 
struct FConZItemElementData
{
	char pad_0[1];  // 0x0(0x1)

}; 
// DelegateFunction ConZ.CircularMenuSegmentThrowingInfo.SegmentExecutionThrowingDelegate__DelegateSignature
// Size: 0x4(Inherited: 0x0) 
struct FSegmentExecutionThrowingDelegate__DelegateSignature
{
	int32_t Index;  // 0x0(0x4)

}; 
// Function ConZ.ConZBaseManager.NetMulticast_ApplyDamageToBaseElement
// Size: 0x28(Inherited: 0x0) 
struct FNetMulticast_ApplyDamageToBaseElement
{
	int32_t dataVersion;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	int64_t BaseId;  // 0x8(0x8)
	int64_t ElementID;  // 0x10(0x8)
	struct FVector elementLocation;  // 0x18(0xC)
	float damageAmount;  // 0x24(0x4)

}; 
// Function ConZ.ConZSquad.CanMemberEditName
// Size: 0x10(Inherited: 0x0) 
struct FCanMemberEditName
{
	struct FDbIntegerId UserProfileId;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.Item.Use
// Size: 0x20(Inherited: 0x0) 
struct FUse
{
	struct APrisoner* Prisoner;  // 0x0(0x8)
	int32_t Usage;  // 0x8(0x4)
	float usageWeight;  // 0xC(0x4)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool Eat : 1;  // 0x10(0x1)
	char pad_17[3];  // 0x11(0x3)
	float DamageMultiplier;  // 0x14(0x4)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool ReturnValue : 1;  // 0x18(0x1)
	char pad_25[7];  // 0x19(0x7)

}; 
// Function ConZ.ConZPlayerController.Client_ReceiveEventsRankingStats
// Size: 0x20(Inherited: 0x0) 
struct FClient_ReceiveEventsRankingStats
{
	uint32_t ID;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct TArray<struct FEventsRankingStatsItem> stats;  // 0x8(0x10)
	int32_t playerRank;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)

}; 
// ScriptStruct ConZ.CookingCategoryDropdownEntryData
// Size: 0x40(Inherited: 0x0) 
struct FCookingCategoryDropdownEntryData
{
	struct FGameplayTag CookingCategoryTag;  // 0x0(0x8)
	struct FGameplayTag NavigationTag;  // 0x8(0x8)
	struct TArray<struct FGameplayTag> NavigationHistory;  // 0x10(0x10)
	struct FText DisplayName;  // 0x20(0x18)
	int32_t IndentationLevel;  // 0x38(0x4)
	char pad_60[4];  // 0x3C(0x4)

}; 
// Function ConZ.ConZPlayerController.Client_SetIsServerSettingsAdmin
// Size: 0x1(Inherited: 0x0) 
struct FClient_SetIsServerSettingsAdmin
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// Function ConZ.PrisonerInventoryComponent.CanEquipClothesItem
// Size: 0x10(Inherited: 0x0) 
struct FCanEquipClothesItem
{
	struct AClothesItem* Item;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.WeaponAttachmentFlashlight.OnComponentActivated
// Size: 0x10(Inherited: 0x0) 
struct FOnComponentActivated
{
	struct UActorComponent* Component;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool wasReset : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.ConZPlayerController.Client_EndByteStream
// Size: 0x4(Inherited: 0x0) 
struct FClient_EndByteStream
{
	int32_t streamId;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.CraftingPart
// Size: 0x20(Inherited: 0x0) 
struct FCraftingPart
{
	UObject* ItemClass;  // 0x0(0x8)
	char pad_8[24];  // 0x8(0x18)

}; 
// ScriptStruct ConZ.PackedEntitySetupAndId
// Size: 0x8(Inherited: 0x0) 
struct FPackedEntitySetupAndId
{
	uint64_t _value;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.GetMaxPartWaterWeight
// Size: 0x8(Inherited: 0x0) 
struct FGetMaxPartWaterWeight
{
	uint8_t  part;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float ReturnValue;  // 0x4(0x4)

}; 
// Function ConZ.FishingRod.Server_SetFishingState
// Size: 0x1(Inherited: 0x0) 
struct FServer_SetFishingState
{
	uint8_t  fishingState;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.ItemStackData
// Size: 0x10(Inherited: 0x0) 
struct FItemStackData
{
	struct TArray<struct UItemStateBase*> Stacks;  // 0x0(0x10)

}; 
// DelegateFunction ConZ.Door.OnUnlocked__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FOnUnlocked__DelegateSignature
{
	struct ADoor* Door;  // 0x0(0x8)

}; 
// Function ConZ.ConZPlayerController.Client_TestPingLockStuff
// Size: 0xC(Inherited: 0x0) 
struct FClient_TestPingLockStuff
{
	float averageDelta;  // 0x0(0x4)
	float averagePing;  // 0x4(0x4)
	float counter;  // 0x8(0x4)

}; 
// Function ConZ.FishingRod.NetMulticast_ReleaseCastingObject
// Size: 0x20(Inherited: 0x0) 
struct FNetMulticast_ReleaseCastingObject
{
	struct FVector Location;  // 0x0(0xC)
	struct FVector Direction;  // 0xC(0xC)
	float castingPower;  // 0x18(0x4)
	uint8_t  nextState;  // 0x1C(0x1)
	char pad_29[3];  // 0x1D(0x3)

}; 
// ScriptStruct ConZ.AttachmentSocketOffset
// Size: 0x20(Inherited: 0x0) 
struct FAttachmentSocketOffset
{
	struct FName BoneName;  // 0x0(0x8)
	struct FVector Location;  // 0x8(0xC)
	struct FRotator Rotation;  // 0x14(0xC)

}; 
// ScriptStruct ConZ.Achievements
// Size: 0x1(Inherited: 0x0) 
struct FAchievements
{
	char pad_0[1];  // 0x0(0x1)

}; 
// ScriptStruct ConZ.AttachmentSocket
// Size: 0x10(Inherited: 0x0) 
struct FAttachmentSocket
{
	struct TArray<struct FAttachmentSocketDataItem> Items;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.RandomRollStage
// Size: 0x98(Inherited: 0x0) 
struct FRandomRollStage
{
	struct FFloatInterval BaseValueRollInterval;  // 0x0(0x8)
	struct FRuntimeFloatCurve BaseValueTargetCurve;  // 0x8(0x88)
	float BaseValueTargetInterpSpeed;  // 0x90(0x4)
	char pad_148[4];  // 0x94(0x4)

}; 
// ScriptStruct ConZ.ConZSquadMember
// Size: 0x20(Inherited: 0x0) 
struct FConZSquadMember
{
	char pad_0[16];  // 0x0(0x10)
	struct FDbIntegerId UserProfileId;  // 0x10(0x8)
	uint8_t  Rank;  // 0x18(0x1)
	char pad_25_1 : 7;  // 0x19(0x1)
	bool online : 1;  // 0x19(0x1)
	char pad_26_1 : 7;  // 0x1A(0x1)
	bool InDanger : 1;  // 0x1A(0x1)
	char pad_27_1 : 7;  // 0x1B(0x1)
	bool IsAlive : 1;  // 0x1B(0x1)
	char pad_28[4];  // 0x1C(0x4)

}; 
// ScriptStruct ConZ.ItemLocation
// Size: 0xF(Inherited: 0x0) 
struct FItemLocation
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Coastal : 1;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool Continantal : 1;  // 0x1(0x1)
	char pad_2_1 : 7;  // 0x2(0x1)
	bool Mountain : 1;  // 0x2(0x1)
	char pad_3_1 : 7;  // 0x3(0x1)
	bool Urban : 1;  // 0x3(0x1)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool Rural : 1;  // 0x4(0x1)
	char pad_5_1 : 7;  // 0x5(0x1)
	bool Industrial : 1;  // 0x5(0x1)
	char pad_6_1 : 7;  // 0x6(0x1)
	bool Police : 1;  // 0x6(0x1)
	char pad_7_1 : 7;  // 0x7(0x1)
	bool MilitaryBasic : 1;  // 0x7(0x1)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool MilitaryMedium : 1;  // 0x8(0x1)
	char pad_9_1 : 7;  // 0x9(0x1)
	bool MilitaryAdvanced : 1;  // 0x9(0x1)
	char pad_10_1 : 7;  // 0xA(0x1)
	bool MilitaryWW2 : 1;  // 0xA(0x1)
	char pad_11_1 : 7;  // 0xB(0x1)
	bool Sport : 1;  // 0xB(0x1)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool Market : 1;  // 0xC(0x1)
	char pad_13_1 : 7;  // 0xD(0x1)
	bool GasStation : 1;  // 0xD(0x1)
	char pad_14_1 : 7;  // 0xE(0x1)
	bool Airfield : 1;  // 0xE(0x1)

}; 
// Function ConZ.WeaponScopeItemComponent.Server_SetWindage
// Size: 0x4(Inherited: 0x0) 
struct FServer_SetWindage
{
	int32_t Windage;  // 0x0(0x4)

}; 
// Function ConZ.PlayerRpcChannel.Client_UnlockAchievement
// Size: 0x18(Inherited: 0x0) 
struct FClient_UnlockAchievement
{
	struct APlayerController* PlayerController;  // 0x0(0x8)
	struct FString AchievementID;  // 0x8(0x10)

}; 
// ScriptStruct ConZ.SpawnCharacterGroupInfo
// Size: 0x50(Inherited: 0x0) 
struct FSpawnCharacterGroupInfo
{
	struct TArray<APawn*> AvailablePawns;  // 0x0(0x10)
	struct FTransform Transform;  // 0x10(0x30)
	int32_t NumOfCharactersToSpawn;  // 0x40(0x4)
	char pad_68_1 : 7;  // 0x44(0x1)
	bool IgnoreLimit : 1;  // 0x44(0x1)
	char pad_69[11];  // 0x45(0xB)

}; 
// Function ConZ.CharacterSpawningManager.SpawnCharactersAroundLocation
// Size: 0x50(Inherited: 0x0) 
struct FSpawnCharactersAroundLocation
{
	struct FSpawnCharacterAroundInfo Info;  // 0x0(0x50)

}; 
// Function ConZ.ConZPlayerController.Client_BeginByteStream
// Size: 0x8(Inherited: 0x0) 
struct FClient_BeginByteStream
{
	int32_t streamId;  // 0x0(0x4)
	uint8_t  streamType;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)

}; 
// Function ConZ.ConZPlayerController.Client_EnableRespawnOption
// Size: 0x1(Inherited: 0x0) 
struct FClient_EnableRespawnOption
{
	uint8_t  option;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.IsInCombatMode
// Size: 0x1(Inherited: 0x0) 
struct FIsInCombatMode
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.ConZPlayerController.Client_HasMountedActorBegunPlay
// Size: 0x8(Inherited: 0x0) 
struct FClient_HasMountedActorBegunPlay
{
	struct AActor* Actor;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.ZombieMeshVariation2
// Size: 0x10(Inherited: 0x0) 
struct FZombieMeshVariation2
{
	struct USkeletalMesh* DressedMesh;  // 0x0(0x8)
	struct USkeletalMesh* StrippedMesh;  // 0x8(0x8)

}; 
// Function ConZ.WeaponActionSequence.SetNextMontageSectionFromPrevious
// Size: 0x10(Inherited: 0x0) 
struct FSetNextMontageSectionFromPrevious
{
	struct FName previousSection;  // 0x0(0x8)
	struct FName NextSection;  // 0x8(0x8)

}; 
// ScriptStruct ConZ.SpawnedItems
// Size: 0x18(Inherited: 0x0) 
struct FSpawnedItems
{
	int32_t ID;  // 0x0(0x4)
	uint8_t  Operation;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)
	struct TArray<struct AItem*> Items;  // 0x8(0x10)

}; 
// Function ConZ.Prisoner.GetPrisonerMovement
// Size: 0x8(Inherited: 0x0) 
struct FGetPrisonerMovement
{
	struct UPrisonerMovementComponent* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.ConZPlayerController.Client_HeartbeatRequest
// Size: 0x4(Inherited: 0x0) 
struct FClient_HeartbeatRequest
{
	uint32_t code;  // 0x0(0x4)

}; 
// Function ConZ.ResourceLockingManager.NetMulticast_UnlockArea
// Size: 0x20(Inherited: 0x0) 
struct FNetMulticast_UnlockArea
{
	int32_t dataVersion;  // 0x0(0x4)
	struct FBox Area;  // 0x4(0x1C)

}; 
// Function ConZ.Prisoner.GetMusicPlayerComponent
// Size: 0x8(Inherited: 0x0) 
struct FGetMusicPlayerComponent
{
	struct UPrisonerMusicPlayerComponent* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.ZombieCombatStanceVariation2
// Size: 0x30(Inherited: 0x0) 
struct FZombieCombatStanceVariation2
{
	struct FZombieCombatStanceAnimations Animations;  // 0x0(0x18)
	float RunAcceleration;  // 0x18(0x4)
	float RunDeceleration;  // 0x1C(0x4)
	float RunSpeed;  // 0x20(0x4)
	float RunSpeedInAnimation;  // 0x24(0x4)
	float RunTurnRate;  // 0x28(0x4)
	char pad_44[4];  // 0x2C(0x4)

}; 
// Function ConZ.Prisoner.Server_SetItemInHandsActualObstructionDepth
// Size: 0x4(Inherited: 0x0) 
struct FServer_SetItemInHandsActualObstructionDepth
{
	float Value;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.ConZSquadPendingMember
// Size: 0x10(Inherited: 0x0) 
struct FConZSquadPendingMember
{
	struct FDbIntegerId UserProfileId;  // 0x0(0x8)
	char pad_8[8];  // 0x8(0x8)

}; 
// Function ConZ.ConZPlayerController.Client_InitializeCharacterModificationTransaction
// Size: 0x50(Inherited: 0x0) 
struct FClient_InitializeCharacterModificationTransaction
{
	int32_t transactionId;  // 0x0(0x4)
	char pad_4[12];  // 0x4(0xC)
	struct FTransform roomTransform;  // 0x10(0x30)
	uint8_t  Type;  // 0x40(0x1)
	char pad_65[15];  // 0x41(0xF)

}; 
// Function ConZ.Prisoner.Server_HandleGearMotion
// Size: 0x2(Inherited: 0x0) 
struct FServer_HandleGearMotion
{
	uint8_t  motionIntensity;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool shouldMakeNoise : 1;  // 0x1(0x1)

}; 
// Function ConZ.ConZGameMode.GetItemVirtualizationManager
// Size: 0x8(Inherited: 0x0) 
struct FGetItemVirtualizationManager
{
	struct AItemVirtualizationManager* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.InitFromCharacterTemplate
// Size: 0xE0(Inherited: 0x0) 
struct FInitFromCharacterTemplate
{
	struct FCharacterTemplate CharacterTemplate;  // 0x0(0xE0)

}; 
// Function ConZ.UserProfile.GetCreationTemplate
// Size: 0xE0(Inherited: 0x0) 
struct FGetCreationTemplate
{
	struct FCharacterTemplate ReturnValue;  // 0x0(0xE0)

}; 
// Function ConZ.ConZPlayerController.Client_Login
// Size: 0x40(Inherited: 0x0) 
struct FClient_Login
{
	struct FPlayerLoginInfo serverLoginInfo;  // 0x0(0x40)

}; 
// Function ConZ.ConZPlayerController.Server_RequestSquadMemberInfo
// Size: 0x10(Inherited: 0x0) 
struct FServer_RequestSquadMemberInfo
{
	uint32_t ID;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct FDbIntegerId squadId;  // 0x8(0x8)

}; 
// ScriptStruct ConZ.DbIntegerId
// Size: 0x8(Inherited: 0x0) 
struct FDbIntegerId
{
	int64_t Value;  // 0x0(0x8)

}; 
// Function ConZ.DropZoneGameEvent.GetKey
// Size: 0x8(Inherited: 0x0) 
struct FGetKey
{
	struct ADropZoneKey* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.DeluxeVersion
// Size: 0x5(Inherited: 0x0) 
struct FDeluxeVersion
{
	char pad_0[5];  // 0x0(0x5)

}; 
// Function ConZ.Prisoner.Server_TurnPrisonerInPlace
// Size: 0x4(Inherited: 0x0) 
struct FServer_TurnPrisonerInPlace
{
	float turnAngle;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.RespawnParameters
// Size: 0x6C(Inherited: 0x0) 
struct FRespawnParameters
{
	int32_t RandomLocationPrice;  // 0x0(0x4)
	int32_t SectorLocationPrice;  // 0x4(0x4)
	uint8_t  SectorLocationPriceCurrency;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)
	int32_t ShelterLocationPrice;  // 0xC(0x4)
	uint8_t  ShelterLocationPriceCurrency;  // 0x10(0x1)
	char pad_17[3];  // 0x11(0x3)
	int32_t SquadLocationPrice;  // 0x14(0x4)
	uint8_t  SquadLocationPriceCurrency;  // 0x18(0x1)
	char pad_25[3];  // 0x19(0x3)
	int32_t PermadeathThreshold;  // 0x1C(0x4)
	uint8_t  PermadeathThresholdPriceCurrency;  // 0x20(0x1)
	char pad_33[3];  // 0x21(0x3)
	float RandomPriceModifier;  // 0x24(0x4)
	float SectorPriceModifier;  // 0x28(0x4)
	float HomePriceModifier;  // 0x2C(0x4)
	float RandomInitialTime;  // 0x30(0x4)
	float SectorInitialTime;  // 0x34(0x4)
	float ShelterInitialTime;  // 0x38(0x4)
	float SquadInitialTime;  // 0x3C(0x4)
	float RandomCooldownTime;  // 0x40(0x4)
	float SectorCooldownTime;  // 0x44(0x4)
	float ShelterCooldownTime;  // 0x48(0x4)
	float SquadCooldownTime;  // 0x4C(0x4)
	float RandomCooldownResetMultiplier;  // 0x50(0x4)
	float SectorCooldownResetMultiplier;  // 0x54(0x4)
	float ShelterCooldownResetMultiplier;  // 0x58(0x4)
	float SquadCooldownResetMultiplier;  // 0x5C(0x4)
	float CommitSuicideInitialTime;  // 0x60(0x4)
	float CommitSuicideCooldownTime;  // 0x64(0x4)
	float CommitSuicideCooldownResetMultiplier;  // 0x68(0x4)

}; 
// Function ConZ.ConZPlayerController.Client_ReceiveBytesFromStream
// Size: 0x18(Inherited: 0x0) 
struct FClient_ReceiveBytesFromStream
{
	int32_t streamId;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct TArray<char> bytes;  // 0x8(0x10)

}; 
// Function ConZ.WeaponAction.GetWeapon
// Size: 0x8(Inherited: 0x0) 
struct FGetWeapon
{
	struct AWeapon* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.GameEventBase.GetParticipantJoinLocation
// Size: 0x18(Inherited: 0x0) 
struct FGetParticipantJoinLocation
{
	struct APrisoner* Prisoner;  // 0x0(0x8)
	struct FVector ReturnValue;  // 0x8(0xC)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function ConZ.UserProfile.SetFamePoints
// Size: 0x4(Inherited: 0x0) 
struct FSetFamePoints
{
	float Value;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.CTFParameters
// Size: 0x30(Inherited: 0x0) 
struct FCTFParameters
{
	float FlagResetDuration;  // 0x0(0x4)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool AllowReturns : 1;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)
	int32_t CaptureLimit;  // 0x8(0x4)
	struct FGameEventRewardPoints PointsPerPickup;  // 0xC(0xC)
	struct FGameEventRewardPoints PointsPerCapture;  // 0x18(0xC)
	struct FGameEventRewardPoints PointsPerReturn;  // 0x24(0xC)

}; 
// Function ConZ.HitReactComponent.GetPelvisRotation
// Size: 0x10(Inherited: 0x0) 
struct FGetPelvisRotation
{
	struct FQuat ReturnValue;  // 0x0(0x10)

}; 
// Function ConZ.ConZPlayerController.Client_ReceiveSquadMemberInfo
// Size: 0x58(Inherited: 0x0) 
struct FClient_ReceiveSquadMemberInfo
{
	uint32_t ID;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct TArray<struct FDbIntegerId> userProfileIds;  // 0x8(0x10)
	struct TArray<struct FString> names;  // 0x18(0x10)
	struct TArray<uint8_t > ranks;  // 0x28(0x10)
	struct TArray<float> FamePoints;  // 0x38(0x10)
	struct TArray<bool> online;  // 0x48(0x10)

}; 
// Function ConZ.GameEventBorder.GetState
// Size: 0x1(Inherited: 0x0) 
struct FGetState
{
	uint8_t  ReturnValue;  // 0x0(0x1)

}; 
// Function ConZ.PrisonerInventoryComponent.DropItemAtOnServer
// Size: 0x20(Inherited: 0x0) 
struct FDropItemAtOnServer
{
	struct AItem* Item;  // 0x0(0x8)
	struct FVector Location;  // 0x8(0xC)
	struct FRotator Rotation;  // 0x14(0xC)

}; 
// Function ConZ.ConZPlayerController.Client_ReceiveSquadRankingData
// Size: 0x50(Inherited: 0x0) 
struct FClient_ReceiveSquadRankingData
{
	uint32_t ID;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct TArray<struct FString> names;  // 0x8(0x10)
	struct TArray<struct FString> information;  // 0x18(0x10)
	struct TArray<uint64_t> emblems;  // 0x28(0x10)
	struct TArray<float> scores;  // 0x38(0x10)
	int32_t squadRank;  // 0x48(0x4)
	int32_t squadIndex;  // 0x4C(0x4)

}; 
// Function ConZ.Prisoner.CreateThrowingComponent
// Size: 0x18(Inherited: 0x0) 
struct FCreateThrowingComponent
{
	struct AItem* itemToThrow;  // 0x0(0x8)
	uint8_t  animationType;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)
	struct UPrisonerThrowComponent* ReturnValue;  // 0x10(0x8)

}; 
// Function ConZ.ActorStatics.GetActorBoundsCenter
// Size: 0x18(Inherited: 0x0) 
struct FGetActorBoundsCenter
{
	struct AActor* Actor;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool onlyCollidingComponents : 1;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)
	struct FVector ReturnValue;  // 0xC(0xC)

}; 
// Function ConZ.Prisoner.GetHoldBreathState
// Size: 0x1(Inherited: 0x0) 
struct FGetHoldBreathState
{
	uint8_t  ReturnValue;  // 0x0(0x1)

}; 
// Function ConZ.ConZPlayerController.Client_ReceiveSurvivalStats
// Size: 0x198(Inherited: 0x0) 
struct FClient_ReceiveSurvivalStats
{
	uint32_t ID;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct FSurvivalStats stats;  // 0x8(0x190)

}; 
// Function ConZ.PrisonerAnimInstance.GetCurrentLocomotionState
// Size: 0x1(Inherited: 0x0) 
struct FGetCurrentLocomotionState
{
	uint8_t  ReturnValue;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.SurvivalStats
// Size: 0x190(Inherited: 0x0) 
struct FSurvivalStats
{
	char pad_0[8];  // 0x0(0x8)
	float HighestPositiveFamePoints;  // 0x8(0x4)
	int32_t DoorsClaimed;  // 0xC(0x4)
	int32_t AnimalsKilled;  // 0x10(0x4)
	float MinutesSurvived;  // 0x14(0x4)
	int32_t Kills;  // 0x18(0x4)
	int32_t Deaths;  // 0x1C(0x4)
	int32_t LocksPicked;  // 0x20(0x4)
	int32_t PuppetsKilled;  // 0x24(0x4)
	int32_t GunsCrafted;  // 0x28(0x4)
	int32_t AmmoCrafted;  // 0x2C(0x4)
	int32_t BulletsCrafted;  // 0x30(0x4)
	int32_t ArrowsCrafted;  // 0x34(0x4)
	int32_t ClothingCrafted;  // 0x38(0x4)
	float LongestKillDistance;  // 0x3C(0x4)
	int32_t MeleeKills;  // 0x40(0x4)
	int32_t ArcheryKills;  // 0x44(0x4)
	int32_t PlayersKnockedOut;  // 0x48(0x4)
	int32_t TotalDefecations;  // 0x4C(0x4)
	int32_t TotalUrinations;  // 0x50(0x4)
	int32_t LightsFired;  // 0x54(0x4)
	int32_t ContainersLooted;  // 0x58(0x4)
	int32_t ItemsPutIntoContainers;  // 0x5C(0x4)
	int32_t DeathsByPrisoners;  // 0x60(0x4)
	int32_t AnimalsSkinned;  // 0x64(0x4)
	float FoodEaten;  // 0x68(0x4)
	float DistanceTravelledByFoot;  // 0x6C(0x4)
	int32_t WoundsPatched;  // 0x70(0x4)
	int32_t ItemsPickedUp;  // 0x74(0x4)
	float LiquidDrank;  // 0x78(0x4)
	int32_t TeethLost;  // 0x7C(0x4)
	int32_t TotalCaloriesIntake;  // 0x80(0x4)
	int32_t ShotsFired;  // 0x84(0x4)
	int32_t ShotsHit;  // 0x88(0x4)
	float RangeWeaponAccuracy;  // 0x8C(0x4)
	int32_t Headshots;  // 0x90(0x4)
	int32_t MeleeWeaponSwings;  // 0x94(0x4)
	int32_t MeleeWeaponHits;  // 0x98(0x4)
	float MeleeWeaponAccuracy;  // 0x9C(0x4)
	int32_t MeleeWeaponsCrafted;  // 0xA0(0x4)
	int32_t DroneKills;  // 0xA4(0x4)
	int32_t SentryKills;  // 0xA8(0x4)
	int32_t PrisonerKills;  // 0xAC(0x4)
	int32_t PuppetsKnockedOut;  // 0xB0(0x4)
	int32_t Diarrheas;  // 0xB4(0x4)
	int32_t Vomits;  // 0xB8(0x4)
	float DistanceTravelledInVehicle;  // 0xBC(0x4)
	int32_t MushroomsEaten;  // 0xC0(0x4)
	float HighestMuscleMass;  // 0xC4(0x4)
	float HighestFat;  // 0xC8(0x4)
	int32_t HeartAttacks;  // 0xCC(0x4)
	int32_t Overdose;  // 0xD0(0x4)
	int32_t Starvation;  // 0xD4(0x4)
	float HighestDamageTaken;  // 0xD8(0x4)
	float HighestWeightCarried;  // 0xDC(0x4)
	int32_t EventsWon;  // 0xE0(0x4)
	int32_t EventsLost;  // 0xE4(0x4)
	float LowestNegativeFamePoints;  // 0xE8(0x4)
	float DistanceTravelledSwimming;  // 0xEC(0x4)
	int32_t EventsEnemyKills;  // 0xF0(0x4)
	int32_t EventsDeaths;  // 0xF4(0x4)
	int32_t FlagCaptures;  // 0xF8(0x4)
	int32_t CrowsKilled;  // 0xFC(0x4)
	int32_t SeagullsKilled;  // 0x100(0x4)
	int32_t HorsesKilled;  // 0x104(0x4)
	int32_t BoarsKilled;  // 0x108(0x4)
	int32_t BearsKilled;  // 0x10C(0x4)
	int32_t GoatsKilled;  // 0x110(0x4)
	int32_t DeersKilled;  // 0x114(0x4)
	int32_t ChickensKilled;  // 0x118(0x4)
	int32_t RabbitsKilled;  // 0x11C(0x4)
	int32_t DonkeysKilled;  // 0x120(0x4)
	int32_t WolvesKilled;  // 0x124(0x4)
	int32_t TimesMauledByABear;  // 0x128(0x4)
	float LongestAnimalKillDistance;  // 0x12C(0x4)
	int32_t EventTeamKills;  // 0x130(0x4)
	float KillDeathRatio;  // 0x134(0x4)
	float EventsKillDeathRatio;  // 0x138(0x4)
	float AlcoholDrank;  // 0x13C(0x4)
	int32_t FoliageCut;  // 0x140(0x4)
	char pad_324[4];  // 0x144(0x4)
	struct FFishingStats FishingStats;  // 0x148(0x28)
	float DistanceTravelledByBoat;  // 0x170(0x4)
	float DistanceSailed;  // 0x174(0x4)
	int32_t TimesCaughtByShark;  // 0x178(0x4)
	int32_t TimesEscapedSharkBite;  // 0x17C(0x4)
	int32_t LastFamePointAwardConsecutiveDays;  // 0x180(0x4)
	int32_t FirearmKills;  // 0x184(0x4)
	int32_t BareHandedKills;  // 0x188(0x4)
	char pad_396[4];  // 0x18C(0x4)

}; 
// Function ConZ.Prisoner.GetMotionIntensity
// Size: 0x1(Inherited: 0x0) 
struct FGetMotionIntensity
{
	uint8_t  ReturnValue;  // 0x0(0x1)

}; 
// Function ConZ.VoiceChatComponent.GetIsActiveTalker
// Size: 0x1(Inherited: 0x0) 
struct FGetIsActiveTalker
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.FishingStats
// Size: 0x28(Inherited: 0x0) 
struct FFishingStats
{
	int32_t FishCaught;  // 0x0(0x4)
	int32_t FishKept;  // 0x4(0x4)
	int32_t FishReleased;  // 0x8(0x4)
	int32_t LinesBroken;  // 0xC(0x4)
	float HeaviestFishCaught;  // 0x10(0x4)
	float LongestFishCaught;  // 0x14(0x4)
	struct TArray<struct FCaughtFishData> FishSpeciesCaught;  // 0x18(0x10)

}; 
// Function ConZ.ConZCharacter.GetCharacterAction
// Size: 0x8(Inherited: 0x0) 
struct FGetCharacterAction
{
	struct UCharacterAction* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Weapon.SetFiringMode
// Size: 0x1(Inherited: 0x0) 
struct FSetFiringMode
{
	uint8_t  Value;  // 0x0(0x1)

}; 
// Function ConZ.LockpickingWidget.GetDuration
// Size: 0x4(Inherited: 0x0) 
struct FGetDuration
{
	float ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.CaughtFishData
// Size: 0x8(Inherited: 0x0) 
struct FCaughtFishData
{
	uint8_t  FishSpecies;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	int32_t Amount;  // 0x4(0x4)

}; 
// Function ConZ.Weapon.SetMalfunction
// Size: 0x1(Inherited: 0x0) 
struct FSetMalfunction
{
	uint8_t  Type;  // 0x0(0x1)

}; 
// Function ConZ.Weapon.Server_SetBehaviourMode
// Size: 0x1(Inherited: 0x0) 
struct FServer_SetBehaviourMode
{
	uint8_t  mode;  // 0x0(0x1)

}; 
// Function ConZ.ConZPlayerController.Client_SendPackedPlayerLocationsForMap
// Size: 0x20(Inherited: 0x0) 
struct FClient_SendPackedPlayerLocationsForMap
{
	struct TArray<struct AConZPlayerState*> playerStates;  // 0x0(0x10)
	struct TArray<uint32_t> packedMapLocations;  // 0x10(0x10)

}; 
// ScriptStruct ConZ.DamageMultiplier
// Size: 0x4(Inherited: 0x0) 
struct FDamageMultiplier
{
	float Multiplier;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.PrisonerViolation
// Size: 0x10(Inherited: 0x0) 
struct FPrisonerViolation
{
	char pad_0[16];  // 0x0(0x10)

}; 
// Function ConZ.ConZPlayerController.Client_SetCommitSuicideOptionTime
// Size: 0x4(Inherited: 0x0) 
struct FClient_SetCommitSuicideOptionTime
{
	float Time;  // 0x0(0x4)

}; 
// Function ConZ.PhotoModeMainPanel.MoveFocusDown
// Size: 0x10(Inherited: 0x0) 
struct FMoveFocusDown
{
	uint8_t  UINavigation;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct UWidget* ReturnValue;  // 0x8(0x8)

}; 
// ScriptStruct ConZ.TreeCanopyCapsule
// Size: 0x24(Inherited: 0x0) 
struct FTreeCanopyCapsule
{
	struct FVector Center;  // 0x0(0xC)
	struct FRotator Rotation;  // 0xC(0xC)
	float Radius;  // 0x18(0x4)
	float Length;  // 0x1C(0x4)
	float CanopyDensity;  // 0x20(0x4)

}; 
// Function ConZ.ConZPlayerController.Client_SetIsAdmin
// Size: 0x1(Inherited: 0x0) 
struct FClient_SetIsAdmin
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// Function ConZ.PrisonerInventoryComponent.Server_PickupCorpse
// Size: 0x8(Inherited: 0x0) 
struct FServer_PickupCorpse
{
	struct ACorpse* Corpse;  // 0x0(0x8)

}; 
// Function ConZ.ConZPlayerController.Client_SetRespawnOptionTime
// Size: 0x8(Inherited: 0x0) 
struct FClient_SetRespawnOptionTime
{
	uint8_t  option;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float Time;  // 0x4(0x4)

}; 
// Function ConZ.ResourceLockingManager.OnResourceDestroyed
// Size: 0x8(Inherited: 0x0) 
struct FOnResourceDestroyed
{
	struct AActor* Resource;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.GetPenisSkeletalMeshComponent
// Size: 0x8(Inherited: 0x0) 
struct FGetPenisSkeletalMeshComponent
{
	struct USkeletalMeshComponent* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.SimpleAnimalAIController.UpdatePerception
// Size: 0x10(Inherited: 0x0) 
struct FUpdatePerception
{
	struct TArray<struct AActor*> actorsPercepted;  // 0x0(0x10)

}; 
// Function ConZ.ChangeTextWidget.SetMaxNumberOfCharacters
// Size: 0x4(Inherited: 0x0) 
struct FSetMaxNumberOfCharacters
{
	int32_t Value;  // 0x0(0x4)

}; 
// Function ConZ.ConZSquad.CanMemberKickRank
// Size: 0x10(Inherited: 0x0) 
struct FCanMemberKickRank
{
	struct FDbIntegerId UserProfileId;  // 0x0(0x8)
	uint8_t  Rank;  // 0x8(0x1)
	char pad_9_1 : 7;  // 0x9(0x1)
	bool ReturnValue : 1;  // 0x9(0x1)
	char pad_10[6];  // 0xA(0x6)

}; 
// ScriptStruct ConZ.RepairToolItemParams
// Size: 0x58(Inherited: 0x0) 
struct FRepairToolItemParams
{
	struct FGameplayTagContainer RepairableItemTypes;  // 0x0(0x20)
	struct UAkAudioEvent* StartRepairSound;  // 0x20(0x8)
	struct UAkAudioEvent* StopRepairSound;  // 0x28(0x8)
	struct UAnimMontage* StartRepairMontage;  // 0x30(0x8)
	struct UAnimMontage* StopRepairMontage;  // 0x38(0x8)
	float HealthGainPerUseMultiplier;  // 0x40(0x4)
	char pad_68[4];  // 0x44(0x4)
	struct TArray<struct FRequiredRepairingItemTagParams> RequiredRepairingItemTagsParms;  // 0x48(0x10)

}; 
// Function ConZ.ConZPlayerController.Client_SetRespawnWaitTime
// Size: 0x4(Inherited: 0x0) 
struct FClient_SetRespawnWaitTime
{
	float Seconds;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.StaticMeshMaterialPair
// Size: 0x18(Inherited: 0x0) 
struct FStaticMeshMaterialPair
{
	struct UStaticMesh* Mesh;  // 0x0(0x8)
	struct TArray<struct UMaterialInterface*> Materials;  // 0x8(0x10)

}; 
// Function ConZ.ConZPlayerController.ComputeFameLevel
// Size: 0x8(Inherited: 0x0) 
struct FComputeFameLevel
{
	float FamePoints;  // 0x0(0x4)
	int32_t ReturnValue;  // 0x4(0x4)

}; 
// Function ConZ.AudioStatics.SetAkRTPCValue
// Size: 0x18(Inherited: 0x0) 
struct FSetAkRTPCValue
{
	struct FName RTPC;  // 0x0(0x8)
	float Value;  // 0x8(0x4)
	int32_t InterpolationTimeMs;  // 0xC(0x4)
	struct AActor* Actor;  // 0x10(0x8)

}; 
// Function ConZ.PlayerRpcChannel.ResourceLockingManager_Server_UnlockIntersectingAreas
// Size: 0x1C(Inherited: 0x0) 
struct FResourceLockingManager_Server_UnlockIntersectingAreas
{
	struct FBox Area;  // 0x0(0x1C)

}; 
// Function ConZ.Prisoner.GetUserProfile
// Size: 0x8(Inherited: 0x0) 
struct FGetUserProfile
{
	struct UUserProfile* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.MapHUDObject
// Size: 0x18(Inherited: 0x0) 
struct FMapHUDObject
{
	char pad_0[8];  // 0x0(0x8)
	int32_t _priority;  // 0x8(0x4)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool _showText : 1;  // 0xC(0x1)
	char pad_13_1 : 7;  // 0xD(0x1)
	bool _showMarkers : 1;  // 0xD(0x1)
	char pad_14[10];  // 0xE(0xA)

}; 
// Function ConZ.Prisoner.IsPostFreeLookControllerRotationBlendActive
// Size: 0x1(Inherited: 0x0) 
struct FIsPostFreeLookControllerRotationBlendActive
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.ConZMapLocationProperties
// Size: 0x4(Inherited: 0x0) 
struct FConZMapLocationProperties
{
	char pad_0[4];  // 0x0(0x4)

}; 
// Function ConZ.PrisonerMovementComponent.NetMulticast_SetDesiredFallingPose
// Size: 0x2(Inherited: 0x0) 
struct FNetMulticast_SetDesiredFallingPose
{
	uint8_t  Pose;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool force : 1;  // 0x1(0x1)

}; 
// Function ConZ.ConZPlayerController.GetAchievementsManagerClient
// Size: 0x8(Inherited: 0x0) 
struct FGetAchievementsManagerClient
{
	struct AAchievementsManagerClient* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.GetLeanAmount
// Size: 0x4(Inherited: 0x0) 
struct FGetLeanAmount
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Chainsaw.GetUseFuelUsagePerHourMultiplierWhenActive
// Size: 0x1(Inherited: 0x0) 
struct FGetUseFuelUsagePerHourMultiplierWhenActive
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.ConZPlayerController.GetCameraManager
// Size: 0x8(Inherited: 0x0) 
struct FGetCameraManager
{
	struct AConZCameraManager* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Vehicle.GetItemContainer
// Size: 0x8(Inherited: 0x0) 
struct FGetItemContainer
{
	struct AVehicleItemContainer* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.BurnPointDamageEvent
// Size: 0xB8(Inherited: 0xB0) 
struct FBurnPointDamageEvent : public FScumPointDamageEvent
{
	char pad_176[8];  // 0xB0(0x8)

}; 
// Function ConZ.ConZPlayerController.GetCommitSuicideOptionTimeLeft
// Size: 0x4(Inherited: 0x0) 
struct FGetCommitSuicideOptionTimeLeft
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.ConZPlayerController.GetDialogueManager
// Size: 0x8(Inherited: 0x0) 
struct FGetDialogueManager
{
	struct AMissionDialogueManager* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.MissionManager.Client_SendMissionInvitation
// Size: 0x10(Inherited: 0x0) 
struct FClient_SendMissionInvitation
{
	struct AMissionManager* manager;  // 0x0(0x8)
	struct AMission* Mission;  // 0x8(0x8)

}; 
// Function ConZ.ConZPlayerController.GetFameLevel
// Size: 0x4(Inherited: 0x0) 
struct FGetFameLevel
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.ConZPlayerController.GetFameMultiplier
// Size: 0x4(Inherited: 0x0) 
struct FGetFameMultiplier
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.Server_RespawnAtCommonSpawnLocation
// Size: 0xC(Inherited: 0x0) 
struct FServer_RespawnAtCommonSpawnLocation
{
	uint8_t  commonSpawnLocation;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	struct FSectorId SectorId;  // 0x4(0x8)

}; 
// Function ConZ.Prisoner.CanOpenTabMode
// Size: 0x2(Inherited: 0x0) 
struct FCanOpenTabMode
{
	uint8_t  mode;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool ReturnValue : 1;  // 0x1(0x1)

}; 
// ScriptStruct ConZ.ObjectiveDataGroup
// Size: 0x18(Inherited: 0x0) 
struct FObjectiveDataGroup
{
	struct TArray<struct TSoftClassPtr<UObject>> RewardItems;  // 0x0(0x10)
	float RewardFamePoints;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function ConZ.PrisonerInventoryComponent.RemoveStolenItemOnServer
// Size: 0x10(Inherited: 0x0) 
struct FRemoveStolenItemOnServer
{
	struct APrisoner* stolenPrisoner;  // 0x0(0x8)
	struct AItem* Item;  // 0x8(0x8)

}; 
// Function ConZ.UserProfile.GetFamePoints
// Size: 0x4(Inherited: 0x0) 
struct FGetFamePoints
{
	float ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.BasicPrisonerBodySymptomNotificationParameters
// Size: 0x28(Inherited: 0x0) 
struct FBasicPrisonerBodySymptomNotificationParameters
{
	struct FFloatRange SeverityRange;  // 0x0(0x10)
	UNotificationDescription* Notification;  // 0x10(0x8)
	int32_t MaxNumTriggers;  // 0x18(0x4)
	struct FFloatInterval TriggerInterval;  // 0x1C(0x8)
	char pad_36[4];  // 0x24(0x4)

}; 
// ScriptStruct ConZ.DropZoneParameters
// Size: 0x2C(Inherited: 0x0) 
struct FDropZoneParameters
{
	float IntroAnnouncementDelay;  // 0x0(0x4)
	float WarmupPhaseDuration;  // 0x4(0x4)
	float CrateDropDuration;  // 0x8(0x4)
	float SearchPhaseTimeLimit;  // 0xC(0x4)
	float CargoDropDuration;  // 0x10(0x4)
	float CapturePhaseTimeLimit;  // 0x14(0x4)
	float CargoOpeningDuration;  // 0x18(0x4)
	char pad_28_1 : 7;  // 0x1C(0x1)
	bool SkipKeyPhase : 1;  // 0x1C(0x1)
	char pad_29[3];  // 0x1D(0x3)
	struct FGameEventRewardPoints PointsPerActivation;  // 0x20(0xC)

}; 
// Function ConZ.ConZPlayerController.GetGameEventCooldown
// Size: 0x4(Inherited: 0x0) 
struct FGetGameEventCooldown
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.ConZPlayerController.GetUserProfileId
// Size: 0x8(Inherited: 0x0) 
struct FGetUserProfileId
{
	struct FDbIntegerId ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.ConZPlayerController.GetMissionDialogueManager
// Size: 0x8(Inherited: 0x0) 
struct FGetMissionDialogueManager
{
	struct AMissionDialogueManager* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.InteractionComponent.CutObjectOnServer
// Size: 0x28(Inherited: 0x0) 
struct FCutObjectOnServer
{
	struct AActor* Actor;  // 0x0(0x8)
	struct UMeshComponent* MeshComponent;  // 0x8(0x8)
	struct FMeshInstanceId InstanceId;  // 0x10(0x8)
	struct FVector Location;  // 0x18(0xC)
	char pad_36_1 : 7;  // 0x24(0x1)
	bool collectOnly : 1;  // 0x24(0x1)
	char pad_37[3];  // 0x25(0x3)

}; 
// Function ConZ.ConZPlayerController.GetNoiseEmitterComponent
// Size: 0x8(Inherited: 0x0) 
struct FGetNoiseEmitterComponent
{
	struct UPawnNoiseEmitterComponent* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.Bandages
// Size: 0x18(Inherited: 0x0) 
struct FBandages
{
	float _amount;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct TArray<struct FBandage> _bandages;  // 0x8(0x10)

}; 
// Function ConZ.ConZPlayerController.GetPlayerRpcChannel
// Size: 0x8(Inherited: 0x0) 
struct FGetPlayerRpcChannel
{
	struct UPlayerRpcChannel* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.SetNightVisionEnabled
// Size: 0x1(Inherited: 0x0) 
struct FSetNightVisionEnabled
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.CharacterHeadImpactSoundData
// Size: 0x28(Inherited: 0x0) 
struct FCharacterHeadImpactSoundData
{
	struct TArray<uint8_t > ImpactSourceCategories;  // 0x0(0x10)
	struct TArray<uint8_t > ImpactTargetCategories;  // 0x10(0x10)
	struct FCharacterImpactSounds Sounds;  // 0x20(0x8)

}; 
// Function ConZ.Prisoner.SetDesiredLeanAmount
// Size: 0x4(Inherited: 0x0) 
struct FSetDesiredLeanAmount
{
	float Value;  // 0x0(0x4)

}; 
// Function ConZ.PrisonerInventoryComponent.GetMaxHairLength
// Size: 0x8(Inherited: 0x0) 
struct FGetMaxHairLength
{
	uint8_t  Gender;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float ReturnValue;  // 0x4(0x4)

}; 
// Function ConZ.ConZPlayerController.GetPrisoner
// Size: 0x8(Inherited: 0x0) 
struct FGetPrisoner
{
	struct APrisoner* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Weapon.GetFiringMode
// Size: 0x1(Inherited: 0x0) 
struct FGetFiringMode
{
	uint8_t  ReturnValue;  // 0x0(0x1)

}; 
// Function ConZ.ConZPlayerController.GetRespawnOptionTimeLeft
// Size: 0x8(Inherited: 0x0) 
struct FGetRespawnOptionTimeLeft
{
	uint8_t  option;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float ReturnValue;  // 0x4(0x4)

}; 
// Function ConZ.WeaponActionSequence.CanInterrupt
// Size: 0x1(Inherited: 0x0) 
struct FCanInterrupt
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.ConZPlayerController.GetRespawnWaitTime
// Size: 0x4(Inherited: 0x0) 
struct FGetRespawnWaitTime
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.GetServerUserProfileId
// Size: 0x8(Inherited: 0x0) 
struct FGetServerUserProfileId
{
	struct FDbIntegerId ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.ReplenishableResourceDescription
// Size: 0x88(Inherited: 0x0) 
struct FReplenishableResourceDescription
{
	char pad_0[8];  // 0x0(0x8)
	UGameResourceType* Type;  // 0x8(0x8)
	struct FGameplayTagContainer InSocketTypes;  // 0x10(0x20)
	struct FGameplayTagContainer OutSocketTypes;  // 0x30(0x20)
	float PricePerUnit;  // 0x50(0x4)
	char pad_84_1 : 7;  // 0x54(0x1)
	bool IsReplenishedPeriodically : 1;  // 0x54(0x1)
	char pad_85[3];  // 0x55(0x3)
	struct FPeriodicallyReplenishedResourceDescription PeriodicReplenishment;  // 0x58(0x10)
	struct FProximityReplenishedResourceDescription ProximityReplenishment;  // 0x68(0x10)
	char pad_120[16];  // 0x78(0x10)

}; 
// Function ConZ.ConZPlayerController.GetTeleportWorldStreamingLocationChangeDelay
// Size: 0x4(Inherited: 0x0) 
struct FGetTeleportWorldStreamingLocationChangeDelay
{
	float ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.SentryPatrolPoint
// Size: 0x20(Inherited: 0x0) 
struct FSentryPatrolPoint
{
	struct FVector LocationRelativeToSentry;  // 0x0(0xC)
	char pad_12[20];  // 0xC(0x14)

}; 
// Function ConZ.LockProtectionTag.GetTotalDamage
// Size: 0x4(Inherited: 0x0) 
struct FGetTotalDamage
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.GetUserId
// Size: 0x10(Inherited: 0x0) 
struct FGetUserId
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// Function ConZ.ConZPlayerController.GetUserName2
// Size: 0x10(Inherited: 0x0) 
struct FGetUserName2
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// Function ConZ.Prisoner.GetUserProfileName
// Size: 0x10(Inherited: 0x0) 
struct FGetUserProfileName
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// Function ConZ.GameEventScoreboardWidget.CreateMini
// Size: 0x20(Inherited: 0x0) 
struct FCreateMini
{
	struct AGameEventBase* gameEvent;  // 0x0(0x8)
	UGameEventParticipantStatsWidget* statClass;  // 0x8(0x8)
	UGameEventTeamHeaderWidget* teamHeaderClass;  // 0x10(0x8)
	struct UGameEventScoreboardWidget* ReturnValue;  // 0x18(0x8)

}; 
// DelegateFunction ConZ.CraftingRecipeWidget.RecipeSelectedDelegate__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FRecipeSelectedDelegate__DelegateSignature
{
	struct UCraftingRecipeWidget* Widget;  // 0x0(0x8)

}; 
// Function ConZ.ConZPlayerController.InitializePathFollowingComponent
// Size: 0x8(Inherited: 0x0) 
struct FInitializePathFollowingComponent
{
	struct APrisoner* Prisoner;  // 0x0(0x8)

}; 
// Function ConZ.Weapon.SetMakeNoiseLoudness
// Size: 0x1(Inherited: 0x0) 
struct FSetMakeNoiseLoudness
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// Function ConZ.ItemAction.GetItem
// Size: 0x8(Inherited: 0x0) 
struct FGetItem
{
	struct AItem* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.Server_ApplyPointDamage
// Size: 0x90(Inherited: 0x0) 
struct FServer_ApplyPointDamage
{
	float Damage;  // 0x0(0x4)
	struct FHitResult HitResult;  // 0x4(0x88)
	uint8_t  damageChannel;  // 0x8C(0x1)
	char pad_141[3];  // 0x8D(0x3)

}; 
// Function ConZ.Prisoner.NetMulticast_ForceDeluxePlayer
// Size: 0x1(Inherited: 0x0) 
struct FNetMulticast_ForceDeluxePlayer
{
	uint8_t  DeluxeVersion;  // 0x0(0x1)

}; 
// Function ConZ.ConZPlayerController.IsPushToTalkPressed
// Size: 0x1(Inherited: 0x0) 
struct FIsPushToTalkPressed
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.TraderUnsubscribeData
// Size: 0x28(Inherited: 0x0) 
struct FTraderUnsubscribeData
{
	char pad_0[40];  // 0x0(0x28)

}; 
// Function ConZ.Bird2.GetIsLanding
// Size: 0x1(Inherited: 0x0) 
struct FGetIsLanding
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.GameEventScoreboardWidget.GetSelectedIndex
// Size: 0x4(Inherited: 0x0) 
struct FGetSelectedIndex
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.ReplenishableResourceManager.NetMulticast_ReleaseReplenishableResourceSlot
// Size: 0x18(Inherited: 0x0) 
struct FNetMulticast_ReleaseReplenishableResourceSlot
{
	int32_t dataVersion;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct FPackedLocation ID;  // 0x8(0x8)
	int32_t SlotIndex;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function ConZ.Prisoner.IsTeleportInProgress
// Size: 0x1(Inherited: 0x0) 
struct FIsTeleportInProgress
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.MeleeInterface.OnBeingAttackedByMelee
// Size: 0x18(Inherited: 0x0) 
struct FOnBeingAttackedByMelee
{
	struct FAttackedByMeleeData Data;  // 0x0(0x18)

}; 
// Function ConZ.ConZPlayerController.JoinGameEvent
// Size: 0x10(Inherited: 0x0) 
struct FJoinGameEvent
{
	struct AGameEventBase* gameEvent;  // 0x0(0x8)
	int32_t preferredTeam;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// DelegateFunction ConZ.ConZPlayerController.PrisonerSpawnedDelegate__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FPrisonerSpawnedDelegate__DelegateSignature
{
	struct APrisoner* spawnedPrisoner;  // 0x0(0x8)

}; 
// Function ConZ.ConZPlayerController.RegisterRespawn
// Size: 0x1(Inherited: 0x0) 
struct FRegisterRespawn
{
	uint8_t  option;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.Server_PrisonWalletHandleItemSpawning
// Size: 0xC(Inherited: 0x0) 
struct FServer_PrisonWalletHandleItemSpawning
{
	struct FVector Location;  // 0x0(0xC)

}; 
// Function ConZ.ConZGameMode.SendHUDMessageToAll
// Size: 0x18(Inherited: 0x0) 
struct FSendHUDMessageToAll
{
	struct FString Message;  // 0x0(0x10)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool beep : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// Function ConZ.Prisoner.GetPartWetness
// Size: 0x8(Inherited: 0x0) 
struct FGetPartWetness
{
	uint8_t  part;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float ReturnValue;  // 0x4(0x4)

}; 
// Function ConZ.GameEventBase.FindParticipantIndex
// Size: 0x10(Inherited: 0x0) 
struct FFindParticipantIndex
{
	struct APrisoner* Prisoner;  // 0x0(0x8)
	int32_t ReturnValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function ConZ.Prisoner.SetPartWaterWeight
// Size: 0x8(Inherited: 0x0) 
struct FSetPartWaterWeight
{
	uint8_t  part;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float Value;  // 0x4(0x4)

}; 
// ScriptStruct ConZ.EngineeringSkillParametersPerSkillLevel
// Size: 0x20(Inherited: 0x0) 
struct FEngineeringSkillParametersPerSkillLevel
{
	float RepairRadius;  // 0x0(0x4)
	float RepairTimeMultiplier;  // 0x4(0x4)
	float ResultQuality;  // 0x8(0x4)
	float IngredientMultiplier;  // 0xC(0x4)
	float ToolUsageMultiplier;  // 0x10(0x4)
	float FillFuelDurationMultiplier;  // 0x14(0x4)
	float DrainFuelDurationMultiplier;  // 0x18(0x4)
	float ChargeBatteryDurationMultiplier;  // 0x1C(0x4)

}; 
// Function ConZ.ConZPlayerController.SendHUDMessageToClient
// Size: 0x18(Inherited: 0x0) 
struct FSendHUDMessageToClient
{
	struct FString Message;  // 0x0(0x10)
	struct UAkAudioEvent* AudioEvent;  // 0x10(0x8)

}; 
// ScriptStruct ConZ.BurialInformation
// Size: 0x18(Inherited: 0x0) 
struct FBurialInformation
{
	struct FDbIntegerId BurierUserId;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ShouldBury : 1;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)
	struct FVector BurialLocation;  // 0xC(0xC)

}; 
// Function ConZ.ConZPlayerController.Server_HeartbeatResponse
// Size: 0x4(Inherited: 0x0) 
struct FServer_HeartbeatResponse
{
	uint32_t code;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.TriggeredEventData
// Size: 0x10(Inherited: 0x0) 
struct FTriggeredEventData
{
	char pad_0[16];  // 0x0(0x10)

}; 
// Function ConZ.PrisonerMovementComponent.GetDesiredCoursePitchAngle
// Size: 0x4(Inherited: 0x0) 
struct FGetDesiredCoursePitchAngle
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.CalculateRespawnPriceBasedOnSquadSize
// Size: 0xC(Inherited: 0x0) 
struct FCalculateRespawnPriceBasedOnSquadSize
{
	int32_t defaultPrice;  // 0x0(0x4)
	uint8_t  SpawnLocation;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)
	int32_t ReturnValue;  // 0x8(0x4)

}; 
// Function ConZ.ConZPlayerController.Server_JoinGameEvent
// Size: 0x10(Inherited: 0x0) 
struct FServer_JoinGameEvent
{
	struct AGameEventBase* gameEvent;  // 0x0(0x8)
	int32_t preferredTeam;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function ConZ.ConZPlayerController.Server_MountedActorHasBegunPlay
// Size: 0x8(Inherited: 0x0) 
struct FServer_MountedActorHasBegunPlay
{
	struct AActor* Actor;  // 0x0(0x8)

}; 
// Function ConZ.ConZEconomyManager.NetMulticast_UpdateDateVsGoldPriceMasterMultiplierMap
// Size: 0x28(Inherited: 0x0) 
struct FNetMulticast_UpdateDateVsGoldPriceMasterMultiplierMap
{
	int32_t dataVersion;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct TArray<struct FDateTime> dates;  // 0x8(0x10)
	struct TArray<float> multipliers;  // 0x18(0x10)

}; 
// Function ConZ.Prisoner.InventoryComponent_ItemEquipped
// Size: 0x10(Inherited: 0x0) 
struct FInventoryComponent_ItemEquipped
{
	struct UPrisonerInventoryComponent* sender;  // 0x0(0x8)
	struct AItem* Item;  // 0x8(0x8)

}; 
// Function ConZ.ConZPlayerController.Server_ProcessCharacterModificationTransaction
// Size: 0xE8(Inherited: 0x0) 
struct FServer_ProcessCharacterModificationTransaction
{
	int32_t transactionId;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct FCharacterTemplate CharacterTemplate;  // 0x8(0xE0)

}; 
// ScriptStruct ConZ.HitReactDirectionData
// Size: 0x48(Inherited: 0x0) 
struct FHitReactDirectionData
{
	struct TArray<struct FHitReactBodyPartDataItem> FrontHit;  // 0x0(0x10)
	struct TArray<struct FHitReactBodyPartDataItem> LeftHit;  // 0x10(0x10)
	struct TArray<struct FHitReactBodyPartDataItem> BackHit;  // 0x20(0x10)
	struct TArray<struct FHitReactBodyPartDataItem> RightHit;  // 0x30(0x10)
	float RegainControlDurationMultiplier;  // 0x40(0x4)
	char pad_68[4];  // 0x44(0x4)

}; 
// ScriptStruct ConZ.CharacterTemplate
// Size: 0xE0(Inherited: 0x0) 
struct FCharacterTemplate
{
	float Strength;  // 0x0(0x4)
	float Constitution;  // 0x4(0x4)
	float Dexterity;  // 0x8(0x4)
	float Intelligence;  // 0xC(0x4)
	int32_t Age;  // 0x10(0x4)
	uint8_t  Gender;  // 0x14(0x1)
	char pad_21[3];  // 0x15(0x3)
	struct FString Name;  // 0x18(0x10)
	int32_t AppearanceIndex;  // 0x28(0x4)
	int32_t TattooIndex;  // 0x2C(0x4)
	int32_t HairStyleIndex;  // 0x30(0x4)
	int32_t FacialHairStyleIndex;  // 0x34(0x4)
	float BreastSize;  // 0x38(0x4)
	float PenisSize;  // 0x3C(0x4)
	char pad_64_1 : 7;  // 0x40(0x1)
	bool GrowOverTime : 1;  // 0x40(0x1)
	char pad_65[3];  // 0x41(0x3)
	int32_t TeamIndex;  // 0x44(0x4)
	struct FString BirthDate;  // 0x48(0x10)
	struct FString ArrestDate;  // 0x58(0x10)
	struct TArray<struct FSkillTemplate> Skills;  // 0x68(0x10)
	AItem* Item0;  // 0x78(0x8)
	AItem* Item1;  // 0x80(0x8)
	AItem* Item2;  // 0x88(0x8)
	int32_t FaceTypeIndex;  // 0x90(0x4)
	int32_t SkinToneIndex;  // 0x94(0x4)
	int32_t HairColorId;  // 0x98(0x4)
	int32_t FacialHairColorId;  // 0x9C(0x4)
	int32_t EyeColorIndex;  // 0xA0(0x4)
	int32_t IrisTypeIndex;  // 0xA4(0x4)
	struct FLinearColor EyeshadowColor;  // 0xA8(0x10)
	struct FLinearColor EyelinerColor;  // 0xB8(0x10)
	struct FLinearColor LipstickColor;  // 0xC8(0x10)
	char EyeMakeupMetalness;  // 0xD8(0x1)
	char EyeMakeupIntensity;  // 0xD9(0x1)
	char LipstickRoughness;  // 0xDA(0x1)
	char LipstickIntensity;  // 0xDB(0x1)
	char pad_220[4];  // 0xDC(0x4)

}; 
// Function ConZ.SimpleAnimalAIController.OnTakeDamageHandler
// Size: 0x20(Inherited: 0x0) 
struct FOnTakeDamageHandler
{
	struct AActor* damageActor;  // 0x0(0x8)
	float Damage;  // 0x8(0x4)
	struct FVector HitLocation;  // 0xC(0xC)
	struct APawn* eventInstigator;  // 0x18(0x8)

}; 
// Function ConZ.MeleeSkill.GetBlockToIdleBlendDuration
// Size: 0x4(Inherited: 0x0) 
struct FGetBlockToIdleBlendDuration
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Weapon.NotifyMissOnServer
// Size: 0x14(Inherited: 0x0) 
struct FNotifyMissOnServer
{
	struct FVector_NetQuantizeNormal shootDirection;  // 0x0(0xC)
	int32_t randomSeed;  // 0xC(0x4)
	float reticleSpread;  // 0x10(0x4)

}; 
// ScriptStruct ConZ.SkillTemplate
// Size: 0x38(Inherited: 0x0) 
struct FSkillTemplate
{
	uint8_t  Attribute;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct FText Name;  // 0x8(0x18)
	struct FString ClassName;  // 0x20(0x10)
	uint8_t  Level;  // 0x30(0x1)
	char pad_49[3];  // 0x31(0x3)
	float Experience;  // 0x34(0x4)

}; 
// ScriptStruct ConZ.RadioProgramData
// Size: 0x18(Inherited: 0x0) 
struct FRadioProgramData
{
	URadioProgram* ProgramClass;  // 0x0(0x8)
	struct URadioProgram* Program;  // 0x8(0x8)
	float Chance;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function ConZ.InventorySlotUserWidget.OnDraggedItemPreRotated
// Size: 0x8(Inherited: 0x0) 
struct FOnDraggedItemPreRotated
{
	struct UItemWidget2* Widget;  // 0x0(0x8)

}; 
// Function ConZ.ConZPlayerController.Server_RequestGameEventTeamChange
// Size: 0x4(Inherited: 0x0) 
struct FServer_RequestGameEventTeamChange
{
	int32_t preferredTeam;  // 0x0(0x4)

}; 
// Function ConZ.PrisonerAnimInstance.ActivateFacialExpressionOnGameThread
// Size: 0x14(Inherited: 0x0) 
struct FActivateFacialExpressionOnGameThread
{
	uint8_t  facialExpression;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float BlendInDuration;  // 0x4(0x4)
	float Duration;  // 0x8(0x4)
	float BlendOutDuration;  // 0xC(0x4)
	float blendWeightMultiplier;  // 0x10(0x4)

}; 
// Function ConZ.ConZPlayerController.Server_RequestSurvivalStats
// Size: 0x10(Inherited: 0x0) 
struct FServer_RequestSurvivalStats
{
	uint32_t ID;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct FDbIntegerId UserProfileId;  // 0x8(0x8)

}; 
// Function ConZ.ConZPlayerController.Server_SelfKickFromGameSession
// Size: 0x10(Inherited: 0x0) 
struct FServer_SelfKickFromGameSession
{
	struct FString reason;  // 0x0(0x10)

}; 
// Function ConZ.MathStatics.GetRandomPointWithinTwoCircles
// Size: 0x20(Inherited: 0x0) 
struct FGetRandomPointWithinTwoCircles
{
	struct FVector2D centerA;  // 0x0(0x8)
	float radiusA;  // 0x8(0x4)
	struct FVector2D centerB;  // 0xC(0x8)
	float radiusB;  // 0x14(0x4)
	struct FVector2D ReturnValue;  // 0x18(0x8)

}; 
// Function ConZ.ConZPlayerController.Server_SetRefreshPawnLocationForMap
// Size: 0x1(Inherited: 0x0) 
struct FServer_SetRefreshPawnLocationForMap
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// Function ConZ.KillBoxTimerWidget.SetTime
// Size: 0x8(Inherited: 0x0) 
struct FSetTime
{
	int32_t Minutes;  // 0x0(0x4)
	int32_t Seconds;  // 0x4(0x4)

}; 
// ScriptStruct ConZ.PrisonerNearbyFoliageInstanceInfoReplicated
// Size: 0x10(Inherited: 0x0) 
struct FPrisonerNearbyFoliageInstanceInfoReplicated
{
	struct TWeakObjectPtr<UInstancedStaticMeshComponent> InstancedMeshComponent;  // 0x0(0x8)
	struct FPackedLocation PackedLocation;  // 0x8(0x8)

}; 
// ScriptStruct ConZ.ConsumableSave
// Size: 0x100(Inherited: 0x0) 
struct FConsumableSave
{
	float MassToConsume;  // 0x0(0x4)
	float ConsumptionDuration;  // 0x4(0x4)
	float Density;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)
	struct FSubstancesData Substances;  // 0x10(0xD0)
	struct TArray<struct FString> ForeignSubstanceClasses;  // 0xE0(0x10)
	struct TArray<char> UserData;  // 0xF0(0x10)

}; 
// Function ConZ.PrisonerHUD.GetHUDMode
// Size: 0x1(Inherited: 0x0) 
struct FGetHUDMode
{
	uint8_t  ReturnValue;  // 0x0(0x1)

}; 
// Function ConZ.ConZPlayerController.SetCurrencyBalanceRep
// Size: 0x10(Inherited: 0x0) 
struct FSetCurrencyBalanceRep
{
	uint8_t  CurrencyType;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	int64_t currencyBalance;  // 0x8(0x8)

}; 
// Function ConZ.MicInputIndicator.IsPushToTalkEnabled
// Size: 0x1(Inherited: 0x0) 
struct FIsPushToTalkEnabled
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.GetLastCorpse
// Size: 0x8(Inherited: 0x0) 
struct FGetLastCorpse
{
	struct ACorpse* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.PhysicalSurfaceVehicleTireParticleData
// Size: 0x10(Inherited: 0x0) 
struct FPhysicalSurfaceVehicleTireParticleData
{
	struct UParticleSystem* ParticleTrail;  // 0x0(0x8)
	struct UParticleSystem* ParticleWave;  // 0x8(0x8)

}; 
// Function ConZ.ConZPlayerController.SetRespawnOptionTime
// Size: 0xC(Inherited: 0x0) 
struct FSetRespawnOptionTime
{
	uint8_t  option;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float Time;  // 0x4(0x4)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool force : 1;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)

}; 
// ScriptStruct ConZ.BankATMCarouselCardStateVisual
// Size: 0x10(Inherited: 0x0) 
struct FBankATMCarouselCardStateVisual
{
	struct FMargin Padding;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.VehicleAttachmentWheelSetup
// Size: 0x44(Inherited: 0x0) 
struct FVehicleAttachmentWheelSetup
{
	float Radius;  // 0x0(0x4)
	float SteeringAngle;  // 0x4(0x4)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ApplyTorque : 1;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)
	float BrakeStrengthMultiplier;  // 0xC(0x4)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ApplyHandbrake : 1;  // 0x10(0x1)
	char pad_17[3];  // 0x11(0x3)
	float SuspensionLength;  // 0x14(0x4)
	float SuspensionStrength;  // 0x18(0x4)
	float SuspensionDamping;  // 0x1C(0x4)
	float SuspensionRestLength;  // 0x20(0x4)
	float SuspensionAngle;  // 0x24(0x4)
	struct FName SteeringBoneName;  // 0x28(0x8)
	struct FName SuspensionBoneName;  // 0x30(0x8)
	float MinWobbleAngleDeg;  // 0x38(0x4)
	float MaxWobbleAngleDeg;  // 0x3C(0x4)
	char pad_64_1 : 7;  // 0x40(0x1)
	bool ShouldSpawnParticles : 1;  // 0x40(0x1)
	char pad_65[3];  // 0x41(0x3)

}; 
// ScriptStruct ConZ.TargetTypeDamageMultiplier
// Size: 0x10(Inherited: 0x0) 
struct FTargetTypeDamageMultiplier
{
	struct TArray<struct FDamageMultiplier> _multipliers;  // 0x0(0x10)

}; 
// Function ConZ.ConZPlayerController.SetTeleportWorldStreamingLocationChangeDelay
// Size: 0x4(Inherited: 0x0) 
struct FSetTeleportWorldStreamingLocationChangeDelay
{
	float Value;  // 0x0(0x4)

}; 
// Function ConZ.Zombie2.GoToRagdoll
// Size: 0x8(Inherited: 0x0) 
struct FGoToRagdoll
{
	struct FZombieRagdollAutoRecovery autoRecovery;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.DamageMultiplierTracker
// Size: 0x28(Inherited: 0x0) 
struct FDamageMultiplierTracker
{
	float _baseDamage;  // 0x0(0x4)
	float _finalDamage;  // 0x4(0x4)
	struct TArray<struct FString> _appliedMultiplierNames;  // 0x8(0x10)
	struct TArray<float> _appliedMultiplierValues;  // 0x18(0x10)

}; 
// ScriptStruct ConZ.PrisonerNearbyFoliageInfo
// Size: 0x10(Inherited: 0x0) 
struct FPrisonerNearbyFoliageInfo
{
	struct TArray<struct FPrisonerNearbyFoliageInstanceInfo> InstancesInfo;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.AerodynamicSurfaceControlData
// Size: 0x18(Inherited: 0x0) 
struct FAerodynamicSurfaceControlData
{
	struct TArray<char> Indices;  // 0x0(0x10)
	float MaxHealth;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function ConZ.ConZPlayerController.ShowKillFeedNotificationOnClient
// Size: 0x38(Inherited: 0x0) 
struct FShowKillFeedNotificationOnClient
{
	struct FString prefix;  // 0x0(0x10)
	struct FString characterName;  // 0x10(0x10)
	struct FString suffix;  // 0x20(0x10)
	char pad_48_1 : 7;  // 0x30(0x1)
	bool ping : 1;  // 0x30(0x1)
	char pad_49[7];  // 0x31(0x7)

}; 
// Function ConZ.GameEventBase.GetCardWidget
// Size: 0x8(Inherited: 0x0) 
struct FGetCardWidget
{
	struct UGameEventCardWidget* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.BaseInteractionParams
// Size: 0x8(Inherited: 0x0) 
struct FBaseInteractionParams
{
	struct FDbIntegerId ElementID;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.BankTransactionRequestData
// Size: 0x38(Inherited: 0x0) 
struct FBankTransactionRequestData
{
	char pad_0[56];  // 0x0(0x38)

}; 
// Function ConZ.ConZPlayerController.ShowLevelUpMessage
// Size: 0x10(Inherited: 0x0) 
struct FShowLevelUpMessage
{
	struct USkill* Skill;  // 0x0(0x8)
	uint8_t  skillLevel;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.Prisoner.HasHandBondage
// Size: 0x1(Inherited: 0x0) 
struct FHasHandBondage
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.CustomZoneDisplayData
// Size: 0x40(Inherited: 0x0) 
struct FCustomZoneDisplayData
{
	struct FString Value;  // 0x0(0x10)
	struct FText Name;  // 0x10(0x18)
	struct FText Description;  // 0x28(0x18)

}; 
// ScriptStruct ConZ.SplineDescription
// Size: 0x30(Inherited: 0x0) 
struct FSplineDescription
{
	struct USplineComponent* SplineComponent;  // 0x0(0x8)
	struct TArray<struct USplineMeshComponent*> SplineMeshComponents;  // 0x8(0x10)
	struct UStaticMeshComponent* SplineStartConnector;  // 0x18(0x8)
	struct UStaticMeshComponent* SplineEndConnector;  // 0x20(0x8)
	char pad_40[8];  // 0x28(0x8)

}; 
// Function ConZ.ConZPlayerController.ShowLevelUpMessageFromClass
// Size: 0x10(Inherited: 0x0) 
struct FShowLevelUpMessageFromClass
{
	USkill* skillClass;  // 0x0(0x8)
	uint8_t  skillLevel;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.ConZPlayerController.ShowWarningMessage
// Size: 0x28(Inherited: 0x0) 
struct FShowWarningMessage
{
	struct FString Message;  // 0x0(0x10)
	float Duration;  // 0x10(0x4)
	struct FLinearColor TextColor;  // 0x14(0x10)
	char pad_36[4];  // 0x24(0x4)

}; 
// ScriptStruct ConZ.ElementQueryMarker
// Size: 0x40(Inherited: 0x0) 
struct FElementQueryMarker
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Include : 1;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	UModularBaseBuildingSocketType* SocketClass;  // 0x8(0x8)
	struct FTransform Transform;  // 0x10(0x30)

}; 
// Function ConZ.PrisonerInventoryComponent.UnEquipClothesItemOnServer
// Size: 0x10(Inherited: 0x0) 
struct FUnEquipClothesItemOnServer
{
	struct AClothesItem* Item;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool placeInInventory : 1;  // 0x8(0x1)
	char pad_9_1 : 7;  // 0x9(0x1)
	bool shouldEverDrop : 1;  // 0x9(0x1)
	char pad_10[6];  // 0xA(0x6)

}; 
// Function ConZ.Prisoner.NetMulticast_SetActiveParachute
// Size: 0x8(Inherited: 0x0) 
struct FNetMulticast_SetActiveParachute
{
	struct AClothesItem* Parachute;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.OnPlaceableDestroyed
// Size: 0x8(Inherited: 0x0) 
struct FOnPlaceableDestroyed
{
	struct AActor* Actor;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.Teleport
// Size: 0x1C(Inherited: 0x0) 
struct FTeleport
{
	struct FPrisonerTeleportRequest request;  // 0x0(0x1C)

}; 
// ScriptStruct ConZ.HitReactBodyPartDataItem
// Size: 0x18(Inherited: 0x0) 
struct FHitReactBodyPartDataItem
{
	struct UAnimMontage* MontageToPlay;  // 0x0(0x8)
	struct UAnimMontage* FollowupMontage;  // 0x8(0x8)
	float RegainControlDurationMultiplier;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// ScriptStruct ConZ.RangedWeaponSkillParametersPerSkillLevel
// Size: 0x4(Inherited: 0x0) 
struct FRangedWeaponSkillParametersPerSkillLevel
{
	float CrosshairHidingDuration;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.ClimbableObstacleInfo
// Size: 0x88(Inherited: 0x0) 
struct FClimbableObstacleInfo
{
	struct FVector EdgeLocationZero;  // 0x0(0xC)
	float EdgeHeight;  // 0xC(0x4)
	struct FVector HWallNormal;  // 0x10(0xC)
	struct FVector VWallNormal;  // 0x1C(0xC)
	struct FVector CapsuleLocationAtAnchorZero;  // 0x28(0xC)
	struct FRotator CapsuleRotationAtAnchor;  // 0x34(0xC)
	struct TWeakObjectPtr<UPrimitiveComponent> BaseComponent;  // 0x40(0x8)
	struct FPrisonerClimbAnimationInfo AnimationInfo;  // 0x48(0x40)

}; 
// ScriptStruct ConZ.TeleportRequest
// Size: 0x28(Inherited: 0x0) 
struct FTeleportRequest
{
	struct TWeakObjectPtr<AActor> Subject;  // 0x0(0x8)
	struct FVector TargetLocation;  // 0x8(0xC)
	struct FRotator TargetRotation;  // 0x14(0xC)
	struct TWeakObjectPtr<UTeleportUserData> UserData;  // 0x20(0x8)

}; 
// ScriptStruct ConZ.RoomDefinition
// Size: 0x20(Inherited: 0x0) 
struct FRoomDefinition
{
	struct ADoor* RoomDoor;  // 0x0(0x8)
	struct UStaticMeshComponent* Locker;  // 0x8(0x8)
	struct AKillBoxC4SpawnPoint* C4;  // 0x10(0x8)
	char pad_24[8];  // 0x18(0x8)

}; 
// Function ConZ.Prisoner.GetBodySimulation
// Size: 0x8(Inherited: 0x0) 
struct FGetBodySimulation
{
	struct UPrisonerBodySimulationComponent* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.ConZCharacter.ActorHitCallback
// Size: 0xA8(Inherited: 0x0) 
struct FActorHitCallback
{
	struct AActor* Actor;  // 0x0(0x8)
	struct AActor* OtherActor;  // 0x8(0x8)
	struct FVector NormalImpulse;  // 0x10(0xC)
	struct FHitResult Hit;  // 0x1C(0x88)
	char pad_164[4];  // 0xA4(0x4)

}; 
// Function ConZ.ConZCharacter.Client_RequestCharacterAction
// Size: 0x20(Inherited: 0x0) 
struct FClient_RequestCharacterAction
{
	struct FCharacterActionReplicationHelper Value;  // 0x0(0x18)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool cancelExecutingAction : 1;  // 0x18(0x1)
	char pad_25[7];  // 0x19(0x7)

}; 
// ScriptStruct ConZ.ConZDimensionRow
// Size: 0x20(Inherited: 0x8) 
struct FConZDimensionRow : public FTableRowBase
{
	float Value;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)
	struct FString Description;  // 0x10(0x10)

}; 
// Function ConZ.PlayerRpcChannel.ScopeableItemComponent_Server_SetCurrentZoomLevel
// Size: 0x10(Inherited: 0x0) 
struct FScopeableItemComponent_Server_SetCurrentZoomLevel
{
	struct UScopeableItemComponent* comp;  // 0x0(0x8)
	int32_t Value;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// ScriptStruct ConZ.CharacterActionReplicationHelper
// Size: 0x18(Inherited: 0x0) 
struct FCharacterActionReplicationHelper
{
	char pad_0[24];  // 0x0(0x18)

}; 
// Function ConZ.Prisoner.NetMulticast_SpawnDefecationEffects
// Size: 0x2(Inherited: 0x0) 
struct FNetMulticast_SpawnDefecationEffects
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool shouldBeDiarrhea : 1;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool isForced : 1;  // 0x1(0x1)

}; 
// ScriptStruct ConZ.ConZPlacementQueryParams
// Size: 0x28(Inherited: 0x0) 
struct FConZPlacementQueryParams
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool IsSnapping : 1;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool MustBePlacedOnFoundations : 1;  // 0x1(0x1)
	char pad_2_1 : 7;  // 0x2(0x1)
	bool CanEverBePlacedOnFoundations : 1;  // 0x2(0x1)
	char pad_3_1 : 7;  // 0x3(0x1)
	bool CanBePlacedOnOtherBaseElements : 1;  // 0x3(0x1)
	char pad_4[4];  // 0x4(0x4)
	struct APrisoner* User;  // 0x8(0x8)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool CanBePlacedWithoutFlag : 1;  // 0x10(0x1)
	char pad_17_1 : 7;  // 0x11(0x1)
	bool CanBePlacedInBuilding : 1;  // 0x11(0x1)
	char pad_18_1 : 7;  // 0x12(0x1)
	bool CanBePlacedInRestrictedArea : 1;  // 0x12(0x1)
	char pad_19[1];  // 0x13(0x1)
	int32_t MaxInstancesPerFlagArea;  // 0x14(0x4)
	UObject* ClassToSpawn;  // 0x18(0x8)
	char pad_32_1 : 7;  // 0x20(0x1)
	bool IgnoreDisabledBaseBuildingFlag : 1;  // 0x20(0x1)
	char pad_33[7];  // 0x21(0x7)

}; 
// ScriptStruct ConZ.CharacterSpawnerData
// Size: 0x10(Inherited: 0x0) 
struct FCharacterSpawnerData
{
	struct TArray<APawn*> CharacterClasses;  // 0x0(0x10)

}; 
// Function ConZ.NetworkStatics.SetComponentNetAddressable
// Size: 0x8(Inherited: 0x0) 
struct FSetComponentNetAddressable
{
	struct UActorComponent* Component;  // 0x0(0x8)

}; 
// Function ConZ.ConZCharacter.GetBodyPartFromBoneName
// Size: 0xC(Inherited: 0x0) 
struct FGetBodyPartFromBoneName
{
	struct FName BoneName;  // 0x0(0x8)
	uint8_t  ReturnValue;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)

}; 
// Function ConZ.Prisoner.GetCollidingNearbyFoliageInfo
// Size: 0x10(Inherited: 0x0) 
struct FGetCollidingNearbyFoliageInfo
{
	struct FPrisonerNearbyFoliageInfo ReturnValue;  // 0x0(0x10)

}; 
// Function ConZ.ConZCharacter.GetEnvironmentDescription
// Size: 0x3(Inherited: 0x0) 
struct FGetEnvironmentDescription
{
	struct FEnvironmentDescription ReturnValue;  // 0x0(0x3)

}; 
// Function ConZ.ResourceLockingManager.NetMulticast_RemoveAreaLocks
// Size: 0x18(Inherited: 0x0) 
struct FNetMulticast_RemoveAreaLocks
{
	int32_t dataVersion;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct TArray<struct FAreaResourceLockNetwork> Locks;  // 0x8(0x10)

}; 
// Function ConZ.PlayerRpcChannel.Notifications_RequestNotification
// Size: 0x18(Inherited: 0x0) 
struct FNotifications_RequestNotification
{
	struct FNotificationDescriptionReplicationHelper Description;  // 0x0(0x18)

}; 
// ScriptStruct ConZ.CorpseSkeletalMeshRepData
// Size: 0x70(Inherited: 0x0) 
struct FCorpseSkeletalMeshRepData
{
	struct FName DisplayName;  // 0x0(0x8)
	struct USkeletalMesh* Mesh;  // 0x8(0x8)
	struct TArray<struct UMaterialInterface*> Materials;  // 0x10(0x10)
	char pad_32_1 : 7;  // 0x20(0x1)
	bool Visibility : 1;  // 0x20(0x1)
	char pad_33[15];  // 0x21(0xF)
	struct FTransform Transform;  // 0x30(0x30)
	struct FName AttachSocket;  // 0x60(0x8)
	char pad_104[8];  // 0x68(0x8)

}; 
// Function ConZ.Vehicle.GetNumVehicleDoorWindows
// Size: 0x4(Inherited: 0x0) 
struct FGetNumVehicleDoorWindows
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.PlayerRpcChannel.BaseBuilding_Server_RequestElementStateUpdate
// Size: 0x10(Inherited: 0x0) 
struct FBaseBuilding_Server_RequestElementStateUpdate
{
	struct FVector Location;  // 0x0(0xC)
	float areaSize;  // 0xC(0x4)

}; 
// ScriptStruct ConZ.EnvironmentDescription
// Size: 0x3(Inherited: 0x0) 
struct FEnvironmentDescription
{
	uint8_t  EnvironmentClass;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool IsUnderground : 1;  // 0x1(0x1)
	char pad_2_1 : 7;  // 0x2(0x1)
	bool ShouldBlockWeatherEffects : 1;  // 0x2(0x1)

}; 
// ScriptStruct ConZ.LegalTender
// Size: 0x8(Inherited: 0x0) 
struct FLegalTender
{
	int32_t Amount;  // 0x0(0x4)
	uint8_t  Currency;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)

}; 
// ScriptStruct ConZ.BuildingsReplicationHelper
// Size: 0x70(Inherited: 0x0) 
struct FBuildingsReplicationHelper
{
	struct TMap<struct FString, struct FBuildingData> BuildingsData;  // 0x0(0x50)
	char pad_80[32];  // 0x50(0x20)

}; 
// Function ConZ.Prisoner.GetClampedDesiredPace
// Size: 0x1(Inherited: 0x0) 
struct FGetClampedDesiredPace
{
	uint8_t  ReturnValue;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.MissionReward
// Size: 0x18(Inherited: 0x0) 
struct FMissionReward
{
	struct TArray<AItem*> RewardItems;  // 0x0(0x10)
	float RewardFamePoints;  // 0x10(0x4)
	char pad_20_1 : 7;  // 0x14(0x1)
	bool RewardReceived : 1;  // 0x14(0x1)
	char pad_21[3];  // 0x15(0x3)

}; 
// Function ConZ.ConZCharacter.GetGender
// Size: 0x1(Inherited: 0x0) 
struct FGetGender
{
	uint8_t  ReturnValue;  // 0x0(0x1)

}; 
// Function ConZ.LadderMarkersReplicator.NetMulticast_UnregisterLadderMarker
// Size: 0xB0(Inherited: 0x0) 
struct FNetMulticast_UnregisterLadderMarker
{
	int32_t dataVersion;  // 0x0(0x4)
	char pad_4[12];  // 0x4(0xC)
	struct FLadderMarker marker;  // 0x10(0xA0)

}; 
// Function ConZ.ConZCharacter.GetHitReactBodyPartFromBodyPart
// Size: 0x2(Inherited: 0x0) 
struct FGetHitReactBodyPartFromBodyPart
{
	uint8_t  Value;  // 0x0(0x1)
	uint8_t  ReturnValue;  // 0x1(0x1)

}; 
// ScriptStruct ConZ.LadderMarker
// Size: 0xA0(Inherited: 0x0) 
struct FLadderMarker
{
	struct FTransform FirstStep;  // 0x0(0x30)
	struct FVector LastStep;  // 0x30(0xC)
	char pad_60[4];  // 0x3C(0x4)
	struct FTransform Edge;  // 0x40(0x30)
	struct FVector CapsuleBias;  // 0x70(0xC)
	float StepHeight;  // 0x7C(0x4)
	float StepWidth;  // 0x80(0x4)
	float HitDetectionExtraAboveLastStep;  // 0x84(0x4)
	float HitDetectionExtraBelowFirstStep;  // 0x88(0x4)
	float HitDetectionExtraOnTheSides;  // 0x8C(0x4)
	char pad_144_1 : 7;  // 0x90(0x1)
	bool HasEdge : 1;  // 0x90(0x1)
	char pad_145_1 : 7;  // 0x91(0x1)
	bool IsNarrow : 1;  // 0x91(0x1)
	char EPhysicalSurface PhysicalSurfaceForSounds;  // 0x92(0x1)
	char pad_147[13];  // 0x93(0xD)

}; 
// Function ConZ.PrisonerMovementComponent.GetMaxAllowedPace
// Size: 0x1(Inherited: 0x0) 
struct FGetMaxAllowedPace
{
	uint8_t  ReturnValue;  // 0x0(0x1)

}; 
// Function ConZ.User.SetLastDirectConnectionAddress
// Size: 0x10(Inherited: 0x0) 
struct FSetLastDirectConnectionAddress
{
	struct FString Value;  // 0x0(0x10)

}; 
// Function ConZ.Weapon.GetLiveAmmoCount
// Size: 0x4(Inherited: 0x0) 
struct FGetLiveAmmoCount
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.SharkAnimInstance.IsAlive
// Size: 0x1(Inherited: 0x0) 
struct FIsAlive
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.WindowMarkerModifier
// Size: 0x8(Inherited: 0x0) 
struct FWindowMarkerModifier
{
	int32_t Index;  // 0x0(0x4)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool IsVaultable : 1;  // 0x4(0x1)
	char pad_5_1 : 7;  // 0x5(0x1)
	bool IsFortifiable : 1;  // 0x5(0x1)
	char pad_6[2];  // 0x6(0x2)

}; 
// Function ConZ.ConZCharacter.GetHitReactBodyPartFromHitResult
// Size: 0x8C(Inherited: 0x0) 
struct FGetHitReactBodyPartFromHitResult
{
	struct FHitResult HitResult;  // 0x0(0x88)
	uint8_t  ReturnValue;  // 0x88(0x1)
	char pad_137[3];  // 0x89(0x3)

}; 
// Function ConZ.Prisoner.Client_ActivateIntroCinematic
// Size: 0x4(Inherited: 0x0) 
struct FClient_ActivateIntroCinematic
{
	float initialAltitude;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.CombinationLockGetCombinationRequestData
// Size: 0x14(Inherited: 0x0) 
struct FCombinationLockGetCombinationRequestData
{
	char pad_0[20];  // 0x0(0x14)

}; 
// Function ConZ.UIStatics.GetDesiredWidgetClass
// Size: 0x10(Inherited: 0x0) 
struct FGetDesiredWidgetClass
{
	uint8_t  Type;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	UUserWidget* ReturnValue;  // 0x8(0x8)

}; 
// Function ConZ.PrisonerMovementComponent.DetectLadderDisembarkLocation
// Size: 0xD0(Inherited: 0x0) 
struct FDetectLadderDisembarkLocation
{
	struct FLadderInfo LadderInfo;  // 0x0(0xB0)
	struct FVector newCapsuleLocation;  // 0xB0(0xC)
	struct FRotator newCapsuleRotation;  // 0xBC(0xC)
	char pad_200_1 : 7;  // 0xC8(0x1)
	bool ReturnValue : 1;  // 0xC8(0x1)
	char pad_201[7];  // 0xC9(0x7)

}; 
// ScriptStruct ConZ.DrivingSkillEngineStallingParameters
// Size: 0x40(Inherited: 0x0) 
struct FDrivingSkillEngineStallingParameters
{
	float Chance;  // 0x0(0x4)
	float MinDuration;  // 0x4(0x4)
	float MaxDuration;  // 0x8(0x4)
	float StopEngineChance;  // 0xC(0x4)
	struct UCurveFloat* ThrottleCurve;  // 0x10(0x8)
	float ThrottleCurveFrequencyMultiplier;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)
	struct UCurveFloat* BrakeCurve;  // 0x20(0x8)
	float BrakeCurveFrequencyMultiplier;  // 0x28(0x4)
	float ForceMagnitudeScale;  // 0x2C(0x4)
	struct UCurveFloat* ForceMagnitudeScaleCurve;  // 0x30(0x8)
	float ForceMagnitudeScaleCurveFrequencyMultiplier;  // 0x38(0x4)
	float ForceDirectionRandomizationAngle;  // 0x3C(0x4)

}; 
// Function ConZ.ConZCharacter.GetSoundComponent
// Size: 0x8(Inherited: 0x0) 
struct FGetSoundComponent
{
	struct UCharacterSoundComponent* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.PrisonerRestingData
// Size: 0x10(Inherited: 0x0) 
struct FPrisonerRestingData
{
	uint8_t  mode;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool IsRestingOnGround : 1;  // 0x1(0x1)
	char pad_2_1 : 7;  // 0x2(0x1)
	bool HasChangedTransform : 1;  // 0x2(0x1)
	char pad_3_1 : 7;  // 0x3(0x1)
	bool HasDisabledCapsuleCollision : 1;  // 0x3(0x1)
	struct TWeakObjectPtr<UAnimSequenceBase> RestingAnimation;  // 0x4(0x8)
	float FeetIKOffset;  // 0xC(0x4)

}; 
// Function ConZ.ConZCharacter.HasCharacterAction
// Size: 0x1(Inherited: 0x0) 
struct FHasCharacterAction
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.InteractionComponent.UnexamineItemOnServer
// Size: 0x8(Inherited: 0x0) 
struct FUnexamineItemOnServer
{
	struct AItem* Item;  // 0x0(0x8)

}; 
// Function ConZ.SpawnMenuWidget.GetCurrentCurrencyTextColorAndOpacity
// Size: 0x28(Inherited: 0x0) 
struct FGetCurrentCurrencyTextColorAndOpacity
{
	struct FSlateColor ReturnValue;  // 0x0(0x28)

}; 
// Function ConZ.ConZCharacter.IsConscious
// Size: 0x1(Inherited: 0x0) 
struct FIsConscious
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.MapHUDWorldEventsObject
// Size: 0x18(Inherited: 0x18) 
struct FMapHUDWorldEventsObject : public FMapHUDObject
{

}; 
// ScriptStruct ConZ.MetabolismAPBFontStyle
// Size: 0x30(Inherited: 0x0) 
struct FMetabolismAPBFontStyle
{
	struct UFont* Font;  // 0x0(0x8)
	int32_t FontSize;  // 0x8(0x4)
	struct FMargin TitlePadding;  // 0xC(0x10)
	struct FMargin ValuePadding;  // 0x1C(0x10)
	char EVerticalAlignment TitleVerticalAlignment;  // 0x2C(0x1)
	char EHorizontalAlignment TitleHorizontalAlignment;  // 0x2D(0x1)
	char EVerticalAlignment ValueVerticalAlignment;  // 0x2E(0x1)
	char EHorizontalAlignment ValueHorizontalAlignment;  // 0x2F(0x1)

}; 
// Function ConZ.Weapon.Server_SetMalfunction
// Size: 0x1(Inherited: 0x0) 
struct FServer_SetMalfunction
{
	uint8_t  Type;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.BodyWeaponAnimation
// Size: 0x10(Inherited: 0x0) 
struct FBodyWeaponAnimation
{
	struct UAnimMontage* Body;  // 0x0(0x8)
	struct UAnimMontage* Weapon;  // 0x8(0x8)

}; 
// Function ConZ.Prisoner.IsCompletelyInitialized
// Size: 0x1(Inherited: 0x0) 
struct FIsCompletelyInitialized
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.GameEventBase.GetParticipantTeam
// Size: 0x10(Inherited: 0x0) 
struct FGetParticipantTeam
{
	struct APrisoner* Prisoner;  // 0x0(0x8)
	int32_t ReturnValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function ConZ.Vehicle.GetNumMountees
// Size: 0x4(Inherited: 0x0) 
struct FGetNumMountees
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.ConZCharacter.IsHeadBone
// Size: 0xC(Inherited: 0x0) 
struct FIsHeadBone
{
	struct FName BoneName;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)

}; 
// ScriptStruct ConZ.CraftingRecipeCraftingItem
// Size: 0x10(Inherited: 0x0) 
struct FCraftingRecipeCraftingItem
{
	AItem* ItemClass;  // 0x0(0x8)
	int32_t Quantity;  // 0x8(0x4)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool IsOptional : 1;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)

}; 
// Function ConZ.Zombie2.BaseInteractionComponent_OnBaseInteractionEvent
// Size: 0x10(Inherited: 0x0) 
struct FBaseInteractionComponent_OnBaseInteractionEvent
{
	struct UBaseInteractionComponent* Component;  // 0x0(0x8)
	struct FBaseInteractionEvent BaseInteractionEvent;  // 0x8(0x8)

}; 
// Function ConZ.ConZCharacter.LeaveCorpse
// Size: 0x8(Inherited: 0x0) 
struct FLeaveCorpse
{
	struct ACorpse* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Weapon.AddAttachmentOnServer
// Size: 0x8(Inherited: 0x0) 
struct FAddAttachmentOnServer
{
	struct AWeaponAttachment* Attachment;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.ParachuteAnimParams
// Size: 0x10(Inherited: 0x0) 
struct FParachuteAnimParams
{
	struct UAnimSequence* OpeningAnimation;  // 0x0(0x8)
	struct FFloatInterval OpeningAnimationTimeRange;  // 0x8(0x8)

}; 
// ScriptStruct ConZ.VehicleAttachmentSave
// Size: 0x10(Inherited: 0x0) 
struct FVehicleAttachmentSave
{
	struct TArray<char> Data;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.CharacterActionAck
// Size: 0xC(Inherited: 0x0) 
struct FCharacterActionAck
{
	int32_t ActionId;  // 0x0(0x4)
	int32_t SubActionIndex;  // 0x4(0x4)
	uint8_t  Type;  // 0x8(0x1)
	uint8_t  EndState;  // 0x9(0x1)
	char pad_10[2];  // 0xA(0x2)

}; 
// ScriptStruct ConZ.AnimalPaceSettings
// Size: 0x10(Inherited: 0x0) 
struct FAnimalPaceSettings
{
	float RunSpeed;  // 0x0(0x4)
	float TrotSpeed;  // 0x4(0x4)
	float WalkSpeed;  // 0x8(0x4)
	float SneakSpeed;  // 0xC(0x4)

}; 
// ScriptStruct ConZ.SearchPerItemData
// Size: 0x48(Inherited: 0x0) 
struct FSearchPerItemData
{
	struct TSoftClassPtr<UObject> ItemClass;  // 0x0(0x28)
	struct TArray<struct UPhysicalMaterial*> NeededMaterials;  // 0x28(0x10)
	float Probability;  // 0x38(0x4)
	int32_t MinQuantity;  // 0x3C(0x4)
	int32_t MaxQuantity;  // 0x40(0x4)
	char pad_68[4];  // 0x44(0x4)

}; 
// Function ConZ.Prisoner.HasItemOfClass
// Size: 0x10(Inherited: 0x0) 
struct FHasItemOfClass
{
	UObject* ItemClass;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.InteractableInterface.CanInteract
// Size: 0x10(Inherited: 0x0) 
struct FCanInteract
{
	struct APrisoner* User;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.ConZCharacter.NetMulticast_HandleMeleeAttackCapsuleHit
// Size: 0x140(Inherited: 0x0) 
struct FNetMulticast_HandleMeleeAttackCapsuleHit
{
	struct AConZCharacter* attacker;  // 0x0(0x8)
	char pad_8[8];  // 0x8(0x8)
	struct FMeleeAttackCapsuleHitInfo HitInfo;  // 0x10(0x130)

}; 
// Function ConZ.GameEventBase.GetParticipantAtRank
// Size: 0x8(Inherited: 0x0) 
struct FGetParticipantAtRank
{
	int32_t Rank;  // 0x0(0x4)
	int32_t ReturnValue;  // 0x4(0x4)

}; 
// ScriptStruct ConZ.CookedFoodIngredientNetData
// Size: 0x14(Inherited: 0x0) 
struct FCookedFoodIngredientNetData
{
	struct FPrimaryAssetId Resource;  // 0x0(0x10)
	float Mass;  // 0x10(0x4)

}; 
// ScriptStruct ConZ.ClothesPartSet
// Size: 0x50(Inherited: 0x0) 
struct FClothesPartSet
{
	struct TSet<uint8_t > ClothesParts;  // 0x0(0x50)

}; 
// ScriptStruct ConZ.MeleeAttackCapsule
// Size: 0x80(Inherited: 0x0) 
struct FMeleeAttackCapsule
{
	struct TWeakObjectPtr<AActor> AttachParent;  // 0x0(0x8)
	struct FGameplayTag Attachment;  // 0x8(0x8)
	struct FTransform RelativeTransform;  // 0x10(0x30)
	float UnscaledRadius;  // 0x40(0x4)
	float UnscaledHalfHeight;  // 0x44(0x4)
	struct FMeleeWeaponDesc WeaponDesc;  // 0x48(0x38)

}; 
// ScriptStruct ConZ.CharacterSpawnerMarker
// Size: 0x50(Inherited: 0x0) 
struct FCharacterSpawnerMarker
{
	struct FTransform Transform;  // 0x0(0x30)
	struct FCharacterSpawnerDataBasedOnPreset Spawner;  // 0x30(0x20)

}; 
// ScriptStruct ConZ.MeleeWeaponDesc
// Size: 0x38(Inherited: 0x0) 
struct FMeleeWeaponDesc
{
	float Damage;  // 0x0(0x4)
	float DamageInGameEvent;  // 0x4(0x4)
	struct FTargetTypeDamageMultiplier TargetTypeMultiplier;  // 0x8(0x10)
	float Energy;  // 0x18(0x4)
	float SharpnessSlash;  // 0x1C(0x4)
	float SharpnessPierce;  // 0x20(0x4)
	int32_t HitSeverityChange;  // 0x24(0x4)
	uint8_t  ImpactSoundCategory;  // 0x28(0x1)
	char pad_41[7];  // 0x29(0x7)
	struct UProjectileImpactEffects* ImpactEffects;  // 0x30(0x8)

}; 
// Function ConZ.ConZCharacter.NetMulticast_RequestCharacterAction
// Size: 0x20(Inherited: 0x0) 
struct FNetMulticast_RequestCharacterAction
{
	struct FCharacterActionReplicationHelper Value;  // 0x0(0x18)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool ignoreAutonomousProxy : 1;  // 0x18(0x1)
	char pad_25[7];  // 0x19(0x7)

}; 
// Function ConZ.PrisonerAnimInstance.GetKnownCurveValueOnWorkerThread
// Size: 0x8(Inherited: 0x0) 
struct FGetKnownCurveValueOnWorkerThread
{
	uint8_t  Curve;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float ReturnValue;  // 0x4(0x4)

}; 
// Function ConZ.ExtendedRichTextBlock.SetTextStyle
// Size: 0x270(Inherited: 0x0) 
struct FSetTextStyle
{
	struct FTextBlockStyle Style;  // 0x0(0x270)

}; 
// Function ConZ.ConZCharacter.OnRep_Gender
// Size: 0x1(Inherited: 0x0) 
struct FOnRep_Gender
{
	uint8_t  oldGender;  // 0x0(0x1)

}; 
// Function ConZ.ResourceLockingManager.NetMulticast_RemoveActorLocks
// Size: 0x18(Inherited: 0x0) 
struct FNetMulticast_RemoveActorLocks
{
	int32_t dataVersion;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct TArray<struct FActorResourceLockNetwork> Locks;  // 0x8(0x10)

}; 
// ScriptStruct ConZ.GameEventNotificationUIData
// Size: 0x50(Inherited: 0x0) 
struct FGameEventNotificationUIData
{
	char pad_0[80];  // 0x0(0x50)

}; 
// Function ConZ.Weapon.AddAmmoSingleAtLocation
// Size: 0x20(Inherited: 0x0) 
struct FAddAmmoSingleAtLocation
{
	struct FAmmunitionData ammoData;  // 0x0(0x18)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool backLocation : 1;  // 0x18(0x1)
	char pad_25[7];  // 0x19(0x7)

}; 
// ScriptStruct ConZ.WindowClimbingAnimationInfo
// Size: 0x48(Inherited: 0x0) 
struct FWindowClimbingAnimationInfo
{
	struct FVector AnchorOffset;  // 0x0(0xC)
	char pad_12[4];  // 0xC(0x4)
	struct UAnimSequenceBase* AnchoringAnimation;  // 0x10(0x8)
	float AnchoringAnimationTime;  // 0x18(0x4)
	float AnchoringDuration;  // 0x1C(0x4)
	struct UAnimMontage* ClimbingMontage;  // 0x20(0x8)
	float MinWindowWidth;  // 0x28(0x4)
	float MinWindowHeight;  // 0x2C(0x4)
	float MinSpacingToLeftWindowEdge;  // 0x30(0x4)
	float MinSpacingToRightWindowEdge;  // 0x34(0x4)
	float MinWindowDistanceToFloor;  // 0x38(0x4)
	float MaxWindowDistanceToFloor;  // 0x3C(0x4)
	float StaminaDrain;  // 0x40(0x4)
	char pad_68[4];  // 0x44(0x4)

}; 
// Function ConZ.MissionContainerWidget.StartObjectiveAnimation
// Size: 0x1(Inherited: 0x0) 
struct FStartObjectiveAnimation
{
	uint8_t  AnimationState;  // 0x0(0x1)

}; 
// Function ConZ.PrisonerInventoryComponent.SpawnAndDropItemAtOnServer
// Size: 0x20(Inherited: 0x0) 
struct FSpawnAndDropItemAtOnServer
{
	struct UContainerItemDescriptor* Item;  // 0x0(0x8)
	struct FVector Location;  // 0x8(0xC)
	struct FRotator Rotation;  // 0x14(0xC)

}; 
// Function ConZ.ConZCharacter.ReceiveBeginHit
// Size: 0xC8(Inherited: 0x0) 
struct FReceiveBeginHit
{
	struct UPrimitiveComponent* MyComp;  // 0x0(0x8)
	struct AActor* Other;  // 0x8(0x8)
	struct UPrimitiveComponent* OtherComp;  // 0x10(0x8)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool selfMoved : 1;  // 0x18(0x1)
	char pad_25[3];  // 0x19(0x3)
	struct FVector HitLocation;  // 0x1C(0xC)
	struct FVector HitNormal;  // 0x28(0xC)
	struct FVector NormalImpulse;  // 0x34(0xC)
	struct FHitResult Hit;  // 0x40(0x88)

}; 
// DelegateFunction ConZ.ItemContainer.OnItemContainerLocked__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FOnItemContainerLocked__DelegateSignature
{
	struct AItemContainer* ItemContainer;  // 0x0(0x8)

}; 
// Function ConZ.ConZCharacter.Server_CharacterActionAck
// Size: 0xC(Inherited: 0x0) 
struct FServer_CharacterActionAck
{
	struct FCharacterActionAck ack;  // 0x0(0xC)

}; 
// ScriptStruct ConZ.PrisonerWaterMovementParameters
// Size: 0xC(Inherited: 0x0) 
struct FPrisonerWaterMovementParameters
{
	float MaxSpeed;  // 0x0(0x4)
	float Acceleration;  // 0x4(0x4)
	float Deceleration;  // 0x8(0x4)

}; 
// Function ConZ.Prisoner.SetMeleeTargetSelectionMode
// Size: 0x1(Inherited: 0x0) 
struct FSetMeleeTargetSelectionMode
{
	uint8_t  Value;  // 0x0(0x1)

}; 
// Function ConZ.ConZCharacter.Server_RequestCharacterAction
// Size: 0x18(Inherited: 0x0) 
struct FServer_RequestCharacterAction
{
	struct FCharacterActionReplicationHelper Value;  // 0x0(0x18)

}; 
// Function ConZ.ConZCharacter.Server_HandleMeleeAttackCapsuleHit
// Size: 0x140(Inherited: 0x0) 
struct FServer_HandleMeleeAttackCapsuleHit
{
	struct AConZCharacter* attacker;  // 0x0(0x8)
	char pad_8[8];  // 0x8(0x8)
	struct FMeleeAttackCapsuleHitInfo HitInfo;  // 0x10(0x130)

}; 
// Function ConZ.WeaponAmmoDisplayContainerWidget.Init
// Size: 0x18(Inherited: 0x0) 
struct FInit
{
	struct AWeapon* Weapon;  // 0x0(0x8)
	float onScreenDuration;  // 0x8(0x4)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool displayOnCenter : 1;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)
	struct UTexture2D* iconOverride;  // 0x10(0x8)

}; 
// ScriptStruct ConZ.ConZWaterSplineControlPoint
// Size: 0x58(Inherited: 0x44) 
struct FConZWaterSplineControlPoint : public FSplinePoint
{
	char pad_68_1 : 7;  // 0x44(0x1)
	bool selected : 1;  // 0x44(0x1)
	char pad_69[3];  // 0x45(0x3)
	float Width;  // 0x48(0x4)
	float MaxDepth;  // 0x4C(0x4)
	float Speed;  // 0x50(0x4)
	float Opacity;  // 0x54(0x4)

}; 
// Function ConZ.Prisoner.PlaceItemInInventoryOrHolster
// Size: 0x10(Inherited: 0x0) 
struct FPlaceItemInInventoryOrHolster
{
	struct AItem* Item;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool tryToJoinItems : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.ConZCharacter.Server_SetEnvironmentDescription
// Size: 0x3(Inherited: 0x0) 
struct FServer_SetEnvironmentDescription
{
	struct FEnvironmentDescription Value;  // 0x0(0x3)

}; 
// Function ConZ.ConZCharacter.SetEnvironmentDescription
// Size: 0x3(Inherited: 0x0) 
struct FSetEnvironmentDescription
{
	struct FEnvironmentDescription Value;  // 0x0(0x3)

}; 
// ScriptStruct ConZ.VehicleExhaustParticles
// Size: 0x18(Inherited: 0x0) 
struct FVehicleExhaustParticles
{
	struct FName AttachSocketName;  // 0x0(0x8)
	struct UParticleSystem* ParticleSystem;  // 0x8(0x8)
	char pad_16[8];  // 0x10(0x8)

}; 
// Function ConZ.DropZoneSlot.Server_Activate
// Size: 0x8(Inherited: 0x0) 
struct FServer_Activate
{
	struct APrisoner* Prisoner;  // 0x0(0x8)

}; 
// Function ConZ.ConZCharacter.SetGender
// Size: 0x1(Inherited: 0x0) 
struct FSetGender
{
	uint8_t  Value;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.IsMemberOfMySquad
// Size: 0x10(Inherited: 0x0) 
struct FIsMemberOfMySquad
{
	struct APrisoner* Prisoner;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.Prisoner.GetDesiredPace
// Size: 0x1(Inherited: 0x0) 
struct FGetDesiredPace
{
	uint8_t  ReturnValue;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.HitEffects
// Size: 0x38(Inherited: 0x0) 
struct FHitEffects
{
	float SpeedThreshold;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct UParticleSystem* ParticleSystem;  // 0x8(0x8)
	struct FVector ParticlesScale;  // 0x10(0xC)
	char pad_28[4];  // 0x1C(0x4)
	struct UAkAudioEvent* AudioEvent;  // 0x20(0x8)
	UMatineeCameraShake* CameraShake;  // 0x28(0x8)
	float CameraShakeScale;  // 0x30(0x4)
	char pad_52[4];  // 0x34(0x4)

}; 
// Function ConZ.Prisoner.AcceptSquadInvitationOnServer
// Size: 0x10(Inherited: 0x0) 
struct FAcceptSquadInvitationOnServer
{
	struct AConZSquad* Squad;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool accepted : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.Prisoner.NetMulticast_SetUserFakeName
// Size: 0x10(Inherited: 0x0) 
struct FNetMulticast_SetUserFakeName
{
	struct FString fakeName;  // 0x0(0x10)

}; 
// Function ConZ.Prisoner.GetRotationTarget
// Size: 0x8(Inherited: 0x0) 
struct FGetRotationTarget
{
	struct AActor* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.AddHandBondage
// Size: 0x8(Inherited: 0x0) 
struct FAddHandBondage
{
	struct AItem* bondageItem;  // 0x0(0x8)

}; 
// Function ConZ.ComplexAnimal2.Rest
// Size: 0x4(Inherited: 0x0) 
struct FRest
{
	float Time;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.AddWeaponAttachment
// Size: 0x10(Inherited: 0x0) 
struct FAddWeaponAttachment
{
	struct AWeapon* Weapon;  // 0x0(0x8)
	struct AWeaponAttachment* Attachment;  // 0x8(0x8)

}; 
// Function ConZ.AudioStatics.PostAkEventAtLocation
// Size: 0x40(Inherited: 0x0) 
struct FPostAkEventAtLocation
{
	struct UAkAudioEvent* akEvent;  // 0x0(0x8)
	struct FVector Location;  // 0x8(0xC)
	struct FRotator Orientation;  // 0x14(0xC)
	struct FString EventName;  // 0x20(0x10)
	struct UObject* WorldContextObject;  // 0x30(0x8)
	int32_t ReturnValue;  // 0x38(0x4)
	char pad_60[4];  // 0x3C(0x4)

}; 
// Function ConZ.MissionScheduler.OnLocationEnter
// Size: 0x10(Inherited: 0x0) 
struct FOnLocationEnter
{
	struct AActor* OverlapedActor;  // 0x0(0x8)
	struct AActor* OtherActor;  // 0x8(0x8)

}; 
// Function ConZ.Prisoner.AreBreastsExposed
// Size: 0x1(Inherited: 0x0) 
struct FAreBreastsExposed
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// DelegateFunction ConZ.Prisoner.BorderCrossingPenaltyChange__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FBorderCrossingPenaltyChange__DelegateSignature
{
	struct APrisoner* sender;  // 0x0(0x8)
	uint8_t  newPenalty;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// ScriptStruct ConZ.SkillEventThrownItemHitTarget
// Size: 0x8(Inherited: 0x0) 
struct FSkillEventThrownItemHitTarget
{
	struct AActor* Target;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.ConZBaseElementInteractionData
// Size: 0x30(Inherited: 0x0) 
struct FConZBaseElementInteractionData
{
	int64_t BaseElementId;  // 0x0(0x8)
	struct FVector BaseElementLocation;  // 0x8(0xC)
	float RepairValue;  // 0x14(0x4)
	int64_t InteractionTimestamp;  // 0x18(0x8)
	int64_t IntegerData;  // 0x20(0x8)
	struct UObject* PointerData;  // 0x28(0x8)

}; 
// Function ConZ.Prisoner.CalculateAIPerceptionPercentage
// Size: 0x4(Inherited: 0x0) 
struct FCalculateAIPerceptionPercentage
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.CanEnterCombatMode
// Size: 0x1(Inherited: 0x0) 
struct FCanEnterCombatMode
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.CustomZoneRegion
// Size: 0x38(Inherited: 0x0) 
struct FCustomZoneRegion
{
	struct FString Name;  // 0x0(0x10)
	struct FVector2D Location;  // 0x10(0x8)
	struct FVector2D Size;  // 0x18(0x8)
	uint8_t  Shape;  // 0x20(0x1)
	char pad_33[3];  // 0x21(0x3)
	int32_t ConfigurationIndex;  // 0x24(0x4)
	struct FName UniqueDefaultZoneName;  // 0x28(0x8)
	uint8_t  DefaultZoneState;  // 0x30(0x1)
	char pad_49[7];  // 0x31(0x7)

}; 
// ScriptStruct ConZ.PrisonerMovementSettings_Ground_Crouching
// Size: 0x6C(Inherited: 0x0) 
struct FPrisonerMovementSettings_Ground_Crouching
{
	struct FPrisonerMovementSettings_Ground_Crouching_Walking Walking;  // 0x0(0x24)
	struct FPrisonerMovementSettings_Ground_Crouching_Walking WalkingFaster;  // 0x24(0x24)
	struct FPrisonerMovementSettings_Ground_Crouching_Walking WalkLimping;  // 0x48(0x24)

}; 
// Function ConZ.ThrowingQuickAccessItemWidget.OnImageWidgetMouseButtonDown
// Size: 0x160(Inherited: 0x0) 
struct FOnImageWidgetMouseButtonDown
{
	struct FGeometry MyGeometry;  // 0x0(0x38)
	struct FPointerEvent MouseEvent;  // 0x38(0x70)
	struct FEventReply ReturnValue;  // 0xA8(0xB8)

}; 
// Function ConZ.KeyboardIllumination.FlashAllKeys
// Size: 0xC(Inherited: 0x0) 
struct FFlashAllKeys
{
	struct FColor Color;  // 0x0(0x4)
	float Duration;  // 0x4(0x4)
	float Interval;  // 0x8(0x4)

}; 
// Function ConZ.Prisoner.CanEnterMeleeCombatMode
// Size: 0x1(Inherited: 0x0) 
struct FCanEnterMeleeCombatMode
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.CanLeaveCombatMode
// Size: 0x1(Inherited: 0x0) 
struct FCanLeaveCombatMode
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// DelegateFunction ConZ.Prisoner.TabModeOpened__DelegateSignature
// Size: 0x1(Inherited: 0x0) 
struct FTabModeOpened__DelegateSignature
{
	uint8_t  tabMode;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.ZombieAttackDescription
// Size: 0x20(Inherited: 0x0) 
struct FZombieAttackDescription
{
	struct UAnimMontage* Montage;  // 0x0(0x8)
	struct FFloatInterval PitchRange;  // 0x8(0x8)
	float MinDistance;  // 0x10(0x4)
	float MaxDistance;  // 0x14(0x4)
	float RegainControlMultiplier;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)

}; 
// Function ConZ.Prisoner.CanTakeItemInHands
// Size: 0x10(Inherited: 0x0) 
struct FCanTakeItemInHands
{
	struct AItem* Item;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.ResourceLockingManager.OnLockOwnerDestroyed
// Size: 0x8(Inherited: 0x0) 
struct FOnLockOwnerDestroyed
{
	struct AActor* lockOwner;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.Server_LoadAmmoIntoMagazine
// Size: 0x18(Inherited: 0x0) 
struct FServer_LoadAmmoIntoMagazine
{
	struct AAmmunitionItem* AmmunitionItem;  // 0x0(0x8)
	struct AWeaponAttachmentMagazine* magazine;  // 0x8(0x8)
	int32_t Count;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function ConZ.Prisoner.CapsuleComponent_PhysicsVolumeChanged
// Size: 0x8(Inherited: 0x0) 
struct FCapsuleComponent_PhysicsVolumeChanged
{
	struct APhysicsVolume* Volume;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.Server_JoinAmmo
// Size: 0x10(Inherited: 0x0) 
struct FServer_JoinAmmo
{
	struct AAmmunitionItem* finalItem;  // 0x0(0x8)
	struct AAmmunitionItem* initiatingItem;  // 0x8(0x8)

}; 
// Function ConZ.Prisoner.EquippedNightVisionGoggles_ActivatedChanged
// Size: 0x8(Inherited: 0x0) 
struct FEquippedNightVisionGoggles_ActivatedChanged
{
	struct ANightVisionGogglesItem* Item;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.CharacterImpactSounds
// Size: 0x8(Inherited: 0x0) 
struct FCharacterImpactSounds
{
	struct UAkAudioEvent* AudioEvent;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.SetShouldIgnoreHeadTurningAndLeaning
// Size: 0x1(Inherited: 0x0) 
struct FSetShouldIgnoreHeadTurningAndLeaning
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// DelegateFunction ConZ.Prisoner.CarriedItemsVisibilityChanged__DelegateSignature
// Size: 0x1(Inherited: 0x0) 
struct FCarriedItemsVisibilityChanged__DelegateSignature
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Visible : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.CarryItem
// Size: 0x8(Inherited: 0x0) 
struct FCarryItem
{
	struct AItem* Item;  // 0x0(0x8)

}; 
// Function ConZ.CargoDropEvent.Multicast_DisplayNotification
// Size: 0x18(Inherited: 0x0) 
struct FMulticast_DisplayNotification
{
	struct FString SectorName;  // 0x0(0x10)
	float FallDuration;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function ConZ.PrisonerCorpse.GetFacialHairMeshComponent
// Size: 0x8(Inherited: 0x0) 
struct FGetFacialHairMeshComponent
{
	struct USkeletalMeshComponent* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.ChangeSquadData
// Size: 0x38(Inherited: 0x0) 
struct FChangeSquadData
{
	struct FString Name;  // 0x0(0x10)
	struct FString Message;  // 0x10(0x10)
	struct FString information;  // 0x20(0x10)
	struct FConZSquadEmblem emblem;  // 0x30(0x8)

}; 
// ScriptStruct ConZ.ConZSquadEmblem
// Size: 0x8(Inherited: 0x0) 
struct FConZSquadEmblem
{
	struct FConZSquadEmblemElement Background;  // 0x0(0x4)
	struct FConZSquadEmblemElement Symbol;  // 0x4(0x4)

}; 
// ScriptStruct ConZ.SpawnerConfiguration
// Size: 0x18(Inherited: 0x0) 
struct FSpawnerConfiguration
{
	UItemSpawnerPreset* Spawner;  // 0x0(0x8)
	UItemSpawnerPreset2* SpawnerPreset;  // 0x8(0x8)
	int32_t MinimumItemsCount;  // 0x10(0x4)
	int32_t MaximumItemsCount;  // 0x14(0x4)

}; 
// Function ConZ.VicinityPanel3.OnItemActorDestroyed
// Size: 0x8(Inherited: 0x0) 
struct FOnItemActorDestroyed
{
	struct AActor* Actor;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.ChooseFirstMeleeTarget
// Size: 0x8(Inherited: 0x0) 
struct FChooseFirstMeleeTarget
{
	struct AActor* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Weapon.GetAmmoReloadCapacity
// Size: 0x10(Inherited: 0x0) 
struct FGetAmmoReloadCapacity
{
	struct AAmmunitionItem* ammo;  // 0x0(0x8)
	int32_t ReturnValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function ConZ.Prisoner.ClearMalfunction
// Size: 0x1(Inherited: 0x0) 
struct FClearMalfunction
{
	uint8_t  malfunction;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.Server_SetShadowIntensity
// Size: 0x1(Inherited: 0x0) 
struct FServer_SetShadowIntensity
{
	char Value;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.BankATMBuyableCardStateVisual
// Size: 0xC(Inherited: 0x0) 
struct FBankATMBuyableCardStateVisual
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool TransparentBackground : 1;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float RenderOpacity;  // 0x4(0x4)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool PlusCircleVisible : 1;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)

}; 
// Function ConZ.Prisoner.Client_FadeInVision
// Size: 0x4(Inherited: 0x0) 
struct FClient_FadeInVision
{
	float Duration;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.SpawnedPawnInfo
// Size: 0x14(Inherited: 0x0) 
struct FSpawnedPawnInfo
{
	char pad_0[20];  // 0x0(0x14)

}; 
// Function ConZ.GameEventTransport.IsInteractable
// Size: 0x1(Inherited: 0x0) 
struct FIsInteractable
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.InteractionData
// Size: 0x68(Inherited: 0x0) 
struct FInteractionData
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ModifierPressed : 1;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	int64_t IntegerData;  // 0x8(0x8)
	struct UObject* PointerData;  // 0x10(0x8)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool BoolData : 1;  // 0x18(0x1)
	char pad_25[7];  // 0x19(0x7)
	struct FText TextData;  // 0x20(0x18)
	struct FVector InteractionLocation;  // 0x38(0xC)
	struct FVector InteractionNormal;  // 0x44(0xC)
	struct FVector VectorData;  // 0x50(0xC)
	char pad_92[4];  // 0x5C(0x4)
	int64_t BaseElementId;  // 0x60(0x8)

}; 
// Function ConZ.HitReactComponent.CanRecoverFromRagdoll
// Size: 0x1(Inherited: 0x0) 
struct FCanRecoverFromRagdoll
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.CustomZoneConfiguration
// Size: 0x40(Inherited: 0x0) 
struct FCustomZoneConfiguration
{
	struct FString Name;  // 0x0(0x10)
	uint8_t  EventHandlingMethod[13];  // 0x10(0x13)
	char pad_35[1];  // 0x23(0x1)
	struct FLinearColor Color;  // 0x24(0x10)
	struct FName UniqueDefaultZoneName;  // 0x34(0x8)
	uint8_t  DefaultZoneState;  // 0x3C(0x1)
	char pad_61[3];  // 0x3D(0x3)

}; 
// Function ConZ.ComplexAnimal2.TurnTowardActor
// Size: 0x10(Inherited: 0x0) 
struct FTurnTowardActor
{
	struct AActor* foe;  // 0x0(0x8)
	float ReturnValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function ConZ.Vehicle.GetVehicleSteerAmount
// Size: 0x4(Inherited: 0x0) 
struct FGetVehicleSteerAmount
{
	float ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.AmmunitionData
// Size: 0x18(Inherited: 0x0) 
struct FAmmunitionData
{
	AAmmunitionItem* AmmunitionItemClass;  // 0x0(0x8)
	float health;  // 0x8(0x4)
	float MaxHealth;  // 0xC(0x4)
	float DefaultMaxHealth;  // 0x10(0x4)
	uint8_t  State;  // 0x14(0x1)
	char pad_21[3];  // 0x15(0x3)

}; 
// Function ConZ.ItemUserWidget.ItemPickedUpStateChanged
// Size: 0x10(Inherited: 0x0) 
struct FItemPickedUpStateChanged
{
	struct AItem* Item;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool pickedUp : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.Prisoner.SetDesiredPace
// Size: 0x1(Inherited: 0x0) 
struct FSetDesiredPace
{
	uint8_t  Value;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.Client_OnAIDetectionTimerChanged
// Size: 0x4(Inherited: 0x0) 
struct FClient_OnAIDetectionTimerChanged
{
	float detectionTimer;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.Server_SetTargetCrouchStage
// Size: 0x4(Inherited: 0x0) 
struct FServer_SetTargetCrouchStage
{
	float Value;  // 0x0(0x4)

}; 
// Function ConZ.HalloweenSacrificePit.NetMulticast_SpawnGiftSpawningPreludeEffects
// Size: 0x10(Inherited: 0x0) 
struct FNetMulticast_SpawnGiftSpawningPreludeEffects
{
	struct UAkAudioEvent* AudioEvent;  // 0x0(0x8)
	struct UParticleSystem* Particles;  // 0x8(0x8)

}; 
// Function ConZ.Prisoner.Client_OnTakeDamage
// Size: 0x28(Inherited: 0x0) 
struct FClient_OnTakeDamage
{
	float Damage;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct FDamageEvent DamageEvent;  // 0x8(0x10)
	struct AController* eventInstigator;  // 0x18(0x8)
	struct AActor* damageObject;  // 0x20(0x8)

}; 
// Function ConZ.Prisoner.GetCombatMode
// Size: 0x1(Inherited: 0x0) 
struct FGetCombatMode
{
	uint8_t  ReturnValue;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.SlidingDoorPartInfo
// Size: 0x20(Inherited: 0x0) 
struct FSlidingDoorPartInfo
{
	char pad_0[32];  // 0x0(0x20)

}; 
// Function ConZ.PrisonerUIStatics.GetPrisonerHealthRatio
// Size: 0x10(Inherited: 0x0) 
struct FGetPrisonerHealthRatio
{
	struct APrisoner* Prisoner;  // 0x0(0x8)
	float ReturnValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function ConZ.Prisoner.Client_SetSavedSpawnLocation
// Size: 0x28(Inherited: 0x0) 
struct FClient_SetSavedSpawnLocation
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Active : 1;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	struct FVector Location;  // 0x4(0xC)
	struct FVector Velocity;  // 0x10(0xC)
	struct FRotator Rotation;  // 0x1C(0xC)

}; 
// Function ConZ.PlayerDrone.Server_SetDroneVisibility
// Size: 0x1(Inherited: 0x0) 
struct FServer_SetDroneVisibility
{
	uint8_t  Value;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.Client_ShowSpawnScreen
// Size: 0x1(Inherited: 0x0) 
struct FClient_ShowSpawnScreen
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool loadoutMenu : 1;  // 0x0(0x1)

}; 
// Function ConZ.PlayerRpcChannel.Vehicle2_Server_SetPhysicsParameters
// Size: 0x28(Inherited: 0x0) 
struct FVehicle2_Server_SetPhysicsParameters
{
	struct AVehicleBase* VehicleBase;  // 0x0(0x8)
	struct FVector comPosition;  // 0x8(0xC)
	struct FVector inertiaTensor;  // 0x14(0xC)
	float Mass;  // 0x20(0x4)
	char pad_36[4];  // 0x24(0x4)

}; 
// ScriptStruct ConZ.CombustibleItemParams
// Size: 0x8(Inherited: 0x0) 
struct FCombustibleItemParams
{
	float DefaultTemp;  // 0x0(0x4)
	float BurningRate;  // 0x4(0x4)

}; 
// Function ConZ.MiscStatics.BroadcastChatLine
// Size: 0x20(Inherited: 0x0) 
struct FBroadcastChatLine
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FString Text;  // 0x8(0x10)
	uint8_t  ChatType;  // 0x18(0x1)
	char pad_25[7];  // 0x19(0x7)

}; 
// Function ConZ.Prisoner.ClosePanels
// Size: 0x2(Inherited: 0x0) 
struct FClosePanels
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool switchingTabs : 1;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool ReturnValue : 1;  // 0x1(0x1)

}; 
// Function ConZ.KillboxComponent.AddGasMist
// Size: 0x8(Inherited: 0x0) 
struct FAddGasMist
{
	struct UParticleSystemComponent* gasMist;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.CreateFishingComponent
// Size: 0x8(Inherited: 0x0) 
struct FCreateFishingComponent
{
	struct UPrisonerFishingComponent* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.GameEventBase.ParticipantEnter
// Size: 0x8(Inherited: 0x0) 
struct FParticipantEnter
{
	struct APrisoner* Prisoner;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.FindNextOrPreviousMeleeTarget
// Size: 0x18(Inherited: 0x0) 
struct FFindNextOrPreviousMeleeTarget
{
	struct AActor* Target;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool Next : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)
	struct AActor* ReturnValue;  // 0x10(0x8)

}; 
// ScriptStruct ConZ.AmmunitionArrowSpawningParamsHelper
// Size: 0x18(Inherited: 0x0) 
struct FAmmunitionArrowSpawningParamsHelper
{
	char pad_0[24];  // 0x0(0x18)

}; 
// Function ConZ.Prisoner.CreateMusicPlayerComponent
// Size: 0x8(Inherited: 0x0) 
struct FCreateMusicPlayerComponent
{
	struct UPrisonerMusicPlayerComponent* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.PlayerRpcChannel.Placeable_Server_FillWithItems
// Size: 0x20(Inherited: 0x0) 
struct FPlaceable_Server_FillWithItems
{
	struct APlaceableActorBase* placeable;  // 0x0(0x8)
	struct APrisoner* User;  // 0x8(0x8)
	struct TArray<struct AItem*> Items;  // 0x10(0x10)

}; 
// Function ConZ.PlayerRpcChannel.InteractWithObjectOnServer
// Size: 0x80(Inherited: 0x0) 
struct FInteractWithObjectOnServer
{
	struct UObject* interactable;  // 0x0(0x8)
	struct APrisoner* User;  // 0x8(0x8)
	uint8_t  interactionType;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)
	struct FInteractionData InteractionData;  // 0x18(0x68)

}; 
// Function ConZ.Prisoner.CreatePrisonWalletComponent
// Size: 0x8(Inherited: 0x0) 
struct FCreatePrisonWalletComponent
{
	struct UPrisonerPrisonWalletComponent* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.PlayerRpcChannel.BaseBuilding_Server_OnFlagAreaEntered
// Size: 0x8(Inherited: 0x0) 
struct FBaseBuilding_Server_OnFlagAreaEntered
{
	struct AConZCharacter* Character;  // 0x0(0x8)

}; 
// Function ConZ.ItemUserWidget.SetItem
// Size: 0x8(Inherited: 0x0) 
struct FSetItem
{
	struct AItem* Item;  // 0x0(0x8)

}; 
// Function ConZ.ConZGameState.StartTournament
// Size: 0x10(Inherited: 0x0) 
struct FStartTournament
{
	struct FTournamentParameters parameters;  // 0x0(0x10)

}; 
// Function ConZ.Prisoner.Server_InitiateCraftedUpgradePlacement
// Size: 0x60(Inherited: 0x0) 
struct FServer_InitiateCraftedUpgradePlacement
{
	struct FConZBaseElementIdentifier elementToBeUpgraded;  // 0x0(0x20)
	struct UPlaceableCraftableItem* upgradeRecipe;  // 0x20(0x8)
	char pad_40[8];  // 0x28(0x8)
	struct FTransform Transform;  // 0x30(0x30)

}; 
// ScriptStruct ConZ.PrisonerFallingPoseTransitionParams
// Size: 0x20(Inherited: 0x0) 
struct FPrisonerFallingPoseTransitionParams
{
	float TransitionTime;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct UAnimSequence* TransitionAnimation;  // 0x8(0x8)
	struct FFloatInterval TransitionAnimationTimeRange;  // 0x10(0x8)
	struct UCurveFloat* TransitionPitchBlendOverrideCurve;  // 0x18(0x8)

}; 
// Function ConZ.WorldStatics.IsLocationInDangerZone
// Size: 0x18(Inherited: 0x0) 
struct FIsLocationInDangerZone
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Location;  // 0x8(0xC)
	char pad_20_1 : 7;  // 0x14(0x1)
	bool ReturnValue : 1;  // 0x14(0x1)
	char pad_21[3];  // 0x15(0x3)

}; 
// ScriptStruct ConZ.HuntingBiomeParameters
// Size: 0x38(Inherited: 0x0) 
struct FHuntingBiomeParameters
{
	struct UBiomeData* BiomeData;  // 0x0(0x8)
	float AnimalSpawnChance;  // 0x8(0x4)
	float DaytimeSpawnMultiplier[4];  // 0xC(0x10)
	float SpawnCheckCooldownMin;  // 0x1C(0x4)
	float SpawnCheckCooldownMax;  // 0x20(0x4)
	int8_t MaxAnimalEncounters;  // 0x24(0x1)
	int8_t MaxAnimalEncountersPerPlayer;  // 0x25(0x1)
	int8_t MaxPlayerTriggers;  // 0x26(0x1)
	char pad_39_1 : 7;  // 0x27(0x1)
	bool PacksAllowed : 1;  // 0x27(0x1)
	char Priority;  // 0x28(0x1)
	char pad_41[3];  // 0x29(0x3)
	float AnimalSoundCooldownMin;  // 0x2C(0x4)
	float AnimalSoundCooldownMax;  // 0x30(0x4)
	float AnimalSoundPlayProbability;  // 0x34(0x4)

}; 
// ScriptStruct ConZ.TextBoxWithLabelStyle
// Size: 0x158(Inherited: 0x0) 
struct FTextBoxWithLabelStyle
{
	struct FSlateBrush FocusBackgroundImage;  // 0x0(0x88)
	struct FTextBoxTextStyle LabelText;  // 0x88(0x68)
	struct FTextBoxTextStyle InputBoxText;  // 0xF0(0x68)

}; 
// Function ConZ.Prisoner.DestroyPlaceable
// Size: 0x8(Inherited: 0x0) 
struct FDestroyPlaceable
{
	struct FDbIntegerId ID;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.FoliageCanopyData
// Size: 0x40(Inherited: 0x0) 
struct FFoliageCanopyData
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool UseSphere : 1;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	struct FTreeCanopySphere Sphere;  // 0x4(0x14)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool UseCapsule : 1;  // 0x18(0x1)
	char pad_25[3];  // 0x19(0x3)
	struct FTreeCanopyCapsule Capsule;  // 0x1C(0x24)

}; 
// Function ConZ.HitReactComponent.IsPlayingGetUpMontage
// Size: 0x1(Inherited: 0x0) 
struct FIsPlayingGetUpMontage
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.Inv2021_InventoryElementRepHelper
// Size: 0x20(Inherited: 0x0) 
struct FInv2021_InventoryElementRepHelper
{
	char pad_0[32];  // 0x0(0x20)

}; 
// Function ConZ.Prisoner.GetItemInHands
// Size: 0x8(Inherited: 0x0) 
struct FGetItemInHands
{
	struct AItem* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.AdminCommandArgumentCompletion.GetCompletionValues
// Size: 0x10(Inherited: 0x0) 
struct FGetCompletionValues
{
	struct TArray<struct FString> Result;  // 0x0(0x10)

}; 
// Function ConZ.Prisoner.DetonateHead
// Size: 0x1(Inherited: 0x0) 
struct FDetonateHead
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool shouldDestroyHeadgear : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.SkillEventItemThrown
// Size: 0x1(Inherited: 0x0) 
struct FSkillEventItemThrown
{
	char pad_0[1];  // 0x0(0x1)

}; 
// Function ConZ.Vehicle.SetVehicleWheelTireDeflated
// Size: 0x8(Inherited: 0x0) 
struct FSetVehicleWheelTireDeflated
{
	int32_t WheelIndex;  // 0x0(0x4)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool isDeflated : 1;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)

}; 
// Function ConZ.PrisonerHUD.IsShowingSpawnScreen
// Size: 0x1(Inherited: 0x0) 
struct FIsShowingSpawnScreen
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.InventoryComponent_ItemUnequipped
// Size: 0x10(Inherited: 0x0) 
struct FInventoryComponent_ItemUnequipped
{
	struct UPrisonerInventoryComponent* sender;  // 0x0(0x8)
	struct AItem* Item;  // 0x8(0x8)

}; 
// Function ConZ.ItemUserWidget.CreateFromItem
// Size: 0x10(Inherited: 0x0) 
struct FCreateFromItem
{
	struct AItem* Item;  // 0x0(0x8)
	struct UItemUserWidget* ReturnValue;  // 0x8(0x8)

}; 
// Function ConZ.Prisoner.EnterCombatMode
// Size: 0x1(Inherited: 0x0) 
struct FEnterCombatMode
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Zombie2.SetStance
// Size: 0x1(Inherited: 0x0) 
struct FSetStance
{
	uint8_t  Value;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.IngredientClassesArray
// Size: 0x10(Inherited: 0x0) 
struct FIngredientClassesArray
{
	struct TArray<struct TSoftClassPtr<UObject>> IngredientClasses;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.EnduranceSkillParametersPerSkillLevel
// Size: 0x18(Inherited: 0x0) 
struct FEnduranceSkillParametersPerSkillLevel
{
	struct FExperienceDependentFloat EnergyConsumptionMultiplier;  // 0x0(0x8)
	struct FExperienceDependentFloat WaterConsumptionMultiplier;  // 0x8(0x8)
	struct FExperienceDependentFloat StaminaRecoveryMultiplier;  // 0x10(0x8)

}; 
// Function ConZ.Prisoner.ExamineItem
// Size: 0x8(Inherited: 0x0) 
struct FExamineItem
{
	struct AItem* Item;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.InventoryContainer2DRepData
// Size: 0x20(Inherited: 0x0) 
struct FInventoryContainer2DRepData
{
	struct TArray<struct FInventoryItemPositionPair> ItemsData;  // 0x0(0x10)
	struct UObject* Parent;  // 0x10(0x8)
	int32_t SizeX;  // 0x18(0x4)
	int32_t SizeY;  // 0x1C(0x4)

}; 
// ScriptStruct ConZ.ItemLootTreeNodeTableRow
// Size: 0x38(Inherited: 0x20) 
struct FItemLootTreeNodeTableRow : public FGameplayTagTableRow
{
	uint8_t  Rarity;  // 0x20(0x1)
	char pad_33[7];  // 0x21(0x7)
	struct TArray<struct TSoftClassPtr<UObject>> PostSpawnActions;  // 0x28(0x10)

}; 
// Function ConZ.Prisoner.GetMeleeTarget
// Size: 0x8(Inherited: 0x0) 
struct FGetMeleeTarget
{
	struct AActor* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.TurnMontages
// Size: 0x10(Inherited: 0x0) 
struct FTurnMontages
{
	struct UAnimMontage* TurnInPlaceLeft;  // 0x0(0x8)
	struct UAnimMontage* TurnInPlaceRight;  // 0x8(0x8)

}; 
// Function ConZ.Weapon.GetReloadActionSequenceForData
// Size: 0x38(Inherited: 0x0) 
struct FGetReloadActionSequenceForData
{
	struct FWeaponReloadData reloadData;  // 0x0(0x30)
	struct UWeaponActionReloadSequence* ReturnValue;  // 0x30(0x8)

}; 
// Function ConZ.FishingBarWidget.SetProgressPercentage
// Size: 0x4(Inherited: 0x0) 
struct FSetProgressPercentage
{
	float Value;  // 0x0(0x4)

}; 
// Function ConZ.Vehicle.RepairVehicle
// Size: 0x8(Inherited: 0x0) 
struct FRepairVehicle
{
	float healthToRepair;  // 0x0(0x4)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool ReturnValue : 1;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)

}; 
// Function ConZ.ComplexAnimal2.GetAngularVelocity
// Size: 0x4(Inherited: 0x0) 
struct FGetAngularVelocity
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.GetBruisingComponent
// Size: 0x8(Inherited: 0x0) 
struct FGetBruisingComponent
{
	struct UBruisingComponent* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.PrisonerNearbyFoliageInstanceInfo
// Size: 0x60(Inherited: 0x0) 
struct FPrisonerNearbyFoliageInstanceInfo
{
	uint8_t  FoliageType;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct UInstancedStaticMeshComponent* InstancedMeshComponent;  // 0x8(0x8)
	struct FPackedLocation PackedLocation;  // 0x10(0x8)
	char pad_24[8];  // 0x18(0x8)
	struct FTransform TransformZeroOrigin;  // 0x20(0x30)
	struct UFoliageAssetData* FoliageAssetData;  // 0x50(0x8)
	char pad_88[8];  // 0x58(0x8)

}; 
// ScriptStruct ConZ.PackedLocation
// Size: 0x8(Inherited: 0x0) 
struct FPackedLocation
{
	char pad_0[8];  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.UpdateZoomEffect
// Size: 0x4(Inherited: 0x0) 
struct FUpdateZoomEffect
{
	float Fraction;  // 0x0(0x4)

}; 
// Function ConZ.CircularMenuWidget.CreateThrowingMenuWidget
// Size: 0x20(Inherited: 0x0) 
struct FCreateThrowingMenuWidget
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct TArray<struct UCircularMenuSegmentThrowingInfo*> throwingSegmentInfo;  // 0x8(0x10)
	struct UCircularMenuWidget* ReturnValue;  // 0x18(0x8)

}; 
// Function ConZ.PlayerRpcChannel.WeaponBow_Server_InsertArrow
// Size: 0x10(Inherited: 0x0) 
struct FWeaponBow_Server_InsertArrow
{
	struct AWeaponBow* bow;  // 0x0(0x8)
	struct AAmmunitionArrow* arrow;  // 0x8(0x8)

}; 
// ScriptStruct ConZ.WireDescription
// Size: 0x50(Inherited: 0x0) 
struct FWireDescription
{
	char pad_0[80];  // 0x0(0x50)

}; 
// Function ConZ.Prisoner.NetMulticast_PostAudioEventOnPrisoner
// Size: 0x10(Inherited: 0x0) 
struct FNetMulticast_PostAudioEventOnPrisoner
{
	struct UAkAudioEvent* akEvent;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool multiCastToClients : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.Prisoner.GetSavedSpawnLocation
// Size: 0xC(Inherited: 0x0) 
struct FGetSavedSpawnLocation
{
	struct FVector ReturnValue;  // 0x0(0xC)

}; 
// Function ConZ.Prisoner.GetCrouchStage
// Size: 0x4(Inherited: 0x0) 
struct FGetCrouchStage
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.AttributeMapInterface.SetBoolAttribute
// Size: 0x18(Inherited: 0x0) 
struct FSetBoolAttribute
{
	struct FString Name;  // 0x0(0x10)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool Value : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// Function ConZ.Weapon.ShouldPlayChamberOpenedIdle
// Size: 0x1(Inherited: 0x0) 
struct FShouldPlayChamberOpenedIdle
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.PrisonerThirdPersonSubviewBlendOverride
// Size: 0x8(Inherited: 0x0) 
struct FPrisonerThirdPersonSubviewBlendOverride
{
	uint8_t  Source;  // 0x0(0x1)
	uint8_t  Target;  // 0x1(0x1)
	char pad_2[2];  // 0x2(0x2)
	float Duration;  // 0x4(0x4)

}; 
// Function ConZ.ConZGameInstance.SetPlayAsDrone
// Size: 0x1(Inherited: 0x0) 
struct FSetPlayAsDrone
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// Function ConZ.LockpickingWidget.GetLockpicksCount
// Size: 0x4(Inherited: 0x0) 
struct FGetLockpicksCount
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.GetCurrentMidiDeviceIndex
// Size: 0x4(Inherited: 0x0) 
struct FGetCurrentMidiDeviceIndex
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.BasePoseAimOffsetPair
// Size: 0x18(Inherited: 0x0) 
struct FBasePoseAimOffsetPair
{
	struct UAnimSequenceBase* UpperBodyPose;  // 0x0(0x8)
	struct UAnimSequenceBase* LowerBodyPose;  // 0x8(0x8)
	struct UBlendSpace* AimOffset;  // 0x10(0x8)

}; 
// Function ConZ.Prisoner.GetFishingRod
// Size: 0x8(Inherited: 0x0) 
struct FGetFishingRod
{
	struct AFishingRod* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.CookingUtilitySlotInstance_UserSetData
// Size: 0x18(Inherited: 0x0) 
struct FCookingUtilitySlotInstance_UserSetData
{
	int32_t SlotId;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct TArray<char> InternalCoordinates;  // 0x8(0x10)

}; 
// Function ConZ.Prisoner.Server_SetHoldBreathState
// Size: 0x1(Inherited: 0x0) 
struct FServer_SetHoldBreathState
{
	uint8_t  Value;  // 0x0(0x1)

}; 
// Function ConZ.GameEventParticipantStatsWidget.GetGameEvent
// Size: 0x8(Inherited: 0x0) 
struct FGetGameEvent
{
	struct AGameEventBase* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.HandsHolstersWidget2.OnFishingAttachmentAdded
// Size: 0x10(Inherited: 0x0) 
struct FOnFishingAttachmentAdded
{
	struct AFishingRod* FishingRod;  // 0x0(0x8)
	struct AFishingAttachment* Attachment;  // 0x8(0x8)

}; 
// Function ConZ.CircularMenuWidget.GetSegmentIdForCoordinates
// Size: 0x10(Inherited: 0x0) 
struct FGetSegmentIdForCoordinates
{
	struct FVector2D Coordinates;  // 0x0(0x8)
	int32_t Layer;  // 0x8(0x4)
	int32_t ReturnValue;  // 0xC(0x4)

}; 
// Function ConZ.Prisoner.GetGroundMovementParameters
// Size: 0xC(Inherited: 0x0) 
struct FGetGroundMovementParameters
{
	struct FPrisonerGroundMovementParameters ReturnValue;  // 0x0(0xC)

}; 
// Function ConZ.Weapon.UpdateReloadData
// Size: 0x60(Inherited: 0x0) 
struct FUpdateReloadData
{
	struct FWeaponReloadData reloadDataIn;  // 0x0(0x30)
	struct FWeaponReloadData reloadDataOut;  // 0x30(0x30)

}; 
// ScriptStruct ConZ.PrisonerGroundMovementParameters
// Size: 0xC(Inherited: 0x0) 
struct FPrisonerGroundMovementParameters
{
	float MaxSpeed;  // 0x0(0x4)
	float Acceleration;  // 0x4(0x4)
	float Deceleration;  // 0x8(0x4)

}; 
// Function ConZ.PrisonerInventoryComponent.EquipClothesItem
// Size: 0x8(Inherited: 0x0) 
struct FEquipClothesItem
{
	struct AClothesItem* Item;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.ConZColorRow
// Size: 0x28(Inherited: 0x8) 
struct FConZColorRow : public FTableRowBase
{
	struct FLinearColor Color;  // 0x8(0x10)
	struct FString Description;  // 0x18(0x10)

}; 
// Function ConZ.AmmunitionItem.Client_SetAmmoCount
// Size: 0x4(Inherited: 0x0) 
struct FClient_SetAmmoCount
{
	int32_t Count;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.ImpactEffectData
// Size: 0x18(Inherited: 0x0) 
struct FImpactEffectData
{
	struct UParticleSystem* ParticleSystem;  // 0x0(0x8)
	struct UNiagaraSystem* NiagaraParticleSystem;  // 0x8(0x8)
	struct UMaterial* Decal;  // 0x10(0x8)

}; 
// Function ConZ.Prisoner.GetHandBondage
// Size: 0x8(Inherited: 0x0) 
struct FGetHandBondage
{
	struct UBondageComponent* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.GetIsInFirstPersonView
// Size: 0x1(Inherited: 0x0) 
struct FGetIsInFirstPersonView
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.VehicleWeaponAimingParameters.CanPrisonerTakeItemInHands
// Size: 0x18(Inherited: 0x0) 
struct FCanPrisonerTakeItemInHands
{
	struct APrisoner* Prisoner;  // 0x0(0x8)
	struct AItem* Item;  // 0x8(0x8)
	uint8_t  stance;  // 0x10(0x1)
	char pad_17_1 : 7;  // 0x11(0x1)
	bool ReturnValue : 1;  // 0x11(0x1)
	char pad_18[6];  // 0x12(0x6)

}; 
// Function ConZ.ChatSuggestionWidget.SetText
// Size: 0x10(Inherited: 0x0) 
struct FSetText
{
	struct FString Text;  // 0x0(0x10)

}; 
// Function ConZ.Prisoner.IsThrowAiming
// Size: 0x1(Inherited: 0x0) 
struct FIsThrowAiming
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.ResourceNetworkGUID
// Size: 0x4(Inherited: 0x0) 
struct FResourceNetworkGUID
{
	char pad_0[4];  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.Server_SetExaminedPrisoner
// Size: 0x8(Inherited: 0x0) 
struct FServer_SetExaminedPrisoner
{
	struct APrisoner* Prisoner;  // 0x0(0x8)

}; 
// Function ConZ.MeleeSkill.GetInactivityIdleAnimations
// Size: 0x10(Inherited: 0x0) 
struct FGetInactivityIdleAnimations
{
	struct TArray<struct UAnimSequenceBase*> ReturnValue;  // 0x0(0x10)

}; 
// Function ConZ.Vehicle.GetVehicleEngineState
// Size: 0x1(Inherited: 0x0) 
struct FGetVehicleEngineState
{
	uint8_t  ReturnValue;  // 0x0(0x1)

}; 
// Function ConZ.MeleeCombatComponent.NetMulticast_ExecuteMeleeAction
// Size: 0x20(Inherited: 0x0) 
struct FNetMulticast_ExecuteMeleeAction
{
	struct FMeleeAction Action;  // 0x0(0x20)

}; 
// Function ConZ.Prisoner.GetIsLimpingOverrideEnabled
// Size: 0x1(Inherited: 0x0) 
struct FGetIsLimpingOverrideEnabled
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.ConZConsoleVariableRow
// Size: 0x28(Inherited: 0x8) 
struct FConZConsoleVariableRow : public FTableRowBase
{
	struct FString ConsoleVariable;  // 0x8(0x10)
	struct FString Description;  // 0x18(0x10)

}; 
// Function ConZ.Prisoner.OnMidiEvent
// Size: 0x20(Inherited: 0x0) 
struct FOnMidiEvent
{
	struct UMIDIDeviceController* MIDIDeviceController;  // 0x0(0x8)
	int32_t Timestamp;  // 0x8(0x4)
	uint8_t  EventType;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)
	int32_t Channel;  // 0x10(0x4)
	int32_t ControlID;  // 0x14(0x4)
	int32_t Velocity;  // 0x18(0x4)
	int32_t RawEventType;  // 0x1C(0x4)

}; 
// Function ConZ.Prisoner.GetItemOfClass
// Size: 0x10(Inherited: 0x0) 
struct FGetItemOfClass
{
	UObject* ItemClass;  // 0x0(0x8)
	struct AItem* ReturnValue;  // 0x8(0x8)

}; 
// Function ConZ.Prisoner.GetLookatMeleeTargetAimOffset
// Size: 0xC(Inherited: 0x0) 
struct FGetLookatMeleeTargetAimOffset
{
	struct FRotator ReturnValue;  // 0x0(0xC)

}; 
// Function ConZ.ItemStatusWidget.SetNameText
// Size: 0x10(Inherited: 0x0) 
struct FSetNameText
{
	struct FString Text;  // 0x0(0x10)

}; 
// Function ConZ.Prisoner.GetNearbyFoliageInfo
// Size: 0x10(Inherited: 0x0) 
struct FGetNearbyFoliageInfo
{
	struct FPrisonerNearbyFoliageInfo ReturnValue;  // 0x0(0x10)

}; 
// Function ConZ.Prisoner.GetOverrideIsLimping
// Size: 0x1(Inherited: 0x0) 
struct FGetOverrideIsLimping
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.CircularProgressBar.GetPercentage
// Size: 0x4(Inherited: 0x0) 
struct FGetPercentage
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.GetPrisonerAnimInstance
// Size: 0x8(Inherited: 0x0) 
struct FGetPrisonerAnimInstance
{
	struct UPrisonerAnimInstance* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.DropZoneGameEvent.GetCapturingTeam
// Size: 0x4(Inherited: 0x0) 
struct FGetCapturingTeam
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.GetSavedSpawnLocationActive
// Size: 0x1(Inherited: 0x0) 
struct FGetSavedSpawnLocationActive
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.AttributeMapInterface.SetIntAttribute
// Size: 0x18(Inherited: 0x0) 
struct FSetIntAttribute
{
	struct FString Name;  // 0x0(0x10)
	int32_t Value;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function ConZ.Prisoner.OnRep_PackedWetness
// Size: 0x4(Inherited: 0x0) 
struct FOnRep_PackedWetness
{
	uint32_t oldWetness;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.VehicleEngineStallingParameters
// Size: 0x58(Inherited: 0x0) 
struct FVehicleEngineStallingParameters
{
	float MinDuration;  // 0x0(0x4)
	float MaxDuration;  // 0x4(0x4)
	float StopEngineChance;  // 0x8(0x4)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool ShouldStallingStopOnThrottleOrBreakRelease : 1;  // 0xC(0x1)
	char pad_13_1 : 7;  // 0xD(0x1)
	bool ShouldEngineStopOnThrottleOrBreakRelease : 1;  // 0xD(0x1)
	char pad_14[2];  // 0xE(0x2)
	struct UCurveFloat* ThrottleCurve;  // 0x10(0x8)
	float ThrottleCurveFrequencyMultiplier;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)
	struct UCurveFloat* BrakeCurve;  // 0x20(0x8)
	float BrakeCurveFrequencyMultiplier;  // 0x28(0x4)
	float ForceMagnitudeScale;  // 0x2C(0x4)
	struct UCurveFloat* ForceMagnitudeScaleCurve;  // 0x30(0x8)
	float ForceMagnitudeScaleCurveFrequencyMultiplier;  // 0x38(0x4)
	float ForceDirectionRandomizationAngle;  // 0x3C(0x4)
	struct UAkAudioEvent* AudioEvent;  // 0x40(0x8)
	struct TArray<float> AudioEventTriggerTimeRatios;  // 0x48(0x10)

}; 
// Function ConZ.Corpse.CopyFromCharacter
// Size: 0x8(Inherited: 0x0) 
struct FCopyFromCharacter
{
	struct AConZCharacter* sourceCharacter;  // 0x0(0x8)

}; 
// Function ConZ.BruisingComponent.GetBruiseLayerRenderTarget
// Size: 0x10(Inherited: 0x0) 
struct FGetBruiseLayerRenderTarget
{
	uint8_t  Layer;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct UTextureRenderTarget2D* ReturnValue;  // 0x8(0x8)

}; 
// Function ConZ.Prisoner.GetSavedSpawnRotation
// Size: 0xC(Inherited: 0x0) 
struct FGetSavedSpawnRotation
{
	struct FRotator ReturnValue;  // 0x0(0xC)

}; 
// ScriptStruct ConZ.CookingRecipeRegistryEntry
// Size: 0x14(Inherited: 0x0) 
struct FCookingRecipeRegistryEntry
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Enabled : 1;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	struct FPrimaryAssetId AssetId;  // 0x4(0x10)

}; 
// Function ConZ.Prisoner.GetShouldIgnoreHeadTurningAndLeaning
// Size: 0x1(Inherited: 0x0) 
struct FGetShouldIgnoreHeadTurningAndLeaning
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.ConZGameState.GetSquad
// Size: 0x10(Inherited: 0x0) 
struct FGetSquad
{
	struct FDbIntegerId squadId;  // 0x0(0x8)
	struct AConZSquad* ReturnValue;  // 0x8(0x8)

}; 
// Function ConZ.PrisonerMovementComponent.GetDesiredCourseAngle
// Size: 0x4(Inherited: 0x0) 
struct FGetDesiredCourseAngle
{
	float ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.ElementSnapMarker
// Size: 0x60(Inherited: 0x0) 
struct FElementSnapMarker
{
	struct FTransform Transform;  // 0x0(0x30)
	struct FVector Slack;  // 0x30(0xC)
	char pad_60_1 : 7;  // 0x3C(0x1)
	bool ElementTypesMustMatch : 1;  // 0x3C(0x1)
	char pad_61_1 : 7;  // 0x3D(0x1)
	bool IncreaseLevelOnSnap : 1;  // 0x3D(0x1)
	char MaxLevelToSnap;  // 0x3E(0x1)
	char pad_63[1];  // 0x3F(0x1)
	struct FVector RequiredElementSize;  // 0x40(0xC)
	struct FVector RequiredElementSizeTolerance;  // 0x4C(0xC)
	char pad_88_1 : 7;  // 0x58(0x1)
	bool DestroySnappedElementWhenDestroyed : 1;  // 0x58(0x1)
	char pad_89[1];  // 0x59(0x1)
	uint16_t OutSocketTypes;  // 0x5A(0x2)
	uint16_t InSocketTypes;  // 0x5C(0x2)
	char pad_94[2];  // 0x5E(0x2)

}; 
// ScriptStruct ConZ.PrisonerBodyEffectSave
// Size: 0x10(Inherited: 0x0) 
struct FPrisonerBodyEffectSave
{
	struct TArray<char> Data;  // 0x0(0x10)

}; 
// Function ConZ.Prisoner.GetTabMode
// Size: 0x1(Inherited: 0x0) 
struct FGetTabMode
{
	uint8_t  ReturnValue;  // 0x0(0x1)

}; 
// Function ConZ.WaypointWidgetBase.GetDistance
// Size: 0x4(Inherited: 0x0) 
struct FGetDistance
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.CharacterAction.OnPreActionEnd
// Size: 0x8(Inherited: 0x0) 
struct FOnPreActionEnd
{
	struct UCharacterAction* Action;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.GetTabMouseMovement
// Size: 0x8(Inherited: 0x0) 
struct FGetTabMouseMovement
{
	struct FVector2D ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.SetMeleeTarget
// Size: 0x8(Inherited: 0x0) 
struct FSetMeleeTarget
{
	struct AActor* Value;  // 0x0(0x8)

}; 
// Function ConZ.KillboxComponent.NetMulticast_QueueHostQuote
// Size: 0x10(Inherited: 0x0) 
struct FNetMulticast_QueueHostQuote
{
	struct UAkAudioEvent* Sound;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool playOnlyIfInstant : 1;  // 0x8(0x1)
	char pad_9_1 : 7;  // 0x9(0x1)
	bool stopPreviousQuote : 1;  // 0x9(0x1)
	char pad_10[6];  // 0xA(0x6)

}; 
// Function ConZ.Prisoner.NetMulticast_PlayLockpickingProtectionEffects
// Size: 0x28(Inherited: 0x0) 
struct FNetMulticast_PlayLockpickingProtectionEffects
{
	struct UObject* Lockpickable;  // 0x0(0x8)
	struct UParticleSystem* Particles;  // 0x8(0x8)
	struct UAkAudioEvent* audio;  // 0x10(0x8)
	struct FVector ParticlesScale;  // 0x18(0xC)
	char pad_36[4];  // 0x24(0x4)

}; 
// Function ConZ.InteractableInterface.GetInteractionHint
// Size: 0x20(Inherited: 0x0) 
struct FGetInteractionHint
{
	struct UObject* User;  // 0x0(0x8)
	struct FText ReturnValue;  // 0x8(0x18)

}; 
// ScriptStruct ConZ.SectorId
// Size: 0x8(Inherited: 0x0) 
struct FSectorId
{
	char pad_0[8];  // 0x0(0x8)

}; 
// Function ConZ.Objective.IsCompleted
// Size: 0x1(Inherited: 0x0) 
struct FIsCompleted
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Wettable.SetWaterWeight
// Size: 0x4(Inherited: 0x0) 
struct FSetWaterWeight
{
	float Value;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.GetTacticsBlobMaterial
// Size: 0x8(Inherited: 0x0) 
struct FGetTacticsBlobMaterial
{
	struct UMaterialInstanceDynamic* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Vehicle.GetVehicleHealthBarCaption
// Size: 0x18(Inherited: 0x0) 
struct FGetVehicleHealthBarCaption
{
	struct FText ReturnValue;  // 0x0(0x18)

}; 
// Function ConZ.Prisoner.ShouldIgnoreRotation
// Size: 0x1(Inherited: 0x0) 
struct FShouldIgnoreRotation
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Zombie2.NetMulticast_PlayMontage
// Size: 0x8(Inherited: 0x0) 
struct FNetMulticast_PlayMontage
{
	struct UAnimMontage* Montage;  // 0x0(0x8)

}; 
// Function ConZ.InteractionContainerUserWidget.InteractableDestroyed
// Size: 0x8(Inherited: 0x0) 
struct FInteractableDestroyed
{
	struct AActor* interactable;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.Server_InstrumentStopTone
// Size: 0xC(Inherited: 0x0) 
struct FServer_InstrumentStopTone
{
	uint8_t  tone;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float timeOffset;  // 0x4(0x4)
	int32_t octave;  // 0x8(0x4)

}; 
// ScriptStruct ConZ.WeaponSpreadData
// Size: 0x40(Inherited: 0x0) 
struct FWeaponSpreadData
{
	struct FWeaponSpreadItem ByStance[4];  // 0x0(0x30)
	float IncrementPerShot;  // 0x30(0x4)
	float IncrementFromShotsMax;  // 0x34(0x4)
	float IncrementSpeed;  // 0x38(0x4)
	float DecrementSpeed;  // 0x3C(0x4)

}; 
// Function ConZ.Prisoner.GetThrowingComponent
// Size: 0x8(Inherited: 0x0) 
struct FGetThrowingComponent
{
	struct UPrisonerThrowComponent* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.InteractableInterface.GetStateForInteractionWithItem
// Size: 0x10(Inherited: 0x0) 
struct FGetStateForInteractionWithItem
{
	struct AItem* Item;  // 0x0(0x8)
	uint8_t  ReturnValue;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.Prisoner.GetUserActiveName
// Size: 0x10(Inherited: 0x0) 
struct FGetUserActiveName
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.ItemSpawnerPreset_Item
// Size: 0x30(Inherited: 0x0) 
struct FItemSpawnerPreset_Item
{
	struct TSoftClassPtr<UObject> Item;  // 0x0(0x28)
	uint8_t  Rarity;  // 0x28(0x1)
	char pad_41[7];  // 0x29(0x7)

}; 
// Function ConZ.Prisoner.GetVehicleWeaponAimingStance
// Size: 0x1(Inherited: 0x0) 
struct FGetVehicleWeaponAimingStance
{
	uint8_t  ReturnValue;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.GetVisionEffectsComponent
// Size: 0x8(Inherited: 0x0) 
struct FGetVisionEffectsComponent
{
	struct UVisionEffectsComponent* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.CTFGameEvent.GetCTFParameters
// Size: 0x30(Inherited: 0x0) 
struct FGetCTFParameters
{
	struct FCTFParameters ReturnValue;  // 0x0(0x30)

}; 
// Function ConZ.GameEventParticipantStatsWidget.GetTeamIndex
// Size: 0x4(Inherited: 0x0) 
struct FGetTeamIndex
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.PrisonerHallucinationSymptomSeverityLevelParams
// Size: 0x4(Inherited: 0x0) 
struct FPrisonerHallucinationSymptomSeverityLevelParams
{
	int32_t MaxNumHallucinationIllusions;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.Server_HandleFootstep
// Size: 0x2(Inherited: 0x0) 
struct FServer_HandleFootstep
{
	uint8_t  motionIntensity;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool shouldMakeNoise : 1;  // 0x1(0x1)

}; 
// Function ConZ.Vehicle.GetMaxVehicleHealth
// Size: 0x4(Inherited: 0x0) 
struct FGetMaxVehicleHealth
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.AudioStatics.GetMaterialSwitchValue
// Size: 0xC(Inherited: 0x0) 
struct FGetMaterialSwitchValue
{
	char EPhysicalSurface Value;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	struct FName ReturnValue;  // 0x4(0x8)

}; 
// ScriptStruct ConZ.GardenSlot
// Size: 0x200(Inherited: 0xC) 
struct FGardenSlot : public FFastArraySerializerItem
{
	struct FIntPoint _slotPosition;  // 0xC(0x8)
	char pad_20[4];  // 0x14(0x4)
	struct UPlantSpecies* _species;  // 0x18(0x8)
	uint8_t  _stage;  // 0x20(0x1)
	char pad_33[1];  // 0x21(0x1)
	uint16_t _repWater;  // 0x22(0x2)
	char pad_36[4];  // 0x24(0x4)
	char _repGrowthPercentage;  // 0x28(0x1)
	char pad_41[7];  // 0x29(0x7)
	char pad_48_1 : 7;  // 0x30(0x1)
	bool _organicFertilizer : 1;  // 0x30(0x1)
	char pad_49_1 : 7;  // 0x31(0x1)
	bool _industrialFertilizer : 1;  // 0x31(0x1)
	char pad_50[6];  // 0x32(0x6)
	struct UPlantPestSpecies* _pests[3];  // 0x38(0x18)
	char _repPestsIntensities[3];  // 0x50(0x3)
	char pad_83[13];  // 0x53(0xD)
	struct UPlantDiseaseSpecies* _diseases[3];  // 0x60(0x18)
	char _repDiseaseIntensities[3];  // 0x78(0x3)
	char pad_123[13];  // 0x7B(0xD)
	char _repWeedIntensity;  // 0x88(0x1)
	char pad_137[7];  // 0x89(0x7)
	char pad_144_1 : 7;  // 0x90(0x1)
	bool _pesticideActive : 1;  // 0x90(0x1)
	char pad_145[7];  // 0x91(0x7)
	char pad_152_1 : 7;  // 0x98(0x1)
	bool _fungicideActive : 1;  // 0x98(0x1)
	char pad_153[7];  // 0x99(0x7)
	char pad_160_1 : 7;  // 0xA0(0x1)
	bool _weedRepellentActive : 1;  // 0xA0(0x1)
	char pad_161[7];  // 0xA1(0x7)
	char _repHealth;  // 0xA8(0x1)
	char pad_169[7];  // 0xA9(0x7)
	char pad_176_1 : 7;  // 0xB0(0x1)
	bool _isDead : 1;  // 0xB0(0x1)
	char pad_177_1 : 7;  // 0xB1(0x1)
	bool _isOld : 1;  // 0xB1(0x1)
	char pad_178[334];  // 0xB2(0x14E)

}; 
// Function ConZ.Prisoner.GetWaterMovementParameters
// Size: 0xC(Inherited: 0x0) 
struct FGetWaterMovementParameters
{
	struct FPrisonerWaterMovementParameters ReturnValue;  // 0x0(0xC)

}; 
// Function ConZ.BuildingManager.NetMulticast_UpdateBuildingFortificationsState
// Size: 0x28(Inherited: 0x0) 
struct FNetMulticast_UpdateBuildingFortificationsState
{
	int32_t dataVersion;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct FString buildingId;  // 0x8(0x10)
	struct TArray<struct FFortificationData> FortificationData;  // 0x18(0x10)

}; 
// Function ConZ.Weapon.GetDefaultAmmunitionData
// Size: 0x18(Inherited: 0x0) 
struct FGetDefaultAmmunitionData
{
	struct FAmmunitionData ReturnValue;  // 0x0(0x18)

}; 
// Function ConZ.Prisoner.Server_JoinCurrencyItem
// Size: 0x10(Inherited: 0x0) 
struct FServer_JoinCurrencyItem
{
	struct AItem* finalItem;  // 0x0(0x8)
	struct AItem* initiatingItem;  // 0x8(0x8)

}; 
// Function ConZ.Prisoner.GetWeightLoad
// Size: 0x4(Inherited: 0x0) 
struct FGetWeightLoad
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.PrisonerMovementComponent.NetMulticast_SetBodyRotation
// Size: 0x20(Inherited: 0x0) 
struct FNetMulticast_SetBodyRotation
{
	struct FQuat Rotation;  // 0x0(0x10)
	struct FVector AngularVelocity;  // 0x10(0xC)
	char pad_28[4];  // 0x1C(0x4)

}; 
// Function ConZ.Prisoner.OnBorderCrossingPenaltyChange
// Size: 0x10(Inherited: 0x0) 
struct FOnBorderCrossingPenaltyChange
{
	struct APrisoner* Prisoner;  // 0x0(0x8)
	uint8_t  newPenalty;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.Prisoner.GetWristwatchComponent
// Size: 0x8(Inherited: 0x0) 
struct FGetWristwatchComponent
{
	struct UChildActorComponent* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.VehicleAttachmentAdditionalSocket
// Size: 0x40(Inherited: 0x0) 
struct FVehicleAttachmentAdditionalSocket
{
	struct FName Name;  // 0x0(0x8)
	char pad_8[8];  // 0x8(0x8)
	struct FTransform Transform;  // 0x10(0x30)

}; 
// Function ConZ.Prisoner.HasHandsUp
// Size: 0x1(Inherited: 0x0) 
struct FHasHandsUp
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.PlayerRpcChannel.Mechanic_Server_UnsubscribeFromVehicleServiceData
// Size: 0x8(Inherited: 0x0) 
struct FMechanic_Server_UnsubscribeFromVehicleServiceData
{
	struct AMechanic* Mechanic;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.HandleIntroCinematicFinished
// Size: 0x8(Inherited: 0x0) 
struct FHandleIntroCinematicFinished
{
	struct AConZCameraManager* cameraManager;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.VehicleLightReference
// Size: 0x14(Inherited: 0x0) 
struct FVehicleLightReference
{
	struct FName Name;  // 0x0(0x8)
	uint8_t  LightType;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)
	struct FName MaterialSlotName;  // 0xC(0x8)

}; 
// Function ConZ.Prisoner.HasItem
// Size: 0x10(Inherited: 0x0) 
struct FHasItem
{
	struct AItem* Item;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.ItemObstructionStatics.OverlapClosestBlocking
// Size: 0xE0(Inherited: 0x0) 
struct FOverlapClosestBlocking
{
	struct ACharacter* Character;  // 0x0(0x8)
	char pad_8[8];  // 0x8(0x8)
	struct FTransform obstructionTestCapsulesWorldTransform;  // 0x10(0x30)
	struct TArray<struct FItemObstructionTestCapsule> obstructionTestCapsules;  // 0x40(0x10)
	struct FHitResult HitResult;  // 0x50(0x88)
	float PenetrationDepth;  // 0xD8(0x4)
	char pad_220_1 : 7;  // 0xDC(0x1)
	bool ReturnValue : 1;  // 0xDC(0x1)
	char pad_221[3];  // 0xDD(0x3)

}; 
// Function ConZ.Prisoner.SetItemInHandsOnClient
// Size: 0x8(Inherited: 0x0) 
struct FSetItemInHandsOnClient
{
	struct AItem* Item;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.HolsterItemOnServer
// Size: 0x10(Inherited: 0x0) 
struct FHolsterItemOnServer
{
	struct AItem* Item;  // 0x0(0x8)
	int32_t attachmentSocketHelper;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function ConZ.Prisoner.Server_UnpackAmmoBox
// Size: 0x8(Inherited: 0x0) 
struct FServer_UnpackAmmoBox
{
	struct AAmmunitionBoxItem* Item;  // 0x0(0x8)

}; 
// DelegateFunction ConZ.Prisoner.HoveredActorChanged__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FHoveredActorChanged__DelegateSignature
{
	struct AActor* hoveredActor;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.IsActivelyFishing
// Size: 0x1(Inherited: 0x0) 
struct FIsActivelyFishing
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.NetMulticast_AIMovementFinished
// Size: 0x1(Inherited: 0x0) 
struct FNetMulticast_AIMovementFinished
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool wasSuccessful : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.IsFishing
// Size: 0x1(Inherited: 0x0) 
struct FIsFishing
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.IsFreeLookEnabled
// Size: 0x1(Inherited: 0x0) 
struct FIsFreeLookEnabled
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.AudioStatics.PostAkEventAttached
// Size: 0x38(Inherited: 0x0) 
struct FPostAkEventAttached
{
	struct UAkAudioEvent* akEvent;  // 0x0(0x8)
	struct AActor* Actor;  // 0x8(0x8)
	struct FName AttachPointName;  // 0x10(0x8)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool bStopWhenAttachedToDestroyed : 1;  // 0x18(0x1)
	char pad_25[7];  // 0x19(0x7)
	struct FString EventName;  // 0x20(0x10)
	int32_t ReturnValue;  // 0x30(0x4)
	char pad_52[4];  // 0x34(0x4)

}; 
// Function ConZ.GameEventBase.Multicast_StopMusic
// Size: 0x8(Inherited: 0x0) 
struct FMulticast_StopMusic
{
	struct UAkAudioEvent* StopAudioEvent;  // 0x0(0x8)

}; 
// Function ConZ.CircularMenuMusicPlayerToggleInfo.CreateSpecific
// Size: 0x148(Inherited: 0x0) 
struct FCreateSpecific
{
	struct APrisoner* interactionInitiator;  // 0x0(0x8)
	struct UObject* interactableObject;  // 0x8(0x8)
	struct FInteractionStruct firstInteractionStruct;  // 0x10(0x98)
	struct FInteractionStruct secondInteractionStruct;  // 0xA8(0x98)
	struct UCircularMenuMusicPlayerToggleInfo* ReturnValue;  // 0x140(0x8)

}; 
// Function ConZ.Prisoner.StartMeleeAttack
// Size: 0x8(Inherited: 0x0) 
struct FStartMeleeAttack
{
	struct FGameplayTag meleeAttackType;  // 0x0(0x8)

}; 
// Function ConZ.UserProfile.SetLastLoginTime
// Size: 0x8(Inherited: 0x0) 
struct FSetLastLoginTime
{
	struct FDateTime Value;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.IsInteracting
// Size: 0x1(Inherited: 0x0) 
struct FIsInteracting
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.SetWeaponAimingTypeOnServer
// Size: 0x1(Inherited: 0x0) 
struct FSetWeaponAimingTypeOnServer
{
	uint8_t  Value;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.IsMemberOf
// Size: 0x10(Inherited: 0x0) 
struct FIsMemberOf
{
	struct AConZSquad* Squad;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// ScriptStruct ConZ.HeatSourceParameters
// Size: 0x24(Inherited: 0x0) 
struct FHeatSourceParameters
{
	float Temperature;  // 0x0(0x4)
	float TemperatureMultiplier;  // 0x4(0x4)
	float FuelMassRatio;  // 0x8(0x4)
	float Emissivity;  // 0xC(0x4)
	float DistanceScale;  // 0x10(0x4)
	float InnerRadiusTemperatureScale;  // 0x14(0x4)
	float AdditionalTemperaturePerGramOfOxygen;  // 0x18(0x4)
	float InnerRadius;  // 0x1C(0x4)
	float OuterRadius;  // 0x20(0x4)

}; 
// Function ConZ.BaseItemContainerWidget.OnDragStartEvent
// Size: 0x40(Inherited: 0x0) 
struct FOnDragStartEvent
{
	struct UBaseItemWidget* Widget;  // 0x0(0x8)
	struct FGeometry Geometry;  // 0x8(0x38)

}; 
// Function ConZ.Prisoner.IsNightVisionEnabled
// Size: 0x1(Inherited: 0x0) 
struct FIsNightVisionEnabled
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.IsSquadInvitationReceived
// Size: 0x1(Inherited: 0x0) 
struct FIsSquadInvitationReceived
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Weapon.HasEnoughAmmo
// Size: 0x1(Inherited: 0x0) 
struct FHasEnoughAmmo
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.IsThrowing
// Size: 0x1(Inherited: 0x0) 
struct FIsThrowing
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.LeaveCombatMode
// Size: 0x2(Inherited: 0x0) 
struct FLeaveCombatMode
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool PlayAnimation : 1;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool overrideAbilityCheck : 1;  // 0x1(0x1)

}; 
// ScriptStruct ConZ.PrisonerBodyBoneGroupsVsSeverity
// Size: 0x10(Inherited: 0x0) 
struct FPrisonerBodyBoneGroupsVsSeverity
{
	struct TArray<struct FPrisonerBodyBoneGroupsVsSeverityKey> Keys;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.BankATMMyCardsButtonStateVisual
// Size: 0x120(Inherited: 0x0) 
struct FBankATMMyCardsButtonStateVisual
{
	struct FLinearColor FontColor;  // 0x0(0x10)
	struct FSlateBrush BackgroundBrush;  // 0x10(0x88)
	struct FSlateBrush CardIconBrush;  // 0x98(0x88)

}; 
// Function ConZ.Prisoner.NetMulticast_AddNearbyFoliageInstances
// Size: 0x10(Inherited: 0x0) 
struct FNetMulticast_AddNearbyFoliageInstances
{
	struct TArray<struct FPrisonerNearbyFoliageInstanceInfoReplicated> replicatedInstanceInfo;  // 0x0(0x10)

}; 
// Function ConZ.Weapon.GetUsedAmmoCount
// Size: 0x4(Inherited: 0x0) 
struct FGetUsedAmmoCount
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.NetMulticast_ApplyHaircutAndMakeup
// Size: 0xE0(Inherited: 0x0) 
struct FNetMulticast_ApplyHaircutAndMakeup
{
	struct FCharacterTemplate CharacterTemplate;  // 0x0(0xE0)

}; 
// Function ConZ.MiscStatics.DrawDebugDigit
// Size: 0x38(Inherited: 0x0) 
struct FDrawDebugDigit
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	int32_t digit;  // 0x8(0x4)
	struct FVector Location;  // 0xC(0xC)
	struct FRotator Rotation;  // 0x18(0xC)
	struct FColor Color;  // 0x24(0x4)
	float Size;  // 0x28(0x4)
	float Duration;  // 0x2C(0x4)
	float Thickness;  // 0x30(0x4)
	char pad_52[4];  // 0x34(0x4)

}; 
// Function ConZ.Weapon.GetLoadedAmmoCount
// Size: 0x4(Inherited: 0x0) 
struct FGetLoadedAmmoCount
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.NetMulticast_ApplyPlasticSurgery
// Size: 0xE0(Inherited: 0x0) 
struct FNetMulticast_ApplyPlasticSurgery
{
	struct FCharacterTemplate CharacterTemplate;  // 0x0(0xE0)

}; 
// ScriptStruct ConZ.TraderMarkerTradeableOverrideStruct
// Size: 0x48(Inherited: 0x0) 
struct FTraderMarkerTradeableOverrideStruct
{
	struct TSoftClassPtr<UObject> TradeableClass;  // 0x0(0x28)
	int32_t BasePlayerPurchasePrice;  // 0x28(0x4)
	uint8_t  PurchaseCurrencyType;  // 0x2C(0x1)
	char pad_45[3];  // 0x2D(0x3)
	int32_t PurchasePriceAlternateCurrencyPrice;  // 0x30(0x4)
	int32_t BasePlayerSellPrice;  // 0x34(0x4)
	float DeltaPrice;  // 0x38(0x4)
	char pad_60_1 : 7;  // 0x3C(0x1)
	bool IsOverridingPurchaseAbility : 1;  // 0x3C(0x1)
	char pad_61_1 : 7;  // 0x3D(0x1)
	bool CanBePurchasedByPlayer : 1;  // 0x3D(0x1)
	char pad_62_1 : 7;  // 0x3E(0x1)
	bool IsLocallyImmuneToUserOverrides : 1;  // 0x3E(0x1)
	char pad_63[1];  // 0x3F(0x1)
	int32_t RequiredFamePoints;  // 0x40(0x4)
	char pad_68[4];  // 0x44(0x4)

}; 
// Function ConZ.Zombie2.NetMulticast_HandleLanded
// Size: 0x94(Inherited: 0x0) 
struct FNetMulticast_HandleLanded
{
	struct FVector ImpactVelocity;  // 0x0(0xC)
	struct FHitResult HitResult;  // 0xC(0x88)

}; 
// Function ConZ.GardenManager.DebugPlantAPlantAtLookedLocation
// Size: 0x8(Inherited: 0x0) 
struct FDebugPlantAPlantAtLookedLocation
{
	struct UPlantSpecies* species;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.PrisonerHallucinationIllusionInfo
// Size: 0x88(Inherited: 0x0) 
struct FPrisonerHallucinationIllusionInfo
{
	struct TSoftClassPtr<UObject> Class;  // 0x0(0x28)
	struct TSet<struct TSoftClassPtr<UObject>> IncompatibleClasses;  // 0x28(0x50)
	struct FInt32Range SeverityLevelConstraint;  // 0x78(0x10)

}; 
// Function ConZ.HuntingManager.OnAnimalActorDestroyed
// Size: 0x8(Inherited: 0x0) 
struct FOnAnimalActorDestroyed
{
	struct AActor* animalActor;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.NetMulticast_InstrumentPlayTone
// Size: 0xC(Inherited: 0x0) 
struct FNetMulticast_InstrumentPlayTone
{
	uint8_t  tone;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float timeOffset;  // 0x4(0x4)
	int32_t octave;  // 0x8(0x4)

}; 
// DelegateFunction ConZ.TrashSliderValueChangedTemp__DelegateSignature
// Size: 0x4(Inherited: 0x0) 
struct FTrashSliderValueChangedTemp__DelegateSignature
{
	float NewValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.NetMulticast_InstrumentStopTone
// Size: 0xC(Inherited: 0x0) 
struct FNetMulticast_InstrumentStopTone
{
	uint8_t  tone;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float timeOffset;  // 0x4(0x4)
	int32_t octave;  // 0x8(0x4)

}; 
// Function ConZ.ConZBaseManager.NetMulticast_UpdateDoorData
// Size: 0x70(Inherited: 0x0) 
struct FNetMulticast_UpdateDoorData
{
	int32_t dataVersion;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct FConZBaseElementIdentifier ElementIdentifier;  // 0x8(0x20)
	struct FDoorRepData doorData;  // 0x28(0x48)

}; 
// Function ConZ.SentryAnimInstance2.GetTurnInPlaceElapsedTimeRight
// Size: 0x4(Inherited: 0x0) 
struct FGetTurnInPlaceElapsedTimeRight
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.FireworksItem.GetSecondsBetweenLaunches
// Size: 0x4(Inherited: 0x0) 
struct FGetSecondsBetweenLaunches
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.NetMulticast_SpawnVomitingEffects
// Size: 0x1(Inherited: 0x0) 
struct FNetMulticast_SpawnVomitingEffects
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool isForced : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.AirplaneWingHitZoneData
// Size: 0x38(Inherited: 0x30) 
struct FAirplaneWingHitZoneData : public FVehicleHitZoneData
{
	uint8_t  Type;  // 0x30(0x1)
	char pad_49[7];  // 0x31(0x7)

}; 
// Function ConZ.Prisoner.NetMulticast_UpdateAdminStates
// Size: 0x1(Inherited: 0x0) 
struct FNetMulticast_UpdateAdminStates
{
	char states;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.OnExaminedPrisonerEquippedItem
// Size: 0x10(Inherited: 0x0) 
struct FOnExaminedPrisonerEquippedItem
{
	struct UPrisonerInventoryComponent* inventory;  // 0x0(0x8)
	struct AItem* Item;  // 0x8(0x8)

}; 
// Function ConZ.TacticsSkill.IsPrisonerDetected
// Size: 0x10(Inherited: 0x0) 
struct FIsPrisonerDetected
{
	struct APrisoner* Prisoner;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.PrisonerSkillComponent.Server_IncreaseSkillExperiencePoints
// Size: 0x8(Inherited: 0x0) 
struct FServer_IncreaseSkillExperiencePoints
{
	uint8_t  skillReplicationID;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float Points;  // 0x4(0x4)

}; 
// Function ConZ.GameEventLocationMarker.GetAreaCenter
// Size: 0xC(Inherited: 0x0) 
struct FGetAreaCenter
{
	struct FVector ReturnValue;  // 0x0(0xC)

}; 
// Function ConZ.Prisoner.Server_SplitAmmo
// Size: 0x8(Inherited: 0x0) 
struct FServer_SplitAmmo
{
	struct AAmmunitionItem* ammoItem;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.OnExaminedPrisonerUnequippedItem
// Size: 0x10(Inherited: 0x0) 
struct FOnExaminedPrisonerUnequippedItem
{
	struct UPrisonerInventoryComponent* inventory;  // 0x0(0x8)
	struct AItem* Item;  // 0x8(0x8)

}; 
// Function ConZ.ComplexAnimal2.Wait
// Size: 0x4(Inherited: 0x0) 
struct FWait
{
	float Time;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.OnMovementUpdated
// Size: 0x1C(Inherited: 0x0) 
struct FOnMovementUpdated
{
	float DeltaSeconds;  // 0x0(0x4)
	struct FVector OldLocation;  // 0x4(0xC)
	struct FVector OldVelocity;  // 0x10(0xC)

}; 
// Function ConZ.KillboxComponent.AddRoomDefinition
// Size: 0x18(Inherited: 0x0) 
struct FAddRoomDefinition
{
	struct ADoor* RoomDoor;  // 0x0(0x8)
	struct UStaticMeshComponent* Locker;  // 0x8(0x8)
	struct AKillBoxC4SpawnPoint* C4;  // 0x10(0x8)

}; 
// Function ConZ.Prisoner.OnHearNoise
// Size: 0x18(Inherited: 0x0) 
struct FOnHearNoise
{
	struct APawn* instigatorPawn;  // 0x0(0x8)
	struct FVector Location;  // 0x8(0xC)
	float Volume;  // 0x14(0x4)

}; 
// Function ConZ.Prisoner.OnRep_ItemInHandsVisualObstructionDepth
// Size: 0x1(Inherited: 0x0) 
struct FOnRep_ItemInHandsVisualObstructionDepth
{
	char oldValue;  // 0x0(0x1)

}; 
// Function ConZ.DebugRpcChannel.Server_Farming_AddWaterToSlot
// Size: 0x10(Inherited: 0x0) 
struct FServer_Farming_AddWaterToSlot
{
	struct AGarden* Garden;  // 0x0(0x8)
	int32_t Slot;  // 0x8(0x4)
	float Amount;  // 0xC(0x4)

}; 
// Function ConZ.GameEventBase.GetMarker
// Size: 0x8(Inherited: 0x0) 
struct FGetMarker
{
	struct AGameEventLocationMarker* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.PromoteSquadMemberOnServer
// Size: 0x8(Inherited: 0x0) 
struct FPromoteSquadMemberOnServer
{
	struct FDbIntegerId UserProfileId;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.RemoveFromSquadOnServer
// Size: 0x8(Inherited: 0x0) 
struct FRemoveFromSquadOnServer
{
	struct FDbIntegerId UserProfileId;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.StartMeleeDodge
// Size: 0x1(Inherited: 0x0) 
struct FStartMeleeDodge
{
	uint8_t  Direction;  // 0x0(0x1)

}; 
// Function ConZ.User.RemoveRecentServerAt
// Size: 0x4(Inherited: 0x0) 
struct FRemoveRecentServerAt
{
	int32_t Index;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.RemoveItemFromHands
// Size: 0x1(Inherited: 0x0) 
struct FRemoveItemFromHands
{
	uint8_t  preferedHolsterType;  // 0x0(0x1)

}; 
// Function ConZ.PlayerRpcChannel.ResourceLockingManager_Server_LockArea
// Size: 0x20(Inherited: 0x0) 
struct FResourceLockingManager_Server_LockArea
{
	struct FResourceNetworkGUID LockOwnerGUID;  // 0x0(0x4)
	struct FBox Area;  // 0x4(0x1C)

}; 
// Function ConZ.Prisoner.RemoveWeaponAttachment
// Size: 0x10(Inherited: 0x0) 
struct FRemoveWeaponAttachment
{
	struct AWeapon* Weapon;  // 0x0(0x8)
	struct AWeaponAttachment* Attachment;  // 0x8(0x8)

}; 
// Function ConZ.WeatherController2.NetMulticast_SendStateSnapshot
// Size: 0x34(Inherited: 0x0) 
struct FNetMulticast_SendStateSnapshot
{
	struct FWeatherReplicatedStateSnapshot Snapshot;  // 0x0(0x34)

}; 
// Function ConZ.FishingAttachmentFloater.Server_SendState
// Size: 0x50(Inherited: 0x0) 
struct FServer_SendState
{
	float DeltaTime;  // 0x0(0x4)
	char pad_4[12];  // 0x4(0xC)
	struct FRigidBodyState State;  // 0x10(0x40)

}; 
// Function ConZ.Door.ChangeOpenState
// Size: 0x1(Inherited: 0x0) 
struct FChangeOpenState
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ShouldOpen : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.Server_SetRotationTarget
// Size: 0x8(Inherited: 0x0) 
struct FServer_SetRotationTarget
{
	struct AActor* rotationTarget;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.RequestRespawn
// Size: 0x1C(Inherited: 0x0) 
struct FRequestRespawn
{
	struct FPrisonerTeleportRequest request;  // 0x0(0x1C)

}; 
// ScriptStruct ConZ.PrisonerTeleportRequest
// Size: 0x1C(Inherited: 0x0) 
struct FPrisonerTeleportRequest
{
	char pad_0[28];  // 0x0(0x1C)

}; 
// Function ConZ.Weapon.GetLoadedProjectileClass
// Size: 0x8(Inherited: 0x0) 
struct FGetLoadedProjectileClass
{
	AProjectile* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.PrisonerShotsFiredTrackerComponent.Client_SetWidgetVisibilityAndReset
// Size: 0x1(Inherited: 0x0) 
struct FClient_SetWidgetVisibilityAndReset
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Visibility : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.CharacterMeshMorphTargetArray
// Size: 0x10(Inherited: 0x0) 
struct FCharacterMeshMorphTargetArray
{
	struct TArray<struct FCharacterMeshMorphTarget> MorphTargetArray;  // 0x0(0x10)

}; 
// Function ConZ.Prisoner.RespawnAtCommonSpawnLocation
// Size: 0xC(Inherited: 0x0) 
struct FRespawnAtCommonSpawnLocation
{
	uint8_t  commonSpawnLocation;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	struct FSectorId SectorId;  // 0x4(0x8)

}; 
// ScriptStruct ConZ.FireShotDescription
// Size: 0x8(Inherited: 0x0) 
struct FFireShotDescription
{
	char pad_0[8];  // 0x0(0x8)

}; 
// Function ConZ.ConZGameState.SendServerTime
// Size: 0x4(Inherited: 0x0) 
struct FSendServerTime
{
	float Time;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.SetTargetLeanAmountOnServer
// Size: 0x4(Inherited: 0x0) 
struct FSetTargetLeanAmountOnServer
{
	float Value;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.SendMessageToClient
// Size: 0x18(Inherited: 0x0) 
struct FSendMessageToClient
{
	struct FString Message;  // 0x0(0x10)
	struct UAkAudioEvent* AudioEvent;  // 0x10(0x8)

}; 
// Function ConZ.ConZGameInstance.GetCurrentUserProfile
// Size: 0x8(Inherited: 0x0) 
struct FGetCurrentUserProfile
{
	struct UUserProfile* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.Server_AddNearbyFoliageInstances
// Size: 0x10(Inherited: 0x0) 
struct FServer_AddNearbyFoliageInstances
{
	struct TArray<struct FPrisonerNearbyFoliageInstanceInfoReplicated> replicatedInstanceInfo;  // 0x0(0x10)

}; 
// Function ConZ.Prisoner.SendSquadInvitationOnServer
// Size: 0x8(Inherited: 0x0) 
struct FSendSquadInvitationOnServer
{
	struct APrisoner* invited;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.TradeOutpostProsperityLevelInfo
// Size: 0x28(Inherited: 0x0) 
struct FTradeOutpostProsperityLevelInfo
{
	struct FString ProsperityLevelName;  // 0x0(0x10)
	float ProsperityLevelThreshold;  // 0x10(0x4)
	float FundsChangeRatePerHour;  // 0x14(0x4)
	int32_t ProsperityLevelThresholdGold;  // 0x18(0x4)
	float GBCRefreshRatePerHour;  // 0x1C(0x4)
	float GSCRefreshRatePerHour;  // 0x20(0x4)
	char pad_36[4];  // 0x24(0x4)

}; 
// DelegateFunction ConZ.ItemWidget2.OnRotated__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FOnRotated__DelegateSignature
{
	struct UItemWidget2* Widget;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.MapHUDHomeLocationObject
// Size: 0x48(Inherited: 0x18) 
struct FMapHUDHomeLocationObject : public FMapHUDObject
{
	struct UFont* _font;  // 0x18(0x8)
	char pad_32[40];  // 0x20(0x28)

}; 
// Function ConZ.LockpickingWidget.SetLockPickingDifficulty
// Size: 0x1(Inherited: 0x0) 
struct FSetLockPickingDifficulty
{
	uint8_t  Value;  // 0x0(0x1)

}; 
// Function ConZ.PlayerDrone.Server_AddInventoryNode
// Size: 0x38(Inherited: 0x0) 
struct FServer_AddInventoryNode
{
	struct UObject* Item;  // 0x0(0x8)
	struct UObject* container;  // 0x8(0x8)
	struct FInventoryPositionDataRepHelper position;  // 0x10(0x20)
	struct UObject* Target;  // 0x30(0x8)

}; 
// ScriptStruct ConZ.EconomyManagerRequestData
// Size: 0xB0(Inherited: 0x0) 
struct FEconomyManagerRequestData
{
	char pad_0[176];  // 0x0(0xB0)

}; 
// Function ConZ.Vehicle.GetVehicleAnimInstance
// Size: 0x8(Inherited: 0x0) 
struct FGetVehicleAnimInstance
{
	struct UAnimInstance* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Weapon.GetMuzzleDirection
// Size: 0xC(Inherited: 0x0) 
struct FGetMuzzleDirection
{
	struct FVector ReturnValue;  // 0x0(0xC)

}; 
// ScriptStruct ConZ.InventoryPositionDataRepHelper
// Size: 0x20(Inherited: 0x0) 
struct FInventoryPositionDataRepHelper
{
	UObject* _dataClass;  // 0x0(0x8)
	struct UInventoryPositionData* _positionData;  // 0x8(0x8)
	struct UObject* _owner;  // 0x10(0x8)
	int32_t _repKey;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)

}; 
// Function ConZ.PrisonerMovementComponent.GetWaterImmersionDepth
// Size: 0x4(Inherited: 0x0) 
struct FGetWaterImmersionDepth
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.Server_AIMovementFinished
// Size: 0x1(Inherited: 0x0) 
struct FServer_AIMovementFinished
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool wasSuccessful : 1;  // 0x0(0x1)

}; 
// Function ConZ.NetworkStatics.GetDefaultDedicatedServerResponsePort
// Size: 0x4(Inherited: 0x0) 
struct FGetDefaultDedicatedServerResponsePort
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.Server_DestroyPlaceable
// Size: 0x8(Inherited: 0x0) 
struct FServer_DestroyPlaceable
{
	struct FDbIntegerId ID;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.Server_InitiateCraftedPlacement
// Size: 0x8(Inherited: 0x0) 
struct FServer_InitiateCraftedPlacement
{
	struct UPlaceableCraftableItem* CraftableItem;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.PrisonerAppearance_TattooArray
// Size: 0x10(Inherited: 0x0) 
struct FPrisonerAppearance_TattooArray
{
	struct TArray<struct FPrisonerAppearance_Tattoo> Tattoos;  // 0x0(0x10)

}; 
// Function ConZ.WeaponAttachmentMagazine.AddAmmo
// Size: 0x10(Inherited: 0x0) 
struct FAddAmmo
{
	struct TArray<struct FAmmunitionData> ammo;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.ConZBaseElementIdentifier
// Size: 0x20(Inherited: 0x0) 
struct FConZBaseElementIdentifier
{
	int64_t BaseId;  // 0x0(0x8)
	int64_t ElementID;  // 0x8(0x8)
	struct FVector Location;  // 0x10(0xC)
	char pad_28[4];  // 0x1C(0x4)

}; 
// Function ConZ.Prisoner.Server_InteractWithLadder
// Size: 0x18(Inherited: 0x0) 
struct FServer_InteractWithLadder
{
	struct FVector traceOrigin;  // 0x0(0xC)
	struct FVector traceDirection;  // 0xC(0xC)

}; 
// ScriptStruct ConZ.PrisonerBodyMuscleGroupsVsSeverityKey
// Size: 0x60(Inherited: 0x0) 
struct FPrisonerBodyMuscleGroupsVsSeverityKey
{
	struct FFloatRange SeverityRange;  // 0x0(0x10)
	struct TSet<uint8_t > Values;  // 0x10(0x50)

}; 
// Function ConZ.ConZSquad.GetMember
// Size: 0x28(Inherited: 0x0) 
struct FGetMember
{
	struct FDbIntegerId UserProfileId;  // 0x0(0x8)
	struct FConZSquadMember ReturnValue;  // 0x8(0x20)

}; 
// ScriptStruct ConZ.RecipeItemState
// Size: 0x1C(Inherited: 0x0) 
struct FRecipeItemState
{
	char pad_0[28];  // 0x0(0x1C)

}; 
// Function ConZ.Prisoner.Server_lockpickingEnded
// Size: 0x30(Inherited: 0x0) 
struct FServer_lockpickingEnded
{
	struct UObject* Lockpickable;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool Succeeded : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)
	struct FConZBaseElementIdentifier lockpickableBaseElement;  // 0x10(0x20)

}; 
// Function ConZ.Prisoner.Server_MinigameEnded
// Size: 0x20(Inherited: 0x0) 
struct FServer_MinigameEnded
{
	AMinigame* minigameClass;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool isPractice : 1;  // 0x8(0x1)
	char pad_9_1 : 7;  // 0x9(0x1)
	bool Succeeded : 1;  // 0x9(0x1)
	char pad_10[6];  // 0xA(0x6)
	struct TArray<struct TWeakObjectPtr<AItem>> tools;  // 0x10(0x10)

}; 
// ScriptStruct ConZ.HitReactResult
// Size: 0x18(Inherited: 0x0) 
struct FHitReactResult
{
	struct UAnimMontage* MontageToPlay;  // 0x0(0x8)
	struct UAnimMontage* FollowupMontage;  // 0x8(0x8)
	float RegainControlDurationMultiplier;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// ScriptStruct ConZ.CharacterHeadImpactSoundsData
// Size: 0x18(Inherited: 0x0) 
struct FCharacterHeadImpactSoundsData
{
	struct TArray<struct FCharacterHeadImpactSoundData> SoundsData;  // 0x0(0x10)
	struct FCharacterImpactSounds FallbackSounds;  // 0x10(0x8)

}; 
// Function ConZ.Prisoner.Server_OnLockpickingProtectionTriggered
// Size: 0x30(Inherited: 0x0) 
struct FServer_OnLockpickingProtectionTriggered
{
	struct UObject* Lockpickable;  // 0x0(0x8)
	float Damage;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)
	struct UParticleSystem* Particles;  // 0x10(0x8)
	struct UAkAudioEvent* audio;  // 0x18(0x8)
	struct FVector ParticlesScale;  // 0x20(0xC)
	char pad_44[4];  // 0x2C(0x4)

}; 
// Function ConZ.Prisoner.Server_ProjectileDealDamage
// Size: 0x108(Inherited: 0x0) 
struct FServer_ProjectileDealDamage
{
	struct FNetPackedProjectileDamageEvent packedDamageEvent;  // 0x0(0x108)

}; 
// Function ConZ.InteractionComponent.Server_UpdateLockHPOnServer
// Size: 0x10(Inherited: 0x0) 
struct FServer_UpdateLockHPOnServer
{
	struct UObject* Lockpickable;  // 0x0(0x8)
	float lockHP;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function ConZ.PlayerRpcChannel.Server_DealRadialDamage
// Size: 0x40(Inherited: 0x0) 
struct FServer_DealRadialDamage
{
	struct APrisoner* Prisoner;  // 0x0(0x8)
	UObject* WeaponClass;  // 0x8(0x8)
	struct FVector zeroLocation;  // 0x10(0xC)
	float Damage;  // 0x1C(0x4)
	float InnerRadius;  // 0x20(0x4)
	float OuterRadius;  // 0x24(0x4)
	float Falloff;  // 0x28(0x4)
	float force;  // 0x2C(0x4)
	struct FTargetTypeDamageMultiplier TargetTypeMultiplier;  // 0x30(0x10)

}; 
// Function ConZ.HitReactComponent.GetPelvisBoneName
// Size: 0x8(Inherited: 0x0) 
struct FGetPelvisBoneName
{
	struct FName ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.TakeItemInHands
// Size: 0x8(Inherited: 0x0) 
struct FTakeItemInHands
{
	struct AItem* Item;  // 0x0(0x8)

}; 
// Function ConZ.BaseItemContainerWidget.GetSlots
// Size: 0x28(Inherited: 0x0) 
struct FGetSlots
{
	struct UGridSlot* GridSlot;  // 0x0(0x8)
	int32_t Width;  // 0x8(0x4)
	int32_t Height;  // 0xC(0x4)
	struct TArray<struct UInventorySlotUserWidget*> Slots;  // 0x10(0x10)
	char pad_32_1 : 7;  // 0x20(0x1)
	bool ReturnValue : 1;  // 0x20(0x1)
	char pad_33[7];  // 0x21(0x7)

}; 
// ScriptStruct ConZ.ScumPointDamageEvent
// Size: 0xB0(Inherited: 0xA8) 
struct FScumPointDamageEvent : public FPointDamageEvent
{
	char pad_168[8];  // 0xA8(0x8)

}; 
// Function ConZ.InteractableInterface.InteractWithItem
// Size: 0x80(Inherited: 0x0) 
struct FInteractWithItem
{
	struct APlayerController* PlayerController;  // 0x0(0x8)
	struct AItem* Item;  // 0x8(0x8)
	uint8_t  interactionType;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)
	struct FInteractionData InteractionData;  // 0x18(0x68)

}; 
// ScriptStruct ConZ.TabButtonStyle
// Size: 0x288(Inherited: 0x0) 
struct FTabButtonStyle
{
	struct FVector2D Size;  // 0x0(0x8)
	char EHorizontalAlignment HorizontalAlignment;  // 0x8(0x1)
	char EVerticalAlignment VerticalAlignment;  // 0x9(0x1)
	char pad_10[6];  // 0xA(0x6)
	struct FButtonStyle ButtonStyle;  // 0x10(0x278)

}; 
// Function ConZ.Prisoner.Server_RemoveNearbyFoliageInstances
// Size: 0x10(Inherited: 0x0) 
struct FServer_RemoveNearbyFoliageInstances
{
	struct TArray<struct FPrisonerNearbyFoliageInstanceInfoReplicated> replicatedInstanceInfo;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.BankCardTypeData
// Size: 0x48(Inherited: 0x0) 
struct FBankCardTypeData
{
	struct TSoftClassPtr<UObject> ItemClass;  // 0x0(0x28)
	int32_t PurchasePrice;  // 0x28(0x4)
	uint8_t  PurchasePriceCurrency;  // 0x2C(0x1)
	char pad_45[3];  // 0x2D(0x3)
	int32_t MaxWrongPinAttempts;  // 0x30(0x4)
	int32_t FreeRenewalNum;  // 0x34(0x4)
	int32_t DailyWithdrawLimit;  // 0x38(0x4)
	int32_t DailyDepositLimit;  // 0x3C(0x4)
	int32_t PinComplexity;  // 0x40(0x4)
	char pad_68[4];  // 0x44(0x4)

}; 
// Function ConZ.Prisoner.Server_ReportVote
// Size: 0x1(Inherited: 0x0) 
struct FServer_ReportVote
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Vote : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.SpawnCharacterAroundInfo
// Size: 0x50(Inherited: 0x0) 
struct FSpawnCharacterAroundInfo
{
	struct TArray<APawn*> AvailablePawns;  // 0x0(0x10)
	struct FTransform Transform;  // 0x10(0x30)
	float MinSpawnRadius;  // 0x40(0x4)
	float MaxSpawnRadius;  // 0x44(0x4)
	int32_t NumOfCharactersToSpawn;  // 0x48(0x4)
	char pad_76_1 : 7;  // 0x4C(0x1)
	bool IgnoreLimit : 1;  // 0x4C(0x1)
	char pad_77[3];  // 0x4D(0x3)

}; 
// Function ConZ.DropZoneGameEvent.GetPhase
// Size: 0x1(Inherited: 0x0) 
struct FGetPhase
{
	uint8_t  ReturnValue;  // 0x0(0x1)

}; 
// Function ConZ.PlayerRpcChannel.Mechanic_Server_SubscribeToVehicleServiceData
// Size: 0x8(Inherited: 0x0) 
struct FMechanic_Server_SubscribeToVehicleServiceData
{
	struct AMechanic* Mechanic;  // 0x0(0x8)

}; 
// Function ConZ.TrapItem.Multicast_SetOnlyManualTrigger
// Size: 0x1(Inherited: 0x0) 
struct FMulticast_SetOnlyManualTrigger
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool onlyManualTrigger : 1;  // 0x0(0x1)

}; 
// Function ConZ.PrisonerSkillComponent.SetSkillStaminaConsumptionOnServer
// Size: 0x10(Inherited: 0x0) 
struct FSetSkillStaminaConsumptionOnServer
{
	struct USkill* Skill;  // 0x0(0x8)
	float Consumption;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function ConZ.Prisoner.Server_SetActiveParachute
// Size: 0x8(Inherited: 0x0) 
struct FServer_SetActiveParachute
{
	struct AClothesItem* Parachute;  // 0x0(0x8)

}; 
// Function ConZ.Bird2.GetIsStaringPerched
// Size: 0x1(Inherited: 0x0) 
struct FGetIsStaringPerched
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.Server_SetCarryingItemState
// Size: 0x1(Inherited: 0x0) 
struct FServer_SetCarryingItemState
{
	uint8_t  State;  // 0x0(0x1)

}; 
// Function ConZ.Weapon.RemoveAttachment
// Size: 0x8(Inherited: 0x0) 
struct FRemoveAttachment
{
	struct AWeaponAttachment* Attachment;  // 0x0(0x8)

}; 
// Function ConZ.Drone.Server_SetCurrentSpeedStep
// Size: 0x4(Inherited: 0x0) 
struct FServer_SetCurrentSpeedStep
{
	int32_t step;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.Server_SetDangerCooldown
// Size: 0x10(Inherited: 0x0) 
struct FServer_SetDangerCooldown
{
	float cooldown;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct APrisoner* Prisoner;  // 0x8(0x8)

}; 
// Function ConZ.Vehicle.SetVehicleDoorWindowCollisionAttached
// Size: 0x8(Inherited: 0x0) 
struct FSetVehicleDoorWindowCollisionAttached
{
	int32_t doorIndex;  // 0x0(0x4)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool Value : 1;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)

}; 
// DelegateFunction ConZ.TrashNamedSliderValueChangedTemp__DelegateSignature
// Size: 0x4(Inherited: 0x0) 
struct FTrashNamedSliderValueChangedTemp__DelegateSignature
{
	float NewValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.Server_SetGameEventLoadout
// Size: 0x68(Inherited: 0x0) 
struct FServer_SetGameEventLoadout
{
	AItem* primary;  // 0x0(0x8)
	struct TArray<AItem*> primaryAttachments;  // 0x8(0x10)
	AItem* secondary;  // 0x18(0x8)
	struct TArray<AItem*> secondaryAttachments;  // 0x20(0x10)
	AItem* tertiary;  // 0x30(0x8)
	struct TArray<AItem*> tertiaryAttachments;  // 0x38(0x10)
	struct TArray<AItem*> outfit;  // 0x48(0x10)
	struct TArray<AItem*> support;  // 0x58(0x10)

}; 
// Function ConZ.DropZoneKey.SphereOverlap
// Size: 0xA8(Inherited: 0x0) 
struct FSphereOverlap
{
	struct UPrimitiveComponent* OverlappedComponent;  // 0x0(0x8)
	struct AActor* OtherActor;  // 0x8(0x8)
	struct UPrimitiveComponent* OtherComp;  // 0x10(0x8)
	int32_t OtherBodyIndex;  // 0x18(0x4)
	char pad_28_1 : 7;  // 0x1C(0x1)
	bool bFromSweep : 1;  // 0x1C(0x1)
	char pad_29[3];  // 0x1D(0x3)
	struct FHitResult SweepResult;  // 0x20(0x88)

}; 
// ScriptStruct ConZ.LadderDetectionParams
// Size: 0x20(Inherited: 0x0) 
struct FLadderDetectionParams
{
	struct FVector RayOrigin;  // 0x0(0xC)
	struct FVector RayDirection;  // 0xC(0xC)
	float MaxHorzDistanceToLadder;  // 0x18(0x4)
	float MaxRayToLadderAngle;  // 0x1C(0x4)

}; 
// Function ConZ.QuickAccessItemWidget.OnItemDestroyed
// Size: 0x8(Inherited: 0x0) 
struct FOnItemDestroyed
{
	struct AActor* itemActor;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.Server_SetItemInHandsVisualObstructionDepth
// Size: 0x4(Inherited: 0x0) 
struct FServer_SetItemInHandsVisualObstructionDepth
{
	float Value;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.Server_SetMeleeTarget
// Size: 0x8(Inherited: 0x0) 
struct FServer_SetMeleeTarget
{
	struct AActor* Value;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.Server_SetPlayingInstrumentState
// Size: 0x1(Inherited: 0x0) 
struct FServer_SetPlayingInstrumentState
{
	uint8_t  Value;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.VehicleMarkerData
// Size: 0x20(Inherited: 0x0) 
struct FVehicleMarkerData
{
	char pad_0[32];  // 0x0(0x20)

}; 
// DelegateFunction ConZ.TrashCarouselValueChangedTemp__DelegateSignature
// Size: 0x4(Inherited: 0x0) 
struct FTrashCarouselValueChangedTemp__DelegateSignature
{
	int32_t NewValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.Server_SetScopingWithItemInHandsState
// Size: 0x1(Inherited: 0x0) 
struct FServer_SetScopingWithItemInHandsState
{
	uint8_t  Value;  // 0x0(0x1)

}; 
// Function ConZ.CookedFoodItem.NetMulticast_SetupStateFromCooking
// Size: 0x18(Inherited: 0x0) 
struct FNetMulticast_SetupStateFromCooking
{
	uint32_t cookState;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct TArray<char> ingredientData;  // 0x8(0x10)

}; 
// Function ConZ.Prisoner.Server_SetShouldIgnoreHeadTurning
// Size: 0x1(Inherited: 0x0) 
struct FServer_SetShouldIgnoreHeadTurning
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.Server_SetVehicleAimingYaw
// Size: 0x4(Inherited: 0x0) 
struct FServer_SetVehicleAimingYaw
{
	float angle;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.SetIsInCombatModeOnServer
// Size: 0x1(Inherited: 0x0) 
struct FSetIsInCombatModeOnServer
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// Function ConZ.GameEventBorder.GetRadius
// Size: 0x4(Inherited: 0x0) 
struct FGetRadius
{
	float ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.DoorUnlockDataDescription
// Size: 0x10(Inherited: 0x0) 
struct FDoorUnlockDataDescription
{
	UDoorUnlockData* DoorUnlockData;  // 0x0(0x8)
	int32_t ProbabilityCount;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function ConZ.Prisoner.Server_SplitCurrencyItem
// Size: 0x10(Inherited: 0x0) 
struct FServer_SplitCurrencyItem
{
	struct AItem* currencyItem;  // 0x0(0x8)
	int32_t newAmount;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function ConZ.WeaponAction.InsertCartridgeIntoWeaponAtLocation
// Size: 0x18(Inherited: 0x0) 
struct FInsertCartridgeIntoWeaponAtLocation
{
	struct AWeapon* Weapon;  // 0x0(0x8)
	struct AAmmunitionItem* ammo;  // 0x8(0x8)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool backLocation : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// Function ConZ.Vehicle.GetNumVehicleDoors
// Size: 0x4(Inherited: 0x0) 
struct FGetNumVehicleDoors
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Prisoner.Server_StoreAmmoInAmmoBox
// Size: 0x10(Inherited: 0x0) 
struct FServer_StoreAmmoInAmmoBox
{
	struct AAmmunitionItem* ammo;  // 0x0(0x8)
	struct AAmmunitionBoxItem* Box;  // 0x8(0x8)

}; 
// Function ConZ.Weapon.GetMakeNoiseLoudness
// Size: 0x4(Inherited: 0x0) 
struct FGetMakeNoiseLoudness
{
	float ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.PrisonerBodyMuscleGroupsVsSeverity
// Size: 0x10(Inherited: 0x0) 
struct FPrisonerBodyMuscleGroupsVsSeverity
{
	struct TArray<struct FPrisonerBodyMuscleGroupsVsSeverityKey> Keys;  // 0x0(0x10)

}; 
// Function ConZ.Vehicle.GetMountSlotIndicatorsWidget
// Size: 0x8(Inherited: 0x0) 
struct FGetMountSlotIndicatorsWidget
{
	UUserWidget* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.Server_SwapWeaponAttachments
// Size: 0x18(Inherited: 0x0) 
struct FServer_SwapWeaponAttachments
{
	struct AWeapon* Weapon;  // 0x0(0x8)
	struct AWeaponAttachment* oldAttachment;  // 0x8(0x8)
	struct AWeaponAttachment* newAttachment;  // 0x10(0x8)

}; 
// Function ConZ.Prisoner.Server_UnloadAmmoFromMagazine
// Size: 0x8(Inherited: 0x0) 
struct FServer_UnloadAmmoFromMagazine
{
	struct AWeaponAttachmentMagazine* magazine;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.HitReactMagnitudeData
// Size: 0x120(Inherited: 0x0) 
struct FHitReactMagnitudeData
{
	struct FHitReactDirectionData SmallHit;  // 0x0(0x48)
	struct FHitReactDirectionData MediumHit;  // 0x48(0x48)
	struct FHitReactDirectionData LargeHit;  // 0x90(0x48)
	struct FHitReactDirectionData KnockoutHit;  // 0xD8(0x48)

}; 
// Function ConZ.Prisoner.SetFreeLookEnabledOnServer
// Size: 0x1(Inherited: 0x0) 
struct FSetFreeLookEnabledOnServer
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// Function ConZ.GameEventTeamHeaderWidget.SetGameEvent
// Size: 0x8(Inherited: 0x0) 
struct FSetGameEvent
{
	struct AGameEventBase* gameEvent;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.VehicleExhaustEffectsParameters
// Size: 0x70(Inherited: 0x0) 
struct FVehicleExhaustEffectsParameters
{
	struct FTransform Transform;  // 0x0(0x30)
	struct UParticleSystem* EngineStartedParticleSystem;  // 0x30(0x8)
	struct UParticleSystem* EngineIdleParticleSystem;  // 0x38(0x8)
	struct UParticleSystem* ThrottlePressedParticleSystem;  // 0x40(0x8)
	struct UAkAudioEvent* ThrottlePressedAudioEvent;  // 0x48(0x8)
	float MinDurationBetweenThrottlePressedEffects;  // 0x50(0x4)
	float DeactivationDelay;  // 0x54(0x4)
	char pad_88[24];  // 0x58(0x18)

}; 
// Function ConZ.Prisoner.SetIsEnabled
// Size: 0x1(Inherited: 0x0) 
struct FSetIsEnabled
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// Function ConZ.MeleeCombatComponent.SetIsInCombatMode
// Size: 0x1(Inherited: 0x0) 
struct FSetIsInCombatMode
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.SetIsLimpingOverrideEnabled
// Size: 0x1(Inherited: 0x0) 
struct FSetIsLimpingOverrideEnabled
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// Function ConZ.PrisonerAnimInstance.GetIKLegsRootOffsetVectorFromCardinalDirection
// Size: 0x10(Inherited: 0x0) 
struct FGetIKLegsRootOffsetVectorFromCardinalDirection
{
	uint8_t  Value;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	struct FVector ReturnValue;  // 0x4(0xC)

}; 
// ScriptStruct ConZ.PhysicalAnimationDesc
// Size: 0x34(Inherited: 0x0) 
struct FPhysicalAnimationDesc
{
	char pad_0[52];  // 0x0(0x34)

}; 
// Function ConZ.Prisoner.SetMidiDeviceByIndex
// Size: 0x8(Inherited: 0x0) 
struct FSetMidiDeviceByIndex
{
	int32_t Index;  // 0x0(0x4)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool ReturnValue : 1;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)

}; 
// ScriptStruct ConZ.WindowMarker
// Size: 0x50(Inherited: 0x0) 
struct FWindowMarker
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool IsVaultable : 1;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool IsFortifiable : 1;  // 0x1(0x1)
	char pad_2[6];  // 0x2(0x6)
	struct UWindowFortificationsType* WindowFortificationsType;  // 0x8(0x8)
	struct TArray<int32_t> AdditionalMarkerIndicesToModify;  // 0x10(0x10)
	char pad_32_1 : 7;  // 0x20(0x1)
	bool DidIFailToCorrectlyPlaceWindowMarkers : 1;  // 0x20(0x1)
	char pad_33[3];  // 0x21(0x3)
	struct FVector Vertex1;  // 0x24(0xC)
	struct FVector Vertex2;  // 0x30(0xC)
	float FortificationOffset;  // 0x3C(0x4)
	float CollisionBoxVertBias;  // 0x40(0x4)
	float CollisionBoxHorzBias;  // 0x44(0x4)
	char pad_72[8];  // 0x48(0x8)

}; 
// ScriptStruct ConZ.MapHUDPrisonerObject
// Size: 0x40(Inherited: 0x18) 
struct FMapHUDPrisonerObject : public FMapHUDObject
{
	struct FVector2D _prisonerPositionTextureSize;  // 0x18(0x8)
	struct UTexture* _myPrisonerPositionTexture;  // 0x20(0x8)
	struct UTexture* _prisonerPingAnimationTexture;  // 0x28(0x8)
	float _prisonerPingSizeMultiplier;  // 0x30(0x4)
	char pad_52[12];  // 0x34(0xC)

}; 
// Function ConZ.Prisoner.SetMidiDeviceByName
// Size: 0x18(Inherited: 0x0) 
struct FSetMidiDeviceByName
{
	struct FString Name;  // 0x0(0x10)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// ScriptStruct ConZ.NotificationDescriptionReplicationHelper
// Size: 0x18(Inherited: 0x0) 
struct FNotificationDescriptionReplicationHelper
{
	char pad_0[24];  // 0x0(0x18)

}; 
// Function ConZ.Prisoner.SetOverrideIsLimping
// Size: 0x1(Inherited: 0x0) 
struct FSetOverrideIsLimping
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.CorpseStaticMeshRepData
// Size: 0x70(Inherited: 0x0) 
struct FCorpseStaticMeshRepData
{
	struct FName DisplayName;  // 0x0(0x8)
	struct UStaticMesh* Mesh;  // 0x8(0x8)
	struct TArray<struct UMaterialInterface*> Materials;  // 0x10(0x10)
	char pad_32_1 : 7;  // 0x20(0x1)
	bool Visibility : 1;  // 0x20(0x1)
	char pad_33[15];  // 0x21(0xF)
	struct FTransform Transform;  // 0x30(0x30)
	struct FName AttachSocket;  // 0x60(0x8)
	char pad_104[8];  // 0x68(0x8)

}; 
// ScriptStruct ConZ.CarouselTextStyle
// Size: 0x80(Inherited: 0x0) 
struct FCarouselTextStyle
{
	struct FMargin Padding;  // 0x0(0x10)
	char EHorizontalAlignment HorizontalAlignment;  // 0x10(0x1)
	char EVerticalAlignment VerticalAlignment;  // 0x11(0x1)
	char pad_18[6];  // 0x12(0x6)
	struct FSlateFontInfo Font;  // 0x18(0x58)
	struct FLinearColor ColorAndOpacity;  // 0x70(0x10)

}; 
// Function ConZ.Prisoner.SetPlayerSoundLevel
// Size: 0x4(Inherited: 0x0) 
struct FSetPlayerSoundLevel
{
	float Value;  // 0x0(0x4)

}; 
// Function ConZ.ItemSelectionWidget.On_Selection_MouseButtonDown
// Size: 0x160(Inherited: 0x0) 
struct FOn_Selection_MouseButtonDown
{
	struct FGeometry Geometry;  // 0x0(0x38)
	struct FPointerEvent MouseEvent;  // 0x38(0x70)
	struct FEventReply ReturnValue;  // 0xA8(0xB8)

}; 
// Function ConZ.Vehicle.IsVehicleInteriorExposed
// Size: 0x1(Inherited: 0x0) 
struct FIsVehicleInteriorExposed
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.User.SetFavoriteServers
// Size: 0x10(Inherited: 0x0) 
struct FSetFavoriteServers
{
	struct TArray<struct FUserServerHistoryItem> Value;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.ActiveMovingThroughFoliageSounds
// Size: 0x20(Inherited: 0x0) 
struct FActiveMovingThroughFoliageSounds
{
	char pad_0[8];  // 0x0(0x8)
	struct UAkAudioEvent* StartAudioEvent;  // 0x8(0x8)
	struct UAkAudioEvent* StopAudioEvent;  // 0x10(0x8)
	char pad_24[8];  // 0x18(0x8)

}; 
// ScriptStruct ConZ.CraftingIngredientTypeModifier
// Size: 0x10(Inherited: 0x0) 
struct FCraftingIngredientTypeModifier
{
	UCraftingIngredientType* IngredientType;  // 0x0(0x8)
	float AmountMultiplier;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function ConZ.Prisoner.SetRotationTarget
// Size: 0x8(Inherited: 0x0) 
struct FSetRotationTarget
{
	struct AActor* rotationTarget;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.AITeamAttitudeData
// Size: 0x7(Inherited: 0x0) 
struct FAITeamAttitudeData
{
	char ETeamAttitude AttitudePerTeam[7];  // 0x0(0x7)

}; 
// Function ConZ.Prisoner.SetTargetOnServer
// Size: 0x8(Inherited: 0x0) 
struct FSetTargetOnServer
{
	struct AActor* Target;  // 0x0(0x8)

}; 
// Function ConZ.Prisoner.SetWristwatchBrightness
// Size: 0x4(Inherited: 0x0) 
struct FSetWristwatchBrightness
{
	float Value;  // 0x0(0x4)

}; 
// Function ConZ.Weapon.Server_InsertCartridgeIntoWeapon
// Size: 0x20(Inherited: 0x0) 
struct FServer_InsertCartridgeIntoWeapon
{
	struct AAmmunitionItem* ammo;  // 0x0(0x8)
	struct FAmmunitionData AmmunitionData;  // 0x8(0x18)

}; 
// Function ConZ.Prisoner.ShouldLookatMeleeTarget
// Size: 0x1(Inherited: 0x0) 
struct FShouldLookatMeleeTarget
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Prisoner.ShowSpawnScreen
// Size: 0x1(Inherited: 0x0) 
struct FShowSpawnScreen
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool loadoutMenu : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.PrisonerMountReplication
// Size: 0x10(Inherited: 0x0) 
struct FPrisonerMountReplication
{
	struct UObject* MountedSlot;  // 0x0(0x8)
	uint8_t  _mountFlags;  // 0x8(0x1)
	char _version;  // 0x9(0x1)
	char pad_10[6];  // 0xA(0x6)

}; 
// DelegateFunction ConZ.Door.OnLockRemoved__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FOnLockRemoved__DelegateSignature
{
	struct ADoor* Door;  // 0x0(0x8)

}; 
// Function ConZ.Door.OnRep_StateFlags
// Size: 0x1(Inherited: 0x0) 
struct FOnRep_StateFlags
{
	uint8_t  Previous;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.VehicleManualSpawnPresetArray
// Size: 0x20(Inherited: 0x0) 
struct FVehicleManualSpawnPresetArray
{
	struct UVehiclePreset* PresetPerSpawnType[4];  // 0x0(0x20)

}; 
// Function ConZ.Door.ShouldOpen
// Size: 0x1(Inherited: 0x0) 
struct FShouldOpen
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.TabTextStyle
// Size: 0x98(Inherited: 0x0) 
struct FTabTextStyle
{
	struct FMargin Padding;  // 0x0(0x10)
	char EHorizontalAlignment HorizontalAlignment;  // 0x10(0x1)
	char EVerticalAlignment VerticalAlignment;  // 0x11(0x1)
	char pad_18[6];  // 0x12(0x6)
	struct FSlateFontInfo Font;  // 0x18(0x58)
	struct FLinearColor Color;  // 0x70(0x10)
	struct FVector2D ShadowOffset;  // 0x80(0x8)
	struct FLinearColor ShadowColorAndOpacity;  // 0x88(0x10)

}; 
// ScriptStruct ConZ.DoorRepData
// Size: 0x48(Inherited: 0x0) 
struct FDoorRepData
{
	uint8_t  StateFlags;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct FDbIntegerId OwningUserProfileId;  // 0x8(0x8)
	struct TArray<UObject*> Locks;  // 0x10(0x10)
	struct TArray<int32_t> RemainingNeutralizationAttemptsPerLock;  // 0x20(0x10)
	char DoorAccessLevel;  // 0x30(0x1)
	char pad_49[7];  // 0x31(0x7)
	struct TArray<struct AItem*> AttachedItems;  // 0x38(0x10)

}; 
// DelegateFunction ConZ.ConZBaseElement.ElementInteractedEvent__DelegateSignature
// Size: 0x80(Inherited: 0x0) 
struct FElementInteractedEvent__DelegateSignature
{
	struct APrisoner* User;  // 0x0(0x8)
	uint8_t  interactionType;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)
	struct FInteractionData InteractionData;  // 0x10(0x68)
	struct FBaseInteractionParams BaseInteractionParams;  // 0x78(0x8)

}; 
// Function ConZ.PlayerRpcChannel.Inventory_Server_DropInventoryElement
// Size: 0x40(Inherited: 0x0) 
struct FInventory_Server_DropInventoryElement
{
	struct AConZCharacter* Character;  // 0x0(0x8)
	struct FInv2021_InventoryElementRepHelper Element;  // 0x8(0x20)
	struct FInv2021_InventoryPositionObjectRepHelper position;  // 0x28(0x18)

}; 
// Function ConZ.Weapon.GetMalfunctionsForEvent
// Size: 0x30(Inherited: 0x0) 
struct FGetMalfunctionsForEvent
{
	uint8_t  malfunctionEvent;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	struct FWeaponMalfunctionEventDescription desc;  // 0x4(0x8)
	char pad_12[4];  // 0xC(0x4)
	struct TArray<struct FWeaponMalfunctionProbability> malfunctionsIn;  // 0x10(0x10)
	struct TArray<struct FWeaponMalfunctionProbability> malfunctionsOut;  // 0x20(0x10)

}; 
// Function ConZ.SquadEditor.OnBackgroundClicked
// Size: 0x8(Inherited: 0x0) 
struct FOnBackgroundClicked
{
	struct UDropdownMenuSelectionWidget* Widget;  // 0x0(0x8)

}; 
// DelegateFunction ConZ.TakeDamageDelegate__DelegateSignature
// Size: 0x20(Inherited: 0x0) 
struct FTakeDamageDelegate__DelegateSignature
{
	struct AActor* damageActor;  // 0x0(0x8)
	float Damage;  // 0x8(0x4)
	struct FVector HitLocation;  // 0xC(0xC)
	struct APawn* eventInstigator;  // 0x18(0x8)

}; 
// Function ConZ.PrisonerAnimInstance.GetCurrentLocomotionStateElapsedTime
// Size: 0x4(Inherited: 0x0) 
struct FGetCurrentLocomotionStateElapsedTime
{
	float ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.PrisonerAppearance_SkinParams
// Size: 0x38(Inherited: 0x0) 
struct FPrisonerAppearance_SkinParams
{
	struct TArray<struct FPrisonerAppearance_FaceVariation> FaceVariations;  // 0x0(0x10)
	struct TArray<struct FPrisonerAppearance_SkinTone> SkinTones;  // 0x10(0x10)
	struct TArray<struct FPrisonerAppearance_HairColorPreset> HairColorPresets;  // 0x20(0x10)
	int32_t DefaultSkinToneIndex;  // 0x30(0x4)
	char pad_52[4];  // 0x34(0x4)

}; 
// DelegateFunction ConZ.ActionChangedDelegate__DelegateSignature
// Size: 0x2(Inherited: 0x0) 
struct FActionChangedDelegate__DelegateSignature
{
	uint8_t  CurrentAction;  // 0x0(0x1)
	uint8_t  PrevAction;  // 0x1(0x1)

}; 
// ScriptStruct ConZ.UnlockLocation
// Size: 0x30(Inherited: 0x0) 
struct FUnlockLocation
{
	struct FTransform Transform;  // 0x0(0x30)

}; 
// Function ConZ.AmmunitionItem.SetAmmoCount
// Size: 0x8(Inherited: 0x0) 
struct FSetAmmoCount
{
	int32_t Count;  // 0x0(0x4)
	uint8_t  broadcastRPCType;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)

}; 
// Function ConZ.ComplexAnimal2.ChangeSpeed
// Size: 0x4(Inherited: 0x0) 
struct FChangeSpeed
{
	float pace;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.FishStateParameters
// Size: 0x10(Inherited: 0x0) 
struct FFishStateParameters
{
	float MaxSpeed;  // 0x0(0x4)
	float Acceleration;  // 0x4(0x4)
	float Deceleration;  // 0x8(0x4)
	float TurnSpeed;  // 0xC(0x4)

}; 
// DelegateFunction ConZ.ItemContainer.OnItemContainerUnlocked__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FOnItemContainerUnlocked__DelegateSignature
{
	struct AItemContainer* ItemContainer;  // 0x0(0x8)

}; 
// Function ConZ.PhotoModePawn.Client_Initialize
// Size: 0x8(Inherited: 0x0) 
struct FClient_Initialize
{
	struct AActor* Target;  // 0x0(0x8)

}; 
// Function ConZ.Weapon.AddAttachment
// Size: 0x10(Inherited: 0x0) 
struct FAddAttachment
{
	struct AWeaponAttachment* Attachment;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool attach : 1;  // 0x8(0x1)
	char pad_9_1 : 7;  // 0x9(0x1)
	bool removeExistingOnTheSameMountType : 1;  // 0x9(0x1)
	char pad_10[6];  // 0xA(0x6)

}; 
// Function ConZ.Objective.Client_ShowWaypointWidget
// Size: 0x10(Inherited: 0x0) 
struct FClient_ShowWaypointWidget
{
	struct AActor* targetActor;  // 0x0(0x8)
	struct AActor* actorToTieLifetime;  // 0x8(0x8)

}; 
// ScriptStruct ConZ.AquaticLifeSpawningVolumeDescription
// Size: 0x68(Inherited: 0x0) 
struct FAquaticLifeSpawningVolumeDescription
{
	char pad_0[32];  // 0x0(0x20)
	struct UFishSpeciesPreset* FishSpeciesPreset;  // 0x20(0x8)
	struct UFishSpawningPreset* FishSpawningPreset;  // 0x28(0x8)
	char pad_48[56];  // 0x30(0x38)

}; 
// Function ConZ.UserProfile.SetAuthorityInfo
// Size: 0x40(Inherited: 0x0) 
struct FSetAuthorityInfo
{
	struct FUserProfileAuthorityInfo Value;  // 0x0(0x40)

}; 
// Function ConZ.Weapon.AddAttachmentLocal
// Size: 0x10(Inherited: 0x0) 
struct FAddAttachmentLocal
{
	struct AWeaponAttachment* Attachment;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool attach : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.ItemUserWidget.OnItemSelectionChanged
// Size: 0x1(Inherited: 0x0) 
struct FOnItemSelectionChanged
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool selected : 1;  // 0x0(0x1)

}; 
// Function ConZ.PlayerRpcChannel.Chat_Client_UpdatePlayerArgumentCompletionCache
// Size: 0x10(Inherited: 0x0) 
struct FChat_Client_UpdatePlayerArgumentCompletionCache
{
	struct TArray<struct FString> completions;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.PrisonerInjuryTypeLikelihoods
// Size: 0x20(Inherited: 0x0) 
struct FPrisonerInjuryTypeLikelihoods
{
	struct FString Name;  // 0x0(0x10)
	float BoneInjuryLikelihood;  // 0x10(0x4)
	float MuscleInjuryLikelihood;  // 0x14(0x4)
	float OrganInjuryLikelihood;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)

}; 
// DelegateFunction ConZ.Weapon.AttachmentAddedSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FAttachmentAddedSignature__DelegateSignature
{
	struct AWeapon* sender;  // 0x0(0x8)
	struct AWeaponAttachment* Attachment;  // 0x8(0x8)

}; 
// DelegateFunction ConZ.Weapon.AttachmentRemovedSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FAttachmentRemovedSignature__DelegateSignature
{
	struct AWeapon* sender;  // 0x0(0x8)
	struct AWeaponAttachment* Attachment;  // 0x8(0x8)

}; 
// ScriptStruct ConZ.ProjectileArrowData
// Size: 0x20(Inherited: 0x0) 
struct FProjectileArrowData
{
	UObject* AmmunitionArrowClass;  // 0x0(0x8)
	float ItemsHealth;  // 0x8(0x4)
	float StiffnessFactor;  // 0xC(0x4)
	float FlightRotationCorrectionSpeed;  // 0x10(0x4)
	float DeviationDegrees;  // 0x14(0x4)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool IsPartOfEvent : 1;  // 0x18(0x1)
	char pad_25[7];  // 0x19(0x7)

}; 
// Function ConZ.BuildingCraftingPanelBase.OnRecipeClicked
// Size: 0x8(Inherited: 0x0) 
struct FOnRecipeClicked
{
	struct UCraftingRecipeWidget* Widget;  // 0x0(0x8)

}; 
// Function ConZ.Weapon.CanAddAttachment
// Size: 0x10(Inherited: 0x0) 
struct FCanAddAttachment
{
	struct AWeaponAttachment* Attachment;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.Weapon.RequestClearMalfunction
// Size: 0x1(Inherited: 0x0) 
struct FRequestClearMalfunction
{
	uint8_t  malfunction;  // 0x0(0x1)

}; 
// Function ConZ.FishingRod.GetFishingRodOwner
// Size: 0x8(Inherited: 0x0) 
struct FGetFishingRodOwner
{
	struct APrisoner* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.HandheldLightItem.GetCurrentLightAngle
// Size: 0x4(Inherited: 0x0) 
struct FGetCurrentLightAngle
{
	float ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.BoatParametersPerMovementPace_Deprecated
// Size: 0x18(Inherited: 0x0) 
struct FBoatParametersPerMovementPace_Deprecated
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool IsValid : 1;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float BaseMaxForwardSpeed;  // 0x4(0x4)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool CanReverse : 1;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)
	float BaseMaxReverseSpeed;  // 0xC(0x4)
	float MinPrisonerStrength;  // 0x10(0x4)
	float ThrottleMultiplier;  // 0x14(0x4)

}; 
// Function ConZ.FishingRod.NetMulticast_SetHookBitten
// Size: 0x10(Inherited: 0x0) 
struct FNetMulticast_SetHookBitten
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct UFishSpeciesData* speciesData;  // 0x8(0x8)

}; 
// Function ConZ.GameEventBase.ChooseSpawnLocation
// Size: 0x18(Inherited: 0x0) 
struct FChooseSpawnLocation
{
	struct APrisoner* Prisoner;  // 0x0(0x8)
	struct FVector ReturnValue;  // 0x8(0xC)
	char pad_20[4];  // 0x14(0x4)

}; 
// ScriptStruct ConZ.CharacterMeshMaterialOverride
// Size: 0x78(Inherited: 0x0) 
struct FCharacterMeshMaterialOverride
{
	struct FGameplayTagQuery Condition;  // 0x0(0x48)
	struct FName MaterialSlot;  // 0x48(0x8)
	struct TSoftObjectPtr<UMaterialInstance> OverrideMaterial;  // 0x50(0x28)

}; 
// ScriptStruct ConZ.FireShotProjectileDescription
// Size: 0x1(Inherited: 0x0) 
struct FFireShotProjectileDescription
{
	char pad_0[1];  // 0x0(0x1)

}; 
// Function ConZ.GameEventBase.AssignParticipantTeam
// Size: 0x10(Inherited: 0x0) 
struct FAssignParticipantTeam
{
	struct APrisoner* Prisoner;  // 0x0(0x8)
	int32_t ReturnValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function ConZ.Weapon.ShouldPlayCasingEjectedSound
// Size: 0x1(Inherited: 0x0) 
struct FShouldPlayCasingEjectedSound
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.ConZGameInstance.GetDedicatedServerRequest
// Size: 0x8(Inherited: 0x0) 
struct FGetDedicatedServerRequest
{
	struct UDedicatedServerRequest* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.FishingRod.OnFishingActionAnimNotify
// Size: 0x1(Inherited: 0x0) 
struct FOnFishingActionAnimNotify
{
	uint8_t  notifyType;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.MovableCollisionFieldMoveInfo
// Size: 0x8(Inherited: 0x0) 
struct FMovableCollisionFieldMoveInfo
{
	float Duration;  // 0x0(0x4)
	uint8_t  curveType;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)

}; 
// Function ConZ.FishingBarWidget.GetProgressPercentage
// Size: 0x4(Inherited: 0x0) 
struct FGetProgressPercentage
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Weapon.RemoveAttachmentLocal
// Size: 0x8(Inherited: 0x0) 
struct FRemoveAttachmentLocal
{
	struct AWeaponAttachment* Attachment;  // 0x0(0x8)

}; 
// Function ConZ.GameEventBase.AwardParticipant
// Size: 0x10(Inherited: 0x0) 
struct FAwardParticipant
{
	int32_t Index;  // 0x0(0x4)
	struct FGameEventRewardPoints reward;  // 0x4(0xC)

}; 
// Function ConZ.PlayerRpcChannel.Lockpickable_Server_TriggerFailurePenalty
// Size: 0x10(Inherited: 0x0) 
struct FLockpickable_Server_TriggerFailurePenalty
{
	struct UObject* Lockpickable;  // 0x0(0x8)
	struct APrisoner* triggeringPrisoner;  // 0x8(0x8)

}; 
// Function ConZ.FishingRod.Server_CheckIfFishBitBait
// Size: 0xC(Inherited: 0x0) 
struct FServer_CheckIfFishBitBait
{
	struct FVector Location;  // 0x0(0xC)

}; 
// ScriptStruct ConZ.HitReactLandingData
// Size: 0x28(Inherited: 0x0) 
struct FHitReactLandingData
{
	float MinImpactSpeedToReact;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct UAnimMontage* MontageToPlay;  // 0x8(0x8)
	float RegainControlDurationMultiplier;  // 0x10(0x4)
	char pad_20_1 : 7;  // 0x14(0x1)
	bool CanEverGoToRagdoll : 1;  // 0x14(0x1)
	char pad_21[3];  // 0x15(0x3)
	float MinImpactSpeedForRagdoll;  // 0x18(0x4)
	float MinRagdollDuration;  // 0x1C(0x4)
	float MaxRagdollDuration;  // 0x20(0x4)
	float RagdollDurationPerSpeedUnit;  // 0x24(0x4)

}; 
// ScriptStruct ConZ.MeleeSkillAttack
// Size: 0x78(Inherited: 0x0) 
struct FMeleeSkillAttack
{
	struct FGameplayTagContainer AttackTypes;  // 0x0(0x20)
	struct FGameplayTagContainer IgnoreReason;  // 0x20(0x20)
	struct UAnimMontage* Montage;  // 0x40(0x8)
	struct UAnimMontage* MontageFP;  // 0x48(0x8)
	struct FFloatInterval PitchRange;  // 0x50(0x8)
	float MaxDistance;  // 0x58(0x4)
	float MinDistance;  // 0x5C(0x4)
	float MinStamina;  // 0x60(0x4)
	float OrientToTargetSpeedFactor;  // 0x64(0x4)
	float RegainControlDurationMultiplier;  // 0x68(0x4)
	float StaminaDrainMultiplier;  // 0x6C(0x4)
	char pad_112_1 : 7;  // 0x70(0x1)
	bool CanBeUsedAsInitialAttack : 1;  // 0x70(0x1)
	char pad_113_1 : 7;  // 0x71(0x1)
	bool CanBeUsedToCloseLargeDistanceToTarget : 1;  // 0x71(0x1)
	char pad_114_1 : 7;  // 0x72(0x1)
	bool Solo : 1;  // 0x72(0x1)
	char pad_115_1 : 7;  // 0x73(0x1)
	bool Mute : 1;  // 0x73(0x1)
	char pad_116_1 : 7;  // 0x74(0x1)
	bool IsAlwaysCandidate : 1;  // 0x74(0x1)
	char pad_117[3];  // 0x75(0x3)

}; 
// Function ConZ.FishingRod.Server_CleanupTrophyState
// Size: 0x1(Inherited: 0x0) 
struct FServer_CleanupTrophyState
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool keptFish : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.SearchItemSpawnerPresetArray
// Size: 0x10(Inherited: 0x0) 
struct FSearchItemSpawnerPresetArray
{
	struct TArray<UItemSpawnerPreset*> ItemSpawnerPresets;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.PrisonerAppearance_IrisColor
// Size: 0x30(Inherited: 0x0) 
struct FPrisonerAppearance_IrisColor
{
	struct FLinearColor PreviewColor;  // 0x0(0x10)
	struct FVector4 IrisColor;  // 0x10(0x10)
	uint8_t  ColorName;  // 0x20(0x1)
	char pad_33[15];  // 0x21(0xF)

}; 
// Function ConZ.FishingRod.Server_ReleaseCastingObject
// Size: 0x20(Inherited: 0x0) 
struct FServer_ReleaseCastingObject
{
	struct FVector Location;  // 0x0(0xC)
	struct FVector Direction;  // 0xC(0xC)
	float castingPower;  // 0x18(0x4)
	uint8_t  nextState;  // 0x1C(0x1)
	char pad_29[3];  // 0x1D(0x3)

}; 
// Function ConZ.FishingRod.Server_SetCastPower
// Size: 0x4(Inherited: 0x0) 
struct FServer_SetCastPower
{
	float Value;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.Inv2021_InventoryPositionObjectRepHelper
// Size: 0x18(Inherited: 0x0) 
struct FInv2021_InventoryPositionObjectRepHelper
{
	char pad_0[24];  // 0x0(0x18)

}; 
// Function ConZ.FishingRod.Server_SpawnCaughtFish
// Size: 0x18(Inherited: 0x0) 
struct FServer_SpawnCaughtFish
{
	AActor* caughtFishClass;  // 0x0(0x8)
	uint8_t  FishSpecies;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)
	float caughtFishMass;  // 0xC(0x4)
	float caughtFishSize;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function ConZ.PrisonerAnimInstance.DeactivateFacialExpressionOnGameThread
// Size: 0x1(Inherited: 0x0) 
struct FDeactivateFacialExpressionOnGameThread
{
	uint8_t  facialExpression;  // 0x0(0x1)

}; 
// Function ConZ.ClothesItem.GetCapacityY
// Size: 0x4(Inherited: 0x0) 
struct FGetCapacityY
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.ClothesItem.GetWarmth
// Size: 0x4(Inherited: 0x0) 
struct FGetWarmth
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.ConZWeaponDescRow
// Size: 0x38(Inherited: 0x8) 
struct FConZWeaponDescRow : public FTableRowBase
{
	float Damage;  // 0x8(0x4)
	float DamageInGameEvent;  // 0xC(0x4)
	struct FTargetTypeDamageMultiplier TargetTypeMultiplier;  // 0x10(0x10)
	float Energy;  // 0x20(0x4)
	float SharpnessSlash;  // 0x24(0x4)
	float SharpnessPierce;  // 0x28(0x4)
	uint8_t  ImpactSoundCategory;  // 0x2C(0x1)
	char pad_45[3];  // 0x2D(0x3)
	struct UProjectileImpactEffects* ImpactEffects;  // 0x30(0x8)

}; 
// Function ConZ.VoiceChatComponent.GetAllVoiceChatComponentsInRange
// Size: 0x10(Inherited: 0x0) 
struct FGetAllVoiceChatComponentsInRange
{
	struct TArray<struct UVoiceChatComponent*> pawnList;  // 0x0(0x10)

}; 
// Function ConZ.ClothesItem.SetDirtiness
// Size: 0x4(Inherited: 0x0) 
struct FSetDirtiness
{
	float dirtiness;  // 0x0(0x4)

}; 
// DelegateFunction ConZ.NightVisionGogglesItem.ActivatedChangedEvent__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FActivatedChangedEvent__DelegateSignature
{
	struct ANightVisionGogglesItem* sender;  // 0x0(0x8)

}; 
// Function ConZ.WeaponAttachmentFlashlight.OnComponentDeactivated
// Size: 0x8(Inherited: 0x0) 
struct FOnComponentDeactivated
{
	struct UActorComponent* Component;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.PhysicalSurfaceData
// Size: 0x1C(Inherited: 0x0) 
struct FPhysicalSurfaceData
{
	float DirtinessFactor;  // 0x0(0x4)
	float WetnessFactor;  // 0x4(0x4)
	float LandingImpactVelocityModifier;  // 0x8(0x4)
	float NoiseLoudnessModifier;  // 0xC(0x4)
	float FootstepEnhancerChance;  // 0x10(0x4)
	float FootwearDamageMultiplier;  // 0x14(0x4)
	float FootAbrasionsMultiplier;  // 0x18(0x4)

}; 
// Function ConZ.ItemActionSequence.CanBeCanceled
// Size: 0x1(Inherited: 0x0) 
struct FCanBeCanceled
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Weapon.GetFiringBodyWeaponAnimation
// Size: 0x10(Inherited: 0x0) 
struct FGetFiringBodyWeaponAnimation
{
	struct FBodyWeaponAnimation ReturnValue;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.ObjectConditionContainer
// Size: 0x10(Inherited: 0x0) 
struct FObjectConditionContainer
{
	struct TArray<UObject*> _objectConditions;  // 0x0(0x10)

}; 
// DelegateFunction ConZ.TriggerComponent.TriggeredEvent__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FTriggeredEvent__DelegateSignature
{
	struct FTriggeredEventData eventData;  // 0x0(0x10)

}; 
// Function ConZ.PrisonerSkillComponent.HighlightItemOnClient
// Size: 0x8(Inherited: 0x0) 
struct FHighlightItemOnClient
{
	struct AItem* Item;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.InteractionStruct
// Size: 0x98(Inherited: 0x0) 
struct FInteractionStruct
{
	uint8_t  interactionType;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct FString InteractionCaption;  // 0x8(0x10)
	char pad_24[128];  // 0x18(0x80)

}; 
// Function ConZ.WeaponAttachmentMagazine.AddAmmoSingle
// Size: 0x18(Inherited: 0x0) 
struct FAddAmmoSingle
{
	struct FAmmunitionData ammo;  // 0x0(0x18)

}; 
// Function ConZ.Weapon.CanBeginFiringSequenceWithMalfunction
// Size: 0x2(Inherited: 0x0) 
struct FCanBeginFiringSequenceWithMalfunction
{
	uint8_t  malfunction;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool ReturnValue : 1;  // 0x1(0x1)

}; 
// Function ConZ.Weapon.CanFireAgain
// Size: 0x1(Inherited: 0x0) 
struct FCanFireAgain
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Weapon.CanReloadUsingData
// Size: 0x38(Inherited: 0x0) 
struct FCanReloadUsingData
{
	struct FWeaponReloadData Data;  // 0x0(0x30)
	char pad_48_1 : 7;  // 0x30(0x1)
	bool ReturnValue : 1;  // 0x30(0x1)
	char pad_49[7];  // 0x31(0x7)

}; 
// Function ConZ.MissionManager.UntrackMission
// Size: 0x1(Inherited: 0x0) 
struct FUntrackMission
{
	uint8_t  MissionType;  // 0x0(0x1)

}; 
// Function ConZ.Weapon.CanSwitchFiringMode
// Size: 0x1(Inherited: 0x0) 
struct FCanSwitchFiringMode
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.ComplexAnimal2.Eat
// Size: 0x4(Inherited: 0x0) 
struct FEat
{
	float Time;  // 0x0(0x4)

}; 
// Function ConZ.Weapon.FindReloadData
// Size: 0x48(Inherited: 0x0) 
struct FFindReloadData
{
	struct TArray<struct AItem*> Items;  // 0x0(0x10)
	struct FWeaponReloadData reloadData;  // 0x10(0x30)
	char pad_64_1 : 7;  // 0x40(0x1)
	bool ReturnValue : 1;  // 0x40(0x1)
	char pad_65[7];  // 0x41(0x7)

}; 
// Function ConZ.TrashNamedSliderWidget.GetMaxValue
// Size: 0x4(Inherited: 0x0) 
struct FGetMaxValue
{
	float ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.ItemContainersReplicationHelper
// Size: 0x70(Inherited: 0x0) 
struct FItemContainersReplicationHelper
{
	struct TMap<struct FString, struct FItemContainerRepData> ItemContainerData;  // 0x0(0x50)
	char pad_80[32];  // 0x50(0x20)

}; 
// Function ConZ.WeaponAttachmentMagazine.GetAmmoCount
// Size: 0x4(Inherited: 0x0) 
struct FGetAmmoCount
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.CharacterMeshMorphTarget
// Size: 0x50(Inherited: 0x0) 
struct FCharacterMeshMorphTarget
{
	struct FGameplayTagQuery Condition;  // 0x0(0x48)
	float Value;  // 0x48(0x4)
	char pad_76[4];  // 0x4C(0x4)

}; 
// ScriptStruct ConZ.AnimalActionMontageData
// Size: 0x18(Inherited: 0x0) 
struct FAnimalActionMontageData
{
	struct UAnimMontage* SleepMontage;  // 0x0(0x8)
	struct UAnimMontage* EatMontage;  // 0x8(0x8)
	struct UAnimMontage* IntimidateMontage;  // 0x10(0x8)

}; 
// Function ConZ.Weapon.GetAmmoTypeString
// Size: 0x10(Inherited: 0x0) 
struct FGetAmmoTypeString
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// Function ConZ.MeleeSkill.GetPrimaryIdleAnimationTP
// Size: 0x8(Inherited: 0x0) 
struct FGetPrimaryIdleAnimationTP
{
	struct UAnimSequenceBase* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Weapon.GetAmmunitionItemClass
// Size: 0x8(Inherited: 0x0) 
struct FGetAmmunitionItemClass
{
	UObject* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.RequestSpamFilter
// Size: 0x14(Inherited: 0x0) 
struct FRequestSpamFilter
{
	char pad_0[20];  // 0x0(0x14)

}; 
// ScriptStruct ConZ.ZombieRelaxedStanceAnimations
// Size: 0x8(Inherited: 0x0) 
struct FZombieRelaxedStanceAnimations
{
	struct UAnimSequenceBase* WalkLoopAnimation;  // 0x0(0x8)

}; 
// Function ConZ.PrisonerHUD.ShouldShowExtendedWidgetTooltip
// Size: 0x1(Inherited: 0x0) 
struct FShouldShowExtendedWidgetTooltip
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Weapon.GetFiringMontage
// Size: 0x10(Inherited: 0x0) 
struct FGetFiringMontage
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool isLastShot : 1;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct UAnimMontage* ReturnValue;  // 0x8(0x8)

}; 
// Function ConZ.Weapon.GetInternalMagazineAmmoCount
// Size: 0x4(Inherited: 0x0) 
struct FGetInternalMagazineAmmoCount
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.PrisonerBodyOrganGroupsVsSeverityKey
// Size: 0x60(Inherited: 0x0) 
struct FPrisonerBodyOrganGroupsVsSeverityKey
{
	struct FFloatRange SeverityRange;  // 0x0(0x10)
	struct TSet<uint8_t > Values;  // 0x10(0x50)

}; 
// Function ConZ.Weapon.GetInternalMagazineSpace
// Size: 0x4(Inherited: 0x0) 
struct FGetInternalMagazineSpace
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.ItemAction.Begin
// Size: 0x4(Inherited: 0x0) 
struct FBegin
{
	float ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.GuardedZoneManagerDescription
// Size: 0x40(Inherited: 0x0) 
struct FGuardedZoneManagerDescription
{
	struct TArray<struct FSentrySpawnerDescription> _sentrySpawners;  // 0x0(0x10)
	char pad_16[48];  // 0x10(0x30)

}; 
// Function ConZ.Animal2.UnpackUint8
// Size: 0x18(Inherited: 0x0) 
struct FUnpackUint8
{
	char pack;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct TArray<bool> B;  // 0x8(0x10)

}; 
// Function ConZ.Weapon.Server_PlayChamberEffects
// Size: 0x1(Inherited: 0x0) 
struct FServer_PlayChamberEffects
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool playDryFireSound : 1;  // 0x0(0x1)

}; 
// Function ConZ.Weapon.GetIsChambering
// Size: 0x1(Inherited: 0x0) 
struct FGetIsChambering
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.CustomZoneSettingsConfigurationsList.UpdateConfiguration
// Size: 0x48(Inherited: 0x0) 
struct FUpdateConfiguration
{
	int32_t ConfigurationIndex;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct FCustomZoneConfiguration configuration;  // 0x8(0x40)

}; 
// Function ConZ.PrisonerMovementComponent.CanClimbWindow
// Size: 0x1(Inherited: 0x0) 
struct FCanClimbWindow
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.MeshHitZones.IsHitZoneActive
// Size: 0x8(Inherited: 0x0) 
struct FIsHitZoneActive
{
	int32_t zoneIndex;  // 0x0(0x4)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool ReturnValue : 1;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)

}; 
// Function ConZ.Weapon.GetIsScopingAllowed
// Size: 0x1(Inherited: 0x0) 
struct FGetIsScopingAllowed
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Objective.IsStarted
// Size: 0x1(Inherited: 0x0) 
struct FIsStarted
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.ConZSquad.CanMemberEditEmblem
// Size: 0x10(Inherited: 0x0) 
struct FCanMemberEditEmblem
{
	struct FDbIntegerId UserProfileId;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.Weapon.GetMagazine
// Size: 0x8(Inherited: 0x0) 
struct FGetMagazine
{
	struct AWeaponAttachmentMagazine* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.WeaponMalfunctionProbability
// Size: 0x8(Inherited: 0x0) 
struct FWeaponMalfunctionProbability
{
	uint8_t  malfunction;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float Probability;  // 0x4(0x4)

}; 
// Function ConZ.ItemActionSequence.CanEverBeCanceled
// Size: 0x1(Inherited: 0x0) 
struct FCanEverBeCanceled
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.WeaponMalfunctionEventDescription
// Size: 0x8(Inherited: 0x0) 
struct FWeaponMalfunctionEventDescription
{
	char pad_0[8];  // 0x0(0x8)

}; 
// Function ConZ.FireworksItem.SetIsFiring
// Size: 0x1(Inherited: 0x0) 
struct FSetIsFiring
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool IsFiring : 1;  // 0x0(0x1)

}; 
// Function ConZ.Weapon.GetMaxAmmoCount
// Size: 0x4(Inherited: 0x0) 
struct FGetMaxAmmoCount
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.WeaponBowAimOffsets
// Size: 0x18(Inherited: 0x0) 
struct FWeaponBowAimOffsets
{
	struct UBlendSpace* DrawPercentage[3];  // 0x0(0x18)

}; 
// Function ConZ.ElectricityGeneratorItem.RangedResourceProvider_ResourceAmountChanged
// Size: 0x10(Inherited: 0x0) 
struct FRangedResourceProvider_ResourceAmountChanged
{
	struct URangedResourceProviderComponent* Component;  // 0x0(0x8)
	float Value;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function ConZ.Weapon.GetProbabilityForMalfunction
// Size: 0xC(Inherited: 0x0) 
struct FGetProbabilityForMalfunction
{
	uint8_t  malfunction;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float normalizedHealth;  // 0x4(0x4)
	float ReturnValue;  // 0x8(0x4)

}; 
// Function ConZ.Weapon.GetShakiness
// Size: 0x4(Inherited: 0x0) 
struct FGetShakiness
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Weapon.GetSpread
// Size: 0x4(Inherited: 0x0) 
struct FGetSpread
{
	float ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.BaseDamageInteractionEvent
// Size: 0x98(Inherited: 0x8) 
struct FBaseDamageInteractionEvent : public FBaseInteractionEvent
{
	char pad_8[144];  // 0x8(0x90)

}; 
// Function ConZ.UserProfile.GetType
// Size: 0x1(Inherited: 0x0) 
struct FGetType
{
	uint8_t  ReturnValue;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.PrisonerMovementSettings_Ground_Standing_Running
// Size: 0xC(Inherited: 0x0) 
struct FPrisonerMovementSettings_Ground_Standing_Running
{
	struct FPrisonerGroundMovementParameters Default;  // 0x0(0xC)

}; 
// Function ConZ.Weapon.GetUseMuzzleDirectionForShooting
// Size: 0x1(Inherited: 0x0) 
struct FGetUseMuzzleDirectionForShooting
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Weapon.GetUseWeaponAnimationPose
// Size: 0x1(Inherited: 0x0) 
struct FGetUseWeaponAnimationPose
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.MissionItemInfo
// Size: 0x38(Inherited: 0x0) 
struct FMissionItemInfo
{
	struct TSoftObjectPtr<AActor> ItemLocation;  // 0x0(0x28)
	AItem* ItemClass;  // 0x28(0x8)
	char pad_48_1 : 7;  // 0x30(0x1)
	bool ShouldRemove : 1;  // 0x30(0x1)
	char pad_49[3];  // 0x31(0x3)
	float TimeToDestroy;  // 0x34(0x4)

}; 
// Function ConZ.Weapon.GetWeaponOwner
// Size: 0x8(Inherited: 0x0) 
struct FGetWeaponOwner
{
	struct APrisoner* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.PrisonerMaxMovementPaceVsSeverityKey
// Size: 0x14(Inherited: 0x0) 
struct FPrisonerMaxMovementPaceVsSeverityKey
{
	struct FFloatRange SeverityRange;  // 0x0(0x10)
	uint8_t  MaxMovementPace;  // 0x10(0x1)
	char pad_17[3];  // 0x11(0x3)

}; 
// ScriptStruct ConZ.HalloweenSacrificePitRequiredItemVariants
// Size: 0x10(Inherited: 0x0) 
struct FHalloweenSacrificePitRequiredItemVariants
{
	struct TArray<struct TSoftClassPtr<UObject>> Variants;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.CraftingSlotRequirement
// Size: 0x68(Inherited: 0x0) 
struct FCraftingSlotRequirement
{
	struct FString SlotName;  // 0x0(0x10)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool LimitIngredientTypes : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)
	struct TArray<UCraftingIngredientType*> IngredientTypes;  // 0x18(0x10)
	uint8_t  ConsumptionHint;  // 0x28(0x1)
	char pad_41[3];  // 0x29(0x3)
	int32_t AmountNeeded;  // 0x2C(0x4)
	char pad_48_1 : 7;  // 0x30(0x1)
	bool OverrideAmountNeededSkill : 1;  // 0x30(0x1)
	char pad_49[7];  // 0x31(0x7)
	struct FCraftingSlotAmountNeededPerSkillLevel AmountNeededSkillLevelOverride;  // 0x38(0x20)
	struct TArray<struct FCraftingIngredientTypeModifier> IngredientTypeModifiers;  // 0x58(0x10)

}; 
// Function ConZ.ItemSelectionWidget.Get_ItemName_ColorAndOpacity
// Size: 0x28(Inherited: 0x0) 
struct FGet_ItemName_ColorAndOpacity
{
	struct FSlateColor ReturnValue;  // 0x0(0x28)

}; 
// Function ConZ.Weapon.GetZeroRange
// Size: 0x4(Inherited: 0x0) 
struct FGetZeroRange
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.Weapon.HasAmmoToUnload
// Size: 0x1(Inherited: 0x0) 
struct FHasAmmoToUnload
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.WorldStatics.TransformWorldPositionToTargetFOV
// Size: 0x28(Inherited: 0x0) 
struct FTransformWorldPositionToTargetFOV
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	float FieldOfView;  // 0x8(0x4)
	struct FVector WorldPosition;  // 0xC(0xC)
	struct FVector ReturnValue;  // 0x18(0xC)
	char pad_36[4];  // 0x24(0x4)

}; 
// Function ConZ.UIStatics.FilterNonNumbersFromString
// Size: 0x20(Inherited: 0x0) 
struct FFilterNonNumbersFromString
{
	struct FString String;  // 0x0(0x10)
	struct FString ReturnValue;  // 0x10(0x10)

}; 
// Function ConZ.ReplenishableResourceManager.NetMulticast_SetReplenishableResourceAmount
// Size: 0x18(Inherited: 0x0) 
struct FNetMulticast_SetReplenishableResourceAmount
{
	int32_t dataVersion;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct FPackedLocation ID;  // 0x8(0x8)
	float Value;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// ScriptStruct ConZ.MetabolismRadialProgressBarFontSettings
// Size: 0x14(Inherited: 0x0) 
struct FMetabolismRadialProgressBarFontSettings
{
	int32_t FontSize;  // 0x0(0x4)
	struct FMargin FontPadding;  // 0x4(0x10)

}; 
// Function ConZ.Weapon.IsAmmoCompatible
// Size: 0xC(Inherited: 0x0) 
struct FIsAmmoCompatible
{
	struct FGameplayTag AmmunitionTag;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)

}; 
// ScriptStruct ConZ.SentrySpawnerDescription
// Size: 0x68(Inherited: 0x0) 
struct FSentrySpawnerDescription
{
	char pad_0[8];  // 0x0(0x8)
	ASentry2* _sentryClass;  // 0x8(0x8)
	char pad_16[88];  // 0x10(0x58)

}; 
// Function ConZ.Weapon.IsAmmoInMagazineCompatible
// Size: 0x10(Inherited: 0x0) 
struct FIsAmmoInMagazineCompatible
{
	struct AWeaponAttachmentMagazine* magazine;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function ConZ.Weapon.IsChamberOpened
// Size: 0x1(Inherited: 0x0) 
struct FIsChamberOpened
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.FireworksItem.IsFiring
// Size: 0x1(Inherited: 0x0) 
struct FIsFiring
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.CookingUtilitySlotArray
// Size: 0x1C0(Inherited: 0x108) 
struct FCookingUtilitySlotArray : public FFastArraySerializer
{
	struct TArray<struct FCookingUtilitySlotInstance> _slots;  // 0x108(0x10)
	char pad_280[168];  // 0x118(0xA8)

}; 
// ScriptStruct ConZ.CharacterStatsItem
// Size: 0x48(Inherited: 0x0) 
struct FCharacterStatsItem
{
	int32_t Rank;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct FString PlayerName;  // 0x8(0x10)
	struct FCharacterStats CharacterStats;  // 0x18(0x30)

}; 
// Function ConZ.DialogueContainerWidget.GetHideAvatarAnimation
// Size: 0x8(Inherited: 0x0) 
struct FGetHideAvatarAnimation
{
	struct UWidgetAnimation* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.Weapon.IsInGameEvent
// Size: 0x1(Inherited: 0x0) 
struct FIsInGameEvent
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.Weapon.NetMulticast_PlayChamberEffects
// Size: 0x1(Inherited: 0x0) 
struct FNetMulticast_PlayChamberEffects
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool playDryFireSound : 1;  // 0x0(0x1)

}; 
// Function ConZ.Weapon.NetMulticast_PlayFiringEffects
// Size: 0x1(Inherited: 0x0) 
struct FNetMulticast_PlayFiringEffects
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool isLastShot : 1;  // 0x0(0x1)

}; 
// Function ConZ.GameEventBorder.Multicast_SetRadius
// Size: 0x4(Inherited: 0x0) 
struct FMulticast_SetRadius
{
	float Radius;  // 0x0(0x4)

}; 
// Function ConZ.PrisonerHUD.IsShowingLoading
// Size: 0x1(Inherited: 0x0) 
struct FIsShowingLoading
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.ZoneConfiguration
// Size: 0x18(Inherited: 0x0) 
struct FZoneConfiguration
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool IsOutpost : 1;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool IsItemPlacementAllowed : 1;  // 0x1(0x1)
	char pad_2[6];  // 0x2(0x6)
	struct TArray<uint8_t > InteractionsToDisable;  // 0x8(0x10)

}; 
// Function ConZ.SquadEditor.OnEmblemUpdate
// Size: 0x8(Inherited: 0x0) 
struct FOnEmblemUpdate
{
	struct UDropdownMenuSelectionWidget* Widget;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.MapHUDFlagsObject
// Size: 0xC0(Inherited: 0x18) 
struct FMapHUDFlagsObject : public FMapHUDObject
{
	struct UTexture* _flagPositionOuterRingTexture;  // 0x18(0x8)
	struct FLinearColor _flagOuterRingColor;  // 0x20(0x10)
	struct FLinearColor _flagHighlightOuterRingColor;  // 0x30(0x10)
	struct UTexture* _flagPositionInnerCircleTexture;  // 0x40(0x8)
	struct FLinearColor _flagInnerCircleColor;  // 0x48(0x10)
	struct FLinearColor _flagHighlightInnerCircleColor;  // 0x58(0x10)
	struct UFont* _flagFont;  // 0x68(0x8)
	struct FLinearColor _flagNameHighlightColor;  // 0x70(0x10)
	struct FLinearColor _flagNameHighlightOutlineColor;  // 0x80(0x10)
	struct FLinearColor _flagNameColor;  // 0x90(0x10)
	struct FLinearColor _flagNameOutlineColor;  // 0xA0(0x10)
	struct FVector2D _flagPositionTextureSize;  // 0xB0(0x8)
	int32_t _flagTextStackOffset;  // 0xB8(0x4)
	char pad_188[4];  // 0xBC(0x4)

}; 
// Function ConZ.TrashNamedSliderWidget.SetLimits
// Size: 0xC(Inherited: 0x0) 
struct FSetLimits
{
	float MinValue;  // 0x0(0x4)
	float MaxValue;  // 0x4(0x4)
	int32_t stepCount;  // 0x8(0x4)

}; 
// Function ConZ.Weapon.NotifyHitOnServer
// Size: 0x9C(Inherited: 0x0) 
struct FNotifyHitOnServer
{
	struct FHitResult HitResult;  // 0x0(0x88)
	struct FVector_NetQuantizeNormal shootDirection;  // 0x88(0xC)
	int32_t randomSeed;  // 0x94(0x4)
	float reticleSpread;  // 0x98(0x4)

}; 
// Function ConZ.RadioCategory.ProvideNextRadioTrack
// Size: 0x8(Inherited: 0x0) 
struct FProvideNextRadioTrack
{
	struct URadioTrack* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.RecipeAvailabilityState
// Size: 0xC8(Inherited: 0x0) 
struct FRecipeAvailabilityState
{
	char pad_0[200];  // 0x0(0xC8)

}; 
// Function ConZ.Vehicle.GetNumVehicleReverseGears
// Size: 0x4(Inherited: 0x0) 
struct FGetNumVehicleReverseGears
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.TextBoxWithLabel.OnTextChanged
// Size: 0x18(Inherited: 0x0) 
struct FOnTextChanged
{
	struct FText Text;  // 0x0(0x18)

}; 
// Function ConZ.HandsHolstersWidget2.OnAttachmentAdded
// Size: 0x10(Inherited: 0x0) 
struct FOnAttachmentAdded
{
	struct AWeapon* Weapon;  // 0x0(0x8)
	struct AWeaponAttachment* Attachment;  // 0x8(0x8)

}; 
// Function ConZ.HandsHolstersWidget2.OnAttachmentRemoved
// Size: 0x10(Inherited: 0x0) 
struct FOnAttachmentRemoved
{
	struct AWeapon* Weapon;  // 0x0(0x8)
	struct AWeaponAttachment* Attachment;  // 0x8(0x8)

}; 
// Function ConZ.Weapon.OnShotFired
// Size: 0x1(Inherited: 0x0) 
struct FOnShotFired
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool isLastShot : 1;  // 0x0(0x1)

}; 
// Function ConZ.CharacterCreationMenu.OnTextNameCommittedInCharacterPanel
// Size: 0x20(Inherited: 0x0) 
struct FOnTextNameCommittedInCharacterPanel
{
	struct FText NewValue;  // 0x0(0x18)
	char ETextCommit CommitMethod;  // 0x18(0x1)
	char pad_25[7];  // 0x19(0x7)

}; 
// Function ConZ.WeaponAction.OnWeaponActionAnimNotify
// Size: 0x1(Inherited: 0x0) 
struct FOnWeaponActionAnimNotify
{
	uint8_t  notifyType;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.GameEventParticipantInfo
// Size: 0x78(Inherited: 0x0) 
struct FGameEventParticipantInfo
{
	struct FString UniqueId;  // 0x0(0x10)
	struct TWeakObjectPtr<APrisoner> Prisoner;  // 0x10(0x8)
	struct FString Name;  // 0x18(0x10)
	uint8_t  State;  // 0x28(0x1)
	char pad_41[3];  // 0x29(0x3)
	int32_t TeamIndex;  // 0x2C(0x4)
	struct TArray<struct UGameEventParticipantStats*> RoundStats;  // 0x30(0x10)
	struct UGameEventParticipantStats* EventStats;  // 0x40(0x8)
	struct TArray<struct APrisoner*> HurtBy;  // 0x48(0x10)
	int32_t RepHelper;  // 0x58(0x4)
	char pad_92[28];  // 0x5C(0x1C)

}; 
// ScriptStruct ConZ.ConZTradeableDescRow
// Size: 0x168(Inherited: 0x8) 
struct FConZTradeableDescRow : public FTableRowBase
{
	struct TSoftClassPtr<UObject> TradeableClass;  // 0x8(0x28)
	struct FPrimaryAssetId PrimaryAssetId;  // 0x30(0x10)
	char pad_64_1 : 7;  // 0x40(0x1)
	bool CanBePurchasedByPlayer : 1;  // 0x40(0x1)
	uint8_t  TradeCategory;  // 0x41(0x1)
	char pad_66[6];  // 0x42(0x6)
	struct TSet<uint8_t > TraderTypes;  // 0x48(0x50)
	float BasePurchasePriceModifier;  // 0x98(0x4)
	float BaseSalePriceReductionModifier;  // 0x9C(0x4)
	uint8_t  PurchaseCurrencyType;  // 0xA0(0x1)
	char pad_161[3];  // 0xA1(0x3)
	int32_t AlternateCurrencyPurchasePrice;  // 0xA4(0x4)
	uint8_t  SpawnType;  // 0xA8(0x1)
	char pad_169[7];  // 0xA9(0x7)
	struct FText TradingEntryCaption;  // 0xB0(0x18)
	struct TSoftObjectPtr<UTexture2D> TradingEntryIconTexture;  // 0xC8(0x28)
	int32_t MaxAmountPurchasedAtOnce;  // 0xF0(0x4)
	char pad_244_1 : 7;  // 0xF4(0x1)
	bool IsStockAmountUnlimited : 1;  // 0xF4(0x1)
	char pad_245[3];  // 0xF5(0x3)
	struct FGameplayTag TradeableFamePointPenaltyGroup;  // 0xF8(0x8)
	int32_t RequiredFamePoints;  // 0x100(0x4)
	struct FGameplayTag TradeableRotationRarity;  // 0x104(0x8)
	char pad_268_1 : 7;  // 0x10C(0x1)
	bool OnlyAvailableAfterPlayerSale : 1;  // 0x10C(0x1)
	char pad_269[3];  // 0x10D(0x3)
	int32_t CustomStockAmountMin;  // 0x110(0x4)
	int32_t CustomStockAmountMax;  // 0x114(0x4)
	UTradeableDiscountCondition* TradeableDiscountCondition;  // 0x118(0x8)
	struct FGameplayTagContainer TraderSearchTypes;  // 0x120(0x20)
	struct FGameplayTagContainer TraderSearchRelated;  // 0x140(0x20)
	char pad_352_1 : 7;  // 0x160(0x1)
	bool IsImmuneToUserOverrides : 1;  // 0x160(0x1)
	char pad_353[7];  // 0x161(0x7)

}; 
// Function ConZ.Weapon.PlayFiringEffects
// Size: 0x1(Inherited: 0x0) 
struct FPlayFiringEffects
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool isLastShot : 1;  // 0x0(0x1)

}; 
// Function ConZ.BondageComponent.GetBondageItem
// Size: 0x8(Inherited: 0x0) 
struct FGetBondageItem
{
	struct AItem* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.WeaponAttachmentMagazine.RemoveAmmo
// Size: 0x18(Inherited: 0x0) 
struct FRemoveAmmo
{
	struct FAmmunitionData ReturnValue;  // 0x0(0x18)

}; 
// Function ConZ.DroneAIController.FollowCharacter
// Size: 0x8(Inherited: 0x0) 
struct FFollowCharacter
{
	struct ACharacter* characterToFollow;  // 0x0(0x8)

}; 
// Function ConZ.Weapon.RemoveAttachmentOnServer
// Size: 0x8(Inherited: 0x0) 
struct FRemoveAttachmentOnServer
{
	struct AWeaponAttachment* Attachment;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.NotificationAndDelay
// Size: 0x10(Inherited: 0x0) 
struct FNotificationAndDelay
{
	struct UNotificationDescription* Notification;  // 0x0(0x8)
	float Delay;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// ScriptStruct ConZ.FoliageEffectsData
// Size: 0x18(Inherited: 0x0) 
struct FFoliageEffectsData
{
	struct UAkAudioEvent* StartMovingThroughFoliageAudioEvent;  // 0x0(0x8)
	struct UAkAudioEvent* StopMovingThroughFoliageAudioEvent;  // 0x8(0x8)
	struct UAkAudioEvent* OneShotMovingThroughFoliageAudioEvent;  // 0x10(0x8)

}; 
// Function ConZ.PlayerRpcChannel.Client_ReceiveServerData
// Size: 0xC(Inherited: 0x0) 
struct FClient_ReceiveServerData
{
	int32_t RequestID;  // 0x0(0x4)
	struct FPlayerRpcChannelServerDataResponseNetSerializer Response;  // 0x4(0x8)

}; 
// Function ConZ.Weapon.Server_DropAttachment
// Size: 0x8(Inherited: 0x0) 
struct FServer_DropAttachment
{
	struct AWeaponAttachment* Attachment;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.DcxWheeledVehicleFlatTireWheelConfiguration
// Size: 0x50(Inherited: 0x0) 
struct FDcxWheeledVehicleFlatTireWheelConfiguration
{
	struct FDcxVehicleWheelData FlatTireWheelData;  // 0x0(0x20)
	char pad_32[32];  // 0x20(0x20)
	struct UDcxVehicleTire* FlatTire;  // 0x40(0x8)
	struct UDcxVehicleTire* OriginalTire;  // 0x48(0x8)

}; 
// ScriptStruct ConZ.ScumRadialDamageEvent
// Size: 0x48(Inherited: 0x40) 
struct FScumRadialDamageEvent : public FRadialDamageEvent
{
	char pad_64[8];  // 0x40(0x8)

}; 
// Function ConZ.Weapon.Server_FireShotProjectile
// Size: 0x34(Inherited: 0x0) 
struct FServer_FireShotProjectile
{
	struct FFireShotProjectileData Data;  // 0x0(0x2C)
	struct FFireShotDescription desc;  // 0x2C(0x8)

}; 
// ScriptStruct ConZ.FireShotProjectileData
// Size: 0x2C(Inherited: 0x0) 
struct FFireShotProjectileData
{
	struct FVector StartLocation;  // 0x0(0xC)
	struct FVector_NetQuantizeNormal shootDirection;  // 0xC(0xC)
	int32_t ZeroRange;  // 0x18(0x4)
	float Windage;  // 0x1C(0x4)
	int32_t RandomFactor;  // 0x20(0x4)
	float ConeHalfAngle;  // 0x24(0x4)
	struct FFireShotProjectileDescription Description;  // 0x28(0x1)
	char pad_41[3];  // 0x29(0x3)

}; 
// ScriptStruct ConZ.DcxWheeledVehicleTireEffectProperties
// Size: 0x14(Inherited: 0x0) 
struct FDcxWheeledVehicleTireEffectProperties
{
	struct FVector TireLocalOffset;  // 0x0(0xC)
	char pad_12[8];  // 0xC(0x8)

}; 
// Function ConZ.ThrowingComponent.OnProjectileStopped
// Size: 0x88(Inherited: 0x0) 
struct FOnProjectileStopped
{
	struct FHitResult ImpactResult;  // 0x0(0x88)

}; 
// Function ConZ.Weapon.Server_PlayFiringEffects
// Size: 0x1(Inherited: 0x0) 
struct FServer_PlayFiringEffects
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool isLastShot : 1;  // 0x0(0x1)

}; 
// Function ConZ.Weapon.SetFiringModeOnServer
// Size: 0x1(Inherited: 0x0) 
struct FSetFiringModeOnServer
{
	uint8_t  Value;  // 0x0(0x1)

}; 
// Function ConZ.AttributeMapInterface.SetStringAttribute
// Size: 0x20(Inherited: 0x0) 
struct FSetStringAttribute
{
	struct FString Name;  // 0x0(0x10)
	struct FString Value;  // 0x10(0x10)

}; 
// Function ConZ.Weapon.SetIsScopingAllowed
// Size: 0x1(Inherited: 0x0) 
struct FSetIsScopingAllowed
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// Function ConZ.AmmunitionItem.GetSpreadMultiplierForWeapon
// Size: 0x10(Inherited: 0x0) 
struct FGetSpreadMultiplierForWeapon
{
	struct AWeapon* Weapon;  // 0x0(0x8)
	float ReturnValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function ConZ.Weapon.SetLoadedProjectileClass
// Size: 0x8(Inherited: 0x0) 
struct FSetLoadedProjectileClass
{
	AProjectile* projectileClass;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.VehicleAttachmentAlternatorSetup
// Size: 0x8(Inherited: 0x0) 
struct FVehicleAttachmentAlternatorSetup
{
	struct UCurveFloat* RpmChargeCurve;  // 0x0(0x8)

}; 
// Function ConZ.Weapon.SetOverrideUseWeaponAnimationPose
// Size: 0x1(Inherited: 0x0) 
struct FSetOverrideUseWeaponAnimationPose
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// Function ConZ.Weapon.SetShouldPlayChamberOpenedIdle
// Size: 0x1(Inherited: 0x0) 
struct FSetShouldPlayChamberOpenedIdle
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// Function ConZ.GameEventBase.UpdateRanking
// Size: 0x4(Inherited: 0x0) 
struct FUpdateRanking
{
	int32_t Index;  // 0x0(0x4)

}; 
// Function ConZ.GameEventBorder.ChangeState
// Size: 0x8(Inherited: 0x0) 
struct FChangeState
{
	uint8_t  State;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float Duration;  // 0x4(0x4)

}; 
// Function ConZ.Weapon.SetUseMuzzleDirectionForShooting
// Size: 0x1(Inherited: 0x0) 
struct FSetUseMuzzleDirectionForShooting
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.WheeledVehicleAnimInstanceProxy
// Size: 0x780(Inherited: 0x770) 
struct FWheeledVehicleAnimInstanceProxy : public FAnimInstanceProxy
{
	char pad_1904[16];  // 0x770(0x10)

}; 
// Function ConZ.Weapon.SetUseWeaponAnimationPose
// Size: 0x1(Inherited: 0x0) 
struct FSetUseWeaponAnimationPose
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// Function ConZ.DropZoneSlot.GetOpeningDuration
// Size: 0x4(Inherited: 0x0) 
struct FGetOpeningDuration
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function ConZ.NetworkStatics.ParseServerIpAndPort
// Size: 0x28(Inherited: 0x0) 
struct FParseServerIpAndPort
{
	struct FString Text;  // 0x0(0x10)
	struct FString Ip;  // 0x10(0x10)
	int32_t Port;  // 0x20(0x4)
	char pad_36_1 : 7;  // 0x24(0x1)
	bool ReturnValue : 1;  // 0x24(0x1)
	char pad_37[3];  // 0x25(0x3)

}; 
// ScriptStruct ConZ.CookingFoodProxyMesh
// Size: 0xB0(Inherited: 0x0) 
struct FCookingFoodProxyMesh
{
	struct UStaticMesh* Mesh;  // 0x0(0x8)
	char pad_8[136];  // 0x8(0x88)
	struct UStaticMeshComponent* _meshComponent;  // 0x90(0x8)
	struct UAkComponent* _thermalSoundEffectComponent;  // 0x98(0x8)
	struct UAkAudioEvent* _startCookingEvent;  // 0xA0(0x8)
	struct UAkAudioEvent* _stopCookingEvent;  // 0xA8(0x8)

}; 
// ScriptStruct ConZ.AnimalSpawnData
// Size: 0x2C(Inherited: 0x0) 
struct FAnimalSpawnData
{
	float NextClueDistanceMin;  // 0x0(0x4)
	float NextClueDistanceMax;  // 0x4(0x4)
	int32_t NumCluesMin;  // 0x8(0x4)
	int32_t NumCluesMax;  // 0xC(0x4)
	int32_t PackSizeMin;  // 0x10(0x4)
	int32_t PackSizeMax;  // 0x14(0x4)
	float NextClueMaxHalfAngleDeg;  // 0x18(0x4)
	struct FAnimalSpawnWeigthsPerDayPeriod SpawnWeights;  // 0x1C(0x10)

}; 
// Function ConZ.Weapon.SetZeroRangeOnServer
// Size: 0x4(Inherited: 0x0) 
struct FSetZeroRangeOnServer
{
	int32_t ZeroRange;  // 0x0(0x4)

}; 
// ScriptStruct ConZ.CookingUtilityFilterDropdownEntryData
// Size: 0x20(Inherited: 0x0) 
struct FCookingUtilityFilterDropdownEntryData
{
	struct FGameplayTag CookingUtilityTag;  // 0x0(0x8)
	struct FText DisplayName;  // 0x8(0x18)

}; 
// ScriptStruct ConZ.CollisionPointDamageEvent
// Size: 0x160(Inherited: 0xB0) 
struct FCollisionPointDamageEvent : public FScumPointDamageEvent
{
	char pad_176[176];  // 0xB0(0xB0)

}; 
// Function ConZ.PrisonerMovementComponent.DetectWindow
// Size: 0xE0(Inherited: 0x0) 
struct FDetectWindow
{
	struct FWindowInfo Result;  // 0x0(0xD0)
	char pad_208_1 : 7;  // 0xD0(0x1)
	bool ReturnValue : 1;  // 0xD0(0x1)
	char pad_209[15];  // 0xD1(0xF)

}; 
// Function ConZ.DropZoneGameEvent.GetKeyCarrier
// Size: 0x8(Inherited: 0x0) 
struct FGetKeyCarrier
{
	struct APrisoner* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.ItemAction.CanBegin
// Size: 0x1(Inherited: 0x0) 
struct FCanBegin
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function ConZ.WeaponActionClearMalfunctionSequence.ShouldClearMalfunctionOnEvent
// Size: 0x3(Inherited: 0x0) 
struct FShouldClearMalfunctionOnEvent
{
	uint8_t  malfunction;  // 0x0(0x1)
	uint8_t  malfunctionEvent;  // 0x1(0x1)
	char pad_2_1 : 7;  // 0x2(0x1)
	bool ReturnValue : 1;  // 0x2(0x1)

}; 
// ScriptStruct ConZ.ConZBaseRepairAreaDuration
// Size: 0x8(Inherited: 0x0) 
struct FConZBaseRepairAreaDuration
{
	int32_t NumberOfBaseElementsTreshold;  // 0x0(0x4)
	float RepairDuration;  // 0x4(0x4)

}; 
// Function ConZ.WeaponAttachmentMagazine.UpdateAmmunitionMeshes
// Size: 0x18(Inherited: 0x0) 
struct FUpdateAmmunitionMeshes
{
	struct TArray<int32_t> ammoIndices;  // 0x0(0x10)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool showReversed : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// Function ConZ.VehicleEnginePowertrainComponent.BeginIgnitionAttempt
// Size: 0x8(Inherited: 0x0) 
struct FBeginIgnitionAttempt
{
	uint32_t ignitionAttempts;  // 0x0(0x4)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool willRecoverFromStall : 1;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)

}; 
// ScriptStruct ConZ.WeaponMalfunctionChances
// Size: 0x38(Inherited: 0x0) 
struct FWeaponMalfunctionChances
{
	struct FFloatInterval Value[7];  // 0x0(0x38)

}; 
// Function ConZ.MeleeSkill.GetAimOffsetBlendSpaceFP
// Size: 0x8(Inherited: 0x0) 
struct FGetAimOffsetBlendSpaceFP
{
	struct UBlendSpace* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct ConZ.PlayerPawnBirdInfo
// Size: 0x10(Inherited: 0x0) 
struct FPlayerPawnBirdInfo
{
	int32_t CoastalBirdsinProximity;  // 0x0(0x4)
	int32_t ContinetalBirdsinProximity;  // 0x4(0x4)
	int32_t VirtualAssignedCoastalBirds;  // 0x8(0x4)
	int32_t VirtualAssignedContinentalBirds;  // 0xC(0x4)

}; 
// Function ConZ.PrisonerInventoryComponent.UnEquipClothesItem
// Size: 0x10(Inherited: 0x0) 
struct FUnEquipClothesItem
{
	struct AClothesItem* Item;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool placeInInventory : 1;  // 0x8(0x1)
	char pad_9_1 : 7;  // 0x9(0x1)
	bool shouldEverDrop : 1;  // 0x9(0x1)
	char pad_10[6];  // 0xA(0x6)

}; 
// Function ConZ.Chainsaw.Server_SetUseFuelUsagePerHourMultiplierWhenActive
// Size: 0x1(Inherited: 0x0) 
struct FServer_SetUseFuelUsagePerHourMultiplierWhenActive
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Value : 1;  // 0x0(0x1)

}; 
// ScriptStruct ConZ.ParameterVector4
// Size: 0x20(Inherited: 0x10) 
struct FParameterVector4 : public FEditableParameter
{
	struct FVector4 Value;  // 0x10(0x10)

}; 
// ScriptStruct ConZ.FireAnimationData
// Size: 0xC0(Inherited: 0x0) 
struct FFireAnimationData
{
	struct FBodyWeaponAnimation BodyWeaponAnimation;  // 0x0(0x10)
	float TimeBetweenShots;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)
	struct FBodyWeaponAnimation BodyWeaponAnimationChamber;  // 0x18(0x10)
	float TimeForChamber;  // 0x28(0x4)
	char pad_44[4];  // 0x2C(0x4)
	UWeaponActionWornOutFiringConditions* Conditions;  // 0x30(0x8)
	struct FRuntimeFloatCurve ProbabilityWeightCurve;  // 0x38(0x88)

}; 
// Function ConZ.TrapItem.NetMulticast_TriggerTrap
// Size: 0x10(Inherited: 0x0) 
struct FNetMulticast_TriggerTrap
{
	struct FTrapTriggerParams Params;  // 0x0(0x10)

}; 
// ScriptStruct ConZ.BaseBuildingSizeVariation
// Size: 0x18(Inherited: 0x0) 
struct FBaseBuildingSizeVariation
{
	UBaseBuildingComponent* Component;  // 0x0(0x8)
	char pad_8[16];  // 0x8(0x10)

}; 
// ScriptStruct ConZ.WeaponViewKickData
// Size: 0x18(Inherited: 0x0) 
struct FWeaponViewKickData
{
	float PitchMin;  // 0x0(0x4)
	float PitchMax;  // 0x4(0x4)
	float YawMin;  // 0x8(0x4)
	float YawMax;  // 0xC(0x4)
	float PitchDecrementSpeed;  // 0x10(0x4)
	float YawDecrementSpeed;  // 0x14(0x4)

}; 
// ScriptStruct ConZ.SkillExperienceChange
// Size: 0x8(Inherited: 0x0) 
struct FSkillExperienceChange
{
	float ExperienceChange;  // 0x0(0x4)
	float Time;  // 0x4(0x4)

}; 
// Function ConZ.TacticsSkill.ShouldDetectPrisoner
// Size: 0x10(Inherited: 0x0) 
struct FShouldDetectPrisoner
{
	struct APrisoner* Prisoner;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// ScriptStruct ConZ.WeaponSpreadItem
// Size: 0xC(Inherited: 0x0) 
struct FWeaponSpreadItem
{
	float Idle;  // 0x0(0x4)
	float Moving;  // 0x4(0x4)
	float SpeedTarget;  // 0x8(0x4)

}; 
// ScriptStruct ConZ.WeaponAttachmentAnimations
// Size: 0x20(Inherited: 0x0) 
struct FWeaponAttachmentAnimations
{
	struct FBodyWeaponAnimation Add;  // 0x0(0x10)
	struct FBodyWeaponAnimation Remove;  // 0x10(0x10)

}; 
// Function ConZ.PrisonerHUD.GetHudWidgetCanvasPanel
// Size: 0x8(Inherited: 0x0) 
struct FGetHudWidgetCanvasPanel
{
	struct UCanvasPanel* ReturnValue;  // 0x0(0x8)

}; 
// Function ConZ.WorldCraftingMarkerWidget.ChangeMode
// Size: 0x1(Inherited: 0x0) 
struct FChangeMode
{
	uint8_t  mode;  // 0x0(0x1)

}; 
// Function ConZ.PrisonerTreatmentUIController.OnInventoryContainerAddedOrRemoved
// Size: 0x10(Inherited: 0x0) 
