#pragma once 
#include <ConZ_Structs.h>
 
 
 
// Class ConZ.AnimNotify_CharacterActionEnd
// Size: 0x38(Inherited: 0x38) 
struct UAnimNotify_CharacterActionEnd : public UAnimNotify
{

}; 



// Class ConZ.PrisonerActionManipulateTrapDescription
// Size: 0x58(Inherited: 0x38) 
struct UPrisonerActionManipulateTrapDescription : public UPrisonerActionDescription
{
	char pad_56[32];  // 0x38(0x20)

}; 



// Class ConZ.AchievementsManagerClient
// Size: 0x2B8(Inherited: 0x220) 
struct AAchievementsManagerClient : public AActor
{
	char pad_544[152];  // 0x220(0x98)

}; 



// Class ConZ.BombDefusalMinigame
// Size: 0x4F8(Inherited: 0x4E8) 
struct ABombDefusalMinigame : public ABombDefusalMinigameBase
{
	char pad_1256[16];  // 0x4E8(0x10)

}; 



// Class ConZ.BirdTargetPoint
// Size: 0x228(Inherited: 0x220) 
struct ABirdTargetPoint : public AActor
{
	char pad_544_1 : 7;  // 0x220(0x1)
	bool IsOccupied : 1;  // 0x220(0x1)
	char pad_545[7];  // 0x221(0x7)

}; 



// Class ConZ.PracticeLockpickingItem
// Size: 0x930(Inherited: 0x910) 
struct APracticeLockpickingItem : public AItem
{
	char pad_2320[8];  // 0x910(0x8)
	struct TArray<struct ULockData*> _possibleLocks;  // 0x918(0x10)
	char pad_2344[8];  // 0x928(0x8)

}; 



// Class ConZ.AdminCommand_DisablePrisonerBodyEffects
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_DisablePrisonerBodyEffects : public UAdminCommand
{

}; 



// Class ConZ.AdjustableSeparator
// Size: 0x280(Inherited: 0x260) 
struct UAdjustableSeparator : public UUserWidget
{
	struct USizeBox* _slotSizeBox;  // 0x260(0x8)
	struct UNamedSlot* _divider;  // 0x268(0x8)
	float _slotMinHeight;  // 0x270(0x4)
	float _slotMaxHeight;  // 0x274(0x4)
	char pad_632[8];  // 0x278(0x8)

}; 



// Class ConZ.DropdownMenuWidget
// Size: 0x288(Inherited: 0x260) 
struct UDropdownMenuWidget : public UUserWidget
{
	char pad_608[16];  // 0x260(0x10)
	struct UScrollBox* ScrollPanel;  // 0x270(0x8)
	char pad_632[8];  // 0x278(0x8)
	struct UNamedSlot* _panelSlot;  // 0x280(0x8)

}; 



// Class ConZ.CookingPanelWidget
// Size: 0x2B0(Inherited: 0x260) 
struct UCookingPanelWidget : public UUserWidget
{
	char pad_608[8];  // 0x260(0x8)
	struct UTabContainer* _panelTabsContainer;  // 0x268(0x8)
	struct UWidgetSwitcher* _mainSwitcher;  // 0x270(0x8)
	struct UCookingUtilitySlotsPanel* _cookingUtilitySlotsPanel;  // 0x278(0x8)
	struct UCookingRecipesPanel* _cookingRecipesPanel;  // 0x280(0x8)
	float _checkIngredientsValidityPeriod;  // 0x288(0x4)
	float _checkVicinityHeatSourceItemsPeriod;  // 0x28C(0x4)
	float _updateProgressBarColorsPeriod;  // 0x290(0x4)
	char pad_660[28];  // 0x294(0x1C)

}; 



// Class ConZ.RemoveMagazineInsertMagazine
// Size: 0x90(Inherited: 0x90) 
struct URemoveMagazineInsertMagazine : public UWeaponActionReloadSequence
{

}; 



// Class ConZ.AdminCommand_DestroyVehicle
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_DestroyVehicle : public UAdminCommand
{

}; 



// Class ConZ.EntityComponentSetup
// Size: 0x48(Inherited: 0x40) 
struct UEntityComponentSetup : public UEntitySystemObjectSetup
{
	float BoundsRadius;  // 0x40(0x4)
	char pad_68[4];  // 0x44(0x4)

}; 



// Class ConZ.AdminCommand_DestroyCorpsesWithinRadius
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_DestroyCorpsesWithinRadius : public UAdminCommand
{

}; 



// Class ConZ.GrappleActionParameters
// Size: 0xB0(Inherited: 0x30) 
struct UGrappleActionParameters : public UDataAsset
{
	char pad_48_1 : 7;  // 0x30(0x1)
	bool IsGrappleAttackInWater : 1;  // 0x30(0x1)
	char pad_49[7];  // 0x31(0x7)
	struct UAnimMontage* GrapplerInitialGrabMontage;  // 0x38(0x8)
	struct UAkAudioEvent* StartGrappleAudioEvent;  // 0x40(0x8)
	struct UAkAudioEvent* StopGrappleAudioEvent;  // 0x48(0x8)
	struct FName AttackerAttachSocketName;  // 0x50(0x8)
	struct FName DefenderAttachBoneName;  // 0x58(0x8)
	float DefenderReleaseOffset;  // 0x60(0x4)
	float DefensePercentageIncreasePerInput;  // 0x64(0x4)
	float DefensePercentageDecreasePerSecond;  // 0x68(0x4)
	float DefenseBarSweetSpotSizePercentage;  // 0x6C(0x4)
	float ReleaseBarPercentageIncreasePerSecond;  // 0x70(0x4)
	float ReleaseBarPercentageDecreasePerSecond;  // 0x74(0x4)
	char pad_120[8];  // 0x78(0x8)
	struct FTransform CameraSpringArmOffset;  // 0x80(0x30)

}; 



// Class ConZ.Inv2021_VirtualizedInventoryElement
// Size: 0x58(Inherited: 0x28) 
struct UInv2021_VirtualizedInventoryElement : public UObject
{
	char pad_40[48];  // 0x28(0x30)

}; 



// Class ConZ.Building
// Size: 0x328(Inherited: 0x220) 
struct ABuilding : public AActor
{
	char pad_544[16];  // 0x220(0x10)
	struct TArray<struct FLadderMarker> _ladderMarkers;  // 0x230(0x10)
	char pad_576[16];  // 0x240(0x10)
	struct TArray<struct FWindowMarker> _windowMarkers;  // 0x250(0x10)
	struct TArray<struct FWindowMarker> _windowMarkersDynamic;  // 0x260(0x10)
	struct TArray<struct FWindowMarkerModifier> _windowMarkerModifiers;  // 0x270(0x10)
	char pad_640_1 : 7;  // 0x280(0x1)
	bool _isCleared : 1;  // 0x280(0x1)
	char pad_641_1 : 7;  // 0x281(0x1)
	bool _isClaimable : 1;  // 0x281(0x1)
	char pad_642[6];  // 0x282(0x6)
	struct TMap<struct FString, struct ADoor*> _doors;  // 0x288(0x50)
	struct TArray<struct UFortificationComponent*> _fortifications;  // 0x2D8(0x10)
	char pad_744[64];  // 0x2E8(0x40)

	void OnRep_WindowMarkerModifiers(); // Function ConZ.Building.OnRep_WindowMarkerModifiers
	void OnRep_Cleared(); // Function ConZ.Building.OnRep_Cleared
}; 



// Class ConZ.ItemStatusWidget
// Size: 0x2F8(Inherited: 0x2F8) 
struct UItemStatusWidget : public UWaypointWidgetBase
{

	void SetTitleText(struct FString Text); // Function ConZ.ItemStatusWidget.SetTitleText
	void SetNameText(struct FString Text); // Function ConZ.ItemStatusWidget.SetNameText
}; 



// Class ConZ.ServerSettingsUIController
// Size: 0x278(Inherited: 0x1D8) 
struct UServerSettingsUIController : public UConZSettingsUIController
{
	char pad_472[160];  // 0x1D8(0xA0)

}; 



// Class ConZ.AchievementsManagerServer
// Size: 0x298(Inherited: 0x220) 
struct AAchievementsManagerServer : public AActor
{
	char pad_544[120];  // 0x220(0x78)

}; 



// Class ConZ.PrisonerActionDrainVehicleFuelIntoItem
// Size: 0x118(Inherited: 0x108) 
struct UPrisonerActionDrainVehicleFuelIntoItem : public UPrisonerAction
{
	char pad_264[16];  // 0x108(0x10)

}; 



// Class ConZ.AdminCommand_CompleteMission
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_CompleteMission : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_DoorDebug
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_DoorDebug : public UAdminCommand
{

}; 



// Class ConZ.ArchitecturalCategoriesDatabase
// Size: 0x40(Inherited: 0x30) 
struct UArchitecturalCategoriesDatabase : public UDataAsset
{
	struct TArray<struct UArchitecturalCategory*> ArchitecturalCategories;  // 0x30(0x10)

}; 



// Class ConZ.PlaceableActorBase
// Size: 0x4E8(Inherited: 0x220) 
struct APlaceableActorBase : public AActor
{
	char pad_544[8];  // 0x220(0x8)
	struct FDbIntegerId _id;  // 0x228(0x8)
	struct UBoxComponent* _boxCollisionComponent;  // 0x230(0x8)
	char pad_568[8];  // 0x238(0x8)
	struct UPlaceableCraftableItem* _craftableItem;  // 0x240(0x8)
	float _ingredientMultiplier;  // 0x248(0x4)
	char pad_588[4];  // 0x24C(0x4)
	struct USceneComponent* _rootComponent;  // 0x250(0x8)
	struct UStaticMeshComponent* _staticMeshComponent_Main;  // 0x258(0x8)
	struct UStaticMeshComponent* _staticMeshComponent_Outline;  // 0x260(0x8)
	struct UStaticMeshComponent* _staticMeshComponent_Depth;  // 0x268(0x8)
	struct UStaticMeshComponent* _queryStaticMeshComponent;  // 0x270(0x8)
	struct UStaticMeshComponent* _directionIndicatorStaticMeshComponent;  // 0x278(0x8)
	struct UMaterialInstanceDynamic* _primaryMaterialAllowed;  // 0x280(0x8)
	struct UMaterialInstanceDynamic* _primaryMaterialDisallowed;  // 0x288(0x8)
	struct UMaterialInstanceDynamic* _outlineMaterial;  // 0x290(0x8)
	struct UMaterialInstanceDynamic* _depthMaterial;  // 0x298(0x8)
	char pad_672[200];  // 0x2A0(0xC8)
	uint8_t  _statusFlags;  // 0x368(0x1)
	char pad_873[31];  // 0x369(0x1F)
	uint8_t  _placementState;  // 0x388(0x1)
	char pad_905[123];  // 0x389(0x7B)
	int32_t _numTracesX;  // 0x404(0x4)
	int32_t _numTracesY;  // 0x408(0x4)
	float _traceHeightFactor;  // 0x40C(0x4)
	float _maxPlacementAngle;  // 0x410(0x4)
	char pad_1044[4];  // 0x414(0x4)
	struct TArray<struct FPlaceableIngredient> _ingredients;  // 0x418(0x10)
	float _widgetHidingDistance;  // 0x428(0x4)
	float _fullWidgetHidingDistance;  // 0x42C(0x4)
	float _widgetSwitchPeriod;  // 0x430(0x4)
	float _minDistanceToShowWidget;  // 0x434(0x4)
	float _syncPeriod;  // 0x438(0x4)
	float _reachabilityMaxDifference;  // 0x43C(0x4)
	float _directionIndicatorOffset;  // 0x440(0x4)
	char pad_1092[4];  // 0x444(0x4)
	struct FText _destroyInteractionText;  // 0x448(0x18)
	struct FVector _replicatedLocation;  // 0x460(0xC)
	struct FVector _replicatedPlacedLocation;  // 0x46C(0xC)
	struct FRotator _replicatedRotation;  // 0x478(0xC)
	char pad_1156[60];  // 0x484(0x3C)
	struct UMaterialInterface* _placementAllowedMaterialOverride;  // 0x4C0(0x8)
	struct UMaterialInterface* _placementDisallowedMaterialOverride;  // 0x4C8(0x8)
	struct UMaterialInterface* _outlineMaterialOverride;  // 0x4D0(0x8)
	struct UMaterialInterface* _depthMaterialOverride;  // 0x4D8(0x8)
	char pad_1248[8];  // 0x4E0(0x8)

	void Server_UpdateState(struct FPlaceableActorStateReplicationHelper State); // Function ConZ.PlaceableActorBase.Server_UpdateState
	void Server_Place(struct FVector Location, struct FRotator Rotation); // Function ConZ.PlaceableActorBase.Server_Place
	void OnRep_ReplicatedRotation(); // Function ConZ.PlaceableActorBase.OnRep_ReplicatedRotation
	void OnRep_ReplicatedPlacedLocation(); // Function ConZ.PlaceableActorBase.OnRep_ReplicatedPlacedLocation
	void OnRep_ReplicatedLocation(); // Function ConZ.PlaceableActorBase.OnRep_ReplicatedLocation
	void OnRep_PlacementState(); // Function ConZ.PlaceableActorBase.OnRep_PlacementState
	void OnRep_Ingredients(); // Function ConZ.PlaceableActorBase.OnRep_Ingredients
	void OnRep_IngredientMultiplier(); // Function ConZ.PlaceableActorBase.OnRep_IngredientMultiplier
	void OnRep_Id(); // Function ConZ.PlaceableActorBase.OnRep_Id
	void OnRep_CraftableItem(); // Function ConZ.PlaceableActorBase.OnRep_CraftableItem
}; 



// Class ConZ.ContainerItemDescriptor
// Size: 0x248(Inherited: 0x28) 
struct UContainerItemDescriptor : public UObject
{
	char pad_40[56];  // 0x28(0x38)
	UObject* _itemClass;  // 0x60(0x8)
	char pad_104[24];  // 0x68(0x18)
	struct FContainerItemDescriptorData _data;  // 0x80(0x60)
	struct TScriptInterface<IInventoryContainer> _owningContainer;  // 0xE0(0x10)
	struct TScriptInterface<IInventoryNode> _owningNode;  // 0xF0(0x10)
	char pad_256[328];  // 0x100(0x148)

}; 



// Class ConZ.Inv2021_InventoryStatics
// Size: 0x28(Inherited: 0x28) 
struct UInv2021_InventoryStatics : public UBlueprintFunctionLibrary
{

}; 



// Class ConZ.ActionProgressWidget
// Size: 0x2B0(Inherited: 0x260) 
struct UActionProgressWidget : public UUserWidget
{
	struct FMulticastInlineDelegate ActionProgressFinishedEvent;  // 0x260(0x10)
	struct FMulticastInlineDelegate ActionProgressCancelledEvent;  // 0x270(0x10)
	char pad_640_1 : 7;  // 0x280(0x1)
	bool CanCancel : 1;  // 0x280(0x1)
	char pad_641[11];  // 0x281(0xB)
	float _currentTime;  // 0x28C(0x4)
	float _duration;  // 0x290(0x4)
	char pad_660_1 : 7;  // 0x294(0x1)
	bool _manualMode : 1;  // 0x294(0x1)
	char pad_661[27];  // 0x295(0x1B)

	void UnPauseProgress(); // Function ConZ.ActionProgressWidget.UnPauseProgress
	void SetProgress(float progress); // Function ConZ.ActionProgressWidget.SetProgress
	void PauseProgress(); // Function ConZ.ActionProgressWidget.PauseProgress
	void OnActionProgressFinishedEvent__DelegateSignature(); // DelegateFunction ConZ.ActionProgressWidget.OnActionProgressFinishedEvent__DelegateSignature
	void OnActionProgressCancelledEvent__DelegateSignature(); // DelegateFunction ConZ.ActionProgressWidget.OnActionProgressCancelledEvent__DelegateSignature
	void ExecuteAction(); // Function ConZ.ActionProgressWidget.ExecuteAction
	void CancelAction(); // Function ConZ.ActionProgressWidget.CancelAction
}; 



// Class ConZ.AttributeMapInterface
// Size: 0x28(Inherited: 0x28) 
struct UAttributeMapInterface : public UInterface
{

	void SetStringAttribute(struct FString Name, struct FString Value); // Function ConZ.AttributeMapInterface.SetStringAttribute
	void SetIntAttribute(struct FString Name, int32_t Value); // Function ConZ.AttributeMapInterface.SetIntAttribute
	void SetFloatAttribute(struct FString Name, float Value); // Function ConZ.AttributeMapInterface.SetFloatAttribute
	void SetBoolAttribute(struct FString Name, bool Value); // Function ConZ.AttributeMapInterface.SetBoolAttribute
	bool HasAttribute(struct FString Name); // Function ConZ.AttributeMapInterface.HasAttribute
	struct FString GetStringAttribute(struct FString Name); // Function ConZ.AttributeMapInterface.GetStringAttribute
	int32_t GetIntAttribute(struct FString Name); // Function ConZ.AttributeMapInterface.GetIntAttribute
	float GetFloatAttribute(struct FString Name); // Function ConZ.AttributeMapInterface.GetFloatAttribute
	bool GetBoolAttribute(struct FString Name); // Function ConZ.AttributeMapInterface.GetBoolAttribute
}; 



// Class ConZ.FoliageAssetData
// Size: 0x98(Inherited: 0x28) 
struct UFoliageAssetData : public UAssetUserData
{
	struct FFoliageGeneralData GeneralData;  // 0x28(0x10)
	struct FFoliageEffectsData EffectsData;  // 0x38(0x18)
	struct FFoliageAIPerceptionData AIPerceptionData;  // 0x50(0x2)
	char pad_82[2];  // 0x52(0x2)
	struct FFoliageCanopyData CanopyData;  // 0x54(0x40)
	char pad_148[4];  // 0x94(0x4)

}; 



// Class ConZ.AdminCommand_ListSquads
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ListSquads : public UAdminCommand
{

}; 



// Class ConZ.PrisonerAppearanceDataAsset
// Size: 0xC8(Inherited: 0x30) 
struct UPrisonerAppearanceDataAsset : public UDataAsset
{
	char pad_48_1 : 7;  // 0x30(0x1)
	bool RequiresGameUpgrade : 1;  // 0x30(0x1)
	uint8_t  GameUpgradeRequired;  // 0x31(0x1)
	char pad_50[6];  // 0x32(0x6)
	struct TArray<struct UCharacterMesh*> CharacterMeshes;  // 0x38(0x10)
	struct TMap<struct FName, struct TSoftObjectPtr<UMaterialInstance>> SkinMaterials;  // 0x48(0x50)
	struct FGameplayTag TypeTag;  // 0x98(0x8)
	struct FGameplayTag RaceTag;  // 0xA0(0x8)
	struct FName CharacterAkSwitchValue;  // 0xA8(0x8)
	struct FName LeftEyeSocketName;  // 0xB0(0x8)
	struct FName RightEyeSocketName;  // 0xB8(0x8)
	int32_t DefaultHairStyleIndex;  // 0xC0(0x4)
	char pad_196[4];  // 0xC4(0x4)

}; 



// Class ConZ.CharacterSlot
// Size: 0x2A8(Inherited: 0x260) 
struct UCharacterSlot : public UUserWidget
{
	char pad_608[48];  // 0x260(0x30)
	struct UConZStandardButton* _profileButton;  // 0x290(0x8)
	struct UButton* _deleteButton;  // 0x298(0x8)
	char pad_672[8];  // 0x2A0(0x8)

	void OnProfileButtonClicked(); // Function ConZ.CharacterSlot.OnProfileButtonClicked
	void OnDeleteButtonClicked(); // Function ConZ.CharacterSlot.OnDeleteButtonClicked
}; 



// Class ConZ.AdminCommand_EndTournamentMode
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_EndTournamentMode : public UAdminCommand
{

}; 



// Class ConZ.AnimNotify_SpawnDefecationEffects
// Size: 0x38(Inherited: 0x38) 
struct UAnimNotify_SpawnDefecationEffects : public UAnimNotify
{

}; 



// Class ConZ.BaseBuildingComponent
// Size: 0x6F0(Inherited: 0x4E0) 
struct UBaseBuildingComponent : public UStaticMeshComponent
{
	struct FString _name;  // 0x4E0(0x10)
	uint8_t  _baseElementType;  // 0x4F0(0x4)
	char pad_1268_1 : 7;  // 0x4F4(0x1)
	bool _forbidPlacementOfOtherElements : 1;  // 0x4F4(0x1)
	char pad_1269_1 : 7;  // 0x4F5(0x1)
	bool _isClimbable : 1;  // 0x4F5(0x1)
	char pad_1270_1 : 7;  // 0x4F6(0x1)
	bool _isBlockingItemPlacement : 1;  // 0x4F6(0x1)
	char pad_1271[1];  // 0x4F7(0x1)
	struct TArray<struct UStaticMesh*> _staticMeshVariations;  // 0x4F8(0x10)
	struct UChoppingRecipeDataAsset* _choppingRecipeAsset;  // 0x508(0x8)
	float _healthPoints;  // 0x510(0x4)
	char pad_1300_1 : 7;  // 0x514(0x1)
	bool _canBeDamaged : 1;  // 0x514(0x1)
	char pad_1301[3];  // 0x515(0x3)
	float _hoursToDecay;  // 0x518(0x4)
	float _hoursToDecayOutsideFlagArea;  // 0x51C(0x4)
	char pad_1312_1 : 7;  // 0x520(0x1)
	bool _isUsedForRespawn : 1;  // 0x520(0x1)
	char pad_1313[3];  // 0x521(0x3)
	float _explosionResistance;  // 0x524(0x4)
	struct UCurveFloat* _collisionDamageModifierFromEnergy;  // 0x528(0x8)
	struct UStaticMesh* _weatherMaskMesh;  // 0x530(0x8)
	char pad_1336_1 : 7;  // 0x538(0x1)
	bool _canBePlacedWithoutFlag : 1;  // 0x538(0x1)
	char pad_1337_1 : 7;  // 0x539(0x1)
	bool _canBePlacedInBuilding : 1;  // 0x539(0x1)
	char pad_1338_1 : 7;  // 0x53A(0x1)
	bool _canBePlacedInRestrictedArea : 1;  // 0x53A(0x1)
	char pad_1339[1];  // 0x53B(0x1)
	int32_t _maxInstancesPerFlagArea;  // 0x53C(0x4)
	struct UPlaceableCraftableItem* _upgradeRecipe;  // 0x540(0x8)
	char pad_1352_1 : 7;  // 0x548(0x1)
	bool _cascadeDestroySnappedElementsOnUpgrade : 1;  // 0x548(0x1)
	char pad_1353_1 : 7;  // 0x549(0x1)
	bool _ignoreDisabledBaseBuildingFlag : 1;  // 0x549(0x1)
	char pad_1354_1 : 7;  // 0x54A(0x1)
	bool _isTileable : 1;  // 0x54A(0x1)
	char pad_1355_1 : 7;  // 0x54B(0x1)
	bool _mustBePlacedOnFoundation : 1;  // 0x54B(0x1)
	char pad_1356_1 : 7;  // 0x54C(0x1)
	bool _canEverBePlacedOnFoundation : 1;  // 0x54C(0x1)
	char pad_1357_1 : 7;  // 0x54D(0x1)
	bool _canBePlacedOnOtherBaseElements : 1;  // 0x54D(0x1)
	char pad_1358_1 : 7;  // 0x54E(0x1)
	bool _canBePlacedWithoutSnapping : 1;  // 0x54E(0x1)
	char pad_1359_1 : 7;  // 0x54F(0x1)
	bool _shouldIgnoreSelfWhilePlacing : 1;  // 0x54F(0x1)
	char pad_1360_1 : 7;  // 0x550(0x1)
	bool _canBeGroundedOnOtherElements : 1;  // 0x550(0x1)
	char _maxHeightLevel;  // 0x551(0x1)
	char pad_1362[2];  // 0x552(0x2)
	float _maxHeightDifference;  // 0x554(0x4)
	char pad_1368_1 : 7;  // 0x558(0x1)
	bool _addRandomRotation : 1;  // 0x558(0x1)
	char pad_1369_1 : 7;  // 0x559(0x1)
	bool _mustGroundAllPoints : 1;  // 0x559(0x1)
	char pad_1370_1 : 7;  // 0x55A(0x1)
	bool _mustBePlacedUpright : 1;  // 0x55A(0x1)
	uint8_t  _placementHeightType;  // 0x55B(0x1)
	char pad_1372_1 : 7;  // 0x55C(0x1)
	bool _useSimpleCollisionForOverlaps : 1;  // 0x55C(0x1)
	char pad_1373[3];  // 0x55D(0x3)
	struct FRotator _maxRotationWhilePlacing;  // 0x560(0xC)
	char pad_1388_1 : 7;  // 0x56C(0x1)
	bool _useEncapsulationTestWhenSnapping : 1;  // 0x56C(0x1)
	char pad_1389[3];  // 0x56D(0x3)
	struct TArray<struct FElementSnapMarker> _elementSnapMarkers;  // 0x570(0x10)
	struct TArray<struct FBaseBuildingSizeVariation> _sizeVariations;  // 0x580(0x10)
	char pad_1424[4];  // 0x590(0x4)
	float _sizeVariationsSpacing;  // 0x594(0x4)
	float _repairTime;  // 0x598(0x4)
	char pad_1436[4];  // 0x59C(0x4)
	struct FRepairableParams _repairableParams;  // 0x5A0(0x38)
	float _experienceAwardForBuilding;  // 0x5D8(0x4)
	char pad_1500[4];  // 0x5DC(0x4)
	struct TArray<struct UParticleSystem*> _destructionParticles;  // 0x5E0(0x10)
	struct TArray<struct FTransform> _destructionParticlesSpawnTransforms;  // 0x5F0(0x10)
	struct UAkAudioEvent* _destructionSound;  // 0x600(0x8)
	char pad_1544_1 : 7;  // 0x608(0x1)
	bool _isDoor : 1;  // 0x608(0x1)
	char pad_1545[7];  // 0x609(0x7)
	ADoor* _doorClass;  // 0x610(0x8)
	char pad_1560_1 : 7;  // 0x618(0x1)
	bool _hasLadder : 1;  // 0x618(0x1)
	char pad_1561[7];  // 0x619(0x7)
	struct TArray<struct FLadderMarker> _ladderMarkers;  // 0x620(0x10)
	struct TArray<struct FBaseElementDamageZone> _damageZones;  // 0x630(0x10)
	char pad_1600_1 : 7;  // 0x640(0x1)
	bool _shouldDestroyElementsOnTopWhenDestroyed : 1;  // 0x640(0x1)
	char pad_1601[3];  // 0x641(0x3)
	float _destructionTime;  // 0x644(0x4)
	char pad_1608_1 : 7;  // 0x648(0x1)
	bool _shouldRemoveIntersectingElementsOnDestroy : 1;  // 0x648(0x1)
	char pad_1609[7];  // 0x649(0x7)
	struct TArray<struct FBaseElementDestructionZone> _destructionZones;  // 0x650(0x10)
	char pad_1632_1 : 7;  // 0x660(0x1)
	bool _useAsReplenishableResource : 1;  // 0x660(0x1)
	char pad_1633[7];  // 0x661(0x7)
	struct FReplenishableResourceDescription _replenishableResourceDescription;  // 0x668(0x88)

}; 



// Class ConZ.ModularTooltipElementData_Timer
// Size: 0x58(Inherited: 0x28) 
struct UModularTooltipElementData_Timer : public UModularTooltipElementData
{
	char pad_40[48];  // 0x28(0x30)

}; 



// Class ConZ.FoodItem
// Size: 0x9B0(Inherited: 0x910) 
struct AFoodItem : public AItem
{
	float AccumulatedFatigueBonus;  // 0x910(0x4)
	float ThermalConductivityFactor;  // 0x914(0x4)
	float FreezingTemperature;  // 0x918(0x4)
	float RoomTemperature;  // 0x91C(0x4)
	char pad_2336_1 : 7;  // 0x920(0x1)
	bool Spoilable : 1;  // 0x920(0x1)
	char pad_2337[3];  // 0x921(0x3)
	float ShelfLife;  // 0x924(0x4)
	float SpoilageRateFrozen;  // 0x928(0x4)
	float SpoilageRateModifierWhileSealed;  // 0x92C(0x4)
	char pad_2352_1 : 7;  // 0x930(0x1)
	bool IsConsumable : 1;  // 0x930(0x1)
	char pad_2353_1 : 7;  // 0x931(0x1)
	bool CanCheckTaste : 1;  // 0x931(0x1)
	char pad_2354[6];  // 0x932(0x6)
	struct UParticleSystemComponent* SteamComponent;  // 0x938(0x8)
	struct UParticleSystem* SteamParticles;  // 0x940(0x8)
	struct UParticleSystemComponent* SmokeComponent;  // 0x948(0x8)
	struct UParticleSystem* SmokeParticles;  // 0x950(0x8)
	struct UStaticMesh* ItemOpenedMesh;  // 0x958(0x8)
	struct UStaticMesh* ItemEmptyMesh;  // 0x960(0x8)
	struct UAkAudioEvent* StartEatingAudioEvent;  // 0x968(0x8)
	struct UAkAudioEvent* StopEatingAudioEvent;  // 0x970(0x8)
	struct UAkAudioEvent* StartCookingAudioEvent;  // 0x978(0x8)
	struct UAkAudioEvent* StopCookingAudioEvent;  // 0x980(0x8)
	UGameResourceType* _resourceTypeForConsumption;  // 0x988(0x8)
	float _caloriesBonus;  // 0x990(0x4)
	float _catchSicknessModifier;  // 0x994(0x4)
	char pad_2456_1 : 7;  // 0x998(0x1)
	bool _itemOpened : 1;  // 0x998(0x1)
	char pad_2457[3];  // 0x999(0x3)
	float _temperature;  // 0x99C(0x4)
	char pad_2464[16];  // 0x9A0(0x10)

	void OnRep_ItemOpened(); // Function ConZ.FoodItem.OnRep_ItemOpened
	void OnAudioComponentExpired(); // Function ConZ.FoodItem.OnAudioComponentExpired
}; 



// Class ConZ.ActorStatics
// Size: 0x28(Inherited: 0x28) 
struct UActorStatics : public UBlueprintFunctionLibrary
{

	struct UActorComponent* GetActorComponentByName(struct AActor* Actor, struct FName& Name); // Function ConZ.ActorStatics.GetActorComponentByName
	struct FVector GetActorBoundsCenter(struct AActor* Actor, bool onlyCollidingComponents); // Function ConZ.ActorStatics.GetActorBoundsCenter
}; 



// Class ConZ.MetabolismSkillProgressionTab
// Size: 0x298(Inherited: 0x260) 
struct UMetabolismSkillProgressionTab : public UUserWidget
{
	UUserWidget* SkillProgressBarWidgetClass;  // 0x260(0x8)
	struct UWrapBox* _skillsWrapBox;  // 0x268(0x8)
	char pad_624[8];  // 0x270(0x8)
	uint8_t  _skillType;  // 0x278(0x1)
	char pad_633[7];  // 0x279(0x7)
	struct FText _skillAttributeName;  // 0x280(0x18)

}; 



// Class ConZ.AdminCommand_ChangeCurrencyBalanceToAllOnline
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ChangeCurrencyBalanceToAllOnline : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_AddPrisonerBodyEffect
// Size: 0x90(Inherited: 0x88) 
struct UAdminCommand_AddPrisonerBodyEffect : public UAdminCommand
{
	UPrisonerBodyEffect* _bodyEffectClass;  // 0x88(0x8)

}; 



// Class ConZ.BankCardOperationRequest
// Size: 0x40(Inherited: 0x28) 
struct UBankCardOperationRequest : public UPlayerRpcChannelServerRequest
{
	char pad_40[24];  // 0x28(0x18)

}; 



// Class ConZ.PrisonerActionActivateSlotDescription
// Size: 0x40(Inherited: 0x38) 
struct UPrisonerActionActivateSlotDescription : public UPrisonerActionDescription
{
	char pad_56[8];  // 0x38(0x8)

}; 



// Class ConZ.HeatSourceEntityComponentSetup
// Size: 0x178(Inherited: 0x48) 
struct UHeatSourceEntityComponentSetup : public UEntityComponentSetup
{
	UGameResourceType* ResourceType;  // 0x48(0x8)
	float MaxTemperature;  // 0x50(0x4)
	float InnerRadius;  // 0x54(0x4)
	float OuterRadius;  // 0x58(0x4)
	char pad_92_1 : 7;  // 0x5C(0x1)
	bool AutoFindResourceSupplier : 1;  // 0x5C(0x1)
	char pad_93[3];  // 0x5D(0x3)
	struct FName ResourceSupplierName;  // 0x60(0x8)
	struct FRuntimeFloatCurve ResourceSupplierUsageRateVsHeatIntensity;  // 0x68(0x88)
	struct FRuntimeFloatCurve MaxHeatIntensityVsSupplierResourceAmountRatio;  // 0xF0(0x88)

}; 



// Class ConZ.AdminCommandArgumentDataType_Numeric
// Size: 0x110(Inherited: 0x108) 
struct UAdminCommandArgumentDataType_Numeric : public UAdminCommandArgumentDataTypeBase
{
	float _defaultValue;  // 0x108(0x4)
	char pad_268[4];  // 0x10C(0x4)

}; 



// Class ConZ.WeaponStateFiring
// Size: 0x30(Inherited: 0x30) 
struct UWeaponStateFiring : public UWeaponState
{

}; 



// Class ConZ.CraftingRecipeWidget
// Size: 0x308(Inherited: 0x260) 
struct UCraftingRecipeWidget : public UUserWidget
{
	struct UItemClassWidget* ItemWidget;  // 0x260(0x8)
	char pad_616[32];  // 0x268(0x20)
	struct UImage* _itemImage;  // 0x288(0x8)
	struct UTextBlock* _additionalText;  // 0x290(0x8)
	struct UCraftableItem* _craftableItem;  // 0x298(0x8)
	char pad_672[16];  // 0x2A0(0x10)
	struct UAkAudioEvent* _clickSound;  // 0x2B0(0x8)
	UTooltipBase* _tooltipClass;  // 0x2B8(0x8)
	struct UMaterial* _greyedOutMaterial;  // 0x2C0(0x8)
	struct UMaterial* _nonGreyedOutMaterial;  // 0x2C8(0x8)
	struct UEmptySlot* EmptySlot;  // 0x2D0(0x8)
	struct URetainerBox* MainRetainerBox;  // 0x2D8(0x8)
	struct UImage* BackgroundImage;  // 0x2E0(0x8)
	struct UImage* SelectionBox;  // 0x2E8(0x8)
	struct UTexture2D* BoxNextLevel;  // 0x2F0(0x8)
	struct UTexture2D* BoxRedNoComponents;  // 0x2F8(0x8)
	struct UTexture2D* BoxYellowComponentsMissing;  // 0x300(0x8)

	void RecipeSelectedDelegate__DelegateSignature(struct UCraftingRecipeWidget* Widget); // DelegateFunction ConZ.CraftingRecipeWidget.RecipeSelectedDelegate__DelegateSignature
	struct FText GetCaption(); // Function ConZ.CraftingRecipeWidget.GetCaption
	uint8_t  GetAvailabilityState(); // Function ConZ.CraftingRecipeWidget.GetAvailabilityState
}; 



// Class ConZ.AdminCommand_GetUserID
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_GetUserID : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_DestroyZombiesWithinRadius
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_DestroyZombiesWithinRadius : public UAdminCommand
{

}; 



// Class ConZ.PlayerManagementMap
// Size: 0x260(Inherited: 0x260) 
struct UPlayerManagementMap : public UUserWidget
{

}; 



// Class ConZ.PrisonerActionClearWeaponMalfunctionDescription
// Size: 0x48(Inherited: 0x38) 
struct UPrisonerActionClearWeaponMalfunctionDescription : public UPrisonerActionDescription
{
	char pad_56[16];  // 0x38(0x10)

}; 



// Class ConZ.CustomZoneSettingsMenu
// Size: 0x2D0(Inherited: 0x260) 
struct UCustomZoneSettingsMenu : public UBaseMenu
{
	char pad_608[24];  // 0x260(0x18)
	struct UCustomZoneSettingsMap* _map;  // 0x278(0x8)
	struct UCustomZoneSettingsConfigurationsList* _configurationsList;  // 0x280(0x8)
	struct UCustomZoneSettingsRegionsList* _regionsList;  // 0x288(0x8)
	struct UCustomZoneSettingsDetailsDisplay* _detailsDisplay;  // 0x290(0x8)
	struct UCustomZoneSettingsApplyNotification* _applyNotification;  // 0x298(0x8)
	struct UVerticalBox* _messageBoxPanel;  // 0x2A0(0x8)
	struct UButton* _buttonBack;  // 0x2A8(0x8)
	struct UButton* _buttonApply;  // 0x2B0(0x8)
	struct UButton* _buttonReset;  // 0x2B8(0x8)
	char pad_704[16];  // 0x2C0(0x10)

	void CloseMenu(); // Function ConZ.CustomZoneSettingsMenu.CloseMenu
}; 



// Class ConZ.AdminCommand_AddOrRemoveWidget
// Size: 0xD8(Inherited: 0x88) 
struct UAdminCommand_AddOrRemoveWidget : public UAdminCommand
{
	struct TMap<struct FName, UUserWidget*> _widgetClassesByName;  // 0x88(0x50)

}; 



// Class ConZ.AdminCommand_SetFamePointsToAll
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetFamePointsToAll : public UAdminCommand
{

}; 



// Class ConZ.BankATMPointingButton
// Size: 0x528(Inherited: 0x260) 
struct UBankATMPointingButton : public UUserWidget
{
	char pad_608[40];  // 0x260(0x28)
	struct FText _titleText;  // 0x288(0x18)
	char pad_672_1 : 7;  // 0x2A0(0x1)
	bool _isPointingRight : 1;  // 0x2A0(0x1)
	char pad_673[7];  // 0x2A1(0x7)
	struct UImage* _backgroundImage;  // 0x2A8(0x8)
	struct UTextBlock* _titleLabel;  // 0x2B0(0x8)
	char pad_696[8];  // 0x2B8(0x8)
	struct FBankATMPointingButtonStateVisual _normalVisuals;  // 0x2C0(0x98)
	struct FBankATMPointingButtonStateVisual _hoveredVisuals;  // 0x358(0x98)
	struct FBankATMPointingButtonStateVisual _pressedVisuals;  // 0x3F0(0x98)
	struct FBankATMPointingButtonStateVisual _disabledVisuals;  // 0x488(0x98)
	struct UAkAudioEvent* _soundOnClicked;  // 0x520(0x8)

}; 



// Class ConZ.AdminCommand_DumpWetnessDebug
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_DumpWetnessDebug : public UAdminCommand
{

}; 



// Class ConZ.CombinationLockGetCombinationResponse
// Size: 0x30(Inherited: 0x28) 
struct UCombinationLockGetCombinationResponse : public UPlayerRpcChannelServerResponse
{
	char pad_40[8];  // 0x28(0x8)

}; 



// Class ConZ.RemoveMagazineRemoveCartridge
// Size: 0x58(Inherited: 0x50) 
struct URemoveMagazineRemoveCartridge : public UWeaponActionUnloadAmmoSequence
{
	struct FName MontageEndSectionName;  // 0x50(0x8)

}; 



// Class ConZ.AdminCommand
// Size: 0x88(Inherited: 0x28) 
struct UAdminCommand : public UObject
{
	struct FString _verb;  // 0x28(0x10)
	struct TArray<struct FAdminCommandArgumentDescription> _argumentDescriptions;  // 0x38(0x10)
	int32_t _numberOfRequiredArguments;  // 0x48(0x4)
	int32_t _numberOfRepeatingArguments;  // 0x4C(0x4)
	char pad_80_1 : 7;  // 0x50(0x1)
	bool _isEnabled : 1;  // 0x50(0x1)
	char pad_81_1 : 7;  // 0x51(0x1)
	bool _isEnabledInShippingBuild : 1;  // 0x51(0x1)
	char pad_82_1 : 7;  // 0x52(0x1)
	bool _isAdminStatusRequired : 1;  // 0x52(0x1)
	char pad_83_1 : 7;  // 0x53(0x1)
	bool _isDeveloperStatusRequired : 1;  // 0x53(0x1)
	char pad_84_1 : 7;  // 0x54(0x1)
	bool _shouldExecuteOnServer : 1;  // 0x54(0x1)
	char pad_85_1 : 7;  // 0x55(0x1)
	bool _shouldExecuteOnClient : 1;  // 0x55(0x1)
	char pad_86_1 : 7;  // 0x56(0x1)
	bool _shouldDisableSingleplayerAchievementsIfExecuted : 1;  // 0x56(0x1)
	char pad_87[1];  // 0x57(0x1)
	struct FText _description;  // 0x58(0x18)
	char pad_112[24];  // 0x70(0x18)

	bool Execute(struct TArray<struct FString>& arguments); // Function ConZ.AdminCommand.Execute
	bool CanEverBeExecuted(struct APlayerController* Controller, struct FString& reasonIfNot); // Function ConZ.AdminCommand.CanEverBeExecuted
	bool CanBeExecuted(struct APlayerController* Controller, struct FString& reasonIfNot); // Function ConZ.AdminCommand.CanBeExecuted
}; 



// Class ConZ.AdminCommand_ListFlags
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ListFlags : public UAdminCommand
{

}; 



// Class ConZ.FishSpawningPreset
// Size: 0x38(Inherited: 0x30) 
struct UFishSpawningPreset : public UDataAsset
{
	float SpawningChance;  // 0x30(0x4)
	char pad_52[4];  // 0x34(0x4)

}; 



// Class ConZ.AdminCommand_AdminLight
// Size: 0x98(Inherited: 0x88) 
struct UAdminCommand_AdminLight : public UAdminCommand
{
	UAdminLight* _adminLightComponent;  // 0x88(0x8)
	float _maxIntensityMultiplier;  // 0x90(0x4)
	char pad_148[4];  // 0x94(0x4)

}; 



// Class ConZ.CheckAssetNamesCommandlet
// Size: 0x80(Inherited: 0x80) 
struct UCheckAssetNamesCommandlet : public UCommandlet
{

}; 



// Class ConZ.AdminCommand_RemovePrisonerBodyEffect
// Size: 0x90(Inherited: 0x88) 
struct UAdminCommand_RemovePrisonerBodyEffect : public UAdminCommand
{
	UPrisonerBodyEffect* _bodyEffectClass;  // 0x88(0x8)

}; 



// Class ConZ.GameEventLocationMarker
// Size: 0x418(Inherited: 0x220) 
struct AGameEventLocationMarker : public AActor
{
	struct FText LocationName;  // 0x220(0x18)
	struct UTexture2D* LocationImage;  // 0x238(0x8)
	struct UTexture2D* LocationImageGrayscale;  // 0x240(0x8)
	char pad_584_1 : 7;  // 0x248(0x1)
	bool EligibleForRandomPick : 1;  // 0x248(0x1)
	char pad_585[7];  // 0x249(0x7)
	AGameEventBase* GameEventClass;  // 0x250(0x8)
	struct FGameEventParameters GameEventParameters;  // 0x258(0x188)
	AGameEventBorder* BorderClass;  // 0x3E0(0x8)
	struct FVector AreaCenterOffset;  // 0x3E8(0xC)
	float Radius;  // 0x3F4(0x4)
	struct TArray<struct FSpawnArea> SpawnAreas;  // 0x3F8(0x10)
	struct USphereComponent* Sphere;  // 0x408(0x8)
	struct UBillboardComponent* Sprite;  // 0x410(0x8)

	struct FVector GetAreaCenter(); // Function ConZ.GameEventLocationMarker.GetAreaCenter
	struct AGameEventBase* CreateGameEvent(); // Function ConZ.GameEventLocationMarker.CreateGameEvent
	struct AGameEventBorder* CreateBorder(); // Function ConZ.GameEventLocationMarker.CreateBorder
}; 



// Class ConZ.RadioCategory
// Size: 0x40(Inherited: 0x28) 
struct URadioCategory : public UObject
{
	struct TArray<struct URadioTrack*> Tracks;  // 0x28(0x10)
	int32_t _index;  // 0x38(0x4)
	char pad_60[4];  // 0x3C(0x4)

	struct URadioTrack* ProvideNextRadioTrack(); // Function ConZ.RadioCategory.ProvideNextRadioTrack
}; 



// Class ConZ.PrisonerBodyConditionInteraction
// Size: 0x80(Inherited: 0x28) 
struct UPrisonerBodyConditionInteraction : public UObject
{
	struct FText _name;  // 0x28(0x18)
	float _actionDurationVsPhysicianSkillLevel[5];  // 0x40(0x14)
	float _experiencePointsToGainVsPhysicianSkillLevel[5];  // 0x54(0x14)
	uint8_t  _beginInteractionMontage;  // 0x68(0x1)
	uint8_t  _endInteractionMontage;  // 0x69(0x1)
	char pad_106[6];  // 0x6A(0x6)
	struct UAkAudioEvent* _beginInteractionPatientAudioEvent;  // 0x70(0x8)
	struct UAkAudioEvent* _endInteractionPatientAudioEvent;  // 0x78(0x8)

}; 



// Class ConZ.MetabolismTitleAndAPB
// Size: 0x2B0(Inherited: 0x260) 
struct UMetabolismTitleAndAPB : public UUserWidget
{
	struct FText Title;  // 0x260(0x18)
	struct UTextBlock* _titleText;  // 0x278(0x8)
	struct UImage* _background;  // 0x280(0x8)
	struct UMetabolismAdvancedProgressBar* _apb_ValueAndProgress;  // 0x288(0x8)
	struct FDataTableRowHandle _backgroundColor;  // 0x290(0x10)
	struct FDataTableRowHandle _titleTextColor;  // 0x2A0(0x10)

}; 



// Class ConZ.BankATMMinigameConfiguration
// Size: 0x60(Inherited: 0x48) 
struct UBankATMMinigameConfiguration : public UMinigameConfiguration
{
	char pad_72[24];  // 0x48(0x18)

}; 



// Class ConZ.AdminCommand_ListSpawnedAnimals
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ListSpawnedAnimals : public UAdminCommand
{

}; 



// Class ConZ.AviationSkill
// Size: 0x5D8(Inherited: 0xB0) 
struct UAviationSkill : public UVehicleHandlingSkill
{
	struct FVehicleHandlingExperienceAwards NoSkillExperienceAwards;  // 0xB0(0x8)
	struct FVehicleHandlingExperienceAwards BasicSkillExperienceAwards;  // 0xB8(0x8)
	struct FVehicleHandlingExperienceAwards MediumSkillExperienceAwards;  // 0xC0(0x8)
	struct FVehicleHandlingExperienceAwards AdvancedSkillExperienceAwards;  // 0xC8(0x8)
	struct FVehicleHandlingExperienceAwards AboveAdvancedSkillExperienceAwards;  // 0xD0(0x8)
	struct FAviationSkillParametersPerSkillLevel NoSkillParameters;  // 0xD8(0x100)
	struct FAviationSkillParametersPerSkillLevel BasicSkillParameters;  // 0x1D8(0x100)
	struct FAviationSkillParametersPerSkillLevel MediumSkillParameters;  // 0x2D8(0x100)
	struct FAviationSkillParametersPerSkillLevel AdvancedSkillParameters;  // 0x3D8(0x100)
	struct FAviationSkillParametersPerSkillLevel AboveAdvancedSkillParameters;  // 0x4D8(0x100)

}; 



// Class ConZ.AdminCommand_Announce
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_Announce : public UAdminCommand
{

}; 



// Class ConZ.BankATMAccountSummary
// Size: 0x288(Inherited: 0x260) 
struct UBankATMAccountSummary : public UUserWidget
{
	struct UTextBlock* _accountBalance;  // 0x260(0x8)
	struct UHorizontalBox* _ATMOperationalTransactionLimitHorizontalBox;  // 0x268(0x8)
	struct UTextBlock* _ATMOperationalTransactionLimit;  // 0x270(0x8)
	struct UHorizontalBox* _cardOperationalTransactionLimitHorizontalBox;  // 0x278(0x8)
	struct UTextBlock* _cardOperationalTransactionLimit;  // 0x280(0x8)

}; 



// Class ConZ.ChatNotification
// Size: 0x30(Inherited: 0x30) 
struct UChatNotification : public UConZNotification
{

}; 



// Class ConZ.BuildingManager
// Size: 0x3F8(Inherited: 0x220) 
struct ABuildingManager : public AActor
{
	char pad_544[72];  // 0x220(0x48)
	struct TMap<struct ABuilding*, struct FBox2D> _buildings;  // 0x268(0x50)
	struct TMap<struct FDbIntegerId, struct FBuildingsArray> _buildingsOwned;  // 0x2B8(0x50)
	char pad_776[8];  // 0x308(0x8)
	struct FBuildingsReplicationHelper _buildingsDataRepHelper;  // 0x310(0x70)
	char pad_896[120];  // 0x380(0x78)

	void NetMulticast_UpdateBuildingFortificationsState(int32_t dataVersion, struct FString buildingId, struct TArray<struct FFortificationData> FortificationData); // Function ConZ.BuildingManager.NetMulticast_UpdateBuildingFortificationsState
	void NetMulticast_UpdateBuildingData(int32_t dataVersion, struct FString runtimeId, struct FBuildingData BuildingData); // Function ConZ.BuildingManager.NetMulticast_UpdateBuildingData
}; 



// Class ConZ.EntitySystemObjectSetup
// Size: 0x40(Inherited: 0x30) 
struct UEntitySystemObjectSetup : public ULWObjectSetup
{
	char pad_48_1 : 7;  // 0x30(0x1)
	bool TickEnabled : 1;  // 0x30(0x1)
	char pad_49[3];  // 0x31(0x3)
	float TickInterval;  // 0x34(0x4)
	char pad_56_1 : 7;  // 0x38(0x1)
	bool CanEverTickOnServer : 1;  // 0x38(0x1)
	char pad_57_1 : 7;  // 0x39(0x1)
	bool CanEverTickOnClient : 1;  // 0x39(0x1)
	char pad_58[6];  // 0x3A(0x6)

}; 



// Class ConZ.InteractionComponent
// Size: 0x278(Inherited: 0xB0) 
struct UInteractionComponent : public UActorComponent
{
	char pad_176[8];  // 0xB0(0x8)
	float ExamineActionDuration;  // 0xB8(0x4)
	float ExamineReplicationDelay;  // 0xBC(0x4)
	float PickupItemActionDuration;  // 0xC0(0x4)
	float PickupItemReplicationDelay;  // 0xC4(0x4)
	float StoreItemActionDuration;  // 0xC8(0x4)
	float TickFrequency;  // 0xCC(0x4)
	float MinLandscapeInteractionDistanceSquared;  // 0xD0(0x4)
	int32_t SavedGroundSearchLocationsCount;  // 0xD4(0x4)
	AActor* GhostActorToSpawnAfterExamine;  // 0xD8(0x8)
	char pad_224[8];  // 0xE0(0x8)
	int32_t InitialMinNumEmptyContainersToSearchToSpawnGhostActor;  // 0xE8(0x4)
	int32_t InitialMaxNumEmptyContainersToSearchToSpawnGhostActor;  // 0xEC(0x4)
	int32_t MinNumEmptyContainersToSearchToSpawnGhostActor;  // 0xF0(0x4)
	int32_t MaxNumEmptyContainersToSearchToSpawnGhostActor;  // 0xF4(0x4)
	char pad_248_1 : 7;  // 0xF8(0x1)
	bool ShouldSpawnGhostActorRelativeToExaminer : 1;  // 0xF8(0x1)
	char pad_249[3];  // 0xF9(0x3)
	float GhostActorSpawnDistanceToExaminer;  // 0xFC(0x4)
	int64_t ExamineGhostSpawnEndTime;  // 0x100(0x8)
	char pad_264[8];  // 0x108(0x8)
	struct TArray<struct UInteractionAction*> _actions;  // 0x110(0x10)
	char pad_288[240];  // 0x120(0xF0)
	struct FSpawnedItems _replicatedExamineSpawnedItems;  // 0x210(0x18)
	struct FSpawnedItems _replicatedPickupSpawnedItem;  // 0x228(0x18)
	char pad_576[44];  // 0x240(0x2C)
	float _drinkAllowedThreshold;  // 0x26C(0x4)
	float _reexamineFrequency;  // 0x270(0x4)
	char pad_628[4];  // 0x274(0x4)

	void UseItemOnServer(struct AItem* Item, int32_t Usage, float usageWeight, bool Eat); // Function ConZ.InteractionComponent.UseItemOnServer
	void UpdateExistenceOnClient(bool Exists); // Function ConZ.InteractionComponent.UpdateExistenceOnClient
	void UnspawnExaminedItemsOnServer(bool destroyItems); // Function ConZ.InteractionComponent.UnspawnExaminedItemsOnServer
	void UnexamineItemOnServer(struct AItem* Item); // Function ConZ.InteractionComponent.UnexamineItemOnServer
	void UnexamineItemOnClient(struct AItem* Item); // Function ConZ.InteractionComponent.UnexamineItemOnClient
	void UncraftItemOnServer(struct AItem* Item); // Function ConZ.InteractionComponent.UncraftItemOnServer
	void StopExamining(); // Function ConZ.InteractionComponent.StopExamining
	void Server_UpdateLockHPOnServer(struct UObject* Lockpickable, float lockHP); // Function ConZ.InteractionComponent.Server_UpdateLockHPOnServer
	void Server_RemoveLockOnServer(struct UObject* Lockpickable); // Function ConZ.InteractionComponent.Server_RemoveLockOnServer
	void Server_InteractWithBaseElement(uint8_t  interactionType, struct FConZBaseInteractionData baseData, struct FConZBaseElementInteractionData elementData); // Function ConZ.InteractionComponent.Server_InteractWithBaseElement
	void Server_FindOrCreateGardenSlotMeshComponentForInteraction(struct UStaticMesh* PlantMesh); // Function ConZ.InteractionComponent.Server_FindOrCreateGardenSlotMeshComponentForInteraction
	void PickupItemOnServer(struct UMeshComponent* MeshComponent, struct FMeshInstanceId InstanceId, struct UStaticMesh* StaticMesh, struct FVector pickupLocation, uint8_t  Operation); // Function ConZ.InteractionComponent.PickupItemOnServer
	void PickupItemOnClients(struct UMeshComponent* MeshComponent, struct FMeshInstanceId InstanceId, struct UStaticMesh* StaticMesh, struct FVector pickupLocation); // Function ConZ.InteractionComponent.PickupItemOnClients
	void OpenItemOnServer(struct AFoodItem* FoodItem, struct AItem* openingItem); // Function ConZ.InteractionComponent.OpenItemOnServer
	void OnRep_PickupSpawnedItem(); // Function ConZ.InteractionComponent.OnRep_PickupSpawnedItem
	void OnRep_ExamineSpawnedItems(); // Function ConZ.InteractionComponent.OnRep_ExamineSpawnedItems
	void NetMulticast_UpdateLockHPOnClients(struct UObject* Lockpickable, float lockHP); // Function ConZ.InteractionComponent.NetMulticast_UpdateLockHPOnClients
	void FinishPickupItemOnServer(); // Function ConZ.InteractionComponent.FinishPickupItemOnServer
	void FinishExaminePrisonerOnServer(struct APrisoner* Prisoner); // Function ConZ.InteractionComponent.FinishExaminePrisonerOnServer
	void FinishExamineObjectOnServer(); // Function ConZ.InteractionComponent.FinishExamineObjectOnServer
	void FillWaterOnServer(struct AItem* Item, float Ratio, float Salinity, UGameResourceType* ResourceType); // Function ConZ.InteractionComponent.FillWaterOnServer
	void ExecuteInteractionOnServer(struct AItem* interactionItem, uint8_t  Interaction, struct FServerCraftableItem CraftableItem); // Function ConZ.InteractionComponent.ExecuteInteractionOnServer
	void ExaminePrisonerOnServer(struct APrisoner* Prisoner); // Function ConZ.InteractionComponent.ExaminePrisonerOnServer
	void ExamineObjectOnServer(struct UMeshComponent* MeshComponent, struct FMeshInstanceId InstanceId, struct FVector instanceLocation, struct UObject* Spawner); // Function ConZ.InteractionComponent.ExamineObjectOnServer
	void CutObjectOnServer(struct AActor* Actor, struct UMeshComponent* MeshComponent, struct FMeshInstanceId InstanceId, struct FVector Location, bool collectOnly); // Function ConZ.InteractionComponent.CutObjectOnServer
	void CutObjectOnClients(struct UMeshComponent* MeshComponent, struct FMeshInstanceId InstanceId); // Function ConZ.InteractionComponent.CutObjectOnClients
	void CraftItemOnServer(struct FServerCraftableItem CraftableItem); // Function ConZ.InteractionComponent.CraftItemOnServer
	void Client_SendGroundSearchLocation(struct FVector Location); // Function ConZ.InteractionComponent.Client_SendGroundSearchLocation
	void ChopOnServer(struct UObject* choppedObject); // Function ConZ.InteractionComponent.ChopOnServer
	void CheckExistenceOnServer(struct UMeshComponent* MeshComponent, struct FMeshInstanceId InstanceId); // Function ConZ.InteractionComponent.CheckExistenceOnServer
}; 



// Class ConZ.AdminCommand_BanPlayer
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_BanPlayer : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_CancelVote
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_CancelVote : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_ChangeCurrencyBalance
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ChangeCurrencyBalance : public UAdminCommand
{

}; 



// Class ConZ.ExteriorCharacterSpawnerComponent
// Size: 0x240(Inherited: 0x230) 
struct UExteriorCharacterSpawnerComponent : public UCharacterSpawnerComponent
{
	uint8_t  Range;  // 0x230(0x1)
	char pad_561[15];  // 0x231(0xF)

}; 



// Class ConZ.DoorUpgradeWidget
// Size: 0x360(Inherited: 0x2F8) 
struct UDoorUpgradeWidget : public UWaypointWidgetBase
{
	struct UVerticalBox* _lockSlotsBox;  // 0x2F8(0x8)
	struct UVerticalBox* _protectionSlotsBox;  // 0x300(0x8)
	struct UVerticalBox* _sensorSlotsBox;  // 0x308(0x8)
	struct UVerticalBox* _bcuLockSlotBox;  // 0x310(0x8)
	struct ADoor* _door;  // 0x318(0x8)
	char pad_800[64];  // 0x320(0x40)

}; 



// Class ConZ.AdminCommand_ChangeCurrencyBalanceToAll
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ChangeCurrencyBalanceToAll : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_CharacterSpawner
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_CharacterSpawner : public UAdminCommand
{

}; 



// Class ConZ.EntityDebuggerEntitySetup
// Size: 0x90(Inherited: 0x80) 
struct UEntityDebuggerEntitySetup : public UEntitySetup
{
	char pad_128_1 : 7;  // 0x80(0x1)
	bool DrawQuerySphere : 1;  // 0x80(0x1)
	char pad_129_1 : 7;  // 0x81(0x1)
	bool DrawTopLevelEntitiesOnly : 1;  // 0x81(0x1)
	char pad_130_1 : 7;  // 0x82(0x1)
	bool DrawEntityBounds : 1;  // 0x82(0x1)
	char pad_131_1 : 7;  // 0x83(0x1)
	bool DrawEntityDebugStrings : 1;  // 0x83(0x1)
	char pad_132_1 : 7;  // 0x84(0x1)
	bool DrawEntityComponentDebugStrings : 1;  // 0x84(0x1)
	char pad_133[3];  // 0x85(0x3)
	int32_t DebugStringLineBreak;  // 0x88(0x4)
	char pad_140[4];  // 0x8C(0x4)

}; 



// Class ConZ.ExpirableItemComponent
// Size: 0xD8(Inherited: 0xC8) 
struct UExpirableItemComponent : public UItemComponent
{
	int64_t _expirationTimeSeconds;  // 0xC8(0x8)
	int64_t _itemCreatedTimestamp;  // 0xD0(0x8)

}; 



// Class ConZ.VideoSettingsManager
// Size: 0x28(Inherited: 0x28) 
struct UVideoSettingsManager : public UObject
{

}; 



// Class ConZ.AudibleButtonComponent
// Size: 0x78(Inherited: 0x28) 
struct UAudibleButtonComponent : public UObject
{
	struct TMap<uint8_t , struct UAkAudioEvent*> _audioEvents;  // 0x28(0x50)

}; 



// Class ConZ.AdminCommand_ClearFakeName
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ClearFakeName : public UAdminCommand
{

}; 



// Class ConZ.DroneTargetData
// Size: 0x30(Inherited: 0x28) 
struct UDroneTargetData : public UObject
{
	char pad_40[8];  // 0x28(0x8)

}; 



// Class ConZ.FireworksItemState
// Size: 0x110(Inherited: 0x100) 
struct UFireworksItemState : public UItemState
{
	char pad_256_1 : 7;  // 0x100(0x1)
	bool IsFiring : 1;  // 0x100(0x1)
	char pad_257[3];  // 0x101(0x3)
	int32_t LaunchedShells;  // 0x104(0x4)
	char pad_264[8];  // 0x108(0x8)

}; 



// Class ConZ.AdminCommand_CrashMajestically
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_CrashMajestically : public UAdminCommand
{

}; 



// Class ConZ.DropZoneSlot
// Size: 0x250(Inherited: 0x220) 
struct ADropZoneSlot : public AActor
{
	char pad_544[8];  // 0x220(0x8)
	struct UStaticMeshComponent* Mesh;  // 0x228(0x8)
	float ActivationDuration;  // 0x230(0x4)
	char pad_564[4];  // 0x234(0x4)
	struct UStaticMesh* UnlockedMesh;  // 0x238(0x8)
	struct UAkAudioEvent* ActivateSound;  // 0x240(0x8)
	struct ADropZoneGameEvent* _gameEvent;  // 0x248(0x8)

	void SetGameEvent(struct ADropZoneGameEvent* gameEvent); // Function ConZ.DropZoneSlot.SetGameEvent
	void Server_Activate(struct APrisoner* Prisoner); // Function ConZ.DropZoneSlot.Server_Activate
	float GetOpeningDuration(); // Function ConZ.DropZoneSlot.GetOpeningDuration
	struct ADropZoneGameEvent* GetGameEvent(); // Function ConZ.DropZoneSlot.GetGameEvent
}; 



// Class ConZ.AdminCommand_CreateEntity
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_CreateEntity : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_ListSpawnedVehicles
// Size: 0x188(Inherited: 0x88) 
struct UAdminCommand_ListSpawnedVehicles : public UAdminCommand
{
	struct FGameplayTagContainer _vehicleSpawnGroupsByCategory[8];  // 0x88(0x100)

}; 



// Class ConZ.AnimNotifyState_WeaponShowAmmunitionMeshes
// Size: 0x48(Inherited: 0x30) 
struct UAnimNotifyState_WeaponShowAmmunitionMeshes : public UAnimNotifyState
{
	char pad_48_1 : 7;  // 0x30(0x1)
	bool showReversed : 1;  // 0x30(0x1)
	char pad_49[7];  // 0x31(0x7)
	struct TArray<int32_t> ammoIndices;  // 0x38(0x10)

}; 



// Class ConZ.AdminCommand_DebugWeapon
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_DebugWeapon : public UAdminCommand
{

}; 



// Class ConZ.InventoryContainerClothes
// Size: 0x90(Inherited: 0x28) 
struct UInventoryContainerClothes : public UObject
{
	char pad_40[8];  // 0x28(0x8)
	struct UInventoryContainerWidget2* _widget;  // 0x30(0x8)
	char pad_56[16];  // 0x38(0x10)
	struct FInventoryContainerClothesData _data;  // 0x48(0x20)
	struct FInventoryContainerClothesData _oldData;  // 0x68(0x20)
	char pad_136[8];  // 0x88(0x8)

	void OnRep_Data(); // Function ConZ.InventoryContainerClothes.OnRep_Data
}; 



// Class ConZ.CargoDropEvent
// Size: 0x310(Inherited: 0x248) 
struct ACargoDropEvent : public AWorldEvent
{
	struct TArray<ACargoDropContainer*> CargoDropClasses;  // 0x248(0x10)
	char pad_600[104];  // 0x258(0x68)
	struct FSpawnCharacterAroundInfo _characterAroundInfo;  // 0x2C0(0x50)

	void Multicast_DisplayNotification(struct FString SectorName, float FallDuration); // Function ConZ.CargoDropEvent.Multicast_DisplayNotification
}; 



// Class ConZ.HeatSourceItemComponent
// Size: 0xE0(Inherited: 0xC8) 
struct UHeatSourceItemComponent : public UItemComponent
{
	struct TArray<struct UFueledHeatSource*> HeatSources;  // 0xC8(0x10)
	char pad_216[8];  // 0xD8(0x8)

}; 



// Class ConZ.AdminCommand_DemolitionSkillDebug
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_DemolitionSkillDebug : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_ListPlayers
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ListPlayers : public UAdminCommand
{

}; 



// Class ConZ.PrisonerBodyConditionUIData_AcuteRadiationSyndrome
// Size: 0x1A8(Inherited: 0x1A0) 
struct UPrisonerBodyConditionUIData_AcuteRadiationSyndrome : public UPrisonerBodyConditionUIData
{
	char pad_416[8];  // 0x1A0(0x8)

}; 



// Class ConZ.AdminCommand_KnockoutPrisoner
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_KnockoutPrisoner : public UAdminCommand
{

}; 



// Class ConZ.BuriableChestItemComponent
// Size: 0x1A0(Inherited: 0x190) 
struct UBuriableChestItemComponent : public UBuriableItemComponent
{
	int64_t _decayInDaysWhenBuried;  // 0x190(0x8)
	char pad_408[8];  // 0x198(0x8)

}; 



// Class ConZ.VicinityPanel3
// Size: 0x540(Inherited: 0x260) 
struct UVicinityPanel3 : public UUserWidget
{
	char pad_608_1 : 7;  // 0x260(0x1)
	bool _isTradingThingy : 1;  // 0x260(0x1)
	char pad_609[7];  // 0x261(0x7)
	struct UWrapBox* _searchedItemsBox;  // 0x268(0x8)
	struct UWrapBox* _vicinityBox;  // 0x270(0x8)
	struct UHorizontalBox* _vicinityContainersBox;  // 0x278(0x8)
	struct UHorizontalBox* _tradingBox;  // 0x280(0x8)
	struct UOverlay* _tradingBoxOverlay;  // 0x288(0x8)
	struct UBadAdjustableSeparator* _adjustableSeparator;  // 0x290(0x8)
	struct TMap<struct UObject*, struct UWidget*> _searchedItems;  // 0x298(0x50)
	struct TMap<struct UObject*, struct UWidget*> _vicinityItems;  // 0x2E8(0x50)
	struct TMap<struct UObject*, struct UWidget*> _vicinityContainers;  // 0x338(0x50)
	struct TMap<struct UObject*, struct UWidget*> _tradingItems;  // 0x388(0x50)
	char pad_984[160];  // 0x3D8(0xA0)
	struct TMap<struct UCheckBox*, struct FClassesArray> _filterCheckboxes;  // 0x478(0x50)
	struct TMap<struct FName, struct FClassesArray> _filterCheckboxesNames;  // 0x4C8(0x50)
	struct FMargin _vicinityContainersPadding;  // 0x518(0x10)
	char pad_1320[24];  // 0x528(0x18)

	void OnVicinityContainerInitialized(struct TScriptInterface<IInventoryNode>& Item, struct UItemWidget2* Widget); // Function ConZ.VicinityPanel3.OnVicinityContainerInitialized
	void OnVicinityContainerClosed(struct UItemWidget2* Widget); // Function ConZ.VicinityPanel3.OnVicinityContainerClosed
	void OnItemActorDestroyed(struct AActor* Actor); // Function ConZ.VicinityPanel3.OnItemActorDestroyed
	void OnCheckBoxCheckedChanged(bool checked); // Function ConZ.VicinityPanel3.OnCheckBoxCheckedChanged
}; 



// Class ConZ.AdminCommand_DestroyAllItemsWithinRadius
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_DestroyAllItemsWithinRadius : public UAdminCommand
{

}; 



// Class ConZ.MetabolismCurrentStatLight
// Size: 0x2B8(Inherited: 0x260) 
struct UMetabolismCurrentStatLight : public UUserWidget
{
	struct FText Title;  // 0x260(0x18)
	struct UImage* _valueBackground;  // 0x278(0x8)
	struct UTextBlock* _title;  // 0x280(0x8)
	struct URichTextBlock* _value;  // 0x288(0x8)
	struct FDataTableRowHandle _normalBackgroundColor;  // 0x290(0x10)
	struct FDataTableRowHandle _alertedBackgroundColor;  // 0x2A0(0x10)
	char pad_688[8];  // 0x2B0(0x8)

}; 



// Class ConZ.FollowsMouseActor
// Size: 0x228(Inherited: 0x220) 
struct AFollowsMouseActor : public AActor
{
	float DistanceFromCamera;  // 0x220(0x4)
	char pad_548[4];  // 0x224(0x4)

}; 



// Class ConZ.AdminCommand_ListPrisonerBodyEffects
// Size: 0x90(Inherited: 0x88) 
struct UAdminCommand_ListPrisonerBodyEffects : public UAdminCommand
{
	UPrisonerBodyEffect* _bodyEffectClass;  // 0x88(0x8)

}; 



// Class ConZ.CookingCategoryButtonWidget
// Size: 0x300(Inherited: 0x260) 
struct UCookingCategoryButtonWidget : public UUserWidget
{
	char pad_608[16];  // 0x260(0x10)
	struct UTextBlock* _titleTextBlock;  // 0x270(0x8)
	struct UImage* _buttonImageWidget;  // 0x278(0x8)
	struct UImage* _overallBorder;  // 0x280(0x8)
	struct FGameplayTag _cookingCategory;  // 0x288(0x8)
	struct FGameplayTag _navigationTag;  // 0x290(0x8)
	struct FText _titleText;  // 0x298(0x18)
	struct TSoftObjectPtr<UTexture2D> _buttonImage;  // 0x2B0(0x28)
	struct FLinearColor _unHoveredBorderColor;  // 0x2D8(0x10)
	struct FLinearColor _hoveredBorderColor;  // 0x2E8(0x10)
	struct UAudibleButtonComponent* _audibleButtonComponent;  // 0x2F8(0x8)

}; 



// Class ConZ.AdminCommand_DestroyAllVehicles
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_DestroyAllVehicles : public UAdminCommand
{

}; 



// Class ConZ.Bedroll
// Size: 0xA20(Inherited: 0x9C0) 
struct ABedroll : public AClothesItem
{
	struct FDbIntegerId _occupiedUserProfileId;  // 0x9B8(0x8)
	char pad_2504_1 : 7;  // 0x9C8(0x1)
	bool _occupantOnline : 1;  // 0x9C0(0x1)
	struct UStaticMesh* _meshInHands;  // 0x9C8(0x8)
	struct UMaterialInterface* _materialInHands;  // 0x9D0(0x8)
	struct UStaticMesh* _meshOnGround;  // 0x9D8(0x8)
	struct UMaterialInterface* _materialOnGround;  // 0x9E0(0x8)
	float _maxRestHeight;  // 0x9E8(0x4)
	float _damageOverTimeWhenOccupied;  // 0x9EC(0x4)
	float _autoDestructTimeWhenOccupied;  // 0x9F0(0x4)
	char pad_2549[43];  // 0x9F5(0x2B)

	void VirtualizeTimerCallback(); // Function ConZ.Bedroll.VirtualizeTimerCallback
	void SetOccupantOfflineTimerCallback(); // Function ConZ.Bedroll.SetOccupantOfflineTimerCallback
	void OnUserLogout(struct FDbIntegerId UserId); // Function ConZ.Bedroll.OnUserLogout
	void OnUserLogin(struct FDbIntegerId UserId); // Function ConZ.Bedroll.OnUserLogin
	void OnOccupantRemoved(); // Function ConZ.Bedroll.OnOccupantRemoved
	void Multicast_SetVisuals(struct UStaticMesh* StaticMesh, struct UMaterialInterface* Material); // Function ConZ.Bedroll.Multicast_SetVisuals
}; 



// Class ConZ.ItemGroup
// Size: 0x40(Inherited: 0x30) 
struct UItemGroup : public UDataAsset
{
	struct TArray<AItem*> Items;  // 0x30(0x10)

}; 



// Class ConZ.AdminCommand_EnableOrDisableServer
// Size: 0x90(Inherited: 0x88) 
struct UAdminCommand_EnableOrDisableServer : public UAdminCommand
{
	char pad_136_1 : 7;  // 0x88(0x1)
	bool _shouldEnableServer : 1;  // 0x88(0x1)
	char pad_137[7];  // 0x89(0x7)

}; 



// Class ConZ.AdminCommand_DestroyEntity
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_DestroyEntity : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_DistanceDebug
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_DistanceDebug : public UAdminCommand
{

}; 



// Class ConZ.BombDefusalMinigameBase
// Size: 0x4E8(Inherited: 0x2F8) 
struct ABombDefusalMinigameBase : public AMinigame
{
	struct UStaticMeshComponent* _timeBomb;  // 0x2F8(0x8)
	struct UStaticMesh* _splineConnectorMesh;  // 0x300(0x8)
	char pad_776[8];  // 0x308(0x8)
	struct FVector _wireButtonsSize;  // 0x310(0xC)
	char pad_796[4];  // 0x31C(0x4)
	struct USkeletalMeshComponent* _defusalTool;  // 0x320(0x8)
	float _toolMovementSensitivity;  // 0x328(0x4)
	struct FVector _minDefusingToolOffsetFromCenter;  // 0x32C(0xC)
	struct FVector _maxDefusingToolOffsetFromCenter;  // 0x338(0xC)
	char pad_836[4];  // 0x344(0x4)
	struct UMaterialInterface* _greenLedLight;  // 0x348(0x8)
	struct UMaterialInterface* _redLedLight;  // 0x350(0x8)
	struct UMaterialInterface* _yellowLedLight;  // 0x358(0x8)
	struct TArray<struct UStaticMeshComponent*> _ledLights;  // 0x360(0x10)
	struct UStaticMesh* _ledLightMesh;  // 0x370(0x8)
	char pad_888[8];  // 0x378(0x8)
	struct UStaticMesh* _wireMesh;  // 0x380(0x8)
	struct TArray<uint8_t > _wiresEndPositions;  // 0x388(0x10)
	struct TArray<struct FWireDescription> _wires;  // 0x398(0x10)
	char pad_936[16];  // 0x3A8(0x10)
	struct TArray<struct FSplineDescription> _splines;  // 0x3B8(0x10)
	char pad_968[16];  // 0x3C8(0x10)
	int32_t _numberOfWires;  // 0x3D8(0x4)
	int32_t _numberOfWirePoints;  // 0x3DC(0x4)
	int32_t _wiresShuffleIntensity;  // 0x3E0(0x4)
	int32_t _minWiresComplexity;  // 0x3E4(0x4)
	uint8_t  _wiresForwardAxis;  // 0x3E8(0x1)
	char pad_1001[3];  // 0x3E9(0x3)
	float _wiresStartSmoothness;  // 0x3EC(0x4)
	float _wiresEndSmoothness;  // 0x3F0(0x4)
	float _wiresMiddleSmoothness;  // 0x3F4(0x4)
	float _wiresSharpCornerSmoothness;  // 0x3F8(0x4)
	float _maxSegmentSize;  // 0x3FC(0x4)
	float _wirePointsSpreadPositive;  // 0x400(0x4)
	float _wirePointsSpreadNegative;  // 0x404(0x4)
	float _wireHeight;  // 0x408(0x4)
	float _wireVerticalSpacing;  // 0x40C(0x4)
	struct FVector _wirePointsOffset;  // 0x410(0xC)
	float _wireEndOffset;  // 0x41C(0x4)
	struct FVector _additionalWireEndPointOffset;  // 0x420(0xC)
	char pad_1068[4];  // 0x42C(0x4)
	struct UStaticMeshComponent* _cutWireSegment0;  // 0x430(0x8)
	struct UStaticMeshComponent* _cutWireSegment1;  // 0x438(0x8)
	struct UStaticMeshComponent* _cutWireSegment2;  // 0x440(0x8)
	struct UStaticMeshComponent* _cutWireSegment3;  // 0x448(0x8)
	struct UStaticMeshComponent* _cutWireSegment4;  // 0x450(0x8)
	struct UStaticMeshComponent* _cutWireSegment5;  // 0x458(0x8)
	struct UStaticMeshComponent* _uncutWireSegment0;  // 0x460(0x8)
	struct UStaticMeshComponent* _uncutWireSegment1;  // 0x468(0x8)
	struct UStaticMeshComponent* _uncutWireSegment2;  // 0x470(0x8)
	struct UStaticMeshComponent* _uncutWireSegment3;  // 0x478(0x8)
	struct UStaticMeshComponent* _uncutWireSegment4;  // 0x480(0x8)
	struct UStaticMeshComponent* _uncutWireSegment5;  // 0x488(0x8)
	struct UBoxComponent* _wireBox1;  // 0x490(0x8)
	struct UBoxComponent* _wireBox2;  // 0x498(0x8)
	struct UBoxComponent* _wireBox3;  // 0x4A0(0x8)
	struct UBoxComponent* _wireBox4;  // 0x4A8(0x8)
	struct UBoxComponent* _wireBox5;  // 0x4B0(0x8)
	struct UBoxComponent* _wireBox6;  // 0x4B8(0x8)
	struct UAkAudioEvent* _bombDefusalTimerStartSound;  // 0x4C0(0x8)
	struct UAkAudioEvent* _bombDefusalTimerStopSound;  // 0x4C8(0x8)
	struct UAkAudioEvent* _cutWireSound;  // 0x4D0(0x8)
	struct UAkAudioEvent* _bombDefusedSound;  // 0x4D8(0x8)
	char pad_1248[8];  // 0x4E0(0x8)

	void PlayCutWireMontage(); // Function ConZ.BombDefusalMinigameBase.PlayCutWireMontage
}; 



// Class ConZ.BowAttachmentSilencer
// Size: 0x940(Inherited: 0x930) 
struct ABowAttachmentSilencer : public AWeaponAttachment
{
	float _noiseMultiplier;  // 0x930(0x4)
	char pad_2356[12];  // 0x934(0xC)

}; 



// Class ConZ.AdminCommand_DumpAllSquadsInfoList
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_DumpAllSquadsInfoList : public UAdminCommand
{

}; 



// Class ConZ.VehicleServiceRegistry
// Size: 0x110(Inherited: 0xB0) 
struct UVehicleServiceRegistry : public UActorComponent
{
	struct TArray<struct FVehicleServiceData> _serviceData;  // 0xB0(0x10)
	char pad_192[80];  // 0xC0(0x50)

}; 



// Class ConZ.AdminCommand_ScheduleWorldEvent
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ScheduleWorldEvent : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_EnableHuntingClueDebugArrow
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_EnableHuntingClueDebugArrow : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_LogCharacterSpawner
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_LogCharacterSpawner : public UAdminCommand
{

}; 



// Class ConZ.CookingUtilityOverview
// Size: 0x498(Inherited: 0x260) 
struct UCookingUtilityOverview : public UUserWidget
{
	char pad_608[112];  // 0x260(0x70)
	UInteractiveIngredientWidget* _ingredientWidgetClass;  // 0x2D0(0x8)
	UCookingIngredientTooltip* _ingredientWidgetTooltipClass;  // 0x2D8(0x8)
	struct UTextBlock* _utilityTitleText;  // 0x2E0(0x8)
	struct URetainerBox* _recipeTitleTextEffectBox;  // 0x2E8(0x8)
	struct UTextBlock* _recipeTitleText;  // 0x2F0(0x8)
	struct UImage* _heatSourceWarningIcon;  // 0x2F8(0x8)
	struct USizeBox* _mainSwitcherSizeBox;  // 0x300(0x8)
	struct UWidgetSwitcher* _mainSwitcher;  // 0x308(0x8)
	struct UCookingAddRecipeButton* _addRecipeButton;  // 0x310(0x8)
	struct UIngredientsForRecipeWidget* _ingredientsForRecipeWidget;  // 0x318(0x8)
	struct UCookingProgressWidget* _cookingProgressWidget;  // 0x320(0x8)
	struct UCookingFinishedWidget* _cookingFinishedWidget;  // 0x328(0x8)
	struct UTextBlock* _slotOrdinalNumber;  // 0x330(0x8)
	struct UCookingControlButton* _cookAndTimerButton;  // 0x338(0x8)
	struct UCookingControlButton* _cancelButton;  // 0x340(0x8)
	struct USizeBox* _progressBarSizeBox;  // 0x348(0x8)
	struct FLinearColor _hasCookingTimeLeftColor;  // 0x350(0x10)
	struct FLinearColor _cookingTimeOverflowedColor;  // 0x360(0x10)
	struct FSlateBrush _heatSourceWarningIcon_MissingFuel;  // 0x370(0x88)
	struct FSlateBrush _heatSourceWarningIcon_NotTurnedOn;  // 0x3F8(0x88)
	char pad_1152[24];  // 0x480(0x18)

}; 



// Class ConZ.BankATMYesNoConfirmationScreen
// Size: 0x298(Inherited: 0x260) 
struct UBankATMYesNoConfirmationScreen : public UUserWidget
{
	char pad_608[32];  // 0x260(0x20)
	struct UTextBlock* _textDialog;  // 0x280(0x8)
	struct UBankATMPointingButton* _btnCancel;  // 0x288(0x8)
	struct UBankATMPointingButton* _btnYes;  // 0x290(0x8)

}; 



// Class ConZ.CommonCraftingRecipe
// Size: 0x88(Inherited: 0x88) 
struct UCommonCraftingRecipe : public UBaseCraftingRecipe
{

}; 



// Class ConZ.AdminCommand_EquipParachute
// Size: 0x90(Inherited: 0x88) 
struct UAdminCommand_EquipParachute : public UAdminCommand
{
	AClothesItem* _parachuteClass;  // 0x88(0x8)

}; 



// Class ConZ.AdminCommand_SetAirplaneMaxVelocity
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetAirplaneMaxVelocity : public UAdminCommand
{

}; 



// Class ConZ.Inv2021_InventoryPosition2DObject
// Size: 0x40(Inherited: 0x28) 
struct UInv2021_InventoryPosition2DObject : public UInv2021_InventoryPositionObject
{
	char pad_40[24];  // 0x28(0x18)

}; 



// Class ConZ.AdminCommand_SetMountedVehicleProperty
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetMountedVehicleProperty : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_ExecuteConsoleCommand
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ExecuteConsoleCommand : public UAdminCommand
{

}; 



// Class ConZ.ValueProviderInteger
// Size: 0x28(Inherited: 0x28) 
struct UValueProviderInteger : public UInterface
{

}; 



// Class ConZ.AdminCommand_ExecutePrisonerBodyConditionInteraction
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ExecutePrisonerBodyConditionInteraction : public UAdminCommand
{

}; 



// Class ConZ.PrisonerActionDestroyGardenDescription
// Size: 0x50(Inherited: 0x38) 
struct UPrisonerActionDestroyGardenDescription : public UPrisonerActionDescription
{
	char pad_56[24];  // 0x38(0x18)

}; 



// Class ConZ.DecontaminateData
// Size: 0x48(Inherited: 0x30) 
struct UDecontaminateData : public UDataAsset
{
	USkill* SkillToIncrease;  // 0x30(0x8)
	float SkillIncreaseAmount;  // 0x38(0x4)
	float SkillIncreaseModifier;  // 0x3C(0x4)
	float RadiationDecontaminationAmountPerSoapUse;  // 0x40(0x4)
	char pad_68[4];  // 0x44(0x4)

}; 



// Class ConZ.PrisonerBodyCondition_BleedingInjury
// Size: 0x530(Inherited: 0xC0) 
struct UPrisonerBodyCondition_BleedingInjury : public UPrisonerBodyCondition_Injury
{
	char pad_192[8];  // 0xC0(0x8)
	struct FRuntimeFloatCurve _selfStabilizationDurationVsSeverity;  // 0xC8(0x88)
	struct FRuntimeFloatCurve _stabilizationDurationVsBloodLossRatio;  // 0x150(0x88)
	struct FRuntimeFloatCurve _destabilizationActionDifficultyRatioVsSeverity;  // 0x1D8(0x88)
	UNotificationDescription* _destabilizationNotification;  // 0x260(0x8)
	float _destabilizationNotificationCooldown;  // 0x268(0x4)
	char pad_620[4];  // 0x26C(0x4)
	struct FRuntimeFloatCurve _recoveryDurationVsBloodLossRatio;  // 0x270(0x88)
	UPrisonerBodySymptom_Bleeding* _bleedingSymptomClass;  // 0x2F8(0x8)
	struct UPrisonerBodySymptomCause_Bleeding* _bleedingSymptomCause;  // 0x300(0x8)
	UPrisonerBodySymptom_Pain* _painSymptomClass;  // 0x308(0x8)
	struct UPrisonerBodySymptomCause_Pain* _painSymptomCause;  // 0x310(0x8)
	struct FRuntimeFloatCurve _painIntensityVsSeverity;  // 0x318(0x88)
	float _limpingIntensityPerLegsDamageRatio;  // 0x3A0(0x4)
	float _legsBleedingSeverityThresholdToLimp;  // 0x3A4(0x4)
	struct UPrisonerBodyMuscleGroupToInfectionClassMappings* _infectionClassMappings;  // 0x3A8(0x8)
	struct UPrisonerBodyCondition_Infection* _infection;  // 0x3B0(0x8)
	float _contaminationIncreaseBaseRate;  // 0x3B8(0x4)
	char pad_956[4];  // 0x3BC(0x4)
	struct FRuntimeFloatCurve _contaminationIncreaseRateMultiplierVsSeverity;  // 0x3C0(0x88)
	struct FRuntimeFloatCurve _contaminationIncreaseRateMultiplierVsAsepsis;  // 0x448(0x88)
	float _disinfectantContaminationDecreaseRate;  // 0x4D0(0x4)
	float _disinfectantEvaporationRate;  // 0x4D4(0x4)
	uint8_t  _muscleGroup;  // 0x4D8(0x1)
	char pad_1241[3];  // 0x4D9(0x3)
	float _damage;  // 0x4DC(0x4)
	float _damageAtRecoveryStart;  // 0x4E0(0x4)
	float _bloodLoss;  // 0x4E4(0x4)
	float _bloodLossAtRecoveryStart;  // 0x4E8(0x4)
	float _bloodLossRate;  // 0x4EC(0x4)
	float _bloodLossRateAtRecoveryStart;  // 0x4F0(0x4)
	float _selfStabilizationBleedingSuppression;  // 0x4F4(0x4)
	float _stabilizationDurationReductionFromPhysician;  // 0x4F8(0x4)
	char pad_1276[4];  // 0x4FC(0x4)
	struct FBandages _bandages;  // 0x500(0x18)
	float _disinfectantAmount;  // 0x518(0x4)
	uint8_t  _state;  // 0x51C(0x1)
	char pad_1309[11];  // 0x51D(0xB)
	float _timerElapsedTime;  // 0x528(0x4)
	float _timerDuration;  // 0x52C(0x4)

}; 



// Class ConZ.AdminCommand_Location
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_Location : public UAdminCommand
{

}; 



// Class ConZ.PrisonerActionTuneBowDescription
// Size: 0x48(Inherited: 0x38) 
struct UPrisonerActionTuneBowDescription : public UPrisonerActionDescription
{
	char pad_56[16];  // 0x38(0x10)

}; 



// Class ConZ.MissionScheduler
// Size: 0x3E0(Inherited: 0x220) 
struct AMissionScheduler : public AActor
{
	char pad_544_1 : 7;  // 0x220(0x1)
	bool _missionSchedulerEnabled : 1;  // 0x220(0x1)
	char pad_545[7];  // 0x221(0x7)
	struct TMap<AMission*, struct FMissionData> _availableMainStoryMissions;  // 0x228(0x50)
	struct TMap<AMission*, struct FMissionData> _availableSideStoryMissions;  // 0x278(0x50)
	struct TMap<AMission*, struct FMissionData> _availableTutorialMissions;  // 0x2C8(0x50)
	float _missionQueuingInterval;  // 0x318(0x4)
	char pad_796[196];  // 0x31C(0xC4)

	void OnLocationEnter(struct AActor* OverlapedActor, struct AActor* OtherActor); // Function ConZ.MissionScheduler.OnLocationEnter
}; 



// Class ConZ.WeaponDamageStatics
// Size: 0x28(Inherited: 0x28) 
struct UWeaponDamageStatics : public UBlueprintFunctionLibrary
{

}; 



// Class ConZ.AdminCommand_ListMutedPlayers
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ListMutedPlayers : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_KickPlayer
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_KickPlayer : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_Teleport
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_Teleport : public UAdminCommand
{

}; 



// Class ConZ.AdminCommandArgumentDataType_Transform
// Size: 0x140(Inherited: 0x108) 
struct UAdminCommandArgumentDataType_Transform : public UAdminCommandArgumentDataTypeBase
{
	char pad_264[8];  // 0x108(0x8)
	struct FTransform _defaultValue;  // 0x110(0x30)

}; 



// Class ConZ.CustomZoneSettingsConfigurationsList
// Size: 0x2C0(Inherited: 0x260) 
struct UCustomZoneSettingsConfigurationsList : public UUserWidget
{
	char pad_608[48];  // 0x260(0x30)
	struct UTextBlock* _configurationCountDisplay;  // 0x290(0x8)
	struct UButton* _buttonAddConfiguration;  // 0x298(0x8)
	struct UScrollBox* _scrollBox;  // 0x2A0(0x8)
	UCustomZoneSettingsConfiguration* _configurationWidgetClass;  // 0x2A8(0x8)
	char pad_688[16];  // 0x2B0(0x10)

	void UpdateConfiguration(int32_t ConfigurationIndex, struct FCustomZoneConfiguration& configuration); // Function ConZ.CustomZoneSettingsConfigurationsList.UpdateConfiguration
	void RemoveConfiguration(int32_t ConfigurationIndex); // Function ConZ.CustomZoneSettingsConfigurationsList.RemoveConfiguration
	void AddConfiguration(struct FCustomZoneConfiguration& configuration); // Function ConZ.CustomZoneSettingsConfigurationsList.AddConfiguration
}; 



// Class ConZ.VehicleMarkersData
// Size: 0x38(Inherited: 0x28) 
struct UVehicleMarkersData : public UObject
{
	char pad_40[16];  // 0x28(0x10)

}; 



// Class ConZ.MotorcycleSkill
// Size: 0x5D8(Inherited: 0x5D8) 
struct UMotorcycleSkill : public UDrivingSkill
{

}; 



// Class ConZ.AdminCommand_FindSquadMember
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_FindSquadMember : public UAdminCommand
{

}; 



// Class ConZ.TabButton
// Size: 0xC58(Inherited: 0x260) 
struct UTabButton : public UUserWidget
{
	char pad_608[96];  // 0x260(0x60)
	char pad_704_1 : 7;  // 0x2C0(0x1)
	bool PreviewSelectedState : 1;  // 0x2C0(0x1)
	char pad_705[7];  // 0x2C1(0x7)
	struct UButton* _button;  // 0x2C8(0x8)
	struct UTextBlock* _text;  // 0x2D0(0x8)
	struct USizeBox* _sizeBox;  // 0x2D8(0x8)
	struct FText _initialTitle;  // 0x2E0(0x18)
	struct FTabButtonStyle _selectedButtonStyle;  // 0x2F8(0x288)
	struct FTabButtonStyle _selectedUnfocusedButtonStyle;  // 0x580(0x288)
	struct FTabButtonStyle _deselectedButtonStyle;  // 0x808(0x288)
	struct FTabTextStyle _selectedTextStyle;  // 0xA90(0x98)
	struct FTabTextStyle _selectedUnfocusedTextStyle;  // 0xB28(0x98)
	struct FTabTextStyle _deselectedTextStyle;  // 0xBC0(0x98)

	void OnClick(); // Function ConZ.TabButton.OnClick
}; 



// Class ConZ.AdminCommand_GetUserIDByRank
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_GetUserIDByRank : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_SpawnItem
// Size: 0x150(Inherited: 0x108) 
struct UAdminCommand_SpawnItem : public UAdminCommand_SpawnPrimaryActorAsset
{
	char pad_264[72];  // 0x108(0x48)

}; 



// Class ConZ.AdminCommand_LeaveCorpse
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_LeaveCorpse : public UAdminCommand
{

}; 



// Class ConZ.DoubleSlidingDoorStatic
// Size: 0x520(Inherited: 0x4F0) 
struct ADoubleSlidingDoorStatic : public ADoubleDoor
{
	struct USceneComponent* ClosedPositionComponent0;  // 0x4F0(0x8)
	struct USceneComponent* ClosedPositionComponent1;  // 0x4F8(0x8)
	struct USceneComponent* OpenPositionComponent0;  // 0x500(0x8)
	struct USceneComponent* OpenPositionComponent1;  // 0x508(0x8)
	char pad_1296[16];  // 0x510(0x10)

	void AddDoorPartInfo(struct FVector& cloasedPosition, struct FVector& OpenedPosition, struct USceneComponent* moveableComponent); // Function ConZ.DoubleSlidingDoorStatic.AddDoorPartInfo
}; 



// Class ConZ.HandPanel3
// Size: 0x2C8(Inherited: 0x260) 
struct UHandPanel3 : public UUserWidget
{
	struct UHandsHolstersWidget2* _handInventory;  // 0x260(0x8)
	struct UHandsHolstersWidget2* _holsterInventory0;  // 0x268(0x8)
	struct UHandsHolstersWidget2* _holsterInventory1;  // 0x270(0x8)
	struct UQuickAccessItemSwitcher3* _quickAccessItemSwitcher0;  // 0x278(0x8)
	struct UQuickAccessItemSwitcher3* _quickAccessItemSwitcher3;  // 0x280(0x8)
	struct UQuickAccessItemSwitcher3* _quickAccessItemSwitcher4;  // 0x288(0x8)
	struct UQuickAccessItemSwitcher3* _quickAccessItemSwitcher5;  // 0x290(0x8)
	struct UQuickAccessItemSwitcher3* _quickAccessItemSwitcher6;  // 0x298(0x8)
	struct UQuickAccessItemSwitcher3* _quickAccessItemSwitcher7;  // 0x2A0(0x8)
	struct UQuickAccessItemSwitcher3* _quickAccessItemSwitcher8;  // 0x2A8(0x8)
	struct UQuickAccessItemSwitcher3* _quickAccessItemSwitcher9;  // 0x2B0(0x8)
	struct USizeBox* _mainSizeBox;  // 0x2B8(0x8)
	float _mainPanelWidth;  // 0x2C0(0x4)
	char pad_708[4];  // 0x2C4(0x4)

}; 



// Class ConZ.DamageData
// Size: 0x70(Inherited: 0x30) 
struct UDamageData : public UDataAsset
{
	struct FGameplayTag DamageResponseTag;  // 0x30(0x8)
	struct FGameplayTag GameEventTag;  // 0x38(0x8)
	struct FGameplayTag IgnoreForStatsTag;  // 0x40(0x8)
	struct FGameplayTag CauseHeadExplosionTag;  // 0x48(0x8)
	struct FGameplayTag ApplyBleedingOnlyTag;  // 0x50(0x8)
	struct UDataTable* WeaponDescTable;  // 0x58(0x8)
	struct TArray<struct FDamageTargetTypeMapping> DamageTargetTypeMap;  // 0x60(0x10)

}; 



// Class ConZ.ModularBaseBuildingSocketType
// Size: 0x28(Inherited: 0x28) 
struct UModularBaseBuildingSocketType : public UObject
{

}; 



// Class ConZ.AdminCommand_ListActiveHunts
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ListActiveHunts : public UAdminCommand
{

}; 



// Class ConZ.PrisonerActionChopBaseElementDescription
// Size: 0x98(Inherited: 0x38) 
struct UPrisonerActionChopBaseElementDescription : public UPrisonerActionDescription
{
	char pad_56[96];  // 0x38(0x60)

	struct UStaticMesh* GetBaseElementStaticMesh(); // Function ConZ.PrisonerActionChopBaseElementDescription.GetBaseElementStaticMesh
}; 



// Class ConZ.PrisonerActionRepairBaseElement
// Size: 0x118(Inherited: 0x118) 
struct UPrisonerActionRepairBaseElement : public UPrisonerActionRepair
{

}; 



// Class ConZ.ItemEntitySetup
// Size: 0x88(Inherited: 0x80) 
struct UItemEntitySetup : public UEntitySetup
{
	float MaxHealth;  // 0x80(0x4)
	float MaxHealthRatioAfterReachingBadQuality;  // 0x84(0x4)

}; 



// Class ConZ.AmmunitionBoxItem
// Size: 0x930(Inherited: 0x910) 
struct AAmmunitionBoxItem : public AItem
{
	AAmmunitionItem* AmmunitionItemClass;  // 0x910(0x8)
	AItem* ItemClassToSpawnWhenUnpacked;  // 0x918(0x8)
	int32_t MaxAmmoCount;  // 0x920(0x4)
	int32_t _ammoCount;  // 0x924(0x4)
	char pad_2344[8];  // 0x928(0x8)

	void OnRep_AmmoCount(); // Function ConZ.AmmunitionBoxItem.OnRep_AmmoCount
}; 



// Class ConZ.DialogueData
// Size: 0x80(Inherited: 0x30) 
struct UDialogueData : public UDataAsset
{
	struct TMap<uint8_t , struct FDialogInfoContainer> Dialogs;  // 0x30(0x50)

}; 



// Class ConZ.AdminCommand_ListItemsSpawnLocations
// Size: 0xC8(Inherited: 0x88) 
struct UAdminCommand_ListItemsSpawnLocations : public UAdminCommand
{
	struct FSearchItemSpawnerPresetArray _itemSpawnerPresets[2];  // 0x88(0x20)
	struct FSearchItemClassesArray _itemClasses[2];  // 0xA8(0x20)

}; 



// Class ConZ.AdminCommand_ListPrisonerForeignSubstances
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ListPrisonerForeignSubstances : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_SetDeluxeVersion
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetDeluxeVersion : public UAdminCommand
{

}; 



// Class ConZ.InventorySizeData
// Size: 0x28(Inherited: 0x28) 
struct UInventorySizeData : public UObject
{

}; 



// Class ConZ.PrisonerMovementSettings
// Size: 0x350(Inherited: 0x30) 
struct UPrisonerMovementSettings : public UDataAsset
{
	struct FPrisonerMovementSettings_Ground Ground;  // 0x30(0x16C)
	char pad_412[4];  // 0x19C(0x4)
	struct FPrisonerMovementSettings_Air Air;  // 0x1A0(0x140)
	struct FPrisonerMovementSettings_Water Water;  // 0x2E0(0x54)
	struct FFloatInterval RotationRateMultiplierVsPerformanceRatio;  // 0x334(0x8)
	struct FFloatInterval ClimbingSpeedMultiplierVsPerformanceRatio;  // 0x33C(0x8)
	struct FFloatInterval WindowClimbingSpeedMultiplierVsPerformanceRatio;  // 0x344(0x8)
	char pad_844[4];  // 0x34C(0x4)

}; 



// Class ConZ.WeaponRocketLauncher
// Size: 0x2FC0(Inherited: 0x2F60) 
struct AWeaponRocketLauncher : public AWeapon
{
	struct UWeaponState* ArmState;  // 0x2F58(0x8)
	struct UWeaponState* UnarmState;  // 0x2F60(0x8)
	struct UWeaponState* ArmedState;  // 0x2F68(0x8)
	UWeaponActionRocketLauncherArmSequence* _armActionSequenceClass;  // 0x2F70(0x8)
	UWeaponActionRocketLauncherUnarmSequence* _unarmActionSequenceClass;  // 0x2F78(0x8)
	char pad_12168_1 : 7;  // 0x2F88(0x1)
	bool _needsToBeArmedToFire : 1;  // 0x2F80(0x1)
	char pad_12169_1 : 7;  // 0x2F89(0x1)
	bool _spawnWithLoadedProjectile : 1;  // 0x2F81(0x1)
	struct FName _backMuzzlerSocketName;  // 0x2F84(0x8)
	struct UParticleSystem* _baskMuzzlePS;  // 0x2F90(0x8)
	struct UWeaponActionRocketLauncherArmSequence* _armActionSequence;  // 0x2F98(0x8)
	struct UWeaponActionRocketLauncherUnarmSequence* _unarmActionSequence;  // 0x2FA0(0x8)
	struct UWeaponState* _unarmedState;  // 0x2FA8(0x8)
	char pad_12210_1 : 7;  // 0x2FB2(0x1)
	bool _isArmed : 1;  // 0x2FB0(0x1)
	char pad_12211[13];  // 0x2FB3(0xD)

	void Server_Unarm(); // Function ConZ.WeaponRocketLauncher.Server_Unarm
	void Server_Arm(); // Function ConZ.WeaponRocketLauncher.Server_Arm
	void OnRep_IsArmed(); // Function ConZ.WeaponRocketLauncher.OnRep_IsArmed
	void OnRep_ActiveState(); // Function ConZ.WeaponRocketLauncher.OnRep_ActiveState
	void NetMulticast_Unarm(); // Function ConZ.WeaponRocketLauncher.NetMulticast_Unarm
	void NetMulticast_Arm(); // Function ConZ.WeaponRocketLauncher.NetMulticast_Arm
	bool IsArmed(); // Function ConZ.WeaponRocketLauncher.IsArmed
}; 



// Class ConZ.AdminCommand_ListPrimaryAssets
// Size: 0xE0(Inherited: 0x88) 
struct UAdminCommand_ListPrimaryAssets : public UAdminCommand
{
	struct FPrimaryAssetType _primaryAssetType;  // 0x88(0x8)
	struct TSet<struct FPrimaryAssetId> _primaryAssetsToExclude;  // 0x90(0x50)

}; 



// Class ConZ.BluntMeleeWeaponItemTag
// Size: 0x30(Inherited: 0x30) 
struct UBluntMeleeWeaponItemTag : public UBaseItemTag
{

}; 



// Class ConZ.AdminCommandArgumentCompletion
// Size: 0x38(Inherited: 0x28) 
struct UAdminCommandArgumentCompletion : public UObject
{
	char pad_40_1 : 7;  // 0x28(0x1)
	bool _canCompletionValuesBeCached : 1;  // 0x28(0x1)
	char pad_41[15];  // 0x29(0xF)

	void GetCompletionValues(struct TArray<struct FString>& Result); // Function ConZ.AdminCommandArgumentCompletion.GetCompletionValues
}; 



// Class ConZ.PrisonerForeignSubstance_Antibiotics
// Size: 0x140(Inherited: 0x140) 
struct UPrisonerForeignSubstance_Antibiotics : public UPrisonerForeignSubstance
{

}; 



// Class ConZ.AdminCommand_ListPrisonerBodyConditionInteractions
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ListPrisonerBodyConditionInteractions : public UAdminCommand
{

}; 



// Class ConZ.TraderItemCategoryButton
// Size: 0x328(Inherited: 0x260) 
struct UTraderItemCategoryButton : public UUserWidget
{
	char pad_608[24];  // 0x260(0x18)
	struct UButton* _button;  // 0x278(0x8)
	struct UImage* _icon;  // 0x280(0x8)
	struct UTextBlock* _title;  // 0x288(0x8)
	struct UOverlay* _insufficientFamePointsOverlay;  // 0x290(0x8)
	struct UTextBlock* _requiredFamePointsText;  // 0x298(0x8)
	struct FText _titleValue;  // 0x2A0(0x18)
	struct TSoftObjectPtr<UTexture> _iconTexture;  // 0x2B8(0x28)
	struct UTexture2D* _iconBlankTexture;  // 0x2E0(0x8)
	struct FVector2D _iconSize;  // 0x2E8(0x8)
	struct FGameplayTagContainer _tradeCategories;  // 0x2F0(0x20)
	struct UPanelWidget* _panelToOpenOnClick;  // 0x310(0x8)
	struct UAkAudioEvent* _soundOnHover;  // 0x318(0x8)
	struct UAkAudioEvent* _soundOnClick;  // 0x320(0x8)

	void UpdateIconTexture(); // Function ConZ.TraderItemCategoryButton.UpdateIconTexture
	void OnClick(); // Function ConZ.TraderItemCategoryButton.OnClick
}; 



// Class ConZ.PrisonerBodyConditionUIData_Sepsis
// Size: 0x1B8(Inherited: 0x1B0) 
struct UPrisonerBodyConditionUIData_Sepsis : public UPrisonerBodyConditionWithCausesUIData
{
	char pad_432[8];  // 0x1B0(0x8)

}; 



// Class ConZ.AnimNotify_PlaySoundOnOwner
// Size: 0x40(Inherited: 0x38) 
struct UAnimNotify_PlaySoundOnOwner : public UAnimNotify
{
	struct UAkAudioEvent* AudioEvent;  // 0x38(0x8)

}; 



// Class ConZ.AdminCommand_ListSilencedPlayers
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ListSilencedPlayers : public UAdminCommand
{

}; 



// Class ConZ.MedicalItemTag
// Size: 0x30(Inherited: 0x30) 
struct UMedicalItemTag : public UBaseItemTag
{

}; 



// Class ConZ.ClothesModifierItemTag
// Size: 0x30(Inherited: 0x30) 
struct UClothesModifierItemTag : public UBaseItemTag
{

}; 



// Class ConZ.AdminCommand_ListWeatherControllerOverrides
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ListWeatherControllerOverrides : public UAdminCommand
{

}; 



// Class ConZ.PrisonerActionChangeStanceDescription
// Size: 0x40(Inherited: 0x38) 
struct UPrisonerActionChangeStanceDescription : public UPrisonerActionDescription
{
	char pad_56[8];  // 0x38(0x8)

}; 



// Class ConZ.AdminCommand_ListSquadMembers
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ListSquadMembers : public UAdminCommand
{

}; 



// Class ConZ.BankAccountRegistryResponse
// Size: 0x30(Inherited: 0x28) 
struct UBankAccountRegistryResponse : public UPlayerRpcChannelServerResponse
{
	struct UBankAccountRegistryResponseDataObject* _payload;  // 0x28(0x8)

}; 



// Class ConZ.CustomZoneSettingsConfiguration
// Size: 0x310(Inherited: 0x260) 
struct UCustomZoneSettingsConfiguration : public UUserWidget
{
	char pad_608[48];  // 0x260(0x30)
	struct UBorder* _border;  // 0x290(0x8)
	struct UTextBlock* _configurationName;  // 0x298(0x8)
	struct UButton* _buttonRemove;  // 0x2A0(0x8)
	struct FLinearColor _unhighlightedColor;  // 0x2A8(0x10)
	struct FLinearColor _highlightedColor;  // 0x2B8(0x10)
	char pad_712[72];  // 0x2C8(0x48)

	void HandleRemoveButtonClicked(); // Function ConZ.CustomZoneSettingsConfiguration.HandleRemoveButtonClicked
}; 



// Class ConZ.AdminCommand_Loot
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_Loot : public UAdminCommand
{

}; 



// Class ConZ.AnimNotifyState_WeaponRevolverDrumRotationDirection
// Size: 0x38(Inherited: 0x30) 
struct UAnimNotifyState_WeaponRevolverDrumRotationDirection : public UAnimNotifyState
{
	uint8_t  RotationDirection;  // 0x30(0x1)
	char pad_49[7];  // 0x31(0x7)

}; 



// Class ConZ.BankAccountRegistryStatics
// Size: 0x28(Inherited: 0x28) 
struct UBankAccountRegistryStatics : public UBlueprintFunctionLibrary
{

}; 



// Class ConZ.AdminCommand_SetCurrencyBalanceToAllOnline
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetCurrencyBalanceToAllOnline : public UAdminCommand
{

}; 



// Class ConZ.PrisonerBodySymptomCause_Unconsciousness
// Size: 0x38(Inherited: 0x30) 
struct UPrisonerBodySymptomCause_Unconsciousness : public UPrisonerBodySymptomCause
{
	char pad_48[8];  // 0x30(0x8)

}; 



// Class ConZ.AdminCommand_MutePlayer
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_MutePlayer : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_PlacementDebug
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_PlacementDebug : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_PrintEntities
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_PrintEntities : public UAdminCommand
{

}; 



// Class ConZ.EffectOverTimeDealer
// Size: 0x270(Inherited: 0x220) 
struct AEffectOverTimeDealer : public AActor
{
	struct TArray<struct FDamageOverTimeUpdateGroup> _updateGroups;  // 0x220(0x10)
	int32_t _actorLimitPerTick;  // 0x230(0x4)
	char pad_564[4];  // 0x234(0x4)
	float _timeDilation;  // 0x238(0x4)
	char pad_572[52];  // 0x23C(0x34)

}; 



// Class ConZ.CircularMenuSegmentWidget
// Size: 0x2E0(Inherited: 0x260) 
struct UCircularMenuSegmentWidget : public UUserWidget
{
	UGenericTooltip* _genericTooltipClass;  // 0x260(0x8)
	float _nonSelectableAlpha;  // 0x268(0x4)
	struct FLinearColor _highlightedColour;  // 0x26C(0x10)
	struct FLinearColor _unHighlightedColour;  // 0x27C(0x10)
	char pad_652[4];  // 0x28C(0x4)
	struct UCircularMenuSegmentInfo* _info;  // 0x290(0x8)
	struct UCircularMenuSegmentWidget* _parentSegmentWidget;  // 0x298(0x8)
	struct UImage* _segment;  // 0x2A0(0x8)
	struct UOverlay* _iconsOverlay;  // 0x2A8(0x8)
	struct USizeBox* _iconSizeBox;  // 0x2B0(0x8)
	struct UImage* _icon;  // 0x2B8(0x8)
	struct USizeBox* _overlayIconSizeBox;  // 0x2C0(0x8)
	struct UImage* _overlayIcon;  // 0x2C8(0x8)
	char pad_720[16];  // 0x2D0(0x10)

	void UpdateVisualParameters(int32_t numberOfSegments, int32_t Index, float Offset, float middleCutoffPercentage, float Size); // Function ConZ.CircularMenuSegmentWidget.UpdateVisualParameters
	bool IsTooltipEnabled(); // Function ConZ.CircularMenuSegmentWidget.IsTooltipEnabled
	struct FText GetTooltipText(); // Function ConZ.CircularMenuSegmentWidget.GetTooltipText
	struct UCircularMenuSegmentWidget* CreateFromInfo(struct UCircularMenuSegmentInfo* Info); // Function ConZ.CircularMenuSegmentWidget.CreateFromInfo
}; 



// Class ConZ.AdminCommand_ShouldShowOtherPlayerInfo
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ShouldShowOtherPlayerInfo : public UAdminCommand
{

}; 



// Class ConZ.InventoryContainerWidget2
// Size: 0x260(Inherited: 0x260) 
struct UInventoryContainerWidget2 : public UUserWidget
{

}; 



// Class ConZ.AdminCommand_RandomizePriceDeltas
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_RandomizePriceDeltas : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_ReloadCustomMapConfig
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ReloadCustomMapConfig : public UAdminCommand
{

}; 



// Class ConZ.PrisonerBodySymptomCause_Bleeding
// Size: 0x38(Inherited: 0x30) 
struct UPrisonerBodySymptomCause_Bleeding : public UPrisonerBodySymptomCause
{
	char pad_48[8];  // 0x30(0x8)

}; 



// Class ConZ.AdminCommand_RenameVehicle
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_RenameVehicle : public UAdminCommand
{

}; 



// Class ConZ.PrisonerActionCheckThermalSensor
// Size: 0x110(Inherited: 0x108) 
struct UPrisonerActionCheckThermalSensor : public UPrisonerAction
{
	char pad_264[8];  // 0x108(0x8)

}; 



// Class ConZ.WeaponStateRocketLauncherArm
// Size: 0x38(Inherited: 0x30) 
struct UWeaponStateRocketLauncherArm : public UWeaponState
{
	char pad_48[8];  // 0x30(0x8)

}; 



// Class ConZ.RunningSkill
// Size: 0x110(Inherited: 0xC8) 
struct URunningSkill : public UConstitutionSkill
{
	struct FRunningSkillParametersPerSkillLevel NoSkillParameters;  // 0xC8(0x10)
	struct FRunningSkillParametersPerSkillLevel BasicSkillParameters;  // 0xD8(0x10)
	struct FRunningSkillParametersPerSkillLevel MediumSkillParameters;  // 0xE8(0x10)
	struct FRunningSkillParametersPerSkillLevel AdvancedSkillParameters;  // 0xF8(0x10)
	char pad_264[8];  // 0x108(0x8)

}; 



// Class ConZ.AdminCommand_ResetAchievements
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ResetAchievements : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_VisualizeZombieLocation
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_VisualizeZombieLocation : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_ResetEconomy
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ResetEconomy : public UAdminCommand
{

}; 



// Class ConZ.PrisonerBodyConditionUIData
// Size: 0x1A0(Inherited: 0x90) 
struct UPrisonerBodyConditionUIData : public UPrisonerBodyConditionOrSymptomUIData
{
	char pad_144[272];  // 0x90(0x110)

}; 



// Class ConZ.SoundReducingItemTag
// Size: 0x30(Inherited: 0x30) 
struct USoundReducingItemTag : public UBaseItemTag
{

}; 



// Class ConZ.AdminCommand_SpawnRandomPrimaryActorAsset
// Size: 0x108(Inherited: 0x108) 
struct UAdminCommand_SpawnRandomPrimaryActorAsset : public UAdminCommand_SpawnPrimaryActorAsset
{

}; 



// Class ConZ.PostItemsSpawnedActions_SetAmmoAmount
// Size: 0x40(Inherited: 0x28) 
struct UPostItemsSpawnedActions_SetAmmoAmount : public UPostItemsSpawnedActions
{
	char pad_40_1 : 7;  // 0x28(0x1)
	bool _useAbsoluteAmount : 1;  // 0x28(0x1)
	char pad_41[3];  // 0x29(0x3)
	struct FInt32Interval _absoluteAmount;  // 0x2C(0x8)
	char pad_52_1 : 7;  // 0x34(0x1)
	bool _useAmountRatio : 1;  // 0x34(0x1)
	char pad_53[3];  // 0x35(0x3)
	struct FFloatInterval _amountRatio;  // 0x38(0x8)

}; 



// Class ConZ.AdminCommand_ResetMissionEnabled
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ResetMissionEnabled : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_ResetSquadInfo
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ResetSquadInfo : public UAdminCommand
{

}; 



// Class ConZ.PlayerRpcChannelServerRequest
// Size: 0x28(Inherited: 0x28) 
struct UPlayerRpcChannelServerRequest : public UObject
{

}; 



// Class ConZ.LargeAquaticAnimal
// Size: 0x800(Inherited: 0x7A0) 
struct ALargeAquaticAnimal : public AConZCharacter
{
	char pad_1952[24];  // 0x7A0(0x18)
	float _maxHealth;  // 0x7B8(0x4)
	float _health;  // 0x7BC(0x4)
	char pad_1984[16];  // 0x7C0(0x10)
	float _maxTimeWithoutRelevantPrisoners;  // 0x7D0(0x4)
	char pad_2004[4];  // 0x7D4(0x4)
	uint8_t  _behavior;  // 0x7D8(0x1)
	char pad_2009[7];  // 0x7D9(0x7)
	struct UAnimMontage* _deathAnimation;  // 0x7E0(0x8)
	float _deathSinkingSpeed;  // 0x7E8(0x4)
	float _capsuleRadiusAndHalfHeightOnDeath;  // 0x7EC(0x4)
	char pad_2032[16];  // 0x7F0(0x10)

	void OnRep_Health(float oldValue); // Function ConZ.LargeAquaticAnimal.OnRep_Health
	void OnRep_Behavior(uint8_t  oldValue); // Function ConZ.LargeAquaticAnimal.OnRep_Behavior
}; 



// Class ConZ.WindowFortificationsType
// Size: 0x80(Inherited: 0x30) 
struct UWindowFortificationsType : public UDataAsset
{
	struct TMap<UObject*, struct UStaticMesh*> MeshForFortification;  // 0x30(0x50)

}; 



// Class ConZ.PrisonerActionApplyFlagElementsExpansionDescription
// Size: 0x60(Inherited: 0x38) 
struct UPrisonerActionApplyFlagElementsExpansionDescription : public UPrisonerActionDescription
{
	char pad_56[40];  // 0x38(0x28)

}; 



// Class ConZ.ConZPlayerController
// Size: 0x9D8(Inherited: 0x570) 
struct AConZPlayerController : public APlayerController
{
	char pad_1392[16];  // 0x570(0x10)
	struct TArray<struct UPrimitiveComponent*> ComponentsToHide;  // 0x580(0x10)
	struct FMulticastInlineDelegate OnPrisonerSpawned;  // 0x590(0x10)
	char pad_1440[136];  // 0x5A0(0x88)
	struct UInteractionContainerUserWidget* CurrentInteractionContainerWidget;  // 0x628(0x8)
	char pad_1584_1 : 7;  // 0x630(0x1)
	bool IsTalkButtonPressed : 1;  // 0x630(0x1)
	char pad_1585[87];  // 0x631(0x57)
	struct UPlayerRpcChannel* _playerRpcChannel;  // 0x688(0x8)
	char pad_1680[64];  // 0x690(0x40)
	struct UUserProfile* _userProfile;  // 0x6D0(0x8)
	char pad_1752[16];  // 0x6D8(0x10)
	struct FString _userFakeName;  // 0x6E8(0x10)
	int64_t _bankAccountNumber;  // 0x6F8(0x8)
	struct APawn* _spawnedPawn;  // 0x700(0x8)
	char pad_1800[40];  // 0x708(0x28)
	struct APawn* _possessedPawn;  // 0x730(0x8)
	APrisoner* _prisonerClass;  // 0x738(0x8)
	char pad_1856[8];  // 0x740(0x8)
	struct UPawnNoiseEmitterComponent* _noiseEmitterComponent;  // 0x748(0x8)
	char pad_1872[16];  // 0x750(0x10)
	float _teleportWorldStreamingLocationChangeDelay;  // 0x760(0x4)
	float _teleportWorldStreamingTriggerLag;  // 0x764(0x4)
	char pad_1896[108];  // 0x768(0x6C)
	int32_t _repFamePoints;  // 0x7D4(0x4)
	char pad_2008[8];  // 0x7D8(0x8)
	int64_t _moneyBalanceRep;  // 0x7E0(0x8)
	int64_t _goldBalanceRep;  // 0x7E8(0x8)
	char pad_2032[144];  // 0x7F0(0x90)
	float _weatherHeightUpdatePeriod;  // 0x880(0x4)
	char pad_2180[4];  // 0x884(0x4)
	struct AAchievementsManagerClient* _achievementsManagerClient;  // 0x888(0x8)
	AAchievementsManagerClient* _achievementsManagerClientClass;  // 0x890(0x8)
	AMissionManager* _missionManagerClass;  // 0x898(0x8)
	struct AMissionManager* _missionManager;  // 0x8A0(0x8)
	AMissionDialogueManager* _missionDialogueManagerClass;  // 0x8A8(0x8)
	char pad_2224[8];  // 0x8B0(0x8)
	float _isReadyForPlayDelay;  // 0x8B8(0x4)
	char pad_2236[12];  // 0x8BC(0xC)
	float _reportPlayTimeInterval;  // 0x8C8(0x4)
	char pad_2252[4];  // 0x8CC(0x4)
	struct FDateTime _replicatedServerUtcNow;  // 0x8D0(0x8)
	char pad_2264[96];  // 0x8D8(0x60)
	struct UPathFollowingComponent* _pathFollowingComponent;  // 0x938(0x8)
	char pad_2368_1 : 7;  // 0x940(0x1)
	bool _forceSpawnAsDrone : 1;  // 0x940(0x1)
	char pad_2369_1 : 7;  // 0x941(0x1)
	bool _mpSpawnDroneAndPrisoner : 1;  // 0x941(0x1)
	char pad_2370[14];  // 0x942(0xE)
	APhotoModePawn* _photoModePawnClass;  // 0x950(0x8)
	char pad_2392[20];  // 0x958(0x14)
	float _refreshTimeForPawnLocationOnMap;  // 0x96C(0x4)
	char pad_2416[8];  // 0x970(0x8)
	struct UMaterialParameterCollection* _mainMPC;  // 0x978(0x8)
	char pad_2432[28];  // 0x980(0x1C)
	int32_t _numTrySpawnsForTimeout;  // 0x99C(0x4)
	char pad_2464[28];  // 0x9A0(0x1C)
	float _serverHeartbeatSendPeriod;  // 0x9BC(0x4)
	float _heartbeatTimeout;  // 0x9C0(0x4)
	char pad_2500[20];  // 0x9C4(0x14)

	void UpdateUserProfileDeletionMarkStatus(); // Function ConZ.ConZPlayerController.UpdateUserProfileDeletionMarkStatus
	void Teleport(struct FTeleportRequest& request); // Function ConZ.ConZPlayerController.Teleport
	void ShowWarningMessage(struct FString Message, float Duration, struct FLinearColor TextColor); // Function ConZ.ConZPlayerController.ShowWarningMessage
	void ShowLevelUpMessageFromClass(USkill* skillClass, uint8_t  skillLevel); // Function ConZ.ConZPlayerController.ShowLevelUpMessageFromClass
	void ShowLevelUpMessage(struct USkill* Skill, uint8_t  skillLevel); // Function ConZ.ConZPlayerController.ShowLevelUpMessage
	void ShowKillFeedNotificationOnClient(struct FString prefix, struct FString characterName, struct FString suffix, bool ping); // Function ConZ.ConZPlayerController.ShowKillFeedNotificationOnClient
	void ShowKillFeedMessage(struct FString prefix, struct FString characterName, struct FString suffix, bool ping); // Function ConZ.ConZPlayerController.ShowKillFeedMessage
	void SetTeleportWorldStreamingLocationChangeDelay(float Value); // Function ConZ.ConZPlayerController.SetTeleportWorldStreamingLocationChangeDelay
	void SetRespawnOptionTime(uint8_t  option, float Time, bool force); // Function ConZ.ConZPlayerController.SetRespawnOptionTime
	void SetGameEventCooldown(float cooldown); // Function ConZ.ConZPlayerController.SetGameEventCooldown
	void SetFamePoints(float Value); // Function ConZ.ConZPlayerController.SetFamePoints
	void SetCurrencyBalanceRep(uint8_t  CurrencyType, int64_t currencyBalance); // Function ConZ.ConZPlayerController.SetCurrencyBalanceRep
	void SetCommitSuicideOptionTime(float Time); // Function ConZ.ConZPlayerController.SetCommitSuicideOptionTime
	void Server_SetRefreshPawnLocationForMap(bool Value); // Function ConZ.ConZPlayerController.Server_SetRefreshPawnLocationForMap
	void Server_SelfKickFromGameSession(struct FString reason); // Function ConZ.ConZPlayerController.Server_SelfKickFromGameSession
	void Server_RequestSurvivalStats(uint32_t ID, struct FDbIntegerId UserProfileId); // Function ConZ.ConZPlayerController.Server_RequestSurvivalStats
	void Server_RequestSquadRankingData(uint32_t ID, struct FDbIntegerId squadId, int32_t Count); // Function ConZ.ConZPlayerController.Server_RequestSquadRankingData
	void Server_RequestSquadMemberInfo(uint32_t ID, struct FDbIntegerId squadId); // Function ConZ.ConZPlayerController.Server_RequestSquadMemberInfo
	void Server_RequestRespawnWaitTime(); // Function ConZ.ConZPlayerController.Server_RequestRespawnWaitTime
	void Server_RequestGameEventTeamChange(int32_t preferredTeam); // Function ConZ.ConZPlayerController.Server_RequestGameEventTeamChange
	void Server_RequestEventsRankingStats(uint32_t ID, struct FDbIntegerId UserProfileId, int32_t Count, uint8_t  orderByField, uint8_t  sortOrder); // Function ConZ.ConZPlayerController.Server_RequestEventsRankingStats
	void Server_ReportStartLeavingGame(); // Function ConZ.ConZPlayerController.Server_ReportStartLeavingGame
	void Server_ReportPlayPreparationsSucceeded(); // Function ConZ.ConZPlayerController.Server_ReportPlayPreparationsSucceeded
	void Server_ReportCancelLeavingGame(); // Function ConZ.ConZPlayerController.Server_ReportCancelLeavingGame
	void Server_ProcessCharacterModificationTransaction(int32_t transactionId, struct FCharacterTemplate CharacterTemplate); // Function ConZ.ConZPlayerController.Server_ProcessCharacterModificationTransaction
	void Server_MountedActorHasBegunPlay(struct AActor* Actor); // Function ConZ.ConZPlayerController.Server_MountedActorHasBegunPlay
	void Server_LeaveGameEvent(); // Function ConZ.ConZPlayerController.Server_LeaveGameEvent
	void Server_JoinGameEvent(struct AGameEventBase* gameEvent, int32_t preferredTeam); // Function ConZ.ConZPlayerController.Server_JoinGameEvent
	void Server_HeartbeatResponse(uint32_t code); // Function ConZ.ConZPlayerController.Server_HeartbeatResponse
	void Server_ExitPhotoMode(); // Function ConZ.ConZPlayerController.Server_ExitPhotoMode
	void Server_EnterPhotoMode(); // Function ConZ.ConZPlayerController.Server_EnterPhotoMode
	void Server_AllowCertainInventoryInteractions(); // Function ConZ.ConZPlayerController.Server_AllowCertainInventoryInteractions
	void SendHUDMessageToClient(struct FString Message, struct UAkAudioEvent* AudioEvent); // Function ConZ.ConZPlayerController.SendHUDMessageToClient
	void SendHUDMessageToAll(struct FString Message, struct UAkAudioEvent* AudioEvent); // Function ConZ.ConZPlayerController.SendHUDMessageToAll
	void SaveState(); // Function ConZ.ConZPlayerController.SaveState
	void RepossesOriginalPrisoner(); // Function ConZ.ConZPlayerController.RepossesOriginalPrisoner
	void RemoveServerFromFavorites(); // Function ConZ.ConZPlayerController.RemoveServerFromFavorites
	void RegisterRespawn(uint8_t  option); // Function ConZ.ConZPlayerController.RegisterRespawn
	void RegisterCommitSuicide(); // Function ConZ.ConZPlayerController.RegisterCommitSuicide
	void PrisonerSpawnedDelegate__DelegateSignature(struct APrisoner* spawnedPrisoner); // DelegateFunction ConZ.ConZPlayerController.PrisonerSpawnedDelegate__DelegateSignature
	void OnRep_UserFakeName(); // Function ConZ.ConZPlayerController.OnRep_UserFakeName
	void OnRep_ReplicatedServerUtcNow(); // Function ConZ.ConZPlayerController.OnRep_ReplicatedServerUtcNow
	void OnRep_PossessedPawn(); // Function ConZ.ConZPlayerController.OnRep_PossessedPawn
	void OnRep_MoneyBalance(); // Function ConZ.ConZPlayerController.OnRep_MoneyBalance
	void OnRep_FamePoints(); // Function ConZ.ConZPlayerController.OnRep_FamePoints
	void OnPhotoModeTransitionTimerElapsed(); // Function ConZ.ConZPlayerController.OnPhotoModeTransitionTimerElapsed
	void OnFadeOutFinished(); // Function ConZ.ConZPlayerController.OnFadeOutFinished
	void LoadState(); // Function ConZ.ConZPlayerController.LoadState
	void LeaveGameEvent(); // Function ConZ.ConZPlayerController.LeaveGameEvent
	void JoinGameEvent(struct AGameEventBase* gameEvent, int32_t preferredTeam); // Function ConZ.ConZPlayerController.JoinGameEvent
	bool IsUserAdmin(); // Function ConZ.ConZPlayerController.IsUserAdmin
	bool IsTeleportInProgress(); // Function ConZ.ConZPlayerController.IsTeleportInProgress
	bool IsPushToTalkPressed(); // Function ConZ.ConZPlayerController.IsPushToTalkPressed
	void InitializePathFollowingComponent(struct APrisoner* Prisoner); // Function ConZ.ConZPlayerController.InitializePathFollowingComponent
	struct FString GetUserProfileName(); // Function ConZ.ConZPlayerController.GetUserProfileName
	struct FDbIntegerId GetUserProfileId(); // Function ConZ.ConZPlayerController.GetUserProfileId
	struct UUserProfile* GetUserProfile(); // Function ConZ.ConZPlayerController.GetUserProfile
	struct FString GetUserName2(); // Function ConZ.ConZPlayerController.GetUserName2
	struct FString GetUserId(); // Function ConZ.ConZPlayerController.GetUserId
	float GetTeleportWorldStreamingLocationChangeDelay(); // Function ConZ.ConZPlayerController.GetTeleportWorldStreamingLocationChangeDelay
	struct FDbIntegerId GetServerUserProfileId(); // Function ConZ.ConZPlayerController.GetServerUserProfileId
	float GetRespawnWaitTime(); // Function ConZ.ConZPlayerController.GetRespawnWaitTime
	float GetRespawnOptionTimeLeft(uint8_t  option); // Function ConZ.ConZPlayerController.GetRespawnOptionTimeLeft
	float GetRespawnOptionTime(uint8_t  option); // Function ConZ.ConZPlayerController.GetRespawnOptionTime
	struct APrisoner* GetPrisoner(); // Function ConZ.ConZPlayerController.GetPrisoner
	struct UPlayerRpcChannel* GetPlayerRpcChannel(); // Function ConZ.ConZPlayerController.GetPlayerRpcChannel
	struct UPawnNoiseEmitterComponent* GetNoiseEmitterComponent(); // Function ConZ.ConZPlayerController.GetNoiseEmitterComponent
	struct AMissionDialogueManager* GetMissionDialogueManager(); // Function ConZ.ConZPlayerController.GetMissionDialogueManager
	float GetGameEventCooldown(); // Function ConZ.ConZPlayerController.GetGameEventCooldown
	int32_t GetFamePointsRounded(); // Function ConZ.ConZPlayerController.GetFamePointsRounded
	float GetFamePoints(); // Function ConZ.ConZPlayerController.GetFamePoints
	float GetFameMultiplier(); // Function ConZ.ConZPlayerController.GetFameMultiplier
	int32_t GetFameLevel(); // Function ConZ.ConZPlayerController.GetFameLevel
	struct AMissionDialogueManager* GetDialogueManager(); // Function ConZ.ConZPlayerController.GetDialogueManager
	struct FText GetCurrencyBalanceText(uint8_t  CurrencyType); // Function ConZ.ConZPlayerController.GetCurrencyBalanceText
	float GetCommitSuicideOptionTimeLeft(); // Function ConZ.ConZPlayerController.GetCommitSuicideOptionTimeLeft
	struct AConZCameraManager* GetCameraManager(); // Function ConZ.ConZPlayerController.GetCameraManager
	struct AAchievementsManagerClient* GetAchievementsManagerClient(); // Function ConZ.ConZPlayerController.GetAchievementsManagerClient
	void Crash(); // Function ConZ.ConZPlayerController.Crash
	int32_t ComputeFameLevel(float FamePoints); // Function ConZ.ConZPlayerController.ComputeFameLevel
	void Client_UpdateRespawnSettings(struct FRespawnParameters parameters); // Function ConZ.ConZPlayerController.Client_UpdateRespawnSettings
	void Client_TestPingLockStuff(float averageDelta, float averagePing, float counter); // Function ConZ.ConZPlayerController.Client_TestPingLockStuff
	void Client_SetRespawnWaitTime(float Seconds); // Function ConZ.ConZPlayerController.Client_SetRespawnWaitTime
	void Client_SetRespawnOptionTime(uint8_t  option, float Time); // Function ConZ.ConZPlayerController.Client_SetRespawnOptionTime
	void Client_SetIsServerSettingsAdmin(bool Value); // Function ConZ.ConZPlayerController.Client_SetIsServerSettingsAdmin
	void Client_SetIsAdmin(bool Value); // Function ConZ.ConZPlayerController.Client_SetIsAdmin
	void Client_SetGameEventCooldown(float cooldown); // Function ConZ.ConZPlayerController.Client_SetGameEventCooldown
	void Client_SetCommitSuicideOptionTime(float Time); // Function ConZ.ConZPlayerController.Client_SetCommitSuicideOptionTime
	void Client_SendPackedPlayerLocationsForMap(struct TArray<struct AConZPlayerState*> playerStates, struct TArray<uint32_t> packedMapLocations); // Function ConZ.ConZPlayerController.Client_SendPackedPlayerLocationsForMap
	void Client_SaveState(); // Function ConZ.ConZPlayerController.Client_SaveState
	void Client_ReceiveSurvivalStats(uint32_t ID, struct FSurvivalStats stats); // Function ConZ.ConZPlayerController.Client_ReceiveSurvivalStats
	void Client_ReceiveSquadRankingData(uint32_t ID, struct TArray<struct FString> names, struct TArray<struct FString> information, struct TArray<uint64_t> emblems, struct TArray<float> scores, int32_t squadRank, int32_t squadIndex); // Function ConZ.ConZPlayerController.Client_ReceiveSquadRankingData
	void Client_ReceiveSquadMemberInfo(uint32_t ID, struct TArray<struct FDbIntegerId> userProfileIds, struct TArray<struct FString> names, struct TArray<uint8_t > ranks, struct TArray<float> FamePoints, struct TArray<bool> online); // Function ConZ.ConZPlayerController.Client_ReceiveSquadMemberInfo
	void Client_ReceiveEventsRankingStats(uint32_t ID, struct TArray<struct FEventsRankingStatsItem> stats, int32_t playerRank); // Function ConZ.ConZPlayerController.Client_ReceiveEventsRankingStats
	void Client_ReceiveBytesFromStream(int32_t streamId, struct TArray<char> bytes); // Function ConZ.ConZPlayerController.Client_ReceiveBytesFromStream
	void Client_Login(struct FPlayerLoginInfo serverLoginInfo); // Function ConZ.ConZPlayerController.Client_Login
	void Client_InitializeCharacterModificationTransaction(int32_t transactionId, struct FTransform roomTransform, uint8_t  Type); // Function ConZ.ConZPlayerController.Client_InitializeCharacterModificationTransaction
	void Client_HeartbeatRequest(uint32_t code); // Function ConZ.ConZPlayerController.Client_HeartbeatRequest
	void Client_HasMountedActorBegunPlay(struct AActor* Actor); // Function ConZ.ConZPlayerController.Client_HasMountedActorBegunPlay
	void Client_EndByteStream(int32_t streamId); // Function ConZ.ConZPlayerController.Client_EndByteStream
	void Client_EnableRespawnOption(uint8_t  option); // Function ConZ.ConZPlayerController.Client_EnableRespawnOption
	void Client_CancelCharacterModificationTransaction(); // Function ConZ.ConZPlayerController.Client_CancelCharacterModificationTransaction
	void Client_BeginByteStream(int32_t streamId, uint8_t  streamType); // Function ConZ.ConZPlayerController.Client_BeginByteStream
	void Client_AllowCertainInventoryInteractions(); // Function ConZ.ConZPlayerController.Client_AllowCertainInventoryInteractions
	void ClearRespawnOptionTimers(); // Function ConZ.ConZPlayerController.ClearRespawnOptionTimers
	void CheckPhotoModeTransitionFailed(); // Function ConZ.ConZPlayerController.CheckPhotoModeTransitionFailed
	bool CanAddServerToFavorites(); // Function ConZ.ConZPlayerController.CanAddServerToFavorites
	void AddServerToFavorites(); // Function ConZ.ConZPlayerController.AddServerToFavorites
}; 



// Class ConZ.AdminCommand_SendNotification
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SendNotification : public UAdminCommand
{

}; 



// Class ConZ.ItemObstructionTestCapsuleComponent
// Size: 0x470(Inherited: 0x470) 
struct UItemObstructionTestCapsuleComponent : public UCapsuleComponent
{

}; 



// Class ConZ.HasLadderMarkersInterface
// Size: 0x28(Inherited: 0x28) 
struct UHasLadderMarkersInterface : public UInterface
{

	void GetLadderMarkers(struct TArray<struct FLadderMarker>& Result); // Function ConZ.HasLadderMarkersInterface.GetLadderMarkers
}; 



// Class ConZ.CookingCommonData
// Size: 0x190(Inherited: 0x30) 
struct UCookingCommonData : public UDataAsset
{
	struct UCurveFloat* MassReductionByPeakTemperature_Fiber;  // 0x30(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_Starch;  // 0x38(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_Sugars;  // 0x40(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_OtherCarbohydrates;  // 0x48(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_SaturatedFat;  // 0x50(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_OtherFats;  // 0x58(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_Protein;  // 0x60(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_VitaminA;  // 0x68(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_VitaminC;  // 0x70(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_VitaminD;  // 0x78(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_VitaminE;  // 0x80(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_VitaminK;  // 0x88(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_VitaminB1;  // 0x90(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_VitaminB2;  // 0x98(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_VitaminB3;  // 0xA0(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_VitaminB6;  // 0xA8(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_VitaminB9;  // 0xB0(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_VitaminB12;  // 0xB8(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_VitaminB5;  // 0xC0(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_VitaminB4;  // 0xC8(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_Calcium;  // 0xD0(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_Iron;  // 0xD8(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_Magnesium;  // 0xE0(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_Phosphorus;  // 0xE8(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_Potassium;  // 0xF0(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_Sodium;  // 0xF8(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_Zinc;  // 0x100(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_Copper;  // 0x108(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_Manganese;  // 0x110(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_Selenium;  // 0x118(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_Alcohol;  // 0x120(0x8)
	struct UCurveFloat* MassReductionByPeakTemperature_Water;  // 0x128(0x8)
	struct UCurveFloat* _cookQualityVsCookAmount;  // 0x130(0x8)
	struct UCurveFloat* _cookQualityVsCookTimeRelativeError_NoSkill;  // 0x138(0x8)
	struct UCurveFloat* _cookQualityVsCookTimeRelativeError_Basic;  // 0x140(0x8)
	struct UCurveFloat* _cookQualityVsCookTimeRelativeError_Medium;  // 0x148(0x8)
	struct UCurveFloat* _cookQualityVsCookTimeRelativeError_Advanced;  // 0x150(0x8)
	struct UCurveFloat* _cookQualityVsCookTimeRelativeError_AboveAdvanced;  // 0x158(0x8)
	float _recipeMemorizationChancePerSkillLevel;  // 0x160(0x4)
	float _recipeMemorizationChancePerCookQuality;  // 0x164(0x4)
	float _baseExperienceGainPerRecipe;  // 0x168(0x4)
	float _experienceGainPerRecipeCookTimeInMinutes;  // 0x16C(0x4)
	float _experienceGainPerRecipeCookTemperatureInDegrees;  // 0x170(0x4)
	float _experienceGainMultiplier_Ruined;  // 0x174(0x4)
	float _experienceGainMultiplier_Bad;  // 0x178(0x4)
	float _experienceGainMultiplier_Poor;  // 0x17C(0x4)
	float _experienceGainMultiplier_Good;  // 0x180(0x4)
	float _experienceGainMultiplier_Excellent;  // 0x184(0x4)
	float _experienceGainMultiplier_Perfect;  // 0x188(0x4)
	char pad_396[4];  // 0x18C(0x4)

}; 



// Class ConZ.AdminCommand_SetAchievementUnlocked
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetAchievementUnlocked : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_SetDecayTimeDilation
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetDecayTimeDilation : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_SetAllInventoryAccess
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetAllInventoryAccess : public UAdminCommand
{

}; 



// Class ConZ.CircularMenuSegmentGenericInfo
// Size: 0x90(Inherited: 0x80) 
struct UCircularMenuSegmentGenericInfo : public UCircularMenuSegmentInfo
{
	struct FDelegate Action;  // 0x80(0x10)

}; 



// Class ConZ.AdminCommand_SetCraftingSearch
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetCraftingSearch : public UAdminCommand
{

}; 



// Class ConZ.ChatSpamProtectionRules
// Size: 0xD8(Inherited: 0x30) 
struct UChatSpamProtectionRules : public UDataAsset
{
	float OffenceDuration;  // 0x30(0x4)
	int32_t MessageRepetitions;  // 0x34(0x4)
	struct TMap<uint8_t , struct FSpamSeverityConditions> _conditions;  // 0x38(0x50)
	struct TMap<uint8_t , struct FSpamConsequences> _consequences;  // 0x88(0x50)

}; 



// Class ConZ.RemoteKeyItemState
// Size: 0x100(Inherited: 0x100) 
struct URemoteKeyItemState : public UItemState
{

}; 



// Class ConZ.CharacterPainSoundsData
// Size: 0x38(Inherited: 0x30) 
struct UCharacterPainSoundsData : public UDataAsset
{
	struct UAkAudioEvent* AudioEvent;  // 0x30(0x8)

}; 



// Class ConZ.WeaponStateBowDraw
// Size: 0x50(Inherited: 0x30) 
struct UWeaponStateBowDraw : public UWeaponState
{
	char pad_48[32];  // 0x30(0x20)

}; 



// Class ConZ.AdminCommand_SetCurrencyBalance
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetCurrencyBalance : public UAdminCommand
{

}; 



// Class ConZ.PrisonerBodyConditionWithCausesUIData
// Size: 0x1B0(Inherited: 0x1A0) 
struct UPrisonerBodyConditionWithCausesUIData : public UPrisonerBodyConditionUIData
{
	struct TArray<struct UPrisonerBodyConditionCauseUIData*> _causes;  // 0x1A0(0x10)

}; 



// Class ConZ.AmmunitionBoneListAssetData
// Size: 0x38(Inherited: 0x28) 
struct UAmmunitionBoneListAssetData : public UAssetUserData
{
	struct TArray<struct FName> CartridgeBoneNames;  // 0x28(0x10)

}; 



// Class ConZ.AdminCommand_SetCurrencyBalanceToAll
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetCurrencyBalanceToAll : public UAdminCommand
{

}; 



// Class ConZ.TraderManagingComponent
// Size: 0x108(Inherited: 0xB0) 
struct UTraderManagingComponent : public UActorComponent
{
	char pad_176[32];  // 0xB0(0x20)
	float _pawnRelevancyRange;  // 0xD0(0x4)
	float _tradeOutpostsUpdateTime;  // 0xD4(0x4)
	char pad_216[4];  // 0xD8(0x4)
	float _outpostEconomyResetTimeHours;  // 0xDC(0x4)
	float _outpostPriceDeltasRandomizationTimeHours;  // 0xE0(0x4)
	float _tradeableRotationTimeIngameHoursMin;  // 0xE4(0x4)
	float _tradeableRotationTimeIngameHoursMax;  // 0xE8(0x4)
	float _tradeableRotationTimeOfDayMin;  // 0xEC(0x4)
	float _tradeableRotationTimeOfDayMax;  // 0xF0(0x4)
	char pad_244[20];  // 0xF4(0x14)

}; 



// Class ConZ.EntitySystemSettingsProvider
// Size: 0x28(Inherited: 0x28) 
struct UEntitySystemSettingsProvider : public UInterface
{

}; 



// Class ConZ.AdminCommand_SetFacialHairLength
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetFacialHairLength : public UAdminCommand
{

}; 



// Class ConZ.PrisonerBodySymptomCause_Burping
// Size: 0x38(Inherited: 0x38) 
struct UPrisonerBodySymptomCause_Burping : public UPrisonerBodySymptomCause_PeriodicSound
{

}; 



// Class ConZ.PrisonerActionTakeItemInHands
// Size: 0x118(Inherited: 0x108) 
struct UPrisonerActionTakeItemInHands : public UPrisonerAction
{
	char pad_264[16];  // 0x108(0x10)

}; 



// Class ConZ.AnimNotifyState_WeaponHideMagazine
// Size: 0x40(Inherited: 0x30) 
struct UAnimNotifyState_WeaponHideMagazine : public UAnimNotifyState
{
	char pad_48[16];  // 0x30(0x10)

}; 



// Class ConZ.ItemActionSequence
// Size: 0x88(Inherited: 0x50) 
struct UItemActionSequence : public UItemAction
{
	char pad_80_1 : 7;  // 0x50(0x1)
	bool _canBeCanceled : 1;  // 0x50(0x1)
	char pad_81[7];  // 0x51(0x7)
	struct FCharacterAndItemAnimation _animations;  // 0x58(0x10)
	char pad_104[32];  // 0x68(0x20)

	void StopAnimation(); // Function ConZ.ItemActionSequence.StopAnimation
	void SetNextAnimationSectionFromPrevious(struct FName& previousSection, struct FName& NextSection); // Function ConZ.ItemActionSequence.SetNextAnimationSectionFromPrevious
	void SetNextAnimationSection(struct FName& Section, bool allowLoop); // Function ConZ.ItemActionSequence.SetNextAnimationSection
	float PlayAnimation(struct ACharacter* Character, float PlayRate, struct FName& startSection, bool assignCallbacks); // Function ConZ.ItemActionSequence.PlayAnimation
	void OnMontageEnded(struct UAnimMontage* Montage, bool interrupted); // Function ConZ.ItemActionSequence.OnMontageEnded
	void OnMontageBlendingOutStarted(struct UAnimMontage* Montage, bool interrupted); // Function ConZ.ItemActionSequence.OnMontageBlendingOutStarted
	void OnAnimNotify(uint8_t  notifyType); // Function ConZ.ItemActionSequence.OnAnimNotify
	void JumpToAnimationSection(struct FName& Section); // Function ConZ.ItemActionSequence.JumpToAnimationSection
	bool IsPlayingAnimation(); // Function ConZ.ItemActionSequence.IsPlayingAnimation
	struct FCharacterActionAnimationDescription GetPlayingAnimations(); // Function ConZ.ItemActionSequence.GetPlayingAnimations
	int32_t GetNumberOfPendingNotifiesInCurrentSection(uint8_t  notifyType); // Function ConZ.ItemActionSequence.GetNumberOfPendingNotifiesInCurrentSection
	struct FCharacterAndItemAnimation GetAnimations(); // Function ConZ.ItemActionSequence.GetAnimations
	bool CanEverBeCanceled(); // Function ConZ.ItemActionSequence.CanEverBeCanceled
	void Cancel(bool Regular); // Function ConZ.ItemActionSequence.Cancel
	bool CanBeCanceled(); // Function ConZ.ItemActionSequence.CanBeCanceled
}; 



// Class ConZ.CuttingObjective
// Size: 0x360(Inherited: 0x330) 
struct ACuttingObjective : public ARequirementObjective
{
	struct TArray<struct TSoftClassPtr<UObject>> _targetMeshes;  // 0x330(0x10)
	char pad_832_1 : 7;  // 0x340(0x1)
	bool _specificItem : 1;  // 0x340(0x1)
	char pad_833[7];  // 0x341(0x7)
	AItem* _itemToFound;  // 0x348(0x8)
	int32_t _itemAmount;  // 0x350(0x4)
	char pad_852[12];  // 0x354(0xC)

}; 



// Class ConZ.AdminCommand_SetFakeName
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetFakeName : public UAdminCommand
{

}; 



// Class ConZ.RadioItem
// Size: 0x920(Inherited: 0x910) 
struct ARadioItem : public AItem
{
	struct URadioComponent* _radioComponent;  // 0x910(0x8)
	struct UBasicGameResourceContainerComponent* _resourceContainerComponent;  // 0x918(0x8)

	void OnComponentDeactivated(struct UActorComponent* Component); // Function ConZ.RadioItem.OnComponentDeactivated
	void OnComponentActivated(struct UActorComponent* Component, bool wasReset); // Function ConZ.RadioItem.OnComponentActivated
}; 



// Class ConZ.MedicationItem
// Size: 0x930(Inherited: 0x910) 
struct AMedicationItem : public AItem
{
	uint8_t  Usage;  // 0x910(0x1)
	uint8_t  Type;  // 0x911(0x1)
	char pad_2322[2];  // 0x912(0x2)
	float DailyDoses;  // 0x914(0x4)
	float TimeToAbsorbSeconds;  // 0x918(0x4)
	float EffectTimeMultiplier;  // 0x91C(0x4)
	float ReuseEffectTimeIncrease;  // 0x920(0x4)
	float MaxEffectTime;  // 0x924(0x4)
	uint8_t  RepeatedAbuseReaction;  // 0x928(0x1)
	char pad_2345[7];  // 0x929(0x7)

}; 



// Class ConZ.PrisonerBodyConditionOrSymptomSideEffectUIData_GroundMovementSpeedModifier
// Size: 0x30(Inherited: 0x30) 
struct UPrisonerBodyConditionOrSymptomSideEffectUIData_GroundMovementSpeedModifier : public UPrisonerBodyConditionOrSymptomSideEffectUIData_AbstractModifier
{

}; 



// Class ConZ.AdminCommand_SetFamePoints
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetFamePoints : public UAdminCommand
{

}; 



// Class ConZ.AnimNotify_WeaponActionNotify
// Size: 0x40(Inherited: 0x38) 
struct UAnimNotify_WeaponActionNotify : public UAnimNotify
{
	uint8_t  WeaponActionNotifyType;  // 0x38(0x1)
	char pad_57[7];  // 0x39(0x7)

}; 



// Class ConZ.InventoryItemData2D
// Size: 0x38(Inherited: 0x30) 
struct UInventoryItemData2D : public UInventoryItemData
{
	int32_t SizeX;  // 0x30(0x4)
	int32_t SizeY;  // 0x34(0x4)

}; 



// Class ConZ.AirplaneAnimInstance
// Size: 0x330(Inherited: 0x2C0) 
struct UAirplaneAnimInstance : public UAnimInstance
{
	char pad_704_1 : 7;  // 0x2C0(0x1)
	bool IsAnyoneMounted : 1;  // 0x2B8(0x1)
	float Speed;  // 0x2BC(0x4)
	float SpeedKph;  // 0x2C0(0x4)
	float PropellerRotationAngle;  // 0x2C4(0x4)
	float LeftAileronsAngle;  // 0x2C8(0x4)
	float RightAileronsAngle;  // 0x2CC(0x4)
	float ElevatorsAngle;  // 0x2D0(0x4)
	float RudderAngle;  // 0x2D4(0x4)
	char pad_733_1 : 7;  // 0x2DD(0x1)
	bool IsMounteeDriver : 1;  // 0x2D8(0x1)
	float clockMinuteRotation;  // 0x2DC(0x4)
	float clockHourRotation;  // 0x2E0(0x4)
	float altimeterTensRotation;  // 0x2E4(0x4)
	float altimeterHundredsRotation;  // 0x2E8(0x4)
	float altimeterThousandsRotation;  // 0x2EC(0x4)
	float airSpeedRotation;  // 0x2F0(0x4)
	float rpmRotation;  // 0x2F4(0x4)
	float verticalSpeedRotation;  // 0x2F8(0x4)
	float throttleLeverRotation;  // 0x2FC(0x4)
	float leftYawPedalRotation;  // 0x300(0x4)
	float rightYawPedalRotation;  // 0x304(0x4)
	struct FRotator stickRotator;  // 0x308(0xC)
	struct FRotator headingRotator;  // 0x314(0xC)
	char pad_802_1 : 7;  // 0x322(0x1)
	bool shouldHidePropellerBone : 1;  // 0x320(0x1)
	char pad_803[13];  // 0x323(0xD)

}; 



// Class ConZ.PlayerRpcChannelServerResponse
// Size: 0x28(Inherited: 0x28) 
struct UPlayerRpcChannelServerResponse : public UObject
{

}; 



// Class ConZ.AdminCommand_SetFamePointsToAllOnline
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetFamePointsToAllOnline : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_ShowFlagInfo
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ShowFlagInfo : public UAdminCommand
{

}; 



// Class ConZ.GameEventBase
// Size: 0x560(Inherited: 0x220) 
struct AGameEventBase : public AActor
{
	struct FText EventName;  // 0x220(0x18)
	UGameEventParticipantStats* ParticipantStatsClass;  // 0x238(0x8)
	UGameEventRoundInfoWidget* RoundInfoWidgetClass;  // 0x240(0x8)
	UGameEventTeamHeaderWidget* TeamHeaderWidgetClass;  // 0x248(0x8)
	UGameEventParticipantStatsWidget* StatWidgetClass;  // 0x250(0x8)
	UGameEventParticipantStatsWidget* MiniStatWidgetClass;  // 0x258(0x8)
	AGameEventTransport* TransportClass;  // 0x260(0x8)
	struct UAkAudioEvent* TimesUpAnnouncement;  // 0x268(0x8)
	struct UAkAudioEvent* BlueTeamWonRoundAnnouncement;  // 0x270(0x8)
	struct UAkAudioEvent* RedTeamWonRoundAnnouncement;  // 0x278(0x8)
	struct UAkAudioEvent* RoundDrawAnnouncement;  // 0x280(0x8)
	struct UAkAudioEvent* BlueTeamWonEventAnnouncement;  // 0x288(0x8)
	struct UAkAudioEvent* RedTeamWonEventAnnouncement;  // 0x290(0x8)
	struct UAkAudioEvent* EventDrawAnnouncement;  // 0x298(0x8)
	struct UAkAudioEvent* Time30sAnnouncement;  // 0x2A0(0x8)
	struct UAkAudioEvent* Time15sAnnouncement;  // 0x2A8(0x8)
	struct UAkAudioEvent* Time10sCountdownAnnouncement;  // 0x2B0(0x8)
	struct UAkAudioEvent* TensionMusicStart;  // 0x2B8(0x8)
	struct UAkAudioEvent* TensionMusicStop;  // 0x2C0(0x8)
	uint8_t  _state;  // 0x2C8(0x1)
	char pad_713[3];  // 0x2C9(0x3)
	int32_t _activeParticipantCount;  // 0x2CC(0x4)
	int32_t _numberOfTeams;  // 0x2D0(0x4)
	char pad_724[4];  // 0x2D4(0x4)
	struct TArray<int32_t> _teamMemberCount;  // 0x2D8(0x10)
	struct TArray<int32_t> _teamScores;  // 0x2E8(0x10)
	struct TArray<int32_t> _roundWinningTeam;  // 0x2F8(0x10)
	int32_t _round;  // 0x308(0x4)
	float _roundTimeLeft;  // 0x30C(0x4)
	float _cancelTimeLeft;  // 0x310(0x4)
	char pad_788[28];  // 0x314(0x1C)
	struct AGameEventLocationMarker* _marker;  // 0x330(0x8)
	struct AGameEventBorder* _border;  // 0x338(0x8)
	struct AGameEventManager* _manager;  // 0x340(0x8)
	struct TArray<struct FGameEventParticipantInfo> _participantInfo;  // 0x348(0x10)
	struct FGameEventParameters _parameters;  // 0x358(0x188)
	struct UGameEventCardWidget* _cardWidget;  // 0x4E0(0x8)
	struct UGameEventScoreboardWidget* _scoreboardWidget;  // 0x4E8(0x8)
	struct UGameEventScoreboardWidget* _miniScoreboardWidget;  // 0x4F0(0x8)
	struct TArray<int32_t> _rankings;  // 0x4F8(0x10)
	char pad_1288[32];  // 0x508(0x20)
	struct UAkComponent* _lastAnnouncement;  // 0x528(0x8)
	struct UAkComponent* _lastCountdownAnnouncement;  // 0x530(0x8)
	char pad_1336[40];  // 0x538(0x28)

	void UpdateTeamMemberCount(); // Function ConZ.GameEventBase.UpdateTeamMemberCount
	void UpdateRanking(int32_t Index); // Function ConZ.GameEventBase.UpdateRanking
	void SetTeamScore(int32_t TeamIndex, float Score); // Function ConZ.GameEventBase.SetTeamScore
	void SetParticipantTeam(struct APrisoner* Prisoner, int32_t TeamIndex); // Function ConZ.GameEventBase.SetParticipantTeam
	void SetParameters(struct FGameEventParameters& parameters); // Function ConZ.GameEventBase.SetParameters
	void SetNumberOfTeams(int32_t Value); // Function ConZ.GameEventBase.SetNumberOfTeams
	bool ScheduleEvent(); // Function ConZ.GameEventBase.ScheduleEvent
	void SavePrisonerState(struct APrisoner* Prisoner); // Function ConZ.GameEventBase.SavePrisonerState
	bool SameTeam(struct APrisoner* prisonerA, struct APrisoner* prisonerB); // Function ConZ.GameEventBase.SameTeam
	void ResetGameEventArea(); // Function ConZ.GameEventBase.ResetGameEventArea
	void RegisterParticipant(struct APrisoner* Prisoner, int32_t preferredTeam); // Function ConZ.GameEventBase.RegisterParticipant
	void PresentSpawnScreen(struct APrisoner* Prisoner); // Function ConZ.GameEventBase.PresentSpawnScreen
	void ParticipantEnter(struct APrisoner* Prisoner); // Function ConZ.GameEventBase.ParticipantEnter
	void OnRep_Rankings(); // Function ConZ.GameEventBase.OnRep_Rankings
	void OnRep_ParticipantInfo(); // Function ConZ.GameEventBase.OnRep_ParticipantInfo
	void NetMulticast_UpdateScoreboard(int32_t victimIndex, int32_t killerIndex, bool IsHeadShot); // Function ConZ.GameEventBase.NetMulticast_UpdateScoreboard
	void Multicast_StopMusic(struct UAkAudioEvent* StopAudioEvent); // Function ConZ.GameEventBase.Multicast_StopMusic
	void Multicast_StopCountdownAnnouncement(); // Function ConZ.GameEventBase.Multicast_StopCountdownAnnouncement
	void Multicast_ShowScoreboardForEveryone(); // Function ConZ.GameEventBase.Multicast_ShowScoreboardForEveryone
	void Multicast_ShowEventNotification(uint8_t  Type, struct FString auxString); // Function ConZ.GameEventBase.Multicast_ShowEventNotification
	void Multicast_PlayMusic(struct UAkAudioEvent* StartAudioEvent); // Function ConZ.GameEventBase.Multicast_PlayMusic
	void Multicast_PlayCountdownAnnouncement(struct UAkAudioEvent* Sound); // Function ConZ.GameEventBase.Multicast_PlayCountdownAnnouncement
	void Multicast_PlayAnnouncementToTeam(int32_t TeamIndex, struct UAkAudioEvent* Sound); // Function ConZ.GameEventBase.Multicast_PlayAnnouncementToTeam
	void Multicast_PlayAnnouncementToParticipant(struct APrisoner* Prisoner, struct UAkAudioEvent* Sound); // Function ConZ.GameEventBase.Multicast_PlayAnnouncementToParticipant
	void Multicast_PlayAnnouncementToAllParticipants(struct UAkAudioEvent* Sound); // Function ConZ.GameEventBase.Multicast_PlayAnnouncementToAllParticipants
	void Multicast_HideScoreboardForEveryone(); // Function ConZ.GameEventBase.Multicast_HideScoreboardForEveryone
	void KickParticipant(struct APrisoner* Prisoner); // Function ConZ.GameEventBase.KickParticipant
	bool IsTeamFull(int32_t TeamIndex); // Function ConZ.GameEventBase.IsTeamFull
	bool IsParticipating(struct APrisoner* Prisoner); // Function ConZ.GameEventBase.IsParticipating
	void InitEvent(struct AGameEventLocationMarker* marker, struct AGameEventManager* manager); // Function ConZ.GameEventBase.InitEvent
	struct TArray<int32_t> GetWinningTeamsPerRound(); // Function ConZ.GameEventBase.GetWinningTeamsPerRound
	float GetTeamScore(int32_t TeamIndex); // Function ConZ.GameEventBase.GetTeamScore
	int32_t GetTeamMemberCount(int32_t TeamIndex); // Function ConZ.GameEventBase.GetTeamMemberCount
	float GetStatusTime(); // Function ConZ.GameEventBase.GetStatusTime
	struct FRotator GetSpawnRotationForLocation(struct FVector Location); // Function ConZ.GameEventBase.GetSpawnRotationForLocation
	struct UGameEventScoreboardWidget* GetScoreboardWidget(); // Function ConZ.GameEventBase.GetScoreboardWidget
	float GetRoundTimeLeft(); // Function ConZ.GameEventBase.GetRoundTimeLeft
	void GetPossibleLoadout(struct APrisoner* Prisoner, struct TArray<struct UItemSelection*>& primaryWeapons, struct TArray<struct UItemSelection*>& secondaryWeapons, struct TArray<struct UItemSelection*>& tertiaryWeapons, struct TArray<struct UItemSelection*>& outfits, struct TArray<struct UItemSelection*>& support, struct TArray<struct UItemSelection*>& Gear); // Function ConZ.GameEventBase.GetPossibleLoadout
	int32_t GetParticipantTeam(struct APrisoner* Prisoner); // Function ConZ.GameEventBase.GetParticipantTeam
	struct FVector GetParticipantJoinLocation(struct APrisoner* Prisoner); // Function ConZ.GameEventBase.GetParticipantJoinLocation
	struct TArray<struct FGameEventParticipantInfo> GetParticipantInfo(); // Function ConZ.GameEventBase.GetParticipantInfo
	int32_t GetParticipantAtRank(int32_t Rank); // Function ConZ.GameEventBase.GetParticipantAtRank
	struct FGameEventParameters GetParameters(); // Function ConZ.GameEventBase.GetParameters
	int32_t GetNumberOfTeams(); // Function ConZ.GameEventBase.GetNumberOfTeams
	int32_t GetNumberOfParticipants(); // Function ConZ.GameEventBase.GetNumberOfParticipants
	int32_t GetNumberOfActiveParticipants(); // Function ConZ.GameEventBase.GetNumberOfActiveParticipants
	struct UGameEventScoreboardWidget* GetMiniScoreboardWidget(); // Function ConZ.GameEventBase.GetMiniScoreboardWidget
	float GetMaxDurationLeft(); // Function ConZ.GameEventBase.GetMaxDurationLeft
	struct AGameEventLocationMarker* GetMarker(); // Function ConZ.GameEventBase.GetMarker
	uint8_t  GetEventState(); // Function ConZ.GameEventBase.GetEventState
	struct FDbIntegerId GetDatabaseEventId(); // Function ConZ.GameEventBase.GetDatabaseEventId
	struct FDbIntegerId GetCurrentRoundDatabaseId(); // Function ConZ.GameEventBase.GetCurrentRoundDatabaseId
	int32_t GetCurrentRound(); // Function ConZ.GameEventBase.GetCurrentRound
	struct UGameEventCardWidget* GetCardWidget(); // Function ConZ.GameEventBase.GetCardWidget
	float GetCancelTimeLeft(); // Function ConZ.GameEventBase.GetCancelTimeLeft
	struct AGameEventBorder* GetBorder(); // Function ConZ.GameEventBase.GetBorder
	void ForceParticipantStatsRep(int32_t Index); // Function ConZ.GameEventBase.ForceParticipantStatsRep
	int32_t FindParticipantIndex(struct APrisoner* Prisoner); // Function ConZ.GameEventBase.FindParticipantIndex
	void EquipParticipantLoadout(struct APrisoner* Prisoner); // Function ConZ.GameEventBase.EquipParticipantLoadout
	int32_t DeclareWinningTeam(); // Function ConZ.GameEventBase.DeclareWinningTeam
	void ConvertScoreToFame(struct APrisoner* Prisoner); // Function ConZ.GameEventBase.ConvertScoreToFame
	void ClearTeamScores(); // Function ConZ.GameEventBase.ClearTeamScores
	struct FVector ChooseSpawnLocation(struct APrisoner* Prisoner); // Function ConZ.GameEventBase.ChooseSpawnLocation
	void CheckParticipatingPrisoners(); // Function ConZ.GameEventBase.CheckParticipatingPrisoners
	bool CanStart(); // Function ConZ.GameEventBase.CanStart
	bool CanSchedule(); // Function ConZ.GameEventBase.CanSchedule
	bool CanJoin(struct APrisoner* Prisoner, int32_t preferredTeam); // Function ConZ.GameEventBase.CanJoin
	void CancelEvent(bool force); // Function ConZ.GameEventBase.CancelEvent
	void CallInParticipant(struct APrisoner* Prisoner); // Function ConZ.GameEventBase.CallInParticipant
	void AwardParticipant(int32_t Index, struct FGameEventRewardPoints& reward); // Function ConZ.GameEventBase.AwardParticipant
	int32_t AssignParticipantTeam(struct APrisoner* Prisoner); // Function ConZ.GameEventBase.AssignParticipantTeam
}; 



// Class ConZ.ZombieImpersonatingItemTag
// Size: 0x30(Inherited: 0x30) 
struct UZombieImpersonatingItemTag : public UBaseItemTag
{

}; 



// Class ConZ.AdminCommand_TeleportToMe
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_TeleportToMe : public UAdminCommand
{

}; 



// Class ConZ.GrapplingWidget
// Size: 0x288(Inherited: 0x260) 
struct UGrapplingWidget : public UUserWidget
{
	struct UImage* _gameProgress;  // 0x260(0x8)
	struct UImage* _grapplingValue;  // 0x268(0x8)
	struct UTextBlock* _instructionText;  // 0x270(0x8)
	char pad_632[16];  // 0x278(0x10)

}; 



// Class ConZ.ItemTooltipPanelElement
// Size: 0x268(Inherited: 0x260) 
struct UItemTooltipPanelElement : public UUserWidget
{
	struct FName _elementName;  // 0x260(0x8)

	void OnTextDataChanged(struct FText& Value); // Function ConZ.ItemTooltipPanelElement.OnTextDataChanged
	void OnNumberDataChanged(float Value); // Function ConZ.ItemTooltipPanelElement.OnNumberDataChanged
}; 



// Class ConZ.InsertMagazineInsertCartridge
// Size: 0xA0(Inherited: 0x90) 
struct UInsertMagazineInsertCartridge : public UWeaponActionReloadSequence
{
	struct FName MontageEndSectionName;  // 0x90(0x8)
	char pad_152[8];  // 0x98(0x8)

}; 



// Class ConZ.AdminCommand_SetFarmingSimulationSpeed
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetFarmingSimulationSpeed : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_SetGodMode
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetGodMode : public UAdminCommand
{

}; 



// Class ConZ.PrisonerBodySimulationUIController
// Size: 0x1E8(Inherited: 0x28) 
struct UPrisonerBodySimulationUIController : public UObject
{
	char pad_40[448];  // 0x28(0x1C0)

}; 



// Class ConZ.PrisonerBodySymptomCause_Diarrhea
// Size: 0x40(Inherited: 0x40) 
struct UPrisonerBodySymptomCause_Diarrhea : public UPrisonerBodySymptomCause_PeriodicAffect
{

}; 



// Class ConZ.BrokenArrow
// Size: 0x910(Inherited: 0x910) 
struct ABrokenArrow : public AItem
{

}; 



// Class ConZ.CharacterSpawnerSpawnee
// Size: 0x28(Inherited: 0x28) 
struct UCharacterSpawnerSpawnee : public UInterface
{

	void SetupCharacter(struct FCharacterSpawneeInfo& spawneeInfo); // Function ConZ.CharacterSpawnerSpawnee.SetupCharacter
}; 



// Class ConZ.DropdownMenuTextureSelectionWidget
// Size: 0x2B0(Inherited: 0x2A8) 
struct UDropdownMenuTextureSelectionWidget : public UDropdownMenuSelectionWidget
{
	struct UTexture2D* Texture;  // 0x2A8(0x8)

}; 



// Class ConZ.AdminCommand_SetHairLength
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetHairLength : public UAdminCommand
{

}; 



// Class ConZ.HaircutAndMakeupService
// Size: 0x38(Inherited: 0x38) 
struct UHaircutAndMakeupService : public UTraderService
{

}; 



// Class ConZ.AdminCommand_SetHealthToItemInHands
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetHealthToItemInHands : public UAdminCommand
{

}; 



// Class ConZ.ArrayStatics
// Size: 0x28(Inherited: 0x28) 
struct UArrayStatics : public UBlueprintFunctionLibrary
{

}; 



// Class ConZ.WeaponAttachmentAutoCrossbowMagazine
// Size: 0x9E0(Inherited: 0x9E0) 
struct AWeaponAttachmentAutoCrossbowMagazine : public AWeaponAttachmentMagazine
{

	float GetFollowerBoneLocationOffset(); // Function ConZ.WeaponAttachmentAutoCrossbowMagazine.GetFollowerBoneLocationOffset
}; 



// Class ConZ.PrisonerActionRemovePlant
// Size: 0x110(Inherited: 0x108) 
struct UPrisonerActionRemovePlant : public UPrisonerAction
{
	char pad_264[8];  // 0x108(0x8)

}; 



// Class ConZ.PrisonerBodySymptomUIData_Pain
// Size: 0xC0(Inherited: 0xA8) 
struct UPrisonerBodySymptomUIData_Pain : public UPrisonerBodySymptomUIData
{
	char pad_168[24];  // 0xA8(0x18)

}; 



// Class ConZ.BreathingBarLungsWidget
// Size: 0x280(Inherited: 0x260) 
struct UBreathingBarLungsWidget : public UUserWidget
{
	char pad_608[8];  // 0x260(0x8)
	struct UImage* _lungs;  // 0x268(0x8)
	struct UImage* _lungsCritical;  // 0x270(0x8)
	struct UWidgetAnimation* _criticalStateAnimation;  // 0x278(0x8)

}; 



// Class ConZ.IgnitableExplosiveItemComponent
// Size: 0x208(Inherited: 0x1A0) 
struct UIgnitableExplosiveItemComponent : public UIgnitableItemComponent
{
	float _explosionDamage;  // 0x1A0(0x4)
	float _explosionOuterRadius;  // 0x1A4(0x4)
	float _explosionInnerRadius;  // 0x1A8(0x4)
	float _explosionFalloff;  // 0x1AC(0x4)
	float _explosionForce;  // 0x1B0(0x4)
	char pad_436[4];  // 0x1B4(0x4)
	struct FTargetTypeDamageMultiplier _targetTypeMultiplier;  // 0x1B8(0x10)
	char pad_456[8];  // 0x1C8(0x8)
	struct UParticleSystem* _explosionParticle;  // 0x1D0(0x8)
	struct UAkAudioEvent* _explosionAudioEvent;  // 0x1D8(0x8)
	UMatineeCameraShake* _explosionCameraShakeClass;  // 0x1E0(0x8)
	float _hearingDamageRadius;  // 0x1E8(0x4)
	float _activeNetCullDistanceSquaredMeters;  // 0x1EC(0x4)
	char pad_496_1 : 7;  // 0x1F0(0x1)
	bool _canExplodeUnderwater : 1;  // 0x1F0(0x1)
	char pad_497[23];  // 0x1F1(0x17)

	void Multicast_OnDetonate(struct FVector zeroBasedLocation); // Function ConZ.IgnitableExplosiveItemComponent.Multicast_OnDetonate
}; 



// Class ConZ.AdminCommand_SetInfiniteAmmo
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetInfiniteAmmo : public UAdminCommand
{

}; 



// Class ConZ.VehiclePowertrainComponent
// Size: 0xB0(Inherited: 0xB0) 
struct UVehiclePowertrainComponent : public UActorComponent
{

}; 



// Class ConZ.Inv2021_InventoryPositionClothesObject
// Size: 0x38(Inherited: 0x28) 
struct UInv2021_InventoryPositionClothesObject : public UInv2021_InventoryPositionObject
{
	char pad_40[16];  // 0x28(0x10)

}; 



// Class ConZ.ConZBaseElement
// Size: 0x328(Inherited: 0x220) 
struct AConZBaseElement : public AActor
{
	char pad_544[48];  // 0x220(0x30)
	USceneComponent* _weatherMaskComponentClass;  // 0x250(0x8)
	char pad_600[8];  // 0x258(0x8)
	struct TMap<struct UStaticMesh*, struct UIndexedHierarchicalInstancedStaticMeshComponent*> _elementClassMap;  // 0x260(0x50)
	char pad_688[120];  // 0x2B0(0x78)

}; 



// Class ConZ.ClearSearchButton
// Size: 0x280(Inherited: 0x260) 
struct UClearSearchButton : public UUserWidget
{
	char pad_608[16];  // 0x260(0x10)
	struct UWidgetAnimation* _hoverAnimation;  // 0x270(0x8)
	struct UWidgetAnimation* _clickAnimation;  // 0x278(0x8)

}; 



// Class ConZ.PrisonerBodySymptomUIData_Weakness
// Size: 0xB8(Inherited: 0xA8) 
struct UPrisonerBodySymptomUIData_Weakness : public UPrisonerBodySymptomUIData
{
	char pad_168[16];  // 0xA8(0x10)

}; 



// Class ConZ.WeaponDamageGroup
// Size: 0x50(Inherited: 0x30) 
struct UWeaponDamageGroup : public UDataAsset
{
	float Head;  // 0x30(0x4)
	float Neck;  // 0x34(0x4)
	float Torso;  // 0x38(0x4)
	float ArmUpper;  // 0x3C(0x4)
	float Abdomen;  // 0x40(0x4)
	float LegUpper;  // 0x44(0x4)
	float OtherLimbs;  // 0x48(0x4)
	char pad_76[4];  // 0x4C(0x4)

}; 



// Class ConZ.CustomZoneSettingsHandlingMethodSelector
// Size: 0x2C0(Inherited: 0x260) 
struct UCustomZoneSettingsHandlingMethodSelector : public UUserWidget
{
	char pad_608[24];  // 0x260(0x18)
	struct FText _description;  // 0x278(0x18)
	struct UTextBlock* _nameText;  // 0x290(0x8)
	struct UButton* _buttonSkip;  // 0x298(0x8)
	struct UButton* _buttonAllow;  // 0x2A0(0x8)
	struct UButton* _buttonBlock;  // 0x2A8(0x8)
	struct UCustomZoneDataAsset* _customZoneData;  // 0x2B0(0x8)
	char pad_696_1 : 7;  // 0x2B8(0x1)
	bool _showSkipOption : 1;  // 0x2B8(0x1)
	char pad_697[7];  // 0x2B9(0x7)

	void HandleSelectionSkip(); // Function ConZ.CustomZoneSettingsHandlingMethodSelector.HandleSelectionSkip
	void HandleSelectionBlock(); // Function ConZ.CustomZoneSettingsHandlingMethodSelector.HandleSelectionBlock
	void HandleSelectionAllow(); // Function ConZ.CustomZoneSettingsHandlingMethodSelector.HandleSelectionAllow
	struct FText GetHandlingMethodDescription(uint8_t  Method); // Function ConZ.CustomZoneSettingsHandlingMethodSelector.GetHandlingMethodDescription
}; 



// Class ConZ.WheeledVehicle2WAnimInstance
// Size: 0xA50(Inherited: 0xA50) 
struct UWheeledVehicle2WAnimInstance : public UWheeledVehicleBaseAnimInstance
{

}; 



// Class ConZ.AnimNotifyState_WeaponRevolverIgnoreDrumRotation
// Size: 0x30(Inherited: 0x30) 
struct UAnimNotifyState_WeaponRevolverIgnoreDrumRotation : public UAnimNotifyState
{

}; 



// Class ConZ.BedrollVirtualizedItemUserData
// Size: 0x48(Inherited: 0x28) 
struct UBedrollVirtualizedItemUserData : public UVirtualizedItemUserData
{
	struct FDbIntegerId Occupant;  // 0x28(0x8)
	struct FDateTime TimerStart;  // 0x30(0x8)
	struct FTimespan TimerDuration;  // 0x38(0x8)
	char pad_64_1 : 7;  // 0x40(0x1)
	bool ShouldLoad : 1;  // 0x40(0x1)
	char pad_65[7];  // 0x41(0x7)

}; 



// Class ConZ.AdminCommand_SetItemDebugMode
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetItemDebugMode : public UAdminCommand
{

}; 



// Class ConZ.PrisonerActionTuneBow
// Size: 0x110(Inherited: 0x108) 
struct UPrisonerActionTuneBow : public UPrisonerAction
{
	struct UAkAudioEvent* _tuneBowAudioEvent;  // 0x108(0x8)

}; 



// Class ConZ.FishSchoolActor
// Size: 0x480(Inherited: 0x220) 
struct AFishSchoolActor : public AActor
{
	uint8_t  _currentState;  // 0x220(0x1)
	char pad_545[47];  // 0x221(0x2F)
	struct UCapsuleComponent* _capsuleComponent;  // 0x250(0x8)
	struct UFishInstancedStaticMeshComponent* _schoolInstancedStaticMeshComponent;  // 0x258(0x8)
	char pad_608[44];  // 0x260(0x2C)
	float _minDistanceToTarget;  // 0x28C(0x4)
	float _boundsInflation;  // 0x290(0x4)
	float _findPathBypassMultiplier;  // 0x294(0x4)
	int32_t _maxTimesSameDestinationAllowed;  // 0x298(0x4)
	float _maxTimePerDestinationMultiplier;  // 0x29C(0x4)
	char pad_672[4];  // 0x2A0(0x4)
	float _schoolMovementRecoveryTurningSpeed;  // 0x2A4(0x4)
	float _schoolMovementRecoveryAcceleration;  // 0x2A8(0x4)
	float _schoolMovementRecoveryDeceleration;  // 0x2AC(0x4)
	float _schoolCloseToSurfaceTurningSpeed;  // 0x2B0(0x4)
	float _schoolCloseToSurfaceAcceleration;  // 0x2B4(0x4)
	float _schoolCloseToSurfaceDeceleration;  // 0x2B8(0x4)
	float _surfaceOffset;  // 0x2BC(0x4)
	char pad_704[4];  // 0x2C0(0x4)
	float _upperForbiddenZoneDepthPercentage;  // 0x2C4(0x4)
	float _swimmingDepthPercentage;  // 0x2C8(0x4)
	float _lowerForbiddenZoneDepthPercentage;  // 0x2CC(0x4)
	struct UParticleSystem* _waterParticles;  // 0x2D0(0x8)
	float _waterParticlesInterval;  // 0x2D8(0x4)
	char pad_732[4];  // 0x2DC(0x4)
	struct UParticleSystemComponent* _waterParticlesComponent;  // 0x2E0(0x8)
	char pad_744[4];  // 0x2E8(0x4)
	int32_t _forcedNumberOfGroups;  // 0x2EC(0x4)
	float _groupSpeed;  // 0x2F0(0x4)
	float _groupSeparationSpeed;  // 0x2F4(0x4)
	float _groupCatchUpSpeed;  // 0x2F8(0x4)
	float _groupSeparationDistance;  // 0x2FC(0x4)
	char pad_768[4];  // 0x300(0x4)
	float _groupSeparationTime;  // 0x304(0x4)
	int32_t _minNumberOfFish;  // 0x308(0x4)
	int32_t _maxNumberOfFish;  // 0x30C(0x4)
	char pad_784[4];  // 0x310(0x4)
	float _maxFishDistance;  // 0x314(0x4)
	char pad_792[4];  // 0x318(0x4)
	float _fishSeparationDistance;  // 0x31C(0x4)
	float _fishSeparationTime;  // 0x320(0x4)
	char pad_804[4];  // 0x324(0x4)
	float _fishTurnSpeedRangeModifier;  // 0x328(0x4)
	float _fishMinScale;  // 0x32C(0x4)
	float _fishMaxScale;  // 0x330(0x4)
	float _fishNormalSpeed;  // 0x334(0x4)
	float _fishSeparationSpeed;  // 0x338(0x4)
	float _fishCatchUpSpeed;  // 0x33C(0x4)
	float _fishMaxSpeed;  // 0x340(0x4)
	float _fishAcceleration;  // 0x344(0x4)
	float _fishDeceleration;  // 0x348(0x4)
	char pad_844[76];  // 0x34C(0x4C)
	struct FVector _moveToLocationRep;  // 0x398(0xC)
	char pad_932[12];  // 0x3A4(0xC)
	struct TMap<uint8_t , struct FFishStateParameters> _behaviorMap;  // 0x3B0(0x50)
	struct FVector _randomMovementExtent;  // 0x400(0xC)
	float _fleeingDistanceFromEnemy;  // 0x40C(0x4)
	float _fleeingPathLength;  // 0x410(0x4)
	float _returnToNormalBehaviorDistance;  // 0x414(0x4)
	float _schoolInternalMovementRelevancyDistanceSquared;  // 0x418(0x4)
	char pad_1052[16];  // 0x41C(0x10)
	float _fadeInTime;  // 0x42C(0x4)
	char pad_1072[4];  // 0x430(0x4)
	float _fadeOutTime;  // 0x434(0x4)
	char pad_1080[72];  // 0x438(0x48)

	void OnRep_MoveToLocationRep(); // Function ConZ.FishSchoolActor.OnRep_MoveToLocationRep
	void OnRep_CurrentState(); // Function ConZ.FishSchoolActor.OnRep_CurrentState
}; 



// Class ConZ.AdminCommand_SetMalfunctionProbability
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetMalfunctionProbability : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_SetPrisonerAttributes
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetPrisonerAttributes : public UAdminCommand
{

}; 



// Class ConZ.MissionResult
// Size: 0x280(Inherited: 0x260) 
struct UMissionResult : public UUserWidget
{
	struct UOverlay* _resultTitleOverlay;  // 0x260(0x8)
	struct UTextBlock* _resultTitleDescription;  // 0x268(0x8)
	struct UOverlay* _resultRewardContainerOverlay;  // 0x270(0x8)
	struct UVerticalBox* _resultRewardContainer;  // 0x278(0x8)

	void PlayShowMissionResultAnimation(); // Function ConZ.MissionResult.PlayShowMissionResultAnimation
}; 



// Class ConZ.PrisonerBodyConditionOrSymptomSideEffect_Weakness
// Size: 0xD8(Inherited: 0x30) 
struct UPrisonerBodyConditionOrSymptomSideEffect_Weakness : public UPrisonerBodyConditionOrSymptomSideEffect
{
	UPrisonerBodySymptom_Weakness* _symptomClass;  // 0x30(0x8)
	struct UPrisonerBodySymptomCause_Weakness* _symptomCause;  // 0x38(0x8)
	struct FRuntimeFloatCurve _performanceScoreModifierVsSeverity;  // 0x40(0x88)
	float _strengthModifierPerPerformanceScoreModifier;  // 0xC8(0x4)
	float _constitutionModifierPerPerformanceScoreModifier;  // 0xCC(0x4)
	float _dexterityModifierPerPerformanceScoreModifier;  // 0xD0(0x4)
	char pad_212[4];  // 0xD4(0x4)

}; 



// Class ConZ.CustomZoneRegistry
// Size: 0x200(Inherited: 0xB0) 
struct UCustomZoneRegistry : public UActorComponent
{
	char pad_176[16];  // 0xB0(0x10)
	struct UMaterialInterface* _mapMaterial;  // 0xC0(0x8)
	struct FCustomZoneConfiguration _defaultGlobalConfiguration;  // 0xC8(0x40)
	struct FCustomZoneConfiguration _defaultConfiguration;  // 0x108(0x40)
	struct TMap<struct FName, struct FCustomZoneRegion> _defaultRegions;  // 0x148(0x50)
	struct UCanvasRenderTarget2D* _mapTexture;  // 0x198(0x8)
	char pad_416[96];  // 0x1A0(0x60)

	void NetMulticast_ReceiveCustomZoneData(struct FCustomZoneConfiguration globalConfiguration, struct TArray<struct FCustomZoneConfiguration> configurations, struct TArray<struct FCustomZoneRegion> Regions); // Function ConZ.CustomZoneRegistry.NetMulticast_ReceiveCustomZoneData
}; 



// Class ConZ.ConZButton
// Size: 0x28(Inherited: 0x28) 
struct UConZButton : public UInterface
{

}; 



// Class ConZ.PrisonerVehicleAction_SetupCarJack
// Size: 0x118(Inherited: 0x108) 
struct UPrisonerVehicleAction_SetupCarJack : public UPrisonerAction
{
	char pad_264[16];  // 0x108(0x10)

}; 



// Class ConZ.PrisonerActionStartPlayingInstrument
// Size: 0x108(Inherited: 0x108) 
struct UPrisonerActionStartPlayingInstrument : public UPrisonerAction
{

}; 



// Class ConZ.PrisonerActionSearchGroundDescription
// Size: 0x68(Inherited: 0x38) 
struct UPrisonerActionSearchGroundDescription : public UPrisonerActionDescription
{
	char pad_56[48];  // 0x38(0x30)

}; 



// Class ConZ.CombinationLockGetCombinationRequest
// Size: 0x40(Inherited: 0x28) 
struct UCombinationLockGetCombinationRequest : public UPlayerRpcChannelServerRequest
{
	char pad_40[24];  // 0x28(0x18)

}; 



// Class ConZ.InstrumentItem
// Size: 0xB10(Inherited: 0x910) 
struct AInstrumentItem : public AItem
{
	char pad_2320[12];  // 0x910(0xC)
	int32_t _numberOfOctaves;  // 0x91C(0x4)
	struct UAnimMontage* _playInstrumentStartMontageFP;  // 0x920(0x8)
	struct UAnimMontage* _playInstrumentStartMontageTP;  // 0x928(0x8)
	struct UAnimMontage* _playInstrumentStopMontageFP;  // 0x930(0x8)
	struct UAnimMontage* _playInstrumentStopMontageTP;  // 0x938(0x8)
	struct UAnimSequenceBase* _playInstrumentIdleAnimationFP;  // 0x940(0x8)
	struct UAnimSequenceBase* _playInstrumentPlayingAnimationFP;  // 0x948(0x8)
	struct UAnimSequenceBase* _playInstrumentIdleAnimationTP;  // 0x950(0x8)
	struct UAnimSequenceBase* _playInstrumentPlayingAnimationTP;  // 0x958(0x8)
	float _playingPoseHoldTime;  // 0x960(0x4)
	char pad_2404[4];  // 0x964(0x4)
	struct TArray<struct UAkAudioEvent*> _noteCStart;  // 0x968(0x10)
	struct TArray<struct UAkAudioEvent*> _noteCStop;  // 0x978(0x10)
	struct TArray<struct UAkAudioEvent*> _noteDStart;  // 0x988(0x10)
	struct TArray<struct UAkAudioEvent*> _noteDStop;  // 0x998(0x10)
	struct TArray<struct UAkAudioEvent*> _noteDbStart;  // 0x9A8(0x10)
	struct TArray<struct UAkAudioEvent*> _noteDbStop;  // 0x9B8(0x10)
	struct TArray<struct UAkAudioEvent*> _noteEStart;  // 0x9C8(0x10)
	struct TArray<struct UAkAudioEvent*> _noteEStop;  // 0x9D8(0x10)
	struct TArray<struct UAkAudioEvent*> _noteEbStart;  // 0x9E8(0x10)
	struct TArray<struct UAkAudioEvent*> _noteEbStop;  // 0x9F8(0x10)
	struct TArray<struct UAkAudioEvent*> _noteFStart;  // 0xA08(0x10)
	struct TArray<struct UAkAudioEvent*> _noteFStop;  // 0xA18(0x10)
	struct TArray<struct UAkAudioEvent*> _noteGStart;  // 0xA28(0x10)
	struct TArray<struct UAkAudioEvent*> _noteGStop;  // 0xA38(0x10)
	struct TArray<struct UAkAudioEvent*> _noteGbStart;  // 0xA48(0x10)
	struct TArray<struct UAkAudioEvent*> _noteGbStop;  // 0xA58(0x10)
	struct TArray<struct UAkAudioEvent*> _noteAStart;  // 0xA68(0x10)
	struct TArray<struct UAkAudioEvent*> _noteAStop;  // 0xA78(0x10)
	struct TArray<struct UAkAudioEvent*> _noteAbStart;  // 0xA88(0x10)
	struct TArray<struct UAkAudioEvent*> _noteAbStop;  // 0xA98(0x10)
	struct TArray<struct UAkAudioEvent*> _noteBStart;  // 0xAA8(0x10)
	struct TArray<struct UAkAudioEvent*> _noteBStop;  // 0xAB8(0x10)
	struct TArray<struct UAkAudioEvent*> _noteBbStart;  // 0xAC8(0x10)
	struct TArray<struct UAkAudioEvent*> _noteBbStop;  // 0xAD8(0x10)
	struct TArray<struct UAkAudioEvent*> _noteC2Start;  // 0xAE8(0x10)
	struct TArray<struct UAkAudioEvent*> _noteC2Stop;  // 0xAF8(0x10)
	char pad_2824[8];  // 0xB08(0x8)

}; 



// Class ConZ.AdminCommand_SetPrisonerExhaustion
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetPrisonerExhaustion : public UAdminCommand
{

}; 



// Class ConZ.TabModeTabsContainer
// Size: 0x2A8(Inherited: 0x260) 
struct UTabModeTabsContainer : public UUserWidget
{
	struct UHorizontalBox* _mainHorizontalBox;  // 0x260(0x8)
	struct UTabModeTab* _inventoryTab;  // 0x268(0x8)
	struct UTabModeTab* _craftingTab;  // 0x270(0x8)
	struct UTabModeTab* _buildingTab;  // 0x278(0x8)
	struct UTabModeTab* _metabolismTab;  // 0x280(0x8)
	struct UTabModeTab* _journalTab;  // 0x288(0x8)
	struct UTabModeTab* _squadTab;  // 0x290(0x8)
	struct UTabModeTab* _eventsTab;  // 0x298(0x8)
	struct UTabModeTab* _cookingTab;  // 0x2A0(0x8)

}; 



// Class ConZ.AdminCommandArgumentDataType_Bool
// Size: 0x110(Inherited: 0x108) 
struct UAdminCommandArgumentDataType_Bool : public UAdminCommandArgumentDataTypeBase
{
	char pad_264_1 : 7;  // 0x108(0x1)
	bool _defaultValue : 1;  // 0x108(0x1)
	char pad_265[7];  // 0x109(0x7)

}; 



// Class ConZ.RainCollectorComponent
// Size: 0xF8(Inherited: 0xC8) 
struct URainCollectorComponent : public UItemComponent
{
	struct FDbIntegerId _collectorID;  // 0xC8(0x8)
	char pad_208[4];  // 0xD0(0x4)
	float _fillRate;  // 0xD4(0x4)
	float _maxAmount;  // 0xD8(0x4)
	char pad_220[12];  // 0xDC(0xC)
	struct UAkAudioEvent* _collectingStartSound;  // 0xE8(0x8)
	struct UAkAudioEvent* _collectingStopSound;  // 0xF0(0x8)

	void OnResourceAmountChanged(struct UBasicGameResourceContainerComponent* containerComponent, float newAmount); // Function ConZ.RainCollectorComponent.OnResourceAmountChanged
	void OnRep_CollectorID(); // Function ConZ.RainCollectorComponent.OnRep_CollectorID
}; 



// Class ConZ.AdminCommand_SetPrisonerImmortality
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetPrisonerImmortality : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_SetPrisonerInfiniteOxygen
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetPrisonerInfiniteOxygen : public UAdminCommand
{

}; 



// Class ConZ.BasicItemDecayEntityComponentSetup
// Size: 0x50(Inherited: 0x48) 
struct UBasicItemDecayEntityComponentSetup : public UEntityComponentSetup
{
	float LifeTime;  // 0x48(0x4)
	char pad_76[4];  // 0x4C(0x4)

}; 



// Class ConZ.EventInsertCartridge
// Size: 0xA0(Inherited: 0x90) 
struct UEventInsertCartridge : public UWeaponActionReloadSequence
{
	struct FName MontageEndSectionName;  // 0x90(0x8)
	char pad_152[8];  // 0x98(0x8)

}; 



// Class ConZ.PrisonerActionApplyFlagElementsExpansion
// Size: 0x108(Inherited: 0x108) 
struct UPrisonerActionApplyFlagElementsExpansion : public UPrisonerAction
{

}; 



// Class ConZ.AnimNotifyState_ShowAmmunitionMeshes
// Size: 0x60(Inherited: 0x30) 
struct UAnimNotifyState_ShowAmmunitionMeshes : public UAnimNotifyState
{
	char pad_48_1 : 7;  // 0x30(0x1)
	bool GenerateCustomMeshComponents : 1;  // 0x30(0x1)
	char pad_49[7];  // 0x31(0x7)
	struct TArray<struct FName> CustomMeshComponentsBoneNames;  // 0x38(0x10)
	char pad_72_1 : 7;  // 0x48(0x1)
	bool showReversed : 1;  // 0x48(0x1)
	char pad_73[7];  // 0x49(0x7)
	struct TArray<int32_t> ammoIndices;  // 0x50(0x10)

}; 



// Class ConZ.BaseItemContainerWidget
// Size: 0x298(Inherited: 0x260) 
struct UBaseItemContainerWidget : public UUserWidget
{
	struct FMulticastInlineDelegate ObjectAddedToContainer;  // 0x260(0x10)
	char pad_624[4];  // 0x270(0x4)
	int32_t Columns;  // 0x274(0x4)
	int32_t Rows;  // 0x278(0x4)
	char pad_636[4];  // 0x27C(0x4)
	struct UGridPanel* GridPanel;  // 0x280(0x8)
	struct UUserWidget* HighlightBorder;  // 0x288(0x8)
	char pad_656[8];  // 0x290(0x8)

	void RefreshSize(); // Function ConZ.BaseItemContainerWidget.RefreshSize
	void OnObjectAddedToContainerEvent__DelegateSignature(struct UObject* Object); // DelegateFunction ConZ.BaseItemContainerWidget.OnObjectAddedToContainerEvent__DelegateSignature
	void OnDropEvent(struct UInventorySlotUserWidget* inventorySlot, struct UBaseItemWidget* Item); // Function ConZ.BaseItemContainerWidget.OnDropEvent
	void OnDragStartEvent(struct UBaseItemWidget* Widget, struct FGeometry& Geometry); // Function ConZ.BaseItemContainerWidget.OnDragStartEvent
	void OnDragLeaveEvent(struct UInventorySlotUserWidget* inventorySlot, struct UBaseItemWidget* Widget); // Function ConZ.BaseItemContainerWidget.OnDragLeaveEvent
	void OnDragEnterEvent(struct UInventorySlotUserWidget* inventorySlot, struct UBaseItemWidget* Widget); // Function ConZ.BaseItemContainerWidget.OnDragEnterEvent
	void OnDragCancelledEvent(struct UBaseItemWidget* Widget); // Function ConZ.BaseItemContainerWidget.OnDragCancelledEvent
	void InitGrid(struct FMargin& gridPadding); // Function ConZ.BaseItemContainerWidget.InitGrid
	bool GetSlotsForPanel(struct UGridSlot* GridSlot, int32_t Width, int32_t Height, struct TArray<struct UInventorySlotUserWidget*>& Slots, struct UGridPanel* panel, int32_t numColumns, int32_t numRows); // Function ConZ.BaseItemContainerWidget.GetSlotsForPanel
	bool GetSlots(struct UGridSlot* GridSlot, int32_t Width, int32_t Height, struct TArray<struct UInventorySlotUserWidget*>& Slots); // Function ConZ.BaseItemContainerWidget.GetSlots
	struct TArray<struct UItemUserWidget*> GetItemWidgets(); // Function ConZ.BaseItemContainerWidget.GetItemWidgets
}; 



// Class ConZ.AdminCommand_SetPrisonerInfiniteStamina
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetPrisonerInfiniteStamina : public UAdminCommand
{

}; 



// Class ConZ.ImageSlotWidget
// Size: 0x3D8(Inherited: 0x260) 
struct UImageSlotWidget : public UUserWidget
{
	char pad_608[72];  // 0x260(0x48)
	struct UImage* _availabilityGrid;  // 0x2A8(0x8)
	struct UImage* _backgroundImage;  // 0x2B0(0x8)
	struct UImage* _displayedImage;  // 0x2B8(0x8)
	struct FSlateBrush _defaultImageBrush;  // 0x2C0(0x88)
	char pad_840[8];  // 0x348(0x8)
	struct FLinearColor _regularColor;  // 0x350(0x10)
	struct FLinearColor _dropUnavailableColor;  // 0x360(0x10)
	struct FLinearColor _dropAvailableColor;  // 0x370(0x10)
	float _defaultBackgroundOpacity;  // 0x380(0x4)
	float _slottedBackgroundOpacity;  // 0x384(0x4)
	struct FSlateColor _defaultIconTint;  // 0x388(0x28)
	struct FSlateColor _slottedIconTint;  // 0x3B0(0x28)

}; 



// Class ConZ.PrisonerActionOperateBondage
// Size: 0x120(Inherited: 0x108) 
struct UPrisonerActionOperateBondage : public UPrisonerAction
{
	char pad_264[24];  // 0x108(0x18)

}; 



// Class ConZ.AdminCommand_SetPrisonerMetabolismSimulationSpeed
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetPrisonerMetabolismSimulationSpeed : public UAdminCommand
{

}; 



// Class ConZ.InventoryPositionDataSelection
// Size: 0x30(Inherited: 0x28) 
struct UInventoryPositionDataSelection : public UInventoryPositionData
{
	int32_t position;  // 0x28(0x4)
	char pad_44[4];  // 0x2C(0x4)

}; 



// Class ConZ.PrisonerAnimInstance
// Size: 0x1150(Inherited: 0x2C0) 
struct UPrisonerAnimInstance : public UAnimInstance
{
	float SlowPaceLoopAnimSpeeds[16];  // 0x2B8(0x58)
	float MediumPaceLoopAnimSpeeds[16];  // 0x310(0x58)
	float FastPaceLoopAnimSpeeds[16];  // 0x368(0x58)
	float MeleeCombatWalkUsageRadius;  // 0x3C0(0x4)
	float MeleeExhaustionFactorInterpSpeed;  // 0x3C4(0x4)
	float UpperEyelidsLookLeftFactor;  // 0x3C8(0x4)
	float LowerEyelidsLookLeftFactor;  // 0x3CC(0x4)
	float UpperEyelidsLookRightFactor;  // 0x3D0(0x4)
	float LowerEyelidsLookRightFactor;  // 0x3D4(0x4)
	float UpperEyelidsLookUpFactor;  // 0x3D8(0x4)
	float LowerEyelidsLookUpFactor;  // 0x3DC(0x4)
	float UpperEyelidsLookDownFactor;  // 0x3E0(0x4)
	float LowerEyelidsLookDownFactor;  // 0x3E4(0x4)
	char pad_1008_1 : 7;  // 0x3F0(0x1)
	bool AutoBlinkEnabled : 1;  // 0x3E8(0x1)
	char pad_1009[151];  // 0x3F1(0x97)
	char pad_1160_1 : 7;  // 0x488(0x1)
	bool _isPrisonerCompletelyInitialized : 1;  // 0x488(0x1)
	char pad_1161_1 : 7;  // 0x489(0x1)
	bool _isOwnerLocallyControlled : 1;  // 0x489(0x1)
	char pad_1162_1 : 7;  // 0x48A(0x1)
	bool _isOwnerPlayerControlled : 1;  // 0x48A(0x1)
	char pad_1163_1 : 7;  // 0x48B(0x1)
	bool _isFemale : 1;  // 0x48B(0x1)
	char pad_1164_1 : 7;  // 0x48C(0x1)
	bool _isInFirstPersonView : 1;  // 0x48C(0x1)
	char pad_1165_1 : 7;  // 0x48D(0x1)
	bool _shouldOverrideIsInFirstPersonView : 1;  // 0x48D(0x1)
	char pad_1166_1 : 7;  // 0x48E(0x1)
	bool _isInFirstPersonViewOverride : 1;  // 0x48E(0x1)
	char pad_1167_1 : 7;  // 0x48F(0x1)
	bool _isInFirstPersonViewAndIsFemale : 1;  // 0x48F(0x1)
	char pad_1168_1 : 7;  // 0x490(0x1)
	bool _isInThirdPersonViewAndIsFemale : 1;  // 0x490(0x1)
	char pad_1169_1 : 7;  // 0x491(0x1)
	bool _isAimingWeapon : 1;  // 0x491(0x1)
	char pad_1170_1 : 7;  // 0x492(0x1)
	bool _isAbleToFireWeapon : 1;  // 0x492(0x1)
	uint8_t  _weaponAimingType;  // 0x493(0x1)
	struct FVector _supportingHandIKLocation;  // 0x494(0xC)
	float _weaponAimYaw;  // 0x4A0(0x4)
	float _weaponAimPitch;  // 0x4A4(0x4)
	struct UAnimSequenceBase* _meleeSkill_PrimaryIdleAnimationTP;  // 0x4A8(0x8)
	struct UAnimSequenceBase* _meleeSkill_PrimaryIdleAnimationFP;  // 0x4B0(0x8)
	struct UAnimSequenceBase* _meleeSkill_TiredIdleAnimationTP;  // 0x4B8(0x8)
	struct UAnimSequenceBase* _meleeSkill_TiredIdleAnimationFP;  // 0x4C0(0x8)
	struct UAnimSequenceBase* _meleeSkill_WalkingIdleAnimationTP;  // 0x4C8(0x8)
	struct UAnimSequenceBase* _meleeSkill_WalkingIdleAnimationFP;  // 0x4D0(0x8)
	struct UAnimSequenceBase* _meleeSkill_BlockIdleAnimationTP;  // 0x4D8(0x8)
	struct UAnimSequenceBase* _meleeSkill_BlockIdleAnimationFP;  // 0x4E0(0x8)
	struct UBlendSpace* _meleeSkill_AimOffsetBlendSpaceTP;  // 0x4E8(0x8)
	struct UBlendSpace* _meleeSkill_AimOffsetBlendSpaceFP;  // 0x4F0(0x8)
	float _meleeSkill_IdleToBlockBlendDuration;  // 0x4F8(0x4)
	float _meleeSkill_BlockToIdleBlendDuration;  // 0x4FC(0x4)
	float _meleeSkill_ExhaustionFactor;  // 0x500(0x4)
	char pad_1284_1 : 7;  // 0x504(0x1)
	bool _shouldUseUnarmedCombatWalk : 1;  // 0x504(0x1)
	char pad_1285_1 : 7;  // 0x505(0x1)
	bool _isHoldingBlock : 1;  // 0x505(0x1)
	char pad_1286[2];  // 0x506(0x2)
	float _stamina;  // 0x508(0x4)
	float _bellyJiggleAmount;  // 0x50C(0x4)
	float _breastJiggleAmount;  // 0x510(0x4)
	struct FRotator _eyesRotationDelta;  // 0x514(0xC)
	float _minEyesRotationPitch;  // 0x520(0x4)
	float _maxEyesRotationPitch;  // 0x524(0x4)
	char pad_1320_1 : 7;  // 0x528(0x1)
	bool _shouldUseWeaponAnimationPose : 1;  // 0x528(0x1)
	char pad_1321[231];  // 0x529(0xE7)
	char pad_1552_1 : 7;  // 0x610(0x1)
	bool _shouldIgnoreSupportingHandIK : 1;  // 0x610(0x1)
	char pad_1553[3];  // 0x611(0x3)
	float _firstPersonAimPitch;  // 0x614(0x4)
	float _firstPersonAimYawDelta;  // 0x618(0x4)
	char pad_1564_1 : 7;  // 0x61C(0x1)
	bool _shouldAimDownTheSights : 1;  // 0x61C(0x1)
	char pad_1565[3];  // 0x61D(0x3)
	struct FVector _aimingDownTheSightsLocationOffset;  // 0x620(0xC)
	struct FVector _scopeViewArmDislocationOffset;  // 0x62C(0xC)
	struct FRotator _armsLagRotation;  // 0x638(0xC)
	float _armsLagPitch;  // 0x644(0x4)
	float _armsLagYaw;  // 0x648(0x4)
	uint8_t  _stance;  // 0x64C(0x1)
	char pad_1613[3];  // 0x64D(0x3)
	float _crouchStage;  // 0x650(0x4)
	float _targetCrouchStage;  // 0x654(0x4)
	char pad_1624_1 : 7;  // 0x658(0x1)
	bool _isFreeLookEnabled : 1;  // 0x658(0x1)
	char pad_1625_1 : 7;  // 0x659(0x1)
	bool _shouldIgnoreHeadTurning : 1;  // 0x659(0x1)
	char pad_1626[2];  // 0x65A(0x2)
	struct FRotator _aimOffset;  // 0x65C(0xC)
	float _leanAmount;  // 0x668(0x4)
	char pad_1644_1 : 7;  // 0x66C(0x1)
	bool _shouldLookAtMeleeTarget : 1;  // 0x66C(0x1)
	char pad_1645[3];  // 0x66D(0x3)
	struct FRotator _lookAtMeleeTargetAimOffset;  // 0x670(0xC)
	uint8_t  _animationSet;  // 0x67C(0x1)
	char pad_1661_1 : 7;  // 0x67D(0x1)
	bool _isInRagdoll : 1;  // 0x67D(0x1)
	char pad_1662_1 : 7;  // 0x67E(0x1)
	bool _isMovingOnGround : 1;  // 0x67E(0x1)
	char pad_1663_1 : 7;  // 0x67F(0x1)
	bool _isFalling : 1;  // 0x67F(0x1)
	char pad_1664_1 : 7;  // 0x680(0x1)
	bool _isSwimming : 1;  // 0x680(0x1)
	char pad_1665[3];  // 0x681(0x3)
	struct FVector _acceleration;  // 0x684(0xC)
	char pad_1680_1 : 7;  // 0x690(0x1)
	bool _wantsToMove : 1;  // 0x690(0x1)
	char pad_1681_1 : 7;  // 0x691(0x1)
	bool _wantsToMoveHorizontallyOnly : 1;  // 0x691(0x1)
	char pad_1682_1 : 7;  // 0x692(0x1)
	bool _wantsToMoveVerticallyOnly : 1;  // 0x692(0x1)
	char pad_1683_1 : 7;  // 0x693(0x1)
	bool _wantsToWalk : 1;  // 0x693(0x1)
	char pad_1684_1 : 7;  // 0x694(0x1)
	bool _wantsToJog : 1;  // 0x694(0x1)
	char pad_1685_1 : 7;  // 0x695(0x1)
	bool _wantsToRun : 1;  // 0x695(0x1)
	char pad_1686[2];  // 0x696(0x2)
	struct FVector _velocity;  // 0x698(0xC)
	char pad_1700[4];  // 0x6A4(0x4)
	float _speed;  // 0x6A8(0x4)
	float _speedXY;  // 0x6AC(0x4)
	float _maxSpeed;  // 0x6B0(0x4)
	float _stoppingDistance;  // 0x6B4(0x4)
	char pad_1720[124];  // 0x6B8(0x7C)
	float _leftHandIKAmount;  // 0x734(0x4)
	float _desiredCourseAngle;  // 0x738(0x4)
	float _desiredCoursePitchAngle;  // 0x73C(0x4)
	float _actualCourseAngle;  // 0x740(0x4)
	uint8_t  _desiredMovementPace;  // 0x744(0x1)
	uint8_t  _clampedDesiredMovementPace;  // 0x745(0x1)
	uint8_t  _movementPaceBeforeGroundStart;  // 0x746(0x1)
	char pad_1863[1];  // 0x747(0x1)
	float _groundStartAnimPlayRate;  // 0x748(0x4)
	float _legsPoseBeforeGroundStop;  // 0x74C(0x4)
	uint8_t  _movementDirectionBeforeGroundStop;  // 0x750(0x1)
	uint8_t  _movementPaceBeforeGroundStop;  // 0x751(0x1)
	uint8_t  _animationSetBeforeGroundStop;  // 0x752(0x1)
	char pad_1875_1 : 7;  // 0x753(0x1)
	bool _shouldUseLUGroundStopAnimation : 1;  // 0x753(0x1)
	uint8_t  _hitReactState;  // 0x754(0x1)
	char pad_1877[3];  // 0x755(0x3)
	float _weightLoadFactor;  // 0x758(0x4)
	char pad_1884_1 : 7;  // 0x75C(0x1)
	bool _shouldUseJogStartForRunStart : 1;  // 0x75C(0x1)
	char pad_1885_1 : 7;  // 0x75D(0x1)
	bool _useLocomotionAdditiveAnimations : 1;  // 0x75D(0x1)
	char pad_1886[2];  // 0x75E(0x2)
	float _disorientation;  // 0x760(0x4)
	float _disorientationMultiplier;  // 0x764(0x4)
	char pad_1896_1 : 7;  // 0x768(0x1)
	bool _isLimping : 1;  // 0x768(0x1)
	char pad_1897_1 : 7;  // 0x769(0x1)
	bool _shouldRotateBonesWithFirstPersonAimPitch : 1;  // 0x769(0x1)
	char pad_1898[6];  // 0x76A(0x6)
	float _jumpApex;  // 0x770(0x4)
	float _distanceToJumpApex;  // 0x774(0x4)
	float _legsPoseBeforeJump;  // 0x778(0x4)
	uint8_t  _movementPaceBeforeJump;  // 0x77C(0x1)
	uint8_t  _animationSetBeforeJump;  // 0x77D(0x1)
	char pad_1918_1 : 7;  // 0x77E(0x1)
	bool _shouldJumpGoToFallingLoop : 1;  // 0x77E(0x1)
	char pad_1919[1];  // 0x77F(0x1)
	float _waterImmersionDepth;  // 0x780(0x4)
	struct FVector _meshOffsetWhenInWater;  // 0x784(0xC)
	char pad_1936_1 : 7;  // 0x790(0x1)
	bool _wantsToDiveIn : 1;  // 0x790(0x1)
	char pad_1937[211];  // 0x791(0xD3)
	char pad_2148_1 : 7;  // 0x864(0x1)
	bool _isClimbing : 1;  // 0x864(0x1)
	char pad_2149_1 : 7;  // 0x865(0x1)
	bool _isClimbingAnchoring : 1;  // 0x865(0x1)
	char pad_2150[138];  // 0x866(0x8A)
	struct UAnimSequenceBase* _climbAnchoringAnimation;  // 0x8F0(0x8)
	float _climbAnchoringAnimationTime;  // 0x8F8(0x4)
	char pad_2300_1 : 7;  // 0x8FC(0x1)
	bool _isClimbingLadder : 1;  // 0x8FC(0x1)
	char pad_2301[179];  // 0x8FD(0xB3)
	struct FVector _ladderClimbingRootBoneOffset;  // 0x9B0(0xC)
	float _ladderClimbingLoopState;  // 0x9BC(0x4)
	float _ladderClimbingLoopStateForPeeking;  // 0x9C0(0x4)
	float _ladderClimbingPeekState;  // 0x9C4(0x4)
	char pad_2504_1 : 7;  // 0x9C8(0x1)
	bool _isClimbingWindow : 1;  // 0x9C8(0x1)
	char pad_2505_1 : 7;  // 0x9C9(0x1)
	bool _isClimbingWindowAnchoring : 1;  // 0x9C9(0x1)
	char pad_2506[6];  // 0x9CA(0x6)
	struct UAnimSequenceBase* _windowClimbingAnchoringAnimation;  // 0x9D0(0x8)
	float _windowClimbingAnchoringAnimationTime;  // 0x9D8(0x4)
	uint8_t  _weaponType;  // 0x9DC(0x1)
	char pad_2525_1 : 7;  // 0x9DD(0x1)
	bool _isDedicatedServer : 1;  // 0x9DD(0x1)
	char pad_2526[842];  // 0x9DE(0x34A)
	struct UAnimSequenceBase* _itemFirstPersonUpperBodyStandIdle;  // 0xD28(0x8)
	struct UBlendSpace1D* _itemFirstPersonUpperBodyStandWalk;  // 0xD30(0x8)
	struct UBlendSpace1D* _itemFirstPersonUpperBodyStandWalkLimping;  // 0xD38(0x8)
	struct UBlendSpace1D* _itemFirstPersonUpperBodyStandJog;  // 0xD40(0x8)
	struct UBlendSpace1D* _itemFirstPersonUpperBodyStandJogLimping;  // 0xD48(0x8)
	struct UAnimSequenceBase* _itemFirstPersonUpperBodyStandRun;  // 0xD50(0x8)
	struct UAnimSequenceBase* _itemFirstPersonUpperBodyCrouchIdle;  // 0xD58(0x8)
	struct UBlendSpace1D* _itemFirstPersonUpperBodyCrouchWalk;  // 0xD60(0x8)
	struct UBlendSpace1D* _itemFirstPersonUpperBodyCrouchWalkLimping;  // 0xD68(0x8)
	struct UAnimSequenceBase* _itemFirstPersonUpperBodyProneIdle;  // 0xD70(0x8)
	struct UAnimSequenceBase* _weaponAimingHipFirstPersonUpperBodyStandIdle;  // 0xD78(0x8)
	struct UBlendSpace1D* _weaponAimingHipFirstPersonUpperBodyStandWalk;  // 0xD80(0x8)
	struct UBlendSpace1D* _weaponAimingHipFirstPersonUpperBodyStandWalkLimping;  // 0xD88(0x8)
	struct UBlendSpace1D* _weaponAimingHipFirstPersonUpperBodyStandJog;  // 0xD90(0x8)
	struct UBlendSpace1D* _weaponAimingHipFirstPersonUpperBodyStandJogLimping;  // 0xD98(0x8)
	struct UAnimSequenceBase* _weaponAimingHipFirstPersonUpperBodyStandRun;  // 0xDA0(0x8)
	struct UAnimSequenceBase* _weaponAimingHipFirstPersonUpperBodyCrouchIdle;  // 0xDA8(0x8)
	struct UBlendSpace1D* _weaponAimingHipFirstPersonUpperBodyCrouchWalk;  // 0xDB0(0x8)
	struct UBlendSpace1D* _weaponAimingHipFirstPersonUpperBodyCrouchWalkLimping;  // 0xDB8(0x8)
	struct UAnimSequenceBase* _weaponAimingHipFirstPersonUpperBodyProneIdle;  // 0xDC0(0x8)
	char pad_3528_1 : 7;  // 0xDC8(0x1)
	bool _shouldUseItemFirstPersonAimOffsets : 1;  // 0xDC8(0x1)
	char pad_3529[7];  // 0xDC9(0x7)
	struct UBlendSpace* _itemFirstPersonAimOffsetStanding;  // 0xDD0(0x8)
	struct UBlendSpace* _itemFirstPersonAimOffsetCrouching;  // 0xDD8(0x8)
	struct UBlendSpace* _itemFirstPersonAimOffsetProne;  // 0xDE0(0x8)
	struct UAnimSequenceBase* _rightHandCorrectionPoseStanding;  // 0xDE8(0x8)
	struct UAnimSequenceBase* _rightHandCorrectionPoseCrouching;  // 0xDF0(0x8)
	struct UAnimSequenceBase* _rightHandCorrectionPoseProne;  // 0xDF8(0x8)
	struct UAnimSequenceBase* _rightFistCorrectionPoseStanding;  // 0xE00(0x8)
	struct UAnimSequenceBase* _rightFistCorrectionPoseStandingInCombatMode;  // 0xE08(0x8)
	struct UAnimSequenceBase* _rightFistCorrectionPoseCrouching;  // 0xE10(0x8)
	struct UAnimSequenceBase* _rightFistCorrectionPoseProne;  // 0xE18(0x8)
	float _rightHandToIdleBlendAlphaStanding;  // 0xE20(0x4)
	float _rightHandToIdleBlendAlphaCrouching;  // 0xE24(0x4)
	struct UAnimSequenceBase* _leftHandCorrectionPoseStanding;  // 0xE28(0x8)
	struct UAnimSequenceBase* _leftHandCorrectionPoseCrouching;  // 0xE30(0x8)
	struct UAnimSequenceBase* _leftHandCorrectionPoseProne;  // 0xE38(0x8)
	struct UAnimSequenceBase* _leftFistCorrectionPoseStanding;  // 0xE40(0x8)
	struct UAnimSequenceBase* _leftFistCorrectionPoseStandingInCombatMode;  // 0xE48(0x8)
	struct UAnimSequenceBase* _leftFistCorrectionPoseCrouching;  // 0xE50(0x8)
	struct UAnimSequenceBase* _leftFistCorrectionPoseProne;  // 0xE58(0x8)
	float _leftHandToIdleBlendAlphaStanding;  // 0xE60(0x4)
	float _leftHandToIdleBlendAlphaCrouching;  // 0xE64(0x4)
	char pad_3688[8];  // 0xE68(0x8)
	char pad_3696_1 : 7;  // 0xE70(0x1)
	bool _hasItemInHands : 1;  // 0xE70(0x1)
	char pad_3697[3];  // 0xE71(0x3)
	struct FVector _itemInHandsLeftHandLocationInRightHandSpace;  // 0xE74(0xC)
	struct FRotator _itemInHandsLeftHandRotationInRightHandSpace;  // 0xE80(0xC)
	float _itemInHandsObstructionDepth;  // 0xE8C(0x4)
	float _itemInHandsObstructionDepthSmoothed;  // 0xE90(0x4)
	char pad_3732_1 : 7;  // 0xE94(0x1)
	bool _isItemInHandsObstructed : 1;  // 0xE94(0x1)
	char pad_3733_1 : 7;  // 0xE95(0x1)
	bool _isItemInHandsCompletelyObstructed : 1;  // 0xE95(0x1)
	char pad_3734[2];  // 0xE96(0x2)
	float _itemInHandsObstructionSide;  // 0xE98(0x4)
	char pad_3740[4];  // 0xE9C(0x4)
	struct UAnimSequenceBase* _itemInHandsLeftObstructedIdleFP;  // 0xEA0(0x8)
	struct UAnimSequenceBase* _itemInHandsRightObstructedIdleFP;  // 0xEA8(0x8)
	struct UAnimSequenceBase* _itemInHandsObstructedIdleTP;  // 0xEB0(0x8)
	struct UAnimSequenceBase* _itemInHandsObstructedIdleProneTP;  // 0xEB8(0x8)
	char pad_3776_1 : 7;  // 0xEC0(0x1)
	bool _isInCombatMode : 1;  // 0xEC0(0x1)
	char pad_3777_1 : 7;  // 0xEC1(0x1)
	bool _shouldUseHandCorrections : 1;  // 0xEC1(0x1)
	char pad_3778_1 : 7;  // 0xEC2(0x1)
	bool _shouldUseFistCorrections : 1;  // 0xEC2(0x1)
	char pad_3779_1 : 7;  // 0xEC3(0x1)
	bool _overrideFingersOnlyInProne : 1;  // 0xEC3(0x1)
	char pad_3780_1 : 7;  // 0xEC4(0x1)
	bool _ignoreAimOffsets : 1;  // 0xEC4(0x1)
	uint8_t  _prisonerMontageBlendType;  // 0xEC5(0x1)
	char pad_3782_1 : 7;  // 0xEC6(0x1)
	bool _isAimingBow : 1;  // 0xEC6(0x1)
	char pad_3783[1];  // 0xEC7(0x1)
	float _bowArmsShakeValue;  // 0xEC8(0x4)
	char pad_3788_1 : 7;  // 0xECC(0x1)
	bool _isScoping : 1;  // 0xECC(0x1)
	char pad_3789[83];  // 0xECD(0x53)
	struct TSet<UPrisonerResponseIdle*> _responseIdleClassReferences;  // 0xF20(0x50)
	char pad_3952[48];  // 0xF70(0x30)
	char pad_4000_1 : 7;  // 0xFA0(0x1)
	bool _shouldUpperBodyBeUsedAsFullBodyInIdle : 1;  // 0xFA0(0x1)
	char pad_4001_1 : 7;  // 0xFA1(0x1)
	bool _isPlayingInstrument : 1;  // 0xFA1(0x1)
	char pad_4002[6];  // 0xFA2(0x6)
	struct UAnimSequenceBase* _playingInstrumentIdleAnimation;  // 0xFA8(0x8)
	struct UAnimSequenceBase* _playingInstrumentPlayAnimation;  // 0xFB0(0x8)
	uint8_t  _playingInstrumentState;  // 0xFB8(0x1)
	char pad_4025_1 : 7;  // 0xFB9(0x1)
	bool _isCarryingItem : 1;  // 0xFB9(0x1)
	char pad_4026[6];  // 0xFBA(0x6)
	struct UAnimSequenceBase* _carryingItemIdleFPAnimation;  // 0xFC0(0x8)
	struct UAnimSequenceBase* _carryingItemIdleTPAnimation;  // 0xFC8(0x8)
	uint8_t  _carryingItemState;  // 0xFD0(0x1)
	char pad_4049_1 : 7;  // 0xFD1(0x1)
	bool _isMounted : 1;  // 0xFD1(0x1)
	char pad_4050[6];  // 0xFD2(0x6)
	struct UAnimSequenceBase* _mountedAnimation;  // 0xFD8(0x8)
	char pad_4064_1 : 7;  // 0xFE0(0x1)
	bool _isVehicleDriver : 1;  // 0xFE0(0x1)
	char pad_4065[7];  // 0xFE1(0x7)
	struct UBlendSpace* _vehicleDriverForwardIdleAnimation;  // 0xFE8(0x8)
	struct UAnimSequenceBase* _vehicleDriverForwardSteeringAnimation;  // 0xFF0(0x8)
	struct UAnimSequenceBase* _vehicleDriverForwardSteeringAnimationFP;  // 0xFF8(0x8)
	struct UBlendSpace* _vehicleDriverReverseIdleAnimation;  // 0x1000(0x8)
	struct UAnimSequenceBase* _vehicleDriverReverseSteeringAnimation;  // 0x1008(0x8)
	struct UAnimSequenceBase* _vehicleDriverReverseSteeringAnimationFP;  // 0x1010(0x8)
	struct UBlendSpace* _vehiclePassengerIdleAnimation;  // 0x1018(0x8)
	float _vehicleSpeed;  // 0x1020(0x4)
	float _vehicleSpeedKph;  // 0x1024(0x4)
	float _vehicleBumpiness;  // 0x1028(0x4)
	float _vehicleDriverSteeringAnimationTime;  // 0x102C(0x4)
	float _vehicleDriverSteeringAnimationTimeInterpSpeed;  // 0x1030(0x4)
	float _vehicleThrottleAmount;  // 0x1034(0x4)
	float _vehicleBrakeAmount;  // 0x1038(0x4)
	float _vehicleHandbrakeAmount;  // 0x103C(0x4)
	float _vehicleSteerAmount;  // 0x1040(0x4)
	char pad_4164_1 : 7;  // 0x1044(0x1)
	bool _isSledgeAcceleratingForward : 1;  // 0x1044(0x1)
	char pad_4165_1 : 7;  // 0x1045(0x1)
	bool _isSledgeAcceleratingBackward : 1;  // 0x1045(0x1)
	char pad_4166[2];  // 0x1046(0x2)
	float _sledgeSlidingThresholdSpeed;  // 0x1048(0x4)
	char pad_4172_1 : 7;  // 0x104C(0x1)
	bool _isSledgeSliding : 1;  // 0x104C(0x1)
	char pad_4173[3];  // 0x104D(0x3)
	struct UAnimSequenceBase* _bowArmsShakeAnimation;  // 0x1050(0x8)
	float _weaponBreathFactor;  // 0x1058(0x4)
	float _weaponAimDownTheSightsStillBlendFactor;  // 0x105C(0x4)
	char pad_4192_1 : 7;  // 0x1060(0x1)
	bool _areHandsBound : 1;  // 0x1060(0x1)
	char pad_4193[7];  // 0x1061(0x7)
	struct UAnimSequenceBase* _handsBoundIdleFPAnimation;  // 0x1068(0x8)
	struct UAnimSequenceBase* _handsBoundIdleTPAnimation;  // 0x1070(0x8)
	char pad_4216_1 : 7;  // 0x1078(0x1)
	bool _isResting : 1;  // 0x1078(0x1)
	char pad_4217[7];  // 0x1079(0x7)
	struct UAnimSequenceBase* _restingAnimation;  // 0x1080(0x8)
	float _restingFeetOffset;  // 0x1088(0x4)
	float _cameraToActorRotationDeltaYaw;  // 0x108C(0x4)
	float _cameraToActorRotationDeltaPitch;  // 0x1090(0x4)
	uint8_t  _vehicleWeaponAimingStance;  // 0x1094(0x1)
	char pad_4245_1 : 7;  // 0x1095(0x1)
	bool _useMountedFirstPersonWeaponAimingParameters : 1;  // 0x1095(0x1)
	char pad_4246[2];  // 0x1096(0x2)
	struct FVector _vehicleWAPLocationOffsetDefaultStanceFP;  // 0x1098(0xC)
	struct FVector _vehicleWAPLocationOffsetLeaningStanceFP;  // 0x10A4(0xC)
	char pad_4272_1 : 7;  // 0x10B0(0x1)
	bool _useMountedThirdPersonWeaponAimingParameters : 1;  // 0x10B0(0x1)
	char pad_4273[7];  // 0x10B1(0x7)
	struct UBlendSpace* _vehicleWAPAimOffsetTP;  // 0x10B8(0x8)
	char pad_4288_1 : 7;  // 0x10C0(0x1)
	bool _useVehicleWAPAimOffsetTP : 1;  // 0x10C0(0x1)
	char pad_4289[7];  // 0x10C1(0x7)
	struct UBlendSpace* _vehicleWAPAimOffsetDefaultStanceTP;  // 0x10C8(0x8)
	char pad_4304_1 : 7;  // 0x10D0(0x1)
	bool _useVehicleWAPAimOffsetDefaultStanceTP : 1;  // 0x10D0(0x1)
	char pad_4305[7];  // 0x10D1(0x7)
	struct UBlendSpace* _vehicleWAPAimOffsetLeaningStanceTP;  // 0x10D8(0x8)
	char pad_4320_1 : 7;  // 0x10E0(0x1)
	bool _useVehicleWAPAimOffsetLeaningStanceTP : 1;  // 0x10E0(0x1)
	char pad_4321_1 : 7;  // 0x10E1(0x1)
	bool _useVehicleWAPUpperBodyIdleTP : 1;  // 0x10E1(0x1)
	char pad_4322[6];  // 0x10E2(0x6)
	struct UAnimSequenceBase* _vehicleWAPUpperBodyIdleRelaxedTP;  // 0x10E8(0x8)
	struct UAnimSequenceBase* _vehicleWAPUpperBodyIdleAimingTP;  // 0x10F0(0x8)
	char pad_4344_1 : 7;  // 0x10F8(0x1)
	bool _useVehicleWAPLowerBodyIdleTP : 1;  // 0x10F8(0x1)
	char pad_4345[7];  // 0x10F9(0x7)
	struct UAnimSequenceBase* _vehicleWAPLowerBodyIdleRelaxedTP;  // 0x1100(0x8)
	struct UAnimSequenceBase* _vehicleWAPLowerBodyIdleAimingTP;  // 0x1108(0x8)
	struct UAnimSequenceBase* _vehicleWAPLowerBodyIdleRelaxedDefaultTP;  // 0x1110(0x8)
	struct UAnimSequenceBase* _vehicleWAPLowerBodyIdleAimingDefaultTP;  // 0x1118(0x8)
	struct UAnimSequenceBase* _vehicleWAPLowerBodyIdleRelaxedLeaningTP;  // 0x1120(0x8)
	struct UAnimSequenceBase* _vehicleWAPLowerBodyIdleAimingLeaningTP;  // 0x1128(0x8)
	char pad_4400_1 : 7;  // 0x1130(0x1)
	bool _isPlayingWAPStanceTransitionMontage : 1;  // 0x1130(0x1)
	char pad_4401_1 : 7;  // 0x1131(0x1)
	bool _isActivelyFishing : 1;  // 0x1131(0x1)
	char pad_4402_1 : 7;  // 0x1132(0x1)
	bool _isBaitingFish : 1;  // 0x1132(0x1)
	char pad_4403_1 : 7;  // 0x1133(0x1)
	bool _isGrappled : 1;  // 0x1133(0x1)
	char pad_4404_1 : 7;  // 0x1134(0x1)
	bool _useWeaponAimingDownTheSightsZeroRangeBlendSpace : 1;  // 0x1134(0x1)
	char pad_4405[3];  // 0x1135(0x3)
	struct UBlendSpace1D* _weaponAimingDownTheSightsZeroRangeBlendSpace;  // 0x1138(0x8)
	float _weaponZeroRange;  // 0x1140(0x4)
	char pad_4420_1 : 7;  // 0x1144(0x1)
	bool _isInPhotoMode : 1;  // 0x1144(0x1)
	char pad_4421_1 : 7;  // 0x1145(0x1)
	bool _hasHighHeels : 1;  // 0x1145(0x1)
	char pad_4422[10];  // 0x1146(0xA)

	void TakePenis(); // Function ConZ.PrisonerAnimInstance.TakePenis
	void ReleasePenis(); // Function ConZ.PrisonerAnimInstance.ReleasePenis
	void OnIdleStateExit(struct FAnimNode_StateMachine& Machine, int32_t prevStateIndex, int32_t nextStateIndex); // Function ConZ.PrisonerAnimInstance.OnIdleStateExit
	void OnIdleStateEntry(struct FAnimNode_StateMachine& Machine, int32_t prevStateIndex, int32_t nextStateIndex); // Function ConZ.PrisonerAnimInstance.OnIdleStateEntry
	bool IsCourseAngleSupportedByStartAndStopAnimations(float courseAngle); // Function ConZ.PrisonerAnimInstance.IsCourseAngleSupportedByStartAndStopAnimations
	bool IsAnyStanceTransitionActive(); // Function ConZ.PrisonerAnimInstance.IsAnyStanceTransitionActive
	float GetWeaponRelatedIdleStateAnimationPlayRateOnGameThread(); // Function ConZ.PrisonerAnimInstance.GetWeaponRelatedIdleStateAnimationPlayRateOnGameThread
	struct UAnimSequenceBase* GetWeaponAnimationPoseOnWorkerThread(uint8_t  animationPose, uint8_t  stance); // Function ConZ.PrisonerAnimInstance.GetWeaponAnimationPoseOnWorkerThread
	struct UBlendSpace* GetWeaponAimOffsetOnGameThread(uint8_t  prisonerAimOffsetType); // Function ConZ.PrisonerAnimInstance.GetWeaponAimOffsetOnGameThread
	float GetWeaponAimingNoisePlayRateOnGameThread(); // Function ConZ.PrisonerAnimInstance.GetWeaponAimingNoisePlayRateOnGameThread
	float GetWeaponAimingNoiseBlendValueOnGameThread(); // Function ConZ.PrisonerAnimInstance.GetWeaponAimingNoiseBlendValueOnGameThread
	float GetVehicleThrottleAmount(); // Function ConZ.PrisonerAnimInstance.GetVehicleThrottleAmount
	float GetVehicleSteerAmount(); // Function ConZ.PrisonerAnimInstance.GetVehicleSteerAmount
	float GetVehicleSpeedKph(); // Function ConZ.PrisonerAnimInstance.GetVehicleSpeedKph
	float GetVehicleSpeed(); // Function ConZ.PrisonerAnimInstance.GetVehicleSpeed
	struct UBlendSpace* GetVehiclePassengerIdleAnimation(); // Function ConZ.PrisonerAnimInstance.GetVehiclePassengerIdleAnimation
	float GetVehicleHandbrakeAmount(); // Function ConZ.PrisonerAnimInstance.GetVehicleHandbrakeAmount
	struct UBlendSpace* GetVehicleDriverForwardIdleAnimation(); // Function ConZ.PrisonerAnimInstance.GetVehicleDriverForwardIdleAnimation
	float GetVehicleBumpiness(); // Function ConZ.PrisonerAnimInstance.GetVehicleBumpiness
	float GetVehicleBrakeAmount(); // Function ConZ.PrisonerAnimInstance.GetVehicleBrakeAmount
	struct FRotator GetUpperEyelidRotationDelta(); // Function ConZ.PrisonerAnimInstance.GetUpperEyelidRotationDelta
	float GetStandLookBlendAlpha(); // Function ConZ.PrisonerAnimInstance.GetStandLookBlendAlpha
	float GetPlayRateFromSpeed(float speedInAnimation, float MinPlayRate, float MaxPlayRate); // Function ConZ.PrisonerAnimInstance.GetPlayRateFromSpeed
	float GetPenisSize(); // Function ConZ.PrisonerAnimInstance.GetPenisSize
	struct FRotator GetLowerEyelidRotationDelta(); // Function ConZ.PrisonerAnimInstance.GetLowerEyelidRotationDelta
	float GetLocomotionStateWeight(uint8_t  State); // Function ConZ.PrisonerAnimInstance.GetLocomotionStateWeight
	void GetLeanBlendWeights(float& Left, float& Right, float Multiplier, struct UCurveFloat* strengthBySpeedCurve); // Function ConZ.PrisonerAnimInstance.GetLeanBlendWeights
	float GetKnownCurveValueOnWorkerThread(uint8_t  Curve); // Function ConZ.PrisonerAnimInstance.GetKnownCurveValueOnWorkerThread
	bool GetIsVehicleDriver(); // Function ConZ.PrisonerAnimInstance.GetIsVehicleDriver
	float GetInPlaceTurningElapsedTimeRight(uint8_t  stance); // Function ConZ.PrisonerAnimInstance.GetInPlaceTurningElapsedTimeRight
	float GetInPlaceTurningElapsedTimeLeft(uint8_t  stance); // Function ConZ.PrisonerAnimInstance.GetInPlaceTurningElapsedTimeLeft
	float GetInPlaceTurningDirectionBlendAlpha(uint8_t  stance); // Function ConZ.PrisonerAnimInstance.GetInPlaceTurningDirectionBlendAlpha
	float GetInPlaceTurningBlendAlpha(uint8_t  stance); // Function ConZ.PrisonerAnimInstance.GetInPlaceTurningBlendAlpha
	struct FVector GetIKLegsRootOffsetVectorFromCardinalDirection(uint8_t  Value); // Function ConZ.PrisonerAnimInstance.GetIKLegsRootOffsetVectorFromCardinalDirection
	float GetFacialExpressionBlendWeightOnWorkerThread(uint8_t  facialExpression); // Function ConZ.PrisonerAnimInstance.GetFacialExpressionBlendWeightOnWorkerThread
	float GetFacialExpressionBlendWeightOnGameThread(uint8_t  facialExpression); // Function ConZ.PrisonerAnimInstance.GetFacialExpressionBlendWeightOnGameThread
	float GetCurrentLocomotionStateElapsedTime(); // Function ConZ.PrisonerAnimInstance.GetCurrentLocomotionStateElapsedTime
	uint8_t  GetCurrentLocomotionState(); // Function ConZ.PrisonerAnimInstance.GetCurrentLocomotionState
	uint8_t  GetCardinalDirectionFromCourseAngle(float Value); // Function ConZ.PrisonerAnimInstance.GetCardinalDirectionFromCourseAngle
	float GetBoxingTurnAngle(); // Function ConZ.PrisonerAnimInstance.GetBoxingTurnAngle
	float GetBoxingInPlaceTurningElapsedTimeRight(); // Function ConZ.PrisonerAnimInstance.GetBoxingInPlaceTurningElapsedTimeRight
	float GetBoxingInPlaceTurningElapsedTimeLeft(); // Function ConZ.PrisonerAnimInstance.GetBoxingInPlaceTurningElapsedTimeLeft
	float GetBoxingInPlaceTurningDirectionBlendAlpha(); // Function ConZ.PrisonerAnimInstance.GetBoxingInPlaceTurningDirectionBlendAlpha
	float GetBoxingInPlaceTurningBlendAlpha(); // Function ConZ.PrisonerAnimInstance.GetBoxingInPlaceTurningBlendAlpha
	struct UAnimSequenceBase* GetBowArmsShakeAnimationOnGameThread(uint8_t  stance); // Function ConZ.PrisonerAnimInstance.GetBowArmsShakeAnimationOnGameThread
	float FindTimeBeforeJumpApex(struct UAnimSequenceBase* AnimSequence, float distanceToApex); // Function ConZ.PrisonerAnimInstance.FindTimeBeforeJumpApex
	float FindTimeAtStoppingDistance(struct UAnimSequenceBase* AnimSequence, float stoppingDistance); // Function ConZ.PrisonerAnimInstance.FindTimeAtStoppingDistance
	float FindTimeAfterJumpApex(struct UAnimSequenceBase* AnimSequence, float distanceToApex); // Function ConZ.PrisonerAnimInstance.FindTimeAfterJumpApex
	void DeactivateFacialExpressionOnGameThread(uint8_t  facialExpression); // Function ConZ.PrisonerAnimInstance.DeactivateFacialExpressionOnGameThread
	void DeactivateAllFacialExpressionsOnGameThread(); // Function ConZ.PrisonerAnimInstance.DeactivateAllFacialExpressionsOnGameThread
	void Blink(); // Function ConZ.PrisonerAnimInstance.Blink
	void AnimNotify_TakePenis(); // Function ConZ.PrisonerAnimInstance.AnimNotify_TakePenis
	void AnimNotify_TakeItemInHands(struct UAnimNotify* Notify); // Function ConZ.PrisonerAnimInstance.AnimNotify_TakeItemInHands
	void AnimNotify_RFootDown(); // Function ConZ.PrisonerAnimInstance.AnimNotify_RFootDown
	void AnimNotify_RemoveItemFromHands(struct UAnimNotify* Notify); // Function ConZ.PrisonerAnimInstance.AnimNotify_RemoveItemFromHands
	void AnimNotify_ReleasePenis(); // Function ConZ.PrisonerAnimInstance.AnimNotify_ReleasePenis
	void AnimNotify_LFootDown(); // Function ConZ.PrisonerAnimInstance.AnimNotify_LFootDown
	void AnimNotify_EnableCapsuleCollision(struct UAnimNotify* Notify); // Function ConZ.PrisonerAnimInstance.AnimNotify_EnableCapsuleCollision
	void AnimNotify_DisableCapsuleCollision(struct UAnimNotify* Notify); // Function ConZ.PrisonerAnimInstance.AnimNotify_DisableCapsuleCollision
	void ActivateFacialExpressionOnGameThread(uint8_t  facialExpression, float BlendInDuration, float Duration, float BlendOutDuration, float blendWeightMultiplier); // Function ConZ.PrisonerAnimInstance.ActivateFacialExpressionOnGameThread
}; 



// Class ConZ.VehicleAttachment
// Size: 0x310(Inherited: 0x28) 
struct UVehicleAttachment : public UObject
{
	char pad_40[16];  // 0x28(0x10)
	struct FName ParentSocket;  // 0x38(0x8)
	struct FVehicleAttachmentMeshSetup MeshSetup;  // 0x40(0x90)
	char pad_208[16];  // 0xD0(0x10)
	struct FVehicleAttachmentMeshSetup QueryMeshSetup;  // 0xE0(0x90)
	char pad_368[8];  // 0x170(0x8)
	struct TArray<struct FVehicleAttachmentAdditionalSocket> AdditionalSockets;  // 0x178(0x10)
	float InstallDuration;  // 0x188(0x4)
	float RepairDuration;  // 0x18C(0x4)
	float RemoveDuration;  // 0x190(0x4)
	char pad_404[4];  // 0x194(0x4)
	struct UWidgetComponent* HealthDisplay;  // 0x198(0x8)
	struct FText _displayName;  // 0x1A0(0x18)
	char pad_440_1 : 7;  // 0x1B8(0x1)
	bool _canEverBeRemoved : 1;  // 0x1B8(0x1)
	char pad_441[7];  // 0x1B9(0x7)
	struct TArray<struct FVehicleAttachmentSlot> _slots;  // 0x1C0(0x10)
	char pad_464_1 : 7;  // 0x1D0(0x1)
	bool _isIndestructible : 1;  // 0x1D0(0x1)
	char pad_465_1 : 7;  // 0x1D1(0x1)
	bool _shouldBeRemovedFromVehicleWhenDestroyed : 1;  // 0x1D1(0x1)
	char pad_466[2];  // 0x1D2(0x2)
	struct FGameplayTag _requiredServiceToolTag;  // 0x1D4(0x8)
	char pad_476[20];  // 0x1DC(0x14)
	int32_t _parentId;  // 0x1F0(0x4)
	int32_t _parentSlotIndex;  // 0x1F4(0x4)
	struct UMaterialInstanceDynamic* _serviceModeMaterial;  // 0x1F8(0x8)
	double _mileage;  // 0x200(0x8)
	char pad_520[1];  // 0x208(0x1)
	char pad_521_1 : 7;  // 0x209(0x1)
	bool _isSupportedForNetworking : 1;  // 0x209(0x1)
	char pad_522[2];  // 0x20A(0x2)
	int32_t _id;  // 0x20C(0x4)
	char pad_528[8];  // 0x210(0x8)
	struct TArray<struct UMaterialInterface*> _cachedMeshMaterials;  // 0x218(0x10)
	float _maxHealth;  // 0x228(0x4)
	float _health;  // 0x22C(0x4)
	float _hardness;  // 0x230(0x4)
	char pad_564[4];  // 0x234(0x4)
	uint64_t _miscState;  // 0x238(0x8)
	float _energyLossMultiplier;  // 0x240(0x4)
	char pad_580[4];  // 0x244(0x4)
	struct TMap<UVehicleAttachment*, struct FDamageAdjacentAttachment> _damageAdjacentAttachments;  // 0x248(0x50)
	char pad_664[16];  // 0x298(0x10)
	float _maximumCollisionDamageAccumulation;  // 0x2A8(0x4)
	char pad_684[4];  // 0x2AC(0x4)
	struct TSoftClassPtr<UObject> AttachmentItemClass;  // 0x2B0(0x28)
	char pad_728[32];  // 0x2D8(0x20)
	char pad_760_1 : 7;  // 0x2F8(0x1)
	bool _isServiceRestrictedToAcceptableModes : 1;  // 0x2F8(0x1)
	char pad_761[7];  // 0x2F9(0x7)
	struct TArray<struct FGameplayTag> _acceptableServiceModes;  // 0x300(0x10)

	void OnRep_MiscState(); // Function ConZ.VehicleAttachment.OnRep_MiscState
	void OnRep_Health(); // Function ConZ.VehicleAttachment.OnRep_Health
	void OnHit(struct UPrimitiveComponent* HitComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, struct FVector NormalImpulse, struct FHitResult& Hit); // Function ConZ.VehicleAttachment.OnHit
}; 



// Class ConZ.AdminCommand_SetPrisonerStamina
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetPrisonerStamina : public UAdminCommand
{

}; 



// Class ConZ.AdminCommandsStatics
// Size: 0x28(Inherited: 0x28) 
struct UAdminCommandsStatics : public UBlueprintFunctionLibrary
{

}; 



// Class ConZ.AnimStatics
// Size: 0x28(Inherited: 0x28) 
struct UAnimStatics : public UBlueprintFunctionLibrary
{

}; 



// Class ConZ.DcxWheeledVehicleAnimInstance
// Size: 0xA90(Inherited: 0xA50) 
struct UDcxWheeledVehicleAnimInstance : public UDcxVehicleAnimInstance
{
	uint8_t  EngineState;  // 0xA48(0x1)
	char pad_2641_1 : 7;  // 0xA51(0x1)
	bool IsEngineRunning : 1;  // 0xA49(0x1)
	float EngineRpm;  // 0xA4C(0x4)
	float EngineRpmInterpSpeed;  // 0xA50(0x4)
	float Speed;  // 0xA54(0x4)
	float SpeedKph;  // 0xA58(0x4)
	float MaxSteeringWheelSteerAngle;  // 0xA5C(0x4)
	float SteeringWheelSteerAngleInterpSpeed;  // 0xA60(0x4)
	float CurrentSteeringWheelSteerAngle;  // 0xA64(0x4)
	struct TArray<float> DoorOpenPercentage;  // 0xA68(0x10)
	struct TArray<float> DoorWindowOpenPercentage;  // 0xA78(0x10)
	char pad_2702[2];  // 0xA8E(0x2)

}; 



// Class ConZ.GameResourceContainer
// Size: 0x28(Inherited: 0x28) 
struct UGameResourceContainer : public UInterface
{

}; 



// Class ConZ.AdminCommand_SetReplishableResourceAmount
// Size: 0x98(Inherited: 0x88) 
struct UAdminCommand_SetReplishableResourceAmount : public UAdminCommand
{
	float _defaultAreaOfEffect;  // 0x88(0x4)
	float _minAreaOfEffect;  // 0x8C(0x4)
	float _maxAreaOfEffect;  // 0x90(0x4)
	char pad_148[4];  // 0x94(0x4)

}; 



// Class ConZ.PrisonerActionResuscitate
// Size: 0x110(Inherited: 0x108) 
struct UPrisonerActionResuscitate : public UPrisonerAction
{
	char pad_264[8];  // 0x108(0x8)

}; 



// Class ConZ.CookingIngredientInfoWidget
// Size: 0x2C0(Inherited: 0x260) 
struct UCookingIngredientInfoWidget : public UUserWidget
{
	char pad_608[16];  // 0x260(0x10)
	struct FLinearColor _unselectedBorderColor;  // 0x270(0x10)
	struct FLinearColor _selectedBorderColor;  // 0x280(0x10)
	struct UCookingInfoButton* _infoButton;  // 0x290(0x8)
	struct UTextBlock* _amountText;  // 0x298(0x8)
	struct UImage* _ingredientIcon;  // 0x2A0(0x8)
	struct UTextBlock* _titleText;  // 0x2A8(0x8)
	struct UImage* _border;  // 0x2B0(0x8)
	char pad_696[8];  // 0x2B8(0x8)

}; 



// Class ConZ.AdminCommand_SetSkillLevel
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetSkillLevel : public UAdminCommand
{

}; 



// Class ConZ.Mechanic
// Size: 0x9C0(Inherited: 0x930) 
struct AMechanic : public ATrader
{
	struct UMechanicCommonData* _commonData;  // 0x928(0x8)
	float _clientUpdatePeriod;  // 0x930(0x4)
	int32_t _clientUpdateMaxSize;  // 0x934(0x4)
	char pad_2368[128];  // 0x940(0x80)

}; 



// Class ConZ.AdminCommand_SetSuperJump
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetSuperJump : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_SetTime
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetTime : public UAdminCommand
{

}; 



// Class ConZ.HUDNotificationDescription
// Size: 0x60(Inherited: 0x40) 
struct UHUDNotificationDescription : public UNotificationDescription
{
	struct FText Message;  // 0x40(0x18)
	struct UAkAudioEvent* AudioEvent;  // 0x58(0x8)

}; 



// Class ConZ.AdminCommand_SetTimeSpeed
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetTimeSpeed : public UAdminCommand
{

}; 



// Class ConZ.PrisonerActionTreatPatientDescription
// Size: 0x48(Inherited: 0x38) 
struct UPrisonerActionTreatPatientDescription : public UPrisonerActionDescription
{
	char pad_56[16];  // 0x38(0x10)

}; 



// Class ConZ.PrisonerFishingComponent
// Size: 0xD0(Inherited: 0xC0) 
struct UPrisonerFishingComponent : public UCharacterActionComponent
{
	uint8_t  _fishingState;  // 0xC0(0x1)
	char pad_193[15];  // 0xC1(0xF)

	void OnRep_FishingState(); // Function ConZ.PrisonerFishingComponent.OnRep_FishingState
}; 



// Class ConZ.AdminCommand_SetWeather
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetWeather : public UAdminCommand
{

}; 



// Class ConZ.PrisonerActionRemoveWeedDescription
// Size: 0x48(Inherited: 0x38) 
struct UPrisonerActionRemoveWeedDescription : public UPrisonerActionDescription
{
	char pad_56[16];  // 0x38(0x10)

}; 



// Class ConZ.TrapItemState
// Size: 0x150(Inherited: 0x100) 
struct UTrapItemState : public UItemState
{
	char pad_256_1 : 7;  // 0x100(0x1)
	bool IsArmed : 1;  // 0x100(0x1)
	char pad_257_1 : 7;  // 0x101(0x1)
	bool CanBeTriggered : 1;  // 0x101(0x1)
	uint8_t  CurrentTrigger;  // 0x102(0x1)
	char pad_259[5];  // 0x103(0x5)
	struct FDbIntegerId LastTriggerOwner;  // 0x108(0x8)
	struct FDbIntegerId LastArmerId;  // 0x110(0x8)
	float Quality;  // 0x118(0x4)
	char pad_284_1 : 7;  // 0x11C(0x1)
	bool WasTriggered : 1;  // 0x11C(0x1)
	char pad_285[3];  // 0x11D(0x3)
	int32_t NumRemainingDefuseAttempts;  // 0x120(0x4)
	float OwnerlessElapsedTime;  // 0x124(0x4)
	char pad_296_1 : 7;  // 0x128(0x1)
	bool PendingDestroy : 1;  // 0x128(0x1)
	char pad_297[7];  // 0x129(0x7)
	struct UTriggerComponentState* Trigger;  // 0x130(0x8)
	struct TArray<char> TriggerData;  // 0x138(0x10)
	char pad_328[8];  // 0x148(0x8)

}; 



// Class ConZ.PlaceableActorModularBaseBuildingFoundation
// Size: 0x668(Inherited: 0x658) 
struct APlaceableActorModularBaseBuildingFoundation : public APlaceableActorModularBaseBuilding
{
	struct TArray<struct FLineTraceSocketPair> _lineTraceSockets;  // 0x658(0x10)

}; 



// Class ConZ.FishingAttachmentWire
// Size: 0x9A0(Inherited: 0x930) 
struct AFishingAttachmentWire : public AFishingAttachment
{
	struct FName ReelSocketName;  // 0x930(0x8)
	struct UFishingWireComponent* _wireComponent;  // 0x938(0x8)
	UFishingWireComponent* _wireComponentClass;  // 0x940(0x8)
	struct UParticleSystemComponent* _rippleParticleSystemComponent;  // 0x948(0x8)
	float _visibilityFactor;  // 0x950(0x4)
	float _wireWeightThreshold;  // 0x954(0x4)
	float _wireThickness;  // 0x958(0x4)
	float _minWireLength;  // 0x95C(0x4)
	float _maxWireLength;  // 0x960(0x4)
	float _reelInTensionThreshold;  // 0x964(0x4)
	float _wireBreakThreshold;  // 0x968(0x4)
	float _instantWireBreakThreshold;  // 0x96C(0x4)
	float _wireBreakTimerThreshold;  // 0x970(0x4)
	float _wireStrength;  // 0x974(0x4)
	char pad_2424_1 : 7;  // 0x978(0x1)
	bool _simulate : 1;  // 0x978(0x1)
	char pad_2425[39];  // 0x979(0x27)

}; 



// Class ConZ.AdminCommand_SetWeatherControllerOverrideActive
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetWeatherControllerOverrideActive : public UAdminCommand
{

}; 



// Class ConZ.AmbientSounds
// Size: 0x2F8(Inherited: 0x220) 
struct AAmbientSounds : public AActor
{
	float MinCameraLocationDeltaForUpdate;  // 0x220(0x4)
	struct FGameplayTag ForestMask;  // 0x224(0x8)
	float ForestMaskSearchRadius;  // 0x22C(0x4)
	struct UAkAudioEvent* CoastalForestAudioEvent;  // 0x230(0x8)
	struct UAkAudioEvent* ContinentalForest1AudioEvent;  // 0x238(0x8)
	struct UAkAudioEvent* ContinentalForest2AudioEvent;  // 0x240(0x8)
	struct UAkAudioEvent* ContinentalForest3AudioEvent;  // 0x248(0x8)
	struct UAkAudioEvent* UndergroundAudioEvent;  // 0x250(0x8)
	struct FGameplayTag CityMask;  // 0x258(0x8)
	float CityMaskSearchRadius;  // 0x260(0x4)
	char pad_612[4];  // 0x264(0x4)
	struct UAkAudioEvent* CityAudioEvent;  // 0x268(0x8)
	struct UAkAudioEvent* LargeVillageAudioEvent;  // 0x270(0x8)
	struct UAkAudioEvent* SmallVillageAudioEvent;  // 0x278(0x8)
	struct UAkAudioEvent* IndustrialAreaAudioEvent;  // 0x280(0x8)
	char pad_648[112];  // 0x288(0x70)

}; 



// Class ConZ.AdminCommand_SetWeatherControllerOverrideValue
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetWeatherControllerOverrideValue : public UAdminCommand
{

}; 



// Class ConZ.HandheldLightItemState
// Size: 0x110(Inherited: 0x100) 
struct UHandheldLightItemState : public UItemState
{
	int32_t CurrentLightAngleIndex;  // 0x100(0x4)
	float CurrentLightIntensity;  // 0x104(0x4)
	char pad_264[8];  // 0x108(0x8)

}; 



// Class ConZ.DcxBicycle
// Size: 0xE30(Inherited: 0xDB0) 
struct ADcxBicycle : public ADcxBike
{
	float _baseStrengthChangeRate;  // 0xDA8(0x4)
	struct UCurveFloat* _strengthChangeRateFactorVsVehicleSpeedKmh;  // 0xDB0(0x8)
	struct UCurveFloat* _strengthChangeRateFactorVsGroundSlope;  // 0xDB8(0x8)
	float _baseConstitutionChangeRate;  // 0xDC0(0x4)
	struct UCurveFloat* _constitutionChangeRateFactorVsVehicleSpeedKmh;  // 0xDC8(0x8)
	struct UCurveFloat* _constitutionChangeRateFactorVsGroundSlope;  // 0xDD0(0x8)
	float _baseRunningSkillExperienceGainRate;  // 0xDD8(0x4)
	char pad_3548[4];  // 0xDDC(0x4)
	struct UCurveFloat* _runningSkillExperienceGainRateFactorVsVehicleSpeedKmh;  // 0xDE0(0x8)
	struct UCurveFloat* _runningSkillExperienceGainRateFactorVsGroundSlope;  // 0xDE8(0x8)
	float _baseEnduranceSkillExperienceGainRate;  // 0xDF0(0x4)
	char pad_3572[4];  // 0xDF4(0x4)
	struct UCurveFloat* _enduranceSkillExperienceGainRateFactorVsVehicleSpeedKmh;  // 0xDF8(0x8)
	struct UCurveFloat* _enduranceSkillExperienceGainRateFactorVsGroundSlope;  // 0xE00(0x8)
	float _baseActionDifficulty;  // 0xE08(0x4)
	char pad_3596[4];  // 0xE0C(0x4)
	struct UCurveFloat* _actionDifficultyFactorVsVehicleSpeedKmh;  // 0xE10(0x8)
	struct UCurveFloat* _actionDifficultyFactorVsGroundSlope;  // 0xE18(0x8)
	float _speedThresholdForAINoise;  // 0xE20(0x4)
	char pad_3620[12];  // 0xE24(0xC)

}; 



// Class ConZ.VehicleHudWidget
// Size: 0x310(Inherited: 0x260) 
struct UVehicleHudWidget : public UUserWidget
{
	struct UVehicleMountSlotIndicators* _mountSlotIndicators;  // 0x260(0x8)
	char pad_616[8];  // 0x268(0x8)
	struct UTextBlock* Speed1s;  // 0x270(0x8)
	struct UTextBlock* Speed10s;  // 0x278(0x8)
	struct UTextBlock* Speed100s;  // 0x280(0x8)
	struct UTextBlock* Gear;  // 0x288(0x8)
	struct UProgressBar* HealthBar;  // 0x290(0x8)
	struct UProgressBar* FuelBar;  // 0x298(0x8)
	struct UProgressBar* BatteryBar;  // 0x2A0(0x8)
	struct UImage* EngineBrokenIndicator;  // 0x2A8(0x8)
	struct UWidgetAnimation* Blink;  // 0x2B0(0x8)
	struct UOverlay* Overlay_1;  // 0x2B8(0x8)
	struct UTextBlock* TextBlock_2;  // 0x2C0(0x8)
	struct UTextBlock* TextBlock_3;  // 0x2C8(0x8)
	struct USizeBox* SizeBox_3;  // 0x2D0(0x8)
	struct USizeBox* SizeBox_4;  // 0x2D8(0x8)
	struct UImage* Image_1;  // 0x2E0(0x8)
	struct UImage* Image_2;  // 0x2E8(0x8)
	struct UImage* Image_3;  // 0x2F0(0x8)
	struct UImage* Image_4;  // 0x2F8(0x8)
	struct UImage* Image_5;  // 0x300(0x8)
	struct UTextBlock* kmh;  // 0x308(0x8)

}; 



// Class ConZ.AdminCommand_ShouldChainTeleportToVehicles
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ShouldChainTeleportToVehicles : public UAdminCommand
{

}; 



// Class ConZ.BaseBuildingStatics
// Size: 0x28(Inherited: 0x28) 
struct UBaseBuildingStatics : public UBlueprintFunctionLibrary
{

}; 



// Class ConZ.AdminCommand_ShouldShowOtherPlayerLocations
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ShouldShowOtherPlayerLocations : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_ShowBaseBuildingDebug
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ShowBaseBuildingDebug : public UAdminCommand
{

}; 



// Class ConZ.FishingAttachment
// Size: 0x930(Inherited: 0x910) 
struct AFishingAttachment : public AItem
{
	struct UStaticMesh* _staticMeshWhenAttached;  // 0x910(0x8)
	char pad_2328[24];  // 0x918(0x18)

	void Unequip(); // Function ConZ.FishingAttachment.Unequip
	struct UStaticMesh* GetStaticMeshWhenAttached(); // Function ConZ.FishingAttachment.GetStaticMeshWhenAttached
	struct USkeletalMesh* GetSkeletalMeshWhenAttached(); // Function ConZ.FishingAttachment.GetSkeletalMeshWhenAttached
	struct AFishingRod* GetOwningFishingRod(); // Function ConZ.FishingAttachment.GetOwningFishingRod
	void Equip(struct AFishingRod* FishingRod); // Function ConZ.FishingAttachment.Equip
}; 



// Class ConZ.AdvancedCraftingObjective
// Size: 0x368(Inherited: 0x348) 
struct AAdvancedCraftingObjective : public ACraftingObjective
{
	struct UCraftableItem* _craftableItem;  // 0x348(0x8)
	struct AMissionDialogueManager* _dialogueManager;  // 0x350(0x8)
	struct UDialogueData* _dialogueData;  // 0x358(0x8)
	char pad_864[8];  // 0x360(0x8)

	void OnTabMenuOpenedHandler(uint8_t  tabMode); // Function ConZ.AdvancedCraftingObjective.OnTabMenuOpenedHandler
}; 



// Class ConZ.AdminCommand_ShowFlagLocations
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ShowFlagLocations : public UAdminCommand
{

}; 



// Class ConZ.PrisonerBodyConditionOrSymptomSideEffect_PerformanceScoreModifier
// Size: 0xC0(Inherited: 0xC0) 
struct UPrisonerBodyConditionOrSymptomSideEffect_PerformanceScoreModifier : public UPrisonerBodyConditionOrSymptomSideEffect_AbstractModifier
{

}; 



// Class ConZ.GardenCraftableItem
// Size: 0x230(Inherited: 0x1F0) 
struct UGardenCraftableItem : public UPlaceableCraftableItem
{
	UObject* PlaceableItemClass;  // 0x1F0(0x8)
	struct UTexture2D* Icon;  // 0x1F8(0x8)
	struct FText Caption;  // 0x200(0x18)
	struct FText Description;  // 0x218(0x18)

}; 



// Class ConZ.Metabolism_ICU_SPO2_Stats
// Size: 0x290(Inherited: 0x278) 
struct UMetabolism_ICU_SPO2_Stats : public UMetabolism_ICU_Expandable_Stats
{
	struct UTextBlock* _spo2MinMax;  // 0x278(0x8)
	struct UTextBlock* _spo2TextValue;  // 0x280(0x8)
	struct UProgressBar* _spo2ProgBar;  // 0x288(0x8)

}; 



// Class ConZ.AdminCommand_ShowNameplates
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ShowNameplates : public UAdminCommand
{

}; 



// Class ConZ.AnimNotify_PlaySoundBySurface
// Size: 0x48(Inherited: 0x38) 
struct UAnimNotify_PlaySoundBySurface : public UAnimNotify
{
	struct UAkAudioEvent* AudioEvent;  // 0x38(0x8)
	char ECollisionChannel TraceChannel;  // 0x40(0x1)
	char pad_65[7];  // 0x41(0x7)

}; 



// Class ConZ.CleaningItemTag
// Size: 0x30(Inherited: 0x30) 
struct UCleaningItemTag : public UBaseItemTag
{

}; 



// Class ConZ.DropZoneEquipmentTable
// Size: 0x238(Inherited: 0x220) 
struct ADropZoneEquipmentTable : public AActor
{
	struct TArray<struct AItem*> _trackedItems;  // 0x220(0x10)
	char pad_560[8];  // 0x230(0x8)

	void UntrackItem(struct AItem* Item); // Function ConZ.DropZoneEquipmentTable.UntrackItem
	void TrackItem(struct AItem* Item); // Function ConZ.DropZoneEquipmentTable.TrackItem
	void PerformItemCleanup(); // Function ConZ.DropZoneEquipmentTable.PerformItemCleanup
	void OnTrackedItemDestroyed(struct AActor* Actor); // Function ConZ.DropZoneEquipmentTable.OnTrackedItemDestroyed
	void BeginCleaningItems(); // Function ConZ.DropZoneEquipmentTable.BeginCleaningItems
}; 



// Class ConZ.FireworksTrapItem
// Size: 0xA90(Inherited: 0xA60) 
struct AFireworksTrapItem : public ATrapItem
{
	struct UAkAudioEvent* _triggerSound;  // 0xA60(0x8)
	int32_t _numShells;  // 0xA68(0x4)
	float _shellLaunchPeriod;  // 0xA6C(0x4)
	float _detonationDelay;  // 0xA70(0x4)
	char pad_2676[13];  // 0xA74(0xD)
	char pad_2689_1 : 7;  // 0xA81(0x1)
	bool _isFiring : 1;  // 0xA81(0x1)
	char pad_2690[14];  // 0xA82(0xE)

	void OnRep_IsFiring(); // Function ConZ.FireworksTrapItem.OnRep_IsFiring
	void LaunchShell(); // Function ConZ.FireworksTrapItem.LaunchShell
	void Detonate(); // Function ConZ.FireworksTrapItem.Detonate
}; 



// Class ConZ.AdminCommand_ShowRespawnTimes
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ShowRespawnTimes : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_ShowVehicleDebug
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ShowVehicleDebug : public UAdminCommand
{

}; 



// Class ConZ.CheckOccludedDetectablePlayersAction
// Size: 0xA8(Inherited: 0xA0) 
struct UCheckOccludedDetectablePlayersAction : public USkillAction
{
	char pad_160[8];  // 0xA0(0x8)

}; 



// Class ConZ.ClearStovePipe
// Size: 0xC0(Inherited: 0xB8) 
struct UClearStovePipe : public UWeaponActionClearMalfunctionSequence
{
	struct FName MontageEndSectionName;  // 0xB8(0x8)

}; 



// Class ConZ.WarningNotification
// Size: 0x30(Inherited: 0x30) 
struct UWarningNotification : public UConZNotification
{

}; 



// Class ConZ.AdminCommand_ShowVehicleInfo
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ShowVehicleInfo : public UAdminCommand
{

}; 



// Class ConZ.CentralBuildingPanel
// Size: 0x268(Inherited: 0x260) 
struct UCentralBuildingPanel : public UUserWidget
{
	struct UPlacedPlaceableWidget* _placedPlaceableWidget;  // 0x260(0x8)

}; 



// Class ConZ.StartLocation
// Size: 0x258(Inherited: 0x250) 
struct AStartLocation : public APlayerStart
{
	char TypeFlags;  // 0x250(0x1)
	char pad_593_1 : 7;  // 0x251(0x1)
	bool IsDisabled : 1;  // 0x251(0x1)
	char pad_594[6];  // 0x252(0x6)

}; 



// Class ConZ.AnimNotify_ClimbingFinished
// Size: 0x38(Inherited: 0x38) 
struct UAnimNotify_ClimbingFinished : public UAnimNotify
{

}; 



// Class ConZ.ComboBoxStringWithIndexing
// Size: 0xE10(Inherited: 0xE00) 
struct UComboBoxStringWithIndexing : public UComboBoxString
{
	char pad_3584[16];  // 0xE00(0x10)

}; 



// Class ConZ.AdminCommand_ShowVehicleLocations
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ShowVehicleLocations : public UAdminCommand
{

}; 



// Class ConZ.ItemActionSequenceLoadMagazine_RPKDrum
// Size: 0x98(Inherited: 0x90) 
struct UItemActionSequenceLoadMagazine_RPKDrum : public UItemActionSequenceLoadMagazine
{
	char pad_144[8];  // 0x90(0x8)

}; 



// Class ConZ.PrisonerActionSearchGardenSlot
// Size: 0x118(Inherited: 0x118) 
struct UPrisonerActionSearchGardenSlot : public UPrisonerActionSearchObject
{

}; 



// Class ConZ.TrashNamedCarouselWidget
// Size: 0x3C0(Inherited: 0x260) 
struct UTrashNamedCarouselWidget : public UUserWidget
{
	char pad_608[48];  // 0x260(0x30)
	struct FMulticastInlineDelegate ValueChangedTemp_DONOTUSE;  // 0x290(0x10)
	struct USizeBox* _nameBox;  // 0x2A0(0x8)
	struct UTextBlock* _name;  // 0x2A8(0x8)
	struct UTrashCarouselWidget* _carousel;  // 0x2B0(0x8)
	struct USelectionOverlayWidget* _focusBackground;  // 0x2B8(0x8)
	struct FString _label;  // 0x2C0(0x10)
	struct FText _mainLabel;  // 0x2D0(0x18)
	struct FSlateFontInfo _defaultFont;  // 0x2E8(0x58)
	char pad_832[88];  // 0x340(0x58)
	struct TArray<struct FString> _possibleValues;  // 0x398(0x10)
	struct TArray<struct FText> _carouselValues;  // 0x3A8(0x10)
	char pad_952[8];  // 0x3B8(0x8)

	void SetValue(int32_t Value); // Function ConZ.TrashNamedCarouselWidget.SetValue
	void SetName(struct FText Name); // Function ConZ.TrashNamedCarouselWidget.SetName
	void OnValueChanged(int32_t NewValue); // Function ConZ.TrashNamedCarouselWidget.OnValueChanged
	int32_t GetValue(); // Function ConZ.TrashNamedCarouselWidget.GetValue
}; 



// Class ConZ.IngredientsForRecipeWidget
// Size: 0x280(Inherited: 0x260) 
struct UIngredientsForRecipeWidget : public UUserWidget
{
	char pad_608[8];  // 0x260(0x8)
	struct UWrapBox* _ingredientsWrapBox;  // 0x268(0x8)
	UInteractiveIngredientWidget* _interactiveIngredientWidgetClass;  // 0x270(0x8)
	char pad_632[8];  // 0x278(0x8)

}; 



// Class ConZ.PrisonerActionDrinkFromReplenishableResource
// Size: 0x110(Inherited: 0x108) 
struct UPrisonerActionDrinkFromReplenishableResource : public UPrisonerAction
{
	char pad_264[8];  // 0x108(0x8)

}; 



// Class ConZ.PrisonerActionFillVehicleFuelWithItem
// Size: 0x118(Inherited: 0x108) 
struct UPrisonerActionFillVehicleFuelWithItem : public UPrisonerAction
{
	char pad_264[16];  // 0x108(0x10)

}; 



// Class ConZ.MotionTriggerComponent
// Size: 0x520(Inherited: 0x4D0) 
struct UMotionTriggerComponent : public UTriggerComponent
{
	struct FVector TriggerForwardVector;  // 0x4D0(0xC)
	float TriggerAngle;  // 0x4DC(0x4)
	float MotionDetectionSensitivity;  // 0x4E0(0x4)
	float MotionDetectionDepletionSpeed;  // 0x4E4(0x4)
	float _motionDetector;  // 0x4E8(0x4)
	char pad_1260[4];  // 0x4EC(0x4)
	struct UAkAudioEvent* _motionDetectorStartSound;  // 0x4F0(0x8)
	struct UAkAudioEvent* _motionDetectorEndSound;  // 0x4F8(0x8)
	char pad_1280[32];  // 0x500(0x20)

}; 



// Class ConZ.ConZAssetManager
// Size: 0x688(Inherited: 0x478) 
struct UConZAssetManager : public UAssetManager
{
	struct TArray<struct FImageAssetToLoad> _imageAssetsToLoad;  // 0x478(0x10)
	char pad_1160[80];  // 0x488(0x50)
	struct TMap<struct FName, struct ULWObjectSetup*> _lwobjectSetupByPrimaryAssetName;  // 0x4D8(0x50)
	char pad_1320[240];  // 0x528(0xF0)
	struct TArray<struct UPrisonerResponseIdle*> _prisonerResponseIdleCDOs;  // 0x618(0x10)
	struct TArray<struct UPrisonerBodyEffect*> _autoAddablePrisonerBodyEffectCDOs;  // 0x628(0x10)
	char pad_1592[80];  // 0x638(0x50)

}; 



// Class ConZ.AdminCommand_ShowWeaponInfo
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_ShowWeaponInfo : public UAdminCommand
{

}; 



// Class ConZ.TradeOutpostBuilding
// Size: 0x398(Inherited: 0x328) 
struct ATradeOutpostBuilding : public ABuilding
{
	char pad_808[48];  // 0x328(0x30)
	float _sedentaryNPCRelevancyDistance;  // 0x358(0x4)
	char pad_860[4];  // 0x35C(0x4)
	struct TArray<struct FSedentaryNPCMarker> _sedentaryNPCMarkers;  // 0x360(0x10)
	struct TArray<struct ASedentaryNPC*> _spawnedSedentaryNPCs;  // 0x370(0x10)
	char pad_896[24];  // 0x380(0x18)

}; 



// Class ConZ.AdminCommand_SpawnInventoryFullOf
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SpawnInventoryFullOf : public UAdminCommand
{

}; 



// Class ConZ.AmmunitionItem
// Size: 0x960(Inherited: 0x910) 
struct AAmmunitionItem : public AItem
{
	struct FGameplayTag AmmunitionTag;  // 0x910(0x8)
	struct FString AmmunitionTypeString;  // 0x918(0x10)
	AProjectile* projectileClass;  // 0x928(0x8)
	struct UStaticMesh* CartridgeMesh;  // 0x930(0x8)
	struct UStaticMesh* CasingMesh;  // 0x938(0x8)
	struct UStaticMesh* UsedBadRoundMesh;  // 0x940(0x8)
	float WeaponSpreadMultiplier;  // 0x948(0x4)
	int32_t MaxAmmoCount;  // 0x94C(0x4)
	int32_t _ammoCount;  // 0x950(0x4)
	int32_t _ammoCountOwnerHelper;  // 0x954(0x4)
	char pad_2392[8];  // 0x958(0x8)

	void SetAmmoCount(int32_t Count, uint8_t  broadcastRPCType); // Function ConZ.AmmunitionItem.SetAmmoCount
	void OnRep_AmmoCountOwnerHelper(); // Function ConZ.AmmunitionItem.OnRep_AmmoCountOwnerHelper
	void OnRep_AmmoCount(); // Function ConZ.AmmunitionItem.OnRep_AmmoCount
	void NetMulticast_SetAmmoCount(int32_t Count); // Function ConZ.AmmunitionItem.NetMulticast_SetAmmoCount
	float GetSpreadMultiplierForWeapon(struct AWeapon* Weapon); // Function ConZ.AmmunitionItem.GetSpreadMultiplierForWeapon
	int32_t GetAmmoCount(); // Function ConZ.AmmunitionItem.GetAmmoCount
	void Client_SetAmmoCount(int32_t Count); // Function ConZ.AmmunitionItem.Client_SetAmmoCount
}; 



// Class ConZ.AdminCommand_SilencePlayer
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SilencePlayer : public UAdminCommand
{

}; 



// Class ConZ.FogSphere
// Size: 0x230(Inherited: 0x220) 
struct AFogSphere : public AActor
{
	char pad_544_1 : 7;  // 0x220(0x1)
	bool _shouldExistOnDedicatedServer : 1;  // 0x220(0x1)
	char pad_545[7];  // 0x221(0x7)
	struct UCurveFloat* _densityVersusTimeOfDay;  // 0x228(0x8)

	void SetFogDensity(float Density); // Function ConZ.FogSphere.SetFogDensity
	void OnTimeOfDayChanged(struct AWeatherController2* sender); // Function ConZ.FogSphere.OnTimeOfDayChanged
}; 



// Class ConZ.InventoryItemComponent
// Size: 0x180(Inherited: 0xC8) 
struct UInventoryItemComponent : public UItemComponent
{
	char pad_200[8];  // 0xC8(0x8)
	int32_t _sizeX;  // 0xD0(0x4)
	int32_t _sizeY;  // 0xD4(0x4)
	int32_t _maxRowsPerPage;  // 0xD8(0x4)
	char pad_220[20];  // 0xDC(0x14)
	struct TArray<struct UInventoryItemComponentReplicatedPage*> _replicatedPages;  // 0xF0(0x10)
	char pad_256[128];  // 0x100(0x80)

	void OnRep_ReplicatedPages(); // Function ConZ.InventoryItemComponent.OnRep_ReplicatedPages
}; 



// Class ConZ.AdminCommand_Sleep
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_Sleep : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_SpawnAllItems
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SpawnAllItems : public UAdminCommand
{

}; 



// Class ConZ.HeatSourceLinkUserData
// Size: 0x38(Inherited: 0x28) 
struct UHeatSourceLinkUserData : public UAssetUserData
{
	int32_t _heatSourceIndex;  // 0x28(0x4)
	int32_t _cookingSlotIndex;  // 0x2C(0x4)
	char pad_48_1 : 7;  // 0x30(0x1)
	bool _sameHeatSourceCookingSlotIndex : 1;  // 0x30(0x1)
	char pad_49_1 : 7;  // 0x31(0x1)
	bool _linkAllCookingSlotsToHeatSource : 1;  // 0x31(0x1)
	char pad_50[6];  // 0x32(0x6)

}; 



// Class ConZ.AdminCommand_SpawnPrimaryActorAsset
// Size: 0x108(Inherited: 0x88) 
struct UAdminCommand_SpawnPrimaryActorAsset : public UAdminCommand
{
	struct FPrimaryAssetType _primaryAssetType;  // 0x88(0x8)
	struct TSet<struct FPrimaryAssetId> _primaryAssetsToExclude;  // 0x90(0x50)
	int32_t _countArgumentMinValue;  // 0xE0(0x4)
	int32_t _countArgumentMaxValue;  // 0xE4(0x4)
	struct FVector _spawnOffset;  // 0xE8(0xC)
	char pad_244[20];  // 0xF4(0x14)

}; 



// Class ConZ.ItemContainer
// Size: 0x350(Inherited: 0x220) 
struct AItemContainer : public AActor
{
	char pad_544[48];  // 0x220(0x30)
	struct USceneComponent* _rootComponent;  // 0x250(0x8)
	char pad_600_1 : 7;  // 0x258(0x1)
	bool _canBeForceUnlocked : 1;  // 0x258(0x1)
	char pad_601[3];  // 0x259(0x3)
	float _forceUnlockTime;  // 0x25C(0x4)
	float _forceUnlockMovementAcceptanceRadius;  // 0x260(0x4)
	char pad_612[12];  // 0x264(0xC)
	struct FUnlockLocation _unlockPositionMarker;  // 0x270(0x30)
	char pad_672[8];  // 0x2A0(0x8)
	struct TArray<UObject*> _upgradeItemsClasses;  // 0x2A8(0x10)
	struct TArray<struct ULockData*> _lockData;  // 0x2B8(0x10)
	char pad_712[16];  // 0x2C8(0x10)
	struct TArray<UObject*> _originalUpgradeItemClasses;  // 0x2D8(0x10)
	struct TArray<struct ULockData*> _originalLockData;  // 0x2E8(0x10)
	char pad_760_1 : 7;  // 0x2F8(0x1)
	bool _ignoreServerSettings : 1;  // 0x2F8(0x1)
	char pad_761[40];  // 0x2F9(0x28)
	char pad_801_1 : 7;  // 0x321(0x1)
	bool _disableSerialization : 1;  // 0x321(0x1)
	char pad_802_1 : 7;  // 0x322(0x1)
	bool _shouldBeResetOnNewSession : 1;  // 0x322(0x1)
	char pad_803[1];  // 0x323(0x1)
	struct FGameplayTag _famePointAwardTag;  // 0x324(0x8)
	char pad_812[36];  // 0x32C(0x24)

}; 



// Class ConZ.AdminCommand_SpawnAnimal
// Size: 0x108(Inherited: 0x108) 
struct UAdminCommand_SpawnAnimal : public UAdminCommand_SpawnPrimaryActorAsset
{

}; 



// Class ConZ.AdminCommand_SpawnDebugAnimalTrack
// Size: 0x90(Inherited: 0x88) 
struct UAdminCommand_SpawnDebugAnimalTrack : public UAdminCommand
{
	struct FPrimaryAssetType _primaryAssetType;  // 0x88(0x8)

}; 



// Class ConZ.ModularTooltipElement_Title
// Size: 0x2F0(Inherited: 0x2E8) 
struct UModularTooltipElement_Title : public UModularTooltipElement
{
	struct UTextBlock* _titleTextBlock;  // 0x2E8(0x8)

}; 



// Class ConZ.PrisonerBodySymptom_Disorientation
// Size: 0xC0(Inherited: 0xB8) 
struct UPrisonerBodySymptom_Disorientation : public UPrisonerBodySymptom
{
	float _maxSeverity;  // 0xB8(0x4)
	char pad_188[4];  // 0xBC(0x4)

}; 



// Class ConZ.WaypointWidgetBase
// Size: 0x2F8(Inherited: 0x260) 
struct UWaypointWidgetBase : public UUserWidget
{
	struct UTexture2D* IconTexture;  // 0x260(0x8)
	struct UTexture2D* AccentTexture;  // 0x268(0x8)
	struct FLinearColor AccentColor;  // 0x270(0x10)
	float BarValue;  // 0x280(0x4)
	struct FLinearColor BarColor;  // 0x284(0x10)
	float HeightOffset;  // 0x294(0x4)
	char pad_664_1 : 7;  // 0x298(0x1)
	bool Emphasized : 1;  // 0x298(0x1)
	char pad_665[3];  // 0x299(0x3)
	struct FLinearColor EmphasisColor;  // 0x29C(0x10)
	char pad_684[4];  // 0x2AC(0x4)
	struct FString LabelText;  // 0x2B0(0x10)
	char pad_704[56];  // 0x2C0(0x38)

	void OnLifetimeTiedActorDestroyed(struct AActor* Actor); // Function ConZ.WaypointWidgetBase.OnLifetimeTiedActorDestroyed
	bool IsOnScreen(); // Function ConZ.WaypointWidgetBase.IsOnScreen
	bool IsAttached(); // Function ConZ.WaypointWidgetBase.IsAttached
	struct AActor* GetTargetActor(); // Function ConZ.WaypointWidgetBase.GetTargetActor
	float GetDistance(); // Function ConZ.WaypointWidgetBase.GetDistance
	float GetAngle(); // Function ConZ.WaypointWidgetBase.GetAngle
}; 



// Class ConZ.AdminCommand_SpawnRandomAnimal
// Size: 0x108(Inherited: 0x108) 
struct UAdminCommand_SpawnRandomAnimal : public UAdminCommand_SpawnAnimal
{

}; 



// Class ConZ.AdminCommand_SpawnReflectionSphere
// Size: 0x90(Inherited: 0x88) 
struct UAdminCommand_SpawnReflectionSphere : public UAdminCommand
{
	UObject* _actorClass;  // 0x88(0x8)

}; 



// Class ConZ.PrisonerBodySymptom_Hallucinations
// Size: 0x228(Inherited: 0xB8) 
struct UPrisonerBodySymptom_Hallucinations : public UPrisonerBodySymptom
{
	struct TArray<struct FPrisonerHallucinationSymptomSeverityLevelParams> _severityLevelParams;  // 0xB8(0x10)
	UPrisonerHallucinationEpisode* _hallucinationEpisodeClass;  // 0xC8(0x8)
	struct TArray<struct FPrisonerHallucinationIllusionInfo> _hallucinationIllusionInfosSP;  // 0xD0(0x10)
	struct TArray<struct FPrisonerHallucinationIllusionInfo> _hallucinationIllusionInfosMP;  // 0xE0(0x10)
	char pad_240[16];  // 0xF0(0x10)
	struct FRuntimeFloatCurve _effectsIntensityVsElapsedTimePeriod;  // 0x100(0x88)
	float _effectsBlendInDuration;  // 0x188(0x4)
	float _effectsFrequencyMultiplier;  // 0x18C(0x4)
	struct FRuntimeFloatCurve _effectsIntensityScaleVsSeverityRatio;  // 0x190(0x88)
	float _visualEffectsIntensityScale;  // 0x218(0x4)
	float _soundEffectsIntensityScale;  // 0x21C(0x4)
	char pad_544[8];  // 0x220(0x8)

}; 



// Class ConZ.InteractionAction
// Size: 0xA8(Inherited: 0x28) 
struct UInteractionAction : public UObject
{
	char pad_40[128];  // 0x28(0x80)

	void OnActionFinished(); // Function ConZ.InteractionAction.OnActionFinished
	void OnActionCanceled(); // Function ConZ.InteractionAction.OnActionCanceled
}; 



// Class ConZ.AdminCommand_SpawnVehicle
// Size: 0x110(Inherited: 0x108) 
struct UAdminCommand_SpawnVehicle : public UAdminCommand_SpawnPrimaryActorAsset
{
	char pad_264[8];  // 0x108(0x8)

}; 



// Class ConZ.PrisonerBodySymptomCause_Farting
// Size: 0x38(Inherited: 0x38) 
struct UPrisonerBodySymptomCause_Farting : public UPrisonerBodySymptomCause_PeriodicSound
{

}; 



// Class ConZ.AdminCommand_StartTournamentMode
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_StartTournamentMode : public UAdminCommand
{

}; 



// Class ConZ.PrisonerBuryComponent
// Size: 0xC8(Inherited: 0xC0) 
struct UPrisonerBuryComponent : public UCharacterActionComponent
{
	uint8_t  _buryState;  // 0xC0(0x1)
	char pad_193[7];  // 0xC1(0x7)

	void OnRep_BuryState(); // Function ConZ.PrisonerBuryComponent.OnRep_BuryState
}; 



// Class ConZ.SoundNotificationDescription
// Size: 0x58(Inherited: 0x40) 
struct USoundNotificationDescription : public UNotificationDescription
{
	struct UAkAudioEvent* AudioEvent;  // 0x40(0x8)
	struct AActor* Actor;  // 0x48(0x8)
	char pad_80_1 : 7;  // 0x50(0x1)
	bool stopWhenAttachedToDestroyed : 1;  // 0x50(0x1)
	char pad_81[7];  // 0x51(0x7)

}; 



// Class ConZ.InventoryItemDataIcon
// Size: 0x38(Inherited: 0x30) 
struct UInventoryItemDataIcon : public UInventoryItemData
{
	struct UTexture2D* Icon;  // 0x30(0x8)

}; 



// Class ConZ.AdminCommand_TeleportTo
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_TeleportTo : public UAdminCommand
{

}; 



// Class ConZ.FishingRodAnimInstance
// Size: 0x2F0(Inherited: 0x2C0) 
struct UFishingRodAnimInstance : public UAnimInstance
{
	char pad_704_1 : 7;  // 0x2C0(0x1)
	bool IsInMinigame : 1;  // 0x2B8(0x1)
	struct FVector RodTipLocation;  // 0x2BC(0xC)
	struct FVector BentRodTipLocation;  // 0x2C8(0xC)
	struct FVector BendDirection;  // 0x2D4(0xC)
	float BendAmount;  // 0x2E0(0x4)
	char pad_745[7];  // 0x2E9(0x7)

}; 



// Class ConZ.BoxMotionTriggerComponent
// Size: 0x530(Inherited: 0x520) 
struct UBoxMotionTriggerComponent : public UMotionTriggerComponent
{
	struct UBoxComponent* BoxCollisionComponent;  // 0x518(0x8)
	struct FVector _triggerSize;  // 0x520(0xC)

	void BoxComponent_OnComponentEndOverlap(struct UPrimitiveComponent* activatedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function ConZ.BoxMotionTriggerComponent.BoxComponent_OnComponentEndOverlap
	void BoxComponent_OnComponentBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function ConZ.BoxMotionTriggerComponent.BoxComponent_OnComponentBeginOverlap
}; 



// Class ConZ.PrisonerActionAlignTransformDescription
// Size: 0x90(Inherited: 0x38) 
struct UPrisonerActionAlignTransformDescription : public UPrisonerActionDescription
{
	char pad_56[88];  // 0x38(0x58)

}; 



// Class ConZ.PrisonerActionGestureDescription
// Size: 0x40(Inherited: 0x38) 
struct UPrisonerActionGestureDescription : public UPrisonerActionDescription
{
	char pad_56[8];  // 0x38(0x8)

}; 



// Class ConZ.SearchForItemsAssetData
// Size: 0x38(Inherited: 0x30) 
struct USearchForItemsAssetData : public UInteractionAssetData
{
	struct USearchItemDataAsset* SearchAsset;  // 0x30(0x8)

}; 



// Class ConZ.AdminCommand_TeleportTo3pm
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_TeleportTo3pm : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_TeleportToVehicle
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_TeleportToVehicle : public UAdminCommand
{

}; 



// Class ConZ.StrengthSkill
// Size: 0xB0(Inherited: 0xB0) 
struct UStrengthSkill : public USkill
{

}; 



// Class ConZ.PrisonerActionChargeVehicleBatteryDescription
// Size: 0x70(Inherited: 0x38) 
struct UPrisonerActionChargeVehicleBatteryDescription : public UPrisonerActionDescription
{
	char pad_56[56];  // 0x38(0x38)

}; 



// Class ConZ.CharacterSelectionWidget
// Size: 0x2B8(Inherited: 0x260) 
struct UCharacterSelectionWidget : public UBaseMenu
{
	char pad_608[8];  // 0x260(0x8)
	UCharacterSlot* _characterSlotClass;  // 0x268(0x8)
	struct UScrollBox* _mainScrollBox;  // 0x270(0x8)
	struct UConZStandardButton* _buttonCreate;  // 0x278(0x8)
	struct UConZStandardButton* _buttonLoad;  // 0x280(0x8)
	struct UOverlay* _characterSlotsOverlay;  // 0x288(0x8)
	struct UVerticalBox* _characterSlotsVerticalBox;  // 0x290(0x8)
	struct UConZStandardButton* _buttonBack;  // 0x298(0x8)
	struct UOverlay* _criminalRecordOverlay;  // 0x2A0(0x8)
	struct UCriminalRecord* _criminalRecord;  // 0x2A8(0x8)
	struct UYesNoDialog* _deleteCharacterConfirmation;  // 0x2B0(0x8)

	void UpdatePreviewPrisonersInternal(struct UUserProfile* profile); // Function ConZ.CharacterSelectionWidget.UpdatePreviewPrisonersInternal
	void OnLoadButtonClicked(); // Function ConZ.CharacterSelectionWidget.OnLoadButtonClicked
	void OnCreateButtonClicked(); // Function ConZ.CharacterSelectionWidget.OnCreateButtonClicked
	void OnBackButtonClicked(); // Function ConZ.CharacterSelectionWidget.OnBackButtonClicked
	void GoBack(); // Function ConZ.CharacterSelectionWidget.GoBack
	void DeleteCharacter(struct UUserProfile* UserProfile); // Function ConZ.CharacterSelectionWidget.DeleteCharacter
}; 



// Class ConZ.KillNotificationWidget
// Size: 0x278(Inherited: 0x260) 
struct UKillNotificationWidget : public UUserWidget
{
	struct UTextBlock* _prefix;  // 0x260(0x8)
	struct UTextBlock* _name;  // 0x268(0x8)
	struct UTextBlock* _suffix;  // 0x270(0x8)

}; 



// Class ConZ.FlashbangItem
// Size: 0x9F0(Inherited: 0x9E0) 
struct AFlashbangItem : public AGrenadeItem
{
	AFlashbangItemEffects* _flashbangEffectsClass;  // 0x9D8(0x8)
	char pad_2536[8];  // 0x9E8(0x8)

}; 



// Class ConZ.AdminCommand_SetTattooIndex
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetTattooIndex : public UAdminCommand
{

}; 



// Class ConZ.SquadLeftPanel
// Size: 0x3B8(Inherited: 0x260) 
struct USquadLeftPanel : public UUserWidget
{
	char pad_608[216];  // 0x260(0xD8)
	struct UTextBlock* SquadName;  // 0x338(0x8)
	struct UTextBlock* SquadMessage;  // 0x340(0x8)
	struct UTextBlock* MemberCount;  // 0x348(0x8)
	struct USquadEmblemWidget* SquadEmblem;  // 0x350(0x8)
	struct UBorder* EmblemBox;  // 0x358(0x8)
	struct USizeBox* MessageBoxPanel;  // 0x360(0x8)
	struct UVerticalBox* MembersList;  // 0x368(0x8)
	struct UButton* EditButton;  // 0x370(0x8)
	struct UButton* LeaveButton;  // 0x378(0x8)
	struct UButton* CreateButton;  // 0x380(0x8)
	struct UScrollBox* MemberListBox;  // 0x388(0x8)
	UGenericTooltip* _genericTooltipClass;  // 0x390(0x8)
	USquadMemberPanel* _squadMemberPanelClass;  // 0x398(0x8)
	struct USquadRightPanel* _squadRightPanel;  // 0x3A0(0x8)
	struct UTabMenuReborn* _tabMenuReborn;  // 0x3A8(0x8)
	char pad_944[8];  // 0x3B0(0x8)

	void OnReleasedLeaveButton(); // Function ConZ.SquadLeftPanel.OnReleasedLeaveButton
	void OnReleasedEditButton(); // Function ConZ.SquadLeftPanel.OnReleasedEditButton
	void OnReleasedCreateButton(); // Function ConZ.SquadLeftPanel.OnReleasedCreateButton
}; 



// Class ConZ.CTFFlagStand
// Size: 0x240(Inherited: 0x220) 
struct ACTFFlagStand : public AActor
{
	struct UStaticMeshComponent* Mesh;  // 0x220(0x8)
	struct UPointLightComponent* Light;  // 0x228(0x8)
	struct FLinearColor _lightColor;  // 0x230(0x10)

	void OnRep_LightColor(); // Function ConZ.CTFFlagStand.OnRep_LightColor
}; 



// Class ConZ.PrisonerActionDecontaminateDescription
// Size: 0x58(Inherited: 0x38) 
struct UPrisonerActionDecontaminateDescription : public UPrisonerActionDescription
{
	char pad_56[32];  // 0x38(0x20)

}; 



// Class ConZ.DropZoneDroppable
// Size: 0x280(Inherited: 0x220) 
struct ADropZoneDroppable : public AActor
{
	struct UStaticMeshComponent* Mesh;  // 0x220(0x8)
	struct UAkAudioEvent* LandSound;  // 0x228(0x8)
	struct ADropZoneGameEvent* _gameEvent;  // 0x230(0x8)
	char pad_568[8];  // 0x238(0x8)
	struct UParticleSystemComponent* _flareParticles0;  // 0x240(0x8)
	struct UParticleSystemComponent* _flareParticles1;  // 0x248(0x8)
	struct UParticleSystemComponent* _flareParticles2;  // 0x250(0x8)
	char pad_600[8];  // 0x258(0x8)
	struct FVector _endLocation;  // 0x260(0xC)
	float _fallingSpeed;  // 0x26C(0x4)
	char pad_624_1 : 7;  // 0x270(0x1)
	bool _flareParticlesEnabled : 1;  // 0x270(0x1)
	char pad_625[3];  // 0x271(0x3)
	int32_t _flareParticlesTeam;  // 0x274(0x4)
	char pad_632[8];  // 0x278(0x8)

	void SetGameEvent(struct ADropZoneGameEvent* gameEvent); // Function ConZ.DropZoneDroppable.SetGameEvent
	void OnRep_FlareParticlesTeam(); // Function ConZ.DropZoneDroppable.OnRep_FlareParticlesTeam
	void OnRep_FlareParticlesEnabled(); // Function ConZ.DropZoneDroppable.OnRep_FlareParticlesEnabled
	struct ADropZoneGameEvent* GetGameEvent(); // Function ConZ.DropZoneDroppable.GetGameEvent
}; 



// Class ConZ.AdminCommand_SetPrivatePartsSize
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_SetPrivatePartsSize : public UAdminCommand
{

}; 



// Class ConZ.ListUnreferencedAssetsCommandlet
// Size: 0x80(Inherited: 0x80) 
struct UListUnreferencedAssetsCommandlet : public UCommandlet
{

}; 



// Class ConZ.AdminCommand_ToggleFamePointsDebugVisualization
// Size: 0x90(Inherited: 0x88) 
struct UAdminCommand_ToggleFamePointsDebugVisualization : public UAdminCommand
{
	UFamePointDebugComponent* _famePointDebugComponentClass;  // 0x88(0x8)

}; 



// Class ConZ.AnimNotifyState_DrainStamina
// Size: 0x48(Inherited: 0x30) 
struct UAnimNotifyState_DrainStamina : public UAnimNotifyState
{
	uint8_t  DrainType;  // 0x30(0x1)
	char pad_49[3];  // 0x31(0x3)
	float AmountToDrain;  // 0x34(0x4)
	float Duration;  // 0x38(0x4)
	float RecoveryDelay;  // 0x3C(0x4)
	float RatioToRecover;  // 0x40(0x4)
	float RecoveryTime;  // 0x44(0x4)

}; 



// Class ConZ.PrisonerActionSearchPrisoner
// Size: 0x118(Inherited: 0x108) 
struct UPrisonerActionSearchPrisoner : public UPrisonerAction
{
	char pad_264[16];  // 0x108(0x10)

}; 



// Class ConZ.AdminCommand_TrackShotsFired
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_TrackShotsFired : public UAdminCommand
{

}; 



// Class ConZ.Metabolism_ICU_GraphWidget_SPO2
// Size: 0x230(Inherited: 0x218) 
struct UMetabolism_ICU_GraphWidget_SPO2 : public UMetabolism_ICU_GraphWidget
{
	struct UCurveFloat* TimeStretchCurveCurve;  // 0x218(0x8)
	char pad_544[16];  // 0x220(0x10)

}; 



// Class ConZ.CookingRecipeButtonWidget
// Size: 0x320(Inherited: 0x260) 
struct UCookingRecipeButtonWidget : public UUserWidget
{
	char pad_608[112];  // 0x260(0x70)
	struct UTextBlock* _titleText;  // 0x2D0(0x8)
	struct UImage* _buttonIcon;  // 0x2D8(0x8)
	struct UCookingFavouriteButton* _favouritesButton;  // 0x2E0(0x8)
	struct UCookingInfoButton* _infoButton;  // 0x2E8(0x8)
	struct UImage* _overallBorder;  // 0x2F0(0x8)
	struct FLinearColor _unHoveredBorderColor;  // 0x2F8(0x10)
	struct FLinearColor _hoveredBorderColor;  // 0x308(0x10)
	char pad_792[8];  // 0x318(0x8)

}; 



// Class ConZ.CircularMenuWidget
// Size: 0x2A8(Inherited: 0x260) 
struct UCircularMenuWidget : public UUserWidget
{
	struct TArray<struct FCircularLayerData> _layerData;  // 0x260(0x10)
	float _centerSize;  // 0x270(0x4)
	char pad_628_1 : 7;  // 0x274(0x1)
	bool _constrainMouseToWidget : 1;  // 0x274(0x1)
	char pad_629_1 : 7;  // 0x275(0x1)
	bool _unboundOuterRadiusOnFirstInteractionLayer : 1;  // 0x275(0x1)
	char pad_630[2];  // 0x276(0x2)
	struct TArray<struct FCircularSegmentContainer> _segmentsByLayer;  // 0x278(0x10)
	struct UOverlay* _mainOverlay;  // 0x288(0x8)
	struct UTextBlock* _actionText;  // 0x290(0x8)
	char pad_664[16];  // 0x298(0x10)

	void InitializeThrowingLayer(int32_t Layer, float Offset, struct TArray<struct UCircularMenuSegmentThrowingInfo*> SegmentInfo, int32_t countParameterOverride); // Function ConZ.CircularMenuWidget.InitializeThrowingLayer
	void InitializeLayer(int32_t Layer, float Offset, struct TArray<struct UCircularMenuSegmentInfo*> SegmentInfo, int32_t countParameterOverride, bool createAdditionalDummySegments); // Function ConZ.CircularMenuWidget.InitializeLayer
	int32_t GetSegmentIdForCoordinatesAndLayer(struct FVector2D Coordinates, int32_t Layer); // Function ConZ.CircularMenuWidget.GetSegmentIdForCoordinatesAndLayer
	int32_t GetSegmentIdForCoordinates(struct FVector2D Coordinates, int32_t& Layer); // Function ConZ.CircularMenuWidget.GetSegmentIdForCoordinates
	struct UCircularMenuWidget* CreateThrowingMenuWidget(struct UObject* WorldContextObject, struct TArray<struct UCircularMenuSegmentThrowingInfo*> throwingSegmentInfo); // Function ConZ.CircularMenuWidget.CreateThrowingMenuWidget
	struct UCircularMenuWidget* Create(struct UObject* WorldContextObject, struct TArray<struct UCircularMenuSegmentInfo*> SegmentInfo); // Function ConZ.CircularMenuWidget.Create
}; 



// Class ConZ.PlaceableActorItems
// Size: 0x4F0(Inherited: 0x4E8) 
struct APlaceableActorItems : public APlaceableActorBase
{
	char pad_1256[8];  // 0x4E8(0x8)

}; 



// Class ConZ.TriggerComponent
// Size: 0x4D0(Inherited: 0x450) 
struct UTriggerComponent : public UPrimitiveComponent
{
	char pad_1104[112];  // 0x450(0x70)
	struct FObjectConditionContainer _triggeringActorConditions;  // 0x4C0(0x10)

}; 



// Class ConZ.PrisonerUIDataController
// Size: 0x138(Inherited: 0x28) 
struct UPrisonerUIDataController : public UObject
{
	struct UPrisonerBodySimulationUIController* BodySimulationUIController;  // 0x28(0x8)
	struct UPrisonerSkillComponentUIController* SkillComponentUIController;  // 0x30(0x8)
	struct UPrisonerTreatmentUIController* TreatmentUIController;  // 0x38(0x8)
	char pad_64[72];  // 0x40(0x48)
	struct UPrisonerUIData* _prisonerUIData;  // 0x88(0x8)
	struct UPrisonerUITooltipCache* _tooltipCache;  // 0x90(0x8)
	char pad_152[160];  // 0x98(0xA0)

}; 



// Class ConZ.Graph2DWidget
// Size: 0x1F0(Inherited: 0x108) 
struct UGraph2DWidget : public UWidget
{
	struct FSlateBrush Brush;  // 0x108(0x88)
	struct FDelegate BrushDelegate;  // 0x190(0x10)
	struct FLinearColor ColorAndOpacity;  // 0x1A0(0x10)
	struct FDelegate ColorAndOpacityDelegate;  // 0x1B0(0x10)
	float GraphLineThickness;  // 0x1C0(0x4)
	float GraphLineSpriteSpacing;  // 0x1C4(0x4)
	struct FVector2D GraphSize;  // 0x1C8(0x8)
	char pad_464_1 : 7;  // 0x1D0(0x1)
	bool InitializeGraphWithDefaultValue : 1;  // 0x1D0(0x1)
	char pad_465[3];  // 0x1D1(0x3)
	int32_t SampleMax;  // 0x1D4(0x4)
	float DefaultSampleValue;  // 0x1D8(0x4)
	char pad_476_1 : 7;  // 0x1DC(0x1)
	bool UseLineAntialiasing : 1;  // 0x1DC(0x1)
	char pad_477[19];  // 0x1DD(0x13)

}; 



// Class ConZ.RackItem
// Size: 0xA40(Inherited: 0xA20) 
struct ARackItem : public AChestItem
{
	struct UStaticMesh* _lockStaticMesh;  // 0xA20(0x8)
	char pad_2600[24];  // 0xA28(0x18)

}; 



// Class ConZ.AdminCommand_TrapsDebug
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_TrapsDebug : public UAdminCommand
{

}; 



// Class ConZ.EnvironmentDescriptionComponent
// Size: 0x4F0(Inherited: 0x4E0) 
struct UEnvironmentDescriptionComponent : public UStaticMeshComponent
{
	uint8_t  EnvironmentClass;  // 0x4E0(0x1)
	char pad_1249_1 : 7;  // 0x4E1(0x1)
	bool IsUnderground : 1;  // 0x4E1(0x1)
	char pad_1250_1 : 7;  // 0x4E2(0x1)
	bool ShouldBlockWeatherEffects : 1;  // 0x4E2(0x1)
	char pad_1251[13];  // 0x4E3(0xD)

}; 



// Class ConZ.ConZSpectatorPawn
// Size: 0x2C0(Inherited: 0x2A8) 
struct AConZSpectatorPawn : public ASpectatorPawn
{
	char pad_680[8];  // 0x2A8(0x8)
	float DefaultFOV;  // 0x2B0(0x4)
	char pad_692[12];  // 0x2B4(0xC)

}; 



// Class ConZ.PrisonerBodySymptom_Fatigue
// Size: 0xC0(Inherited: 0xB8) 
struct UPrisonerBodySymptom_Fatigue : public UPrisonerBodySymptom
{
	float _maxSeverity;  // 0xB8(0x4)
	float _maxSeverityMaxStaminaModifier;  // 0xBC(0x4)

}; 



// Class ConZ.AdminCommandExecutor
// Size: 0x28(Inherited: 0x28) 
struct UAdminCommandExecutor : public UInterface
{

}; 



// Class ConZ.BankAccountRegistry
// Size: 0x178(Inherited: 0xB0) 
struct UBankAccountRegistry : public UActorComponent
{
	char pad_176[200];  // 0xB0(0xC8)

	void ResetDailyTransactionLimitsOnAllAccounts(); // Function ConZ.BankAccountRegistry.ResetDailyTransactionLimitsOnAllAccounts
}; 



// Class ConZ.CarouselWithLabel
// Size: 0x2358(Inherited: 0x1DF0) 
struct UCarouselWithLabel : public UCarousel
{
	char pad_7664[24];  // 0x1DF0(0x18)
	struct UTextBlock* _name;  // 0x1E08(0x8)
	struct UImage* _focusBackgroundImage;  // 0x1E10(0x8)
	struct FText _label;  // 0x1E18(0x18)
	struct FCarouselWithLabelStyle _selectedAndFocusedCWLStyle;  // 0x1E30(0x108)
	struct FCarouselWithLabelStyle _selectedAndUnfocusedCWLStyle;  // 0x1F38(0x108)
	struct FCarouselWithLabelStyle _unselectedCWLStyle;  // 0x2040(0x108)
	struct FCarouselWithLabelStyle _highlightedCWLStyle;  // 0x2148(0x108)
	struct FCarouselWithLabelStyle _disabledCWLStyle;  // 0x2250(0x108)

}; 



// Class ConZ.AdminCommand_UnbanPlayer
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_UnbanPlayer : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_UnmutePlayer
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_UnmutePlayer : public UAdminCommand
{

}; 



// Class ConZ.PrisonerActionSearchGardenSlotDescription
// Size: 0x78(Inherited: 0x70) 
struct UPrisonerActionSearchGardenSlotDescription : public UPrisonerActionSearchObjectDescription
{
	char pad_112[8];  // 0x70(0x8)

}; 



// Class ConZ.AdminCommand_UnsilencePlayer
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_UnsilencePlayer : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_VisualizeBulletTrajectories
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_VisualizeBulletTrajectories : public UAdminCommand
{

}; 



// Class ConZ.AdminCommand_VisualizePlayerAiming
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_VisualizePlayerAiming : public UAdminCommand
{

}; 



// Class ConZ.PrisonerActionRemoveItemFromHandsDescription
// Size: 0x70(Inherited: 0x38) 
struct UPrisonerActionRemoveItemFromHandsDescription : public UPrisonerActionDescription
{
	char pad_56[56];  // 0x38(0x38)

}; 



// Class ConZ.AnimNotify_CharacterActionNotify
// Size: 0x40(Inherited: 0x38) 
struct UAnimNotify_CharacterActionNotify : public UAnimNotify
{
	uint8_t  CharacterActionNotifyType;  // 0x38(0x1)
	char pad_57[7];  // 0x39(0x7)

}; 



// Class ConZ.PrisonerBodyCondition_NutrientDeficiency
// Size: 0x170(Inherited: 0xC0) 
struct UPrisonerBodyCondition_NutrientDeficiency : public UPrisonerBodyCondition
{
	uint8_t  _nutrient;  // 0xC0(0x1)
	char pad_193[7];  // 0xC1(0x7)
	struct FRuntimeFloatCurve _severityVsNutrientDeficiencyRatio;  // 0xC8(0x88)
	float _maxRatioOfAbsorbedNutrientCapacityToBeRecovered;  // 0x150(0x4)
	float _artificialAbsorbedNutrientAccumulationScale;  // 0x154(0x4)
	float _nutrientDeficiency;  // 0x158(0x4)
	float _nutrientDeficiencyToRecover;  // 0x15C(0x4)
	float _artificialAbsorbedNutrient;  // 0x160(0x4)
	char pad_356[12];  // 0x164(0xC)

}; 



// Class ConZ.AdminCommand_Vote
// Size: 0x88(Inherited: 0x88) 
struct UAdminCommand_Vote : public UAdminCommand
{

}; 



// Class ConZ.AnimNotify_WeaponEjectCasing
// Size: 0x48(Inherited: 0x38) 
struct UAnimNotify_WeaponEjectCasing : public UAnimNotify
{
	struct FName EmitterSocketName;  // 0x38(0x8)
	char pad_64_1 : 7;  // 0x40(0x1)
	bool AttachEmitter : 1;  // 0x40(0x1)
	char pad_65[7];  // 0x41(0x7)

}; 



// Class ConZ.Metabolism_ICU_GraphWidget_RR
// Size: 0x220(Inherited: 0x218) 
struct UMetabolism_ICU_GraphWidget_RR : public UMetabolism_ICU_GraphWidget
{
	char pad_536[8];  // 0x218(0x8)

}; 



// Class ConZ.MechanicCommonData
// Size: 0xD0(Inherited: 0x30) 
struct UMechanicCommonData : public UDataAsset
{
	struct TMap<struct TSoftClassPtr<UObject>, struct FVehicleAttachmentAssociatedTradeables> VehicleAttachmentAssociatedTradeablesMap;  // 0x30(0x50)
	struct TMap<struct TSoftClassPtr<UObject>, struct TSoftClassPtr<UObject>> VehicleAttachmentToTradeableInStockClassRedirectors;  // 0x80(0x50)

}; 



// Class ConZ.AdminCommandArgumentCompletion_Achievements
// Size: 0x38(Inherited: 0x38) 
struct UAdminCommandArgumentCompletion_Achievements : public UAdminCommandArgumentCompletion
{

}; 



// Class ConZ.SmokeGrenadeItem
// Size: 0xA10(Inherited: 0x9E0) 
struct ASmokeGrenadeItem : public AGrenadeItem
{
	struct UParticleSystem* _smokeParticle;  // 0x9D8(0x8)
	struct UAkAudioEvent* _smokeStartedAudioEvent;  // 0x9E0(0x8)
	struct UAkAudioEvent* _smokeStoppedAudioEvent;  // 0x9E8(0x8)
	float _smokeSoundDuration;  // 0x9F0(0x4)
	struct UAkComponent* _smokeAudioComponent;  // 0x9F8(0x8)
	char pad_2564[12];  // 0xA04(0xC)

}; 



// Class ConZ.CharacterSoundComponent
// Size: 0xD8(Inherited: 0xB0) 
struct UCharacterSoundComponent : public UActorComponent
{
	struct FName AttachedSoundsAttachPointName;  // 0xB0(0x8)
	struct UCharacterImpactSoundsData* ImpactSounds;  // 0xB8(0x8)
	struct UCharacterPainSoundsData* PainSounds;  // 0xC0(0x8)
	float MinDurationBetweenPainSounds;  // 0xC8(0x4)
	float MaxDurationBetweenPainSounds;  // 0xCC(0x4)
	char pad_208[8];  // 0xD0(0x8)

}; 



// Class ConZ.AdminCommandArgumentCompletion_Constant
// Size: 0x48(Inherited: 0x38) 
struct UAdminCommandArgumentCompletion_Constant : public UAdminCommandArgumentCompletion
{
	struct TArray<struct FString> _completionValues;  // 0x38(0x10)

}; 



// Class ConZ.VehicleMountSlot
// Size: 0x28(Inherited: 0x28) 
struct UVehicleMountSlot : public UMountSlot
{

}; 



// Class ConZ.AdminCommandArgumentCompletion_Enum
// Size: 0x98(Inherited: 0x38) 
struct UAdminCommandArgumentCompletion_Enum : public UAdminCommandArgumentCompletion
{
	struct FName _enum;  // 0x38(0x8)
	char pad_64_1 : 7;  // 0x40(0x1)
	bool _excludeNoneEnumerator : 1;  // 0x40(0x1)
	char pad_65_1 : 7;  // 0x41(0x1)
	bool _excludeCountEnumerator : 1;  // 0x41(0x1)
	char pad_66_1 : 7;  // 0x42(0x1)
	bool _excludeAutoGeneratedEnumerator : 1;  // 0x42(0x1)
	char pad_67[5];  // 0x43(0x5)
	struct TSet<struct FName> _additionalEnumeratorsToExclude;  // 0x48(0x50)

}; 



// Class ConZ.CompanionCrow
// Size: 0x228(Inherited: 0x220) 
struct ACompanionCrow : public AActor
{
	struct USkeletalMeshComponent* _mesh;  // 0x220(0x8)

}; 



// Class ConZ.PrisonerAIController
// Size: 0x350(Inherited: 0x328) 
struct APrisonerAIController : public AAIController
{
	struct APrisoner* _prisoner;  // 0x328(0x8)
	struct UPrisonerMovementComponent* _prisonerMovementComponent;  // 0x330(0x8)
	char pad_824[24];  // 0x338(0x18)

}; 



// Class ConZ.AdminCommandArgumentCompletion_Player
// Size: 0x38(Inherited: 0x38) 
struct UAdminCommandArgumentCompletion_Player : public UAdminCommandArgumentCompletion
{

}; 



// Class ConZ.Bird2AIController
// Size: 0x380(Inherited: 0x328) 
struct ABird2AIController : public AAIController
{
	float FlyDurationMin;  // 0x328(0x4)
	float FlyDurationMax;  // 0x32C(0x4)
	float RemainOnGroundDurationMin;  // 0x330(0x4)
	float RemainOnGroundDurationMax;  // 0x334(0x4)
	float TurnSpeed;  // 0x338(0x4)
	float FlightSegmentDistance;  // 0x33C(0x4)
	float LandingDistance;  // 0x340(0x4)
	char pad_836[60];  // 0x344(0x3C)

	void UpdatePerception(struct TArray<struct AActor*>& actorsPercepted); // Function ConZ.Bird2AIController.UpdatePerception
}; 



// Class ConZ.AdminCommandArgumentCompletion_PrimaryAsset
// Size: 0x90(Inherited: 0x38) 
struct UAdminCommandArgumentCompletion_PrimaryAsset : public UAdminCommandArgumentCompletion
{
	struct FPrimaryAssetType _primaryAssetType;  // 0x38(0x8)
	struct TSet<struct FPrimaryAssetId> _primaryAssetsToExclude;  // 0x40(0x50)

}; 



// Class ConZ.AmmunitionItemState
// Size: 0x110(Inherited: 0x100) 
struct UAmmunitionItemState : public UItemState
{
	int32_t AmmoCount;  // 0x100(0x4)
	char pad_260[12];  // 0x104(0xC)

}; 



// Class ConZ.MeleeSkillAnimationsPreset
// Size: 0x4C8(Inherited: 0x30) 
struct UMeleeSkillAnimationsPreset : public UDataAsset
{
	struct FMeleeSkillAnimations NoSkillAnimations;  // 0x30(0x98)
	struct FMeleeSkillAnimations BasicSkillAnimations;  // 0xC8(0x98)
	struct FMeleeSkillAnimations MediumSkillAnimations;  // 0x160(0x98)
	struct FMeleeSkillAnimations AdvancedSkillAnimations;  // 0x1F8(0x98)
	struct FMeleeSkillParametersPerSkillLevel NoSkillParameters;  // 0x290(0x88)
	struct FMeleeSkillParametersPerSkillLevel BasicSkillParameters;  // 0x318(0x88)
	struct FMeleeSkillParametersPerSkillLevel MediumSkillParameters;  // 0x3A0(0x88)
	struct FMeleeSkillParametersPerSkillLevel AdvancedSkillParameters;  // 0x428(0x88)
	float NoSkillDamageMultiplier;  // 0x4B0(0x4)
	float BasicSkillDamageMultiplier;  // 0x4B4(0x4)
	float MediumSkillDamageMultiplier;  // 0x4B8(0x4)
	float AdvancedSkillDamageMultiplier;  // 0x4BC(0x4)
	float AboveAdvancedSkillDamageMultiplier;  // 0x4C0(0x4)
	char pad_1220[4];  // 0x4C4(0x4)

}; 



// Class ConZ.AudioDeviceDisplay
// Size: 0x268(Inherited: 0x260) 
struct UAudioDeviceDisplay : public UUserWidget
{
	struct UTextBlock* _deviceName;  // 0x260(0x8)

}; 



// Class ConZ.MugshotRoom
// Size: 0x240(Inherited: 0x220) 
struct AMugshotRoom : public AActor
{
	struct USceneComponent* _sceneRoot;  // 0x220(0x8)
	struct UChildActorComponent* _previewPrisoner;  // 0x228(0x8)
	struct USceneCaptureComponent2D* _mugshotCapture;  // 0x230(0x8)
	struct UChildActorComponent* _inmateShirt;  // 0x238(0x8)

}; 



// Class ConZ.AdminCommandArgumentCompletion_Skill
// Size: 0x38(Inherited: 0x38) 
struct UAdminCommandArgumentCompletion_Skill : public UAdminCommandArgumentCompletion
{

}; 



// Class ConZ.CraftingAvailableItemWidget
// Size: 0x2D8(Inherited: 0x260) 
struct UCraftingAvailableItemWidget : public UUserWidget
{
	char pad_608[24];  // 0x260(0x18)
	struct AItem* _item;  // 0x278(0x8)
	struct UAkAudioEvent* _clickSound;  // 0x280(0x8)
	UTooltipBase* _tooltipClass;  // 0x288(0x8)
	struct UTexture2D* _selectedTexture;  // 0x290(0x8)
	struct UTexture2D* _unselectedTexture;  // 0x298(0x8)
	struct UTexture2D* _componentAddTexture;  // 0x2A0(0x8)
	struct UTexture2D* _componentRemoveTexture;  // 0x2A8(0x8)
	struct URetainerBox* MainRetainerBox;  // 0x2B0(0x8)
	struct UImage* _itemImage;  // 0x2B8(0x8)
	struct UImage* BackgroundImage;  // 0x2C0(0x8)
	struct UImage* AdditionalComponentImage;  // 0x2C8(0x8)
	struct UTextBlock* CountText;  // 0x2D0(0x8)

}; 



// Class ConZ.ChainsawAnimInstance
// Size: 0x2E0(Inherited: 0x2D0) 
struct UChainsawAnimInstance : public UItemAnimInstance
{
	char pad_720_1 : 7;  // 0x2D0(0x1)
	bool _isTurnedOn : 1;  // 0x2D0(0x1)
	char pad_721[15];  // 0x2D1(0xF)

}; 



// Class ConZ.ObstuctsMouthItemTag
// Size: 0x30(Inherited: 0x30) 
struct UObstuctsMouthItemTag : public UBaseItemTag
{

}; 



// Class ConZ.AdminCommandArgumentCompletion_Squad
// Size: 0x38(Inherited: 0x38) 
struct UAdminCommandArgumentCompletion_Squad : public UAdminCommandArgumentCompletion
{

}; 



// Class ConZ.PrisonerActionCutObject
// Size: 0x110(Inherited: 0x108) 
struct UPrisonerActionCutObject : public UPrisonerAction
{
	char pad_264[8];  // 0x108(0x8)

}; 



// Class ConZ.RangedResourceConsumerEntityComponentSetup
// Size: 0x68(Inherited: 0x48) 
struct URangedResourceConsumerEntityComponentSetup : public UEntityComponentSetup
{
	UGameResourceType* ResourceType;  // 0x48(0x8)
	float ResourceAmount;  // 0x50(0x4)
	float RequiredResourceAmount;  // 0x54(0x4)
	char pad_88_1 : 7;  // 0x58(0x1)
	bool AutoFindResourceSupplier : 1;  // 0x58(0x1)
	char pad_89[3];  // 0x59(0x3)
	struct FName ResourceSupplierName;  // 0x5C(0x8)
	char pad_100[4];  // 0x64(0x4)

}; 



// Class ConZ.AdminCommandArgumentCompletion_Widget
// Size: 0x40(Inherited: 0x38) 
struct UAdminCommandArgumentCompletion_Widget : public UAdminCommandArgumentCompletion
{
	UAdminCommand_AddOrRemoveWidget* _commandClass;  // 0x38(0x8)

}; 



// Class ConZ.WheeledVehicleBase
// Size: 0xDC0(Inherited: 0xAE0) 
struct AWheeledVehicleBase : public AVehicleBase
{
	char pad_2784[72];  // 0xAE0(0x48)
	struct UTireToSurfaceAudioData* _tireToSurfaceAudioData;  // 0xB28(0x8)
	char pad_2864[16];  // 0xB30(0x10)
	struct UVehicleGearedEnginePowertrainComponent* _powertrainComponent;  // 0xB40(0x8)
	struct UVehicleDoorsComponent* _doorsComponent;  // 0xB48(0x8)
	char pad_2896[40];  // 0xB50(0x28)
	float _brakeStrength;  // 0xB78(0x4)
	char pad_2940[4];  // 0xB7C(0x4)
	struct UCurveFloat* _engineAccelerationCurve;  // 0xB80(0x8)
	struct UCurveFloat* _engineTorqueCurve;  // 0xB88(0x8)
	float _maxPushForce;  // 0xB90(0x4)
	char pad_2964[4];  // 0xB94(0x4)
	float _minPushForce;  // 0xB98(0x4)
	float _maxPushForcePerPusher;  // 0xB9C(0x4)
	float _minPushStartForce;  // 0xBA0(0x4)
	char pad_2980[4];  // 0xBA4(0x4)
	struct UCurveFloat* _speedToPushForceCurve;  // 0xBA8(0x8)
	float _maxLinearVelocityWhenPushing;  // 0xBB0(0x4)
	float _maxAllowedDistanceFromPushStartingPlayer;  // 0xBB4(0x4)
	float _steeringResetSpeed;  // 0xBB8(0x4)
	char pad_3004[4];  // 0xBBC(0x4)
	struct UCurveFloat* _steeringSpeedCurve;  // 0xBC0(0x8)
	struct UStaticMesh* _steeringStaticMesh;  // 0xBC8(0x8)
	float _dragCoefficient;  // 0xBD0(0x4)
	float _airDensity;  // 0xBD4(0x4)
	float _additionalGravityFactor;  // 0xBD8(0x4)
	float _antiDriftMultiplier;  // 0xBDC(0x4)
	float _antiRollMultiplier;  // 0xBE0(0x4)
	float _antiPitchMultiplier;  // 0xBE4(0x4)
	char pad_3048[20];  // 0xBE8(0x14)
	int32_t _minimumNumberOfWheelsToBeDriven;  // 0xBFC(0x4)
	int32_t _minimumNumberOfWheelsToBePushed;  // 0xC00(0x4)
	char pad_3076[4];  // 0xC04(0x4)
	struct UAkAudioEvent* _hornStartAudioEvent;  // 0xC08(0x8)
	struct UAkAudioEvent* _hornStopAudioEvent;  // 0xC10(0x8)
	char pad_3096[8];  // 0xC18(0x8)
	struct FRuntimeFloatCurve _pusherActionDifficultyVsSpeed;  // 0xC20(0x88)
	struct FRuntimeFloatCurve _pusherBaseStrengthChangeRateSpeedInfluenceVsSpeed;  // 0xCA8(0x88)
	struct FRuntimeFloatCurve _pusherBaseConstitutionChangeRateModifierVsSpeed;  // 0xD30(0x88)
	char pad_3512[8];  // 0xDB8(0x8)

	void UpdateHandlingParametersOnClient(float WheelSteeringLerpSpeedMultiplier, float engineIgnitionDurationMultiplier, float engineIgnitionFailureChance, float gearboxGearChangeDelayMultiplier, float gearboxGearUpRatioMultiplier, float gearboxGearDownRatioMultiplier); // Function ConZ.WheeledVehicleBase.UpdateHandlingParametersOnClient
}; 



// Class ConZ.InteractionUserWidget
// Size: 0x2F0(Inherited: 0x260) 
struct UInteractionUserWidget : public UUserWidget
{
	struct UTextBlock* _actionText;  // 0x260(0x8)
	struct UButton* _actionButton;  // 0x268(0x8)
	char pad_624[128];  // 0x270(0x80)

	void Interact(); // Function ConZ.InteractionUserWidget.Interact
}; 



// Class ConZ.ChatNotificationDescription
// Size: 0x58(Inherited: 0x40) 
struct UChatNotificationDescription : public UNotificationDescription
{
	struct FString Message;  // 0x40(0x10)
	uint8_t  ChatType;  // 0x50(0x1)
	char pad_81_1 : 7;  // 0x51(0x1)
	bool ShouldCopyToClientClipboard : 1;  // 0x51(0x1)
	char pad_82[6];  // 0x52(0x6)

}; 



// Class ConZ.PrisonerActionPlaceItemOnRack
// Size: 0x108(Inherited: 0x108) 
struct UPrisonerActionPlaceItemOnRack : public UPrisonerAction
{

}; 



// Class ConZ.FireFanningItemTag
// Size: 0x68(Inherited: 0x30) 
struct UFireFanningItemTag : public UBaseItemTag
{
	struct UAnimMontage* BlowAirIntoFireMontage;  // 0x30(0x8)
	struct UAnimMontage* BlowAirIntoLowFireMontage;  // 0x38(0x8)
	struct UAnimMontage* ItemSwingAnimOpen;  // 0x40(0x8)
	struct FName ItemSwingAnimOpenSection;  // 0x48(0x8)
	struct UAnimMontage* ItemSwingAnimClose;  // 0x50(0x8)
	struct FName ItemSwingAnimCloseSection;  // 0x58(0x8)
	float AirAmountMultiplier;  // 0x60(0x4)
	char pad_100[4];  // 0x64(0x4)

}; 



// Class ConZ.AdminCommandArgumentDataTypeBase
// Size: 0x108(Inherited: 0x30) 
struct UAdminCommandArgumentDataTypeBase : public UDataAsset
{
	struct FText DataTypeName;  // 0x30(0x18)
	UAdminCommandArgumentCompletion* ArgumentCompletion;  // 0x48(0x8)
	char pad_80[184];  // 0x50(0xB8)

}; 



// Class ConZ.InsertMagazine
// Size: 0x90(Inherited: 0x90) 
struct UInsertMagazine : public UWeaponActionReloadSequence
{

	bool IsMagazineToLoadEmpty(struct FWeaponReloadData& Data); // Function ConZ.InsertMagazine.IsMagazineToLoadEmpty
}; 



// Class ConZ.MeshHitZones
// Size: 0xD0(Inherited: 0xB0) 
struct UMeshHitZones : public UActorComponent
{
	char pad_176[16];  // 0xB0(0x10)
	struct UMaterialInterface* _deactivationMaterial;  // 0xC0(0x8)
	char pad_200[8];  // 0xC8(0x8)

	bool IsHitZoneActive(int32_t zoneIndex); // Function ConZ.MeshHitZones.IsHitZoneActive
}; 



// Class ConZ.SharkAnimInstance
// Size: 0x360(Inherited: 0x2C0) 
struct USharkAnimInstance : public UAnimInstance
{
	char pad_704[8];  // 0x2C0(0x8)
	struct FName _mouthTargetName;  // 0x2C8(0x8)
	float _mouthMorphValueChangePerSecond;  // 0x2D0(0x4)
	struct FName _teethTargetName;  // 0x2D4(0x8)
	float _teethMorphValueChangePerSecond;  // 0x2DC(0x4)
	struct FName _eyesTargetName;  // 0x2E0(0x8)
	float _eyesMorphValueChangePerSecond;  // 0x2E8(0x4)
	struct FVector _velocity;  // 0x2EC(0xC)
	float _angularVelocityYaw;  // 0x2F8(0x4)
	float _angularVelocityPitch;  // 0x2FC(0x4)
	uint8_t  _behaviorMode;  // 0x300(0x1)
	char pad_769_1 : 7;  // 0x301(0x1)
	bool _isAlive : 1;  // 0x301(0x1)
	char pad_770[94];  // 0x302(0x5E)

	bool IsAlive(); // Function ConZ.SharkAnimInstance.IsAlive
}; 



// Class ConZ.AdminCommandArgumentDataType_Location
// Size: 0x118(Inherited: 0x108) 
struct UAdminCommandArgumentDataType_Location : public UAdminCommandArgumentDataTypeBase
{
	struct FVector _defaultValue;  // 0x108(0xC)
	char pad_276[4];  // 0x114(0x4)

}; 



// Class ConZ.Choppable
// Size: 0x28(Inherited: 0x28) 
struct UChoppable : public UInterface
{

}; 



// Class ConZ.PrisonerBodyConditionOrSymptomSideEffectUIData_MaxMovementPace
// Size: 0x30(Inherited: 0x28) 
struct UPrisonerBodyConditionOrSymptomSideEffectUIData_MaxMovementPace : public UPrisonerBodyConditionOrSymptomSideEffectUIData
{
	char pad_40[8];  // 0x28(0x8)

}; 



// Class ConZ.CookingUtilitySlotButton
// Size: 0x2E8(Inherited: 0x260) 
struct UCookingUtilitySlotButton : public UUserWidget
{
	char pad_608[16];  // 0x260(0x10)
	struct UTextBlock* _titleText;  // 0x270(0x8)
	struct UImage* _utilityIcon;  // 0x278(0x8)
	struct UImage* _borderImage;  // 0x280(0x8)
	struct UImage* _ordinalNumberBorderImage;  // 0x288(0x8)
	struct UTextBlock* _slotOrdinalNumber;  // 0x290(0x8)
	struct UImage* _cookingInProgressIcon;  // 0x298(0x8)
	char pad_672_1 : 7;  // 0x2A0(0x1)
	bool _selected : 1;  // 0x2A0(0x1)
	char pad_673[3];  // 0x2A1(0x3)
	struct FLinearColor _selectedBorderColor;  // 0x2A4(0x10)
	struct FLinearColor _deselectedBorderColor;  // 0x2B4(0x10)
	struct FLinearColor _selectedTextColor;  // 0x2C4(0x10)
	struct FLinearColor _deselectedTextColor;  // 0x2D4(0x10)
	char pad_740[4];  // 0x2E4(0x4)

}; 



// Class ConZ.AdminCommandArgumentDataType_String
// Size: 0x120(Inherited: 0x108) 
struct UAdminCommandArgumentDataType_String : public UAdminCommandArgumentDataTypeBase
{
	struct FString _defaultValue;  // 0x108(0x10)
	char pad_280_1 : 7;  // 0x118(0x1)
	bool _caseSensitive : 1;  // 0x118(0x1)
	char pad_281[7];  // 0x119(0x7)

}; 



// Class ConZ.MalfunctionWidget
// Size: 0x270(Inherited: 0x260) 
struct UMalfunctionWidget : public UUserWidget
{
	char pad_608[8];  // 0x260(0x8)
	struct UTextBlock* _descriptionWidget;  // 0x268(0x8)

	void ExecuteAction(); // Function ConZ.MalfunctionWidget.ExecuteAction
}; 



// Class ConZ.CraftingInfoWidget
// Size: 0x360(Inherited: 0x260) 
struct UCraftingInfoWidget : public UUserWidget
{
	struct UInspectedItemWidget* ItemWidget;  // 0x260(0x8)
	struct UGridPanel* ComponentsGridPanel;  // 0x268(0x8)
	struct UGridPanel* CraftingGridPanel;  // 0x270(0x8)
	struct UUserWidget* ComponentsMinimizableWidget;  // 0x278(0x8)
	struct UUserWidget* CraftingMinimizableWidget;  // 0x280(0x8)
	char pad_648[88];  // 0x288(0x58)
	struct TArray<struct UPreviousNextSwitchWidget*> _switchWidgets;  // 0x2E0(0x10)
	struct TWeakObjectPtr<UPrisonerInventoryComponent> _inventoryComponent;  // 0x2F0(0x8)
	struct FCraftingRecipe _craftingRecipe;  // 0x2F8(0x38)
	char pad_816[32];  // 0x330(0x20)
	struct UTextBlock* TitleText;  // 0x350(0x8)
	struct UTextBlock* DescriptionText;  // 0x358(0x8)

	void SwapIngredient(int32_t widgetIndex, int32_t orderIndex); // Function ConZ.CraftingInfoWidget.SwapIngredient
}; 



// Class ConZ.AdminCommandArgumentDataType_TransformOrLocation
// Size: 0x118(Inherited: 0x108) 
struct UAdminCommandArgumentDataType_TransformOrLocation : public UAdminCommandArgumentDataTypeBase
{
	struct FVector _defaultLocationValue;  // 0x108(0xC)
	char pad_276[4];  // 0x114(0x4)

}; 



// Class ConZ.PrisonerBodyConditionInteractionQueryResults
// Size: 0xA0(Inherited: 0x28) 
struct UPrisonerBodyConditionInteractionQueryResults : public UObject
{
	char pad_40[120];  // 0x28(0x78)

}; 



// Class ConZ.CircularMenuSegmentThrowingInfo
// Size: 0x98(Inherited: 0x80) 
struct UCircularMenuSegmentThrowingInfo : public UCircularMenuSegmentInfo
{
	struct FDelegate Action;  // 0x80(0x10)
	int32_t Index;  // 0x90(0x4)
	char pad_148[4];  // 0x94(0x4)

}; 



// Class ConZ.InventoryCentralPanel
// Size: 0x278(Inherited: 0x260) 
struct UInventoryCentralPanel : public UUserWidget
{
	struct UVicinityPanel3* _vicinityPanel;  // 0x260(0x8)
	struct UVicinityContainer3* _vicinityContainer;  // 0x268(0x8)
	struct UScrollBox* _vicinityContainerScrollBox;  // 0x270(0x8)

}; 



// Class ConZ.PlaceableOnWallRackItemTag
// Size: 0x38(Inherited: 0x38) 
struct UPlaceableOnWallRackItemTag : public UPlaceableOnRackItemTag
{

}; 



// Class ConZ.AdminCommandCompletionManager
// Size: 0x1E0(Inherited: 0x28) 
struct UAdminCommandCompletionManager : public UObject
{
	struct TMap<struct FString, UAdminCommand*> _commands;  // 0x28(0x50)
	char pad_120[360];  // 0x78(0x168)

}; 



// Class ConZ.BuriableItemComponent
// Size: 0x190(Inherited: 0xC8) 
struct UBuriableItemComponent : public UItemComponent
{
	char pad_200[8];  // 0xC8(0x8)
	char pad_208_1 : 7;  // 0xD0(0x1)
	bool _canEverShowMarker : 1;  // 0xD0(0x1)
	char pad_209[15];  // 0xD1(0xF)
	char pad_224_1 : 7;  // 0xE0(0x1)
	bool _canBeBuried : 1;  // 0xE0(0x1)
	char pad_225[7];  // 0xE1(0x7)
	struct FBurialInformation _repBurialInformation;  // 0xE8(0x18)
	char pad_256[8];  // 0x100(0x8)
	struct UStaticMesh* _buriedMesh;  // 0x108(0x8)
	struct FVector _buriedMeshScale;  // 0x110(0xC)
	struct FVector _buriedMeshRelativeLocation;  // 0x11C(0xC)
	char pad_296[16];  // 0x128(0x10)
	struct UMaterialBillboardComponent* _spriteMarkerBillboard;  // 0x138(0x8)
	struct FMaterialSpriteElement _spriteMarkerData;  // 0x140(0x28)
	struct FVector _spriteMarkerRelativeLocation;  // 0x168(0xC)
	char pad_372_1 : 7;  // 0x174(0x1)
	bool _applyBuryMaterial : 1;  // 0x174(0x1)
	char pad_373[3];  // 0x175(0x3)
	float _startMeshFadeDistance;  // 0x178(0x4)
	float _endMeshFadeDistance;  // 0x17C(0x4)
	USkill* _skillToIncrease;  // 0x180(0x8)
	float _skillIncreaseAmount;  // 0x188(0x4)
	float _skillIncreaseModifier;  // 0x18C(0x4)

	void OnRep_UpdateBurialInformation(); // Function ConZ.BuriableItemComponent.OnRep_UpdateBurialInformation
}; 



// Class ConZ.AdminCommandRegistry
// Size: 0x88(Inherited: 0x28) 
struct UAdminCommandRegistry : public UObject
{
	struct TArray<UAdminCommand*> _commands;  // 0x28(0x10)
	char pad_56[80];  // 0x38(0x50)

}; 



// Class ConZ.CargoDropShip
// Size: 0x220(Inherited: 0x220) 
struct ACargoDropShip : public AActor
{

}; 



// Class ConZ.AdminLight
// Size: 0x370(Inherited: 0x360) 
struct UAdminLight : public UPointLightComponent
{
	struct UCurveFloat* _intensityVersusTimeOfDay;  // 0x360(0x8)
	char pad_872[8];  // 0x368(0x8)

}; 



// Class ConZ.RadioStation
// Size: 0x298(Inherited: 0x220) 
struct ARadioStation : public AActor
{
	char pad_544[48];  // 0x220(0x30)
	struct FName _stationName;  // 0x250(0x8)
	struct TArray<struct FRadioProgramData> _programsData;  // 0x258(0x10)
	int32_t _maxTracksToQueue;  // 0x268(0x4)
	int32_t _currentIndex;  // 0x26C(0x4)
	struct TArray<struct URadioTrack*> _playlist;  // 0x270(0x10)
	float _elapsedTime;  // 0x280(0x4)
	char pad_644[20];  // 0x284(0x14)

	void StartTrack(); // Function ConZ.RadioStation.StartTrack
	void OnTrackEnded(); // Function ConZ.RadioStation.OnTrackEnded
	void OnRep_Playlist(); // Function ConZ.RadioStation.OnRep_Playlist
	void Multicast_SendNextTrack(struct URadioTrack* Track); // Function ConZ.RadioStation.Multicast_SendNextTrack
}; 



// Class ConZ.CCGameUpgradeConditionDisplayWidget
// Size: 0x2C8(Inherited: 0x260) 
struct UCCGameUpgradeConditionDisplayWidget : public UUserWidget
{
	struct UBorder* _border;  // 0x260(0x8)
	struct UTextBlock* _text;  // 0x268(0x8)
	struct TMap<uint8_t , struct FText> _requirementTextPerGameUpgrade;  // 0x270(0x50)
	char pad_704[8];  // 0x2C0(0x8)

}; 



// Class ConZ.BaseCraftingRecipe
// Size: 0x88(Inherited: 0x28) 
struct UBaseCraftingRecipe : public UObject
{
	struct FString RecipeName;  // 0x28(0x10)
	uint8_t  RecipeCategory;  // 0x38(0x1)
	char pad_57[3];  // 0x39(0x3)
	int32_t RecipeOrder;  // 0x3C(0x4)
	struct UAnimMontage* CustomCraftingMontage;  // 0x40(0x8)
	struct UAkAudioEvent* CustomStartCraftingAudioEvent;  // 0x48(0x8)
	struct UAkAudioEvent* CustomStopCraftingAudioEvent;  // 0x50(0x8)
	struct TArray<struct UCraftingCondition*> GlobalConditions;  // 0x58(0x10)
	struct TArray<struct FCraftingSlot> IngredientSlots;  // 0x68(0x10)
	struct TArray<struct FCraftingProductDescription> PossibleProducts;  // 0x78(0x10)

	bool Process(struct FCraftingRecipeParams& Params, struct UCraftingResult* Result); // Function ConZ.BaseCraftingRecipe.Process
	struct UObject* Finalize(struct UObject* WorldContextObject, struct UCraftingResult* Result); // Function ConZ.BaseCraftingRecipe.Finalize
}; 



// Class ConZ.AdminPlantPanel
// Size: 0x2B0(Inherited: 0x260) 
struct UAdminPlantPanel : public UUserWidget
{
	char pad_608[8];  // 0x260(0x8)
	struct UButton* _seedingButton;  // 0x268(0x8)
	struct UButton* _vegetatingButton;  // 0x270(0x8)
	struct UButton* _floweringButton;  // 0x278(0x8)
	struct UButton* _ripeningButton;  // 0x280(0x8)
	struct UButton* _killButton;  // 0x288(0x8)
	struct UButton* _addWeedButton;  // 0x290(0x8)
	struct UButton* _removeWeedButton;  // 0x298(0x8)
	struct UButton* _removePlantButton;  // 0x2A0(0x8)
	struct UButton* _addWaterButton;  // 0x2A8(0x8)

	void OnClickVegetating(); // Function ConZ.AdminPlantPanel.OnClickVegetating
	void OnClickSeeding(); // Function ConZ.AdminPlantPanel.OnClickSeeding
	void OnClickRipening(); // Function ConZ.AdminPlantPanel.OnClickRipening
	void OnClickRemoveWeed(); // Function ConZ.AdminPlantPanel.OnClickRemoveWeed
	void OnClickRemovePlant(); // Function ConZ.AdminPlantPanel.OnClickRemovePlant
	void OnClickKill(); // Function ConZ.AdminPlantPanel.OnClickKill
	void OnClickFlowering(); // Function ConZ.AdminPlantPanel.OnClickFlowering
	void OnClickAddWeed(); // Function ConZ.AdminPlantPanel.OnClickAddWeed
	void OnClickAddWater(); // Function ConZ.AdminPlantPanel.OnClickAddWater
}; 



// Class ConZ.PrisonerBodySymptom_DoubleVision
// Size: 0xC0(Inherited: 0xB8) 
struct UPrisonerBodySymptom_DoubleVision : public UPrisonerBodySymptom
{
	float _maxSeverity;  // 0xB8(0x4)
	char pad_188[4];  // 0xBC(0x4)

}; 



// Class ConZ.CustomZoneSettingsApplyNotification
// Size: 0x270(Inherited: 0x260) 
struct UCustomZoneSettingsApplyNotification : public UUserWidget
{
	struct UTextBlock* _text;  // 0x260(0x8)
	char pad_616[8];  // 0x268(0x8)

}; 



// Class ConZ.Objective
// Size: 0x320(Inherited: 0x220) 
struct AObjective : public AActor
{
	char pad_544[144];  // 0x220(0x90)
	struct TArray<struct FDialogueInfo> _objectivesIntroDialogues;  // 0x2B0(0x10)
	struct TArray<struct FDialogueInfo> _objectivesOutroSuccessDialogues;  // 0x2C0(0x10)
	struct TArray<struct FDialogueInfo> _objectivesOutroFailDialogues;  // 0x2D0(0x10)
	uint8_t  _objectiveState;  // 0x2E0(0x1)
	char pad_737[3];  // 0x2E1(0x3)
	struct TWeakObjectPtr<AMission> _parentMission;  // 0x2E4(0x8)
	char pad_748[4];  // 0x2EC(0x4)
	struct FText _description;  // 0x2F0(0x18)
	char pad_776[17];  // 0x308(0x11)
	char pad_793_1 : 7;  // 0x319(0x1)
	bool _canInterruptDialogue : 1;  // 0x319(0x1)
	char pad_794_1 : 7;  // 0x31A(0x1)
	bool _playUISounds : 1;  // 0x31A(0x1)
	char pad_795[5];  // 0x31B(0x5)

	void SetObjectiveState(uint8_t  Value, bool silent); // Function ConZ.Objective.SetObjectiveState
	void Server_ActiveObjectiveInitialized(); // Function ConZ.Objective.Server_ActiveObjectiveInitialized
	void OnRep_ObjectiveStateChanged(); // Function ConZ.Objective.OnRep_ObjectiveStateChanged
	bool IsStarted(); // Function ConZ.Objective.IsStarted
	bool IsCompleted(); // Function ConZ.Objective.IsCompleted
	struct FText GetDescription(); // Function ConZ.Objective.GetDescription
	void FailObjective(bool forceFail); // Function ConZ.Objective.FailObjective
	void CompleteObjective(); // Function ConZ.Objective.CompleteObjective
	void Client_ShowWaypointWidget(struct AActor* targetActor, struct AActor* actorToTieLifetime); // Function ConZ.Objective.Client_ShowWaypointWidget
	void Client_RemoveWaypointWidget(); // Function ConZ.Objective.Client_RemoveWaypointWidget
	void Client_BroadcastTrackedItemAmount(int32_t currentAmount); // Function ConZ.Objective.Client_BroadcastTrackedItemAmount
	bool CanInterruptDialogue(); // Function ConZ.Objective.CanInterruptDialogue
}; 



// Class ConZ.DbStatics
// Size: 0x28(Inherited: 0x28) 
struct UDbStatics : public UBlueprintFunctionLibrary
{

}; 



// Class ConZ.PrisonerBodyCondition_StomachEmpty
// Size: 0xE0(Inherited: 0xC0) 
struct UPrisonerBodyCondition_StomachEmpty : public UPrisonerBodyCondition
{
	float _stomachEmptinessToExist;  // 0xC0(0x4)
	float _energyRatioToExist;  // 0xC4(0x4)
	UPrisonerBodySymptom_StomachGrowling* _stomachGrowlingSymptomClass;  // 0xC8(0x8)
	struct UPrisonerBodySymptomCause_StomachGrowling* _stomachGrowlingSymptomCause;  // 0xD0(0x8)
	float _stomachGrowlingSymptomSoundInterval;  // 0xD8(0x4)
	char pad_220[4];  // 0xDC(0x4)

}; 



// Class ConZ.AnimNotifyState_ChamberWeapon
// Size: 0x30(Inherited: 0x30) 
struct UAnimNotifyState_ChamberWeapon : public UAnimNotifyState
{

}; 



// Class ConZ.SedentaryNPC
// Size: 0x900(Inherited: 0x7A0) 
struct ASedentaryNPC : public AConZCharacter
{
	char pad_1952[8];  // 0x7A0(0x8)
	struct FVector _originalLocation;  // 0x7A8(0xC)
	char pad_1972[4];  // 0x7B4(0x4)
	struct ATradeOutpostBuilding* _tradeOutpostBuilding;  // 0x7B8(0x8)
	char pad_1984[24];  // 0x7C0(0x18)
	struct FVector _animationHeadScale;  // 0x7D8(0xC)
	char pad_2020[4];  // 0x7E4(0x4)
	struct UAnimSequenceBase* _faceIdleAnimation;  // 0x7E8(0x8)
	struct FFloatRange _headYawClampValues;  // 0x7F0(0x10)
	struct FFloatRange _headPitchClampValues;  // 0x800(0x10)
	float _headPitchClampCorrectionValueLower;  // 0x810(0x4)
	float _headPitchClampCorrectionValueUpper;  // 0x814(0x4)
	float _headRotationSpeedLerpFactor;  // 0x818(0x4)
	struct FFloatRange _eyesYawAngleRange;  // 0x81C(0x10)
	struct FFloatRange _eyesPitchAngleRange;  // 0x82C(0x10)
	float _eyesPitchClampCorrectionValueLower;  // 0x83C(0x4)
	float _eyesPitchClampCorrectionValueUpper;  // 0x840(0x4)
	float _eyesRotationSpeedLerpFactor;  // 0x844(0x4)
	struct FFloatRange _blinkingPeriodRange;  // 0x848(0x10)
	float _timeToBlinkInSeconds;  // 0x858(0x4)
	char pad_2140[4];  // 0x85C(0x4)
	struct TArray<USedentaryNPCBackgroundInteraction*> _backgroundInteractions;  // 0x860(0x10)
	struct USedentaryNPCBackgroundInteraction* _activeBackgroundInteraction;  // 0x870(0x8)
	float _interactionDistance;  // 0x878(0x4)
	float _timeWithoutFocusPawnToClearBackgroundInteractions;  // 0x87C(0x4)
	char pad_2176[88];  // 0x880(0x58)
	float _backgroundInteractionCooldownTime;  // 0x8D8(0x4)
	char pad_2268[36];  // 0x8DC(0x24)

}; 



// Class ConZ.RequirementObjective
// Size: 0x330(Inherited: 0x320) 
struct ARequirementObjective : public AObjective
{
	char pad_800[16];  // 0x320(0x10)

}; 



// Class ConZ.FireSourceItemTag
// Size: 0x30(Inherited: 0x30) 
struct UFireSourceItemTag : public UCraftingItemTag
{

}; 



// Class ConZ.BlueprintableItemObjective
// Size: 0x368(Inherited: 0x330) 
struct ABlueprintableItemObjective : public ARequirementObjective
{
	uint8_t  _actionType;  // 0x330(0x1)
	char pad_817[7];  // 0x331(0x7)
	AActor* _targetBlueprintActor;  // 0x338(0x8)
	struct TArray<AActor*> _itemsToFill;  // 0x340(0x10)
	char pad_848[24];  // 0x350(0x18)

}; 



// Class ConZ.Airplane
// Size: 0xCC0(Inherited: 0xAE0) 
struct AAirplane : public AVehicleBase
{
	char pad_2784[16];  // 0xAE0(0x10)
	struct ULiftComponent* _physicsLiftComponent;  // 0xAF0(0x8)
	char pad_2808[40];  // 0xAF8(0x28)
	struct TMap<uint8_t , struct FAerodynamicSurfaceControlData> _aerodynamicSurfaceMap;  // 0xB20(0x50)
	char pad_2928[16];  // 0xB70(0x10)
	float _airFlowParticlesSpeedKmhThreshold;  // 0xB80(0x4)
	float _reverseTaxiingForce;  // 0xB84(0x4)
	float _maxReverseTaxiingVelocity;  // 0xB88(0x4)
	float _airplaneHeightToStallInMeters;  // 0xB8C(0x4)
	float _propellerForce;  // 0xB90(0x4)
	float _maxVelocity;  // 0xB94(0x4)
	char pad_2968[4];  // 0xB98(0x4)
	struct FInt32Range _throttleLevelRange;  // 0xB9C(0x10)
	char pad_2988[4];  // 0xBAC(0x4)
	struct FRuntimeFloatCurve _throttlePerLevel;  // 0xBB0(0x88)
	char pad_3128[4];  // 0xC38(0x4)
	float _throttleLerpAmount;  // 0xC3C(0x4)
	char pad_3136[8];  // 0xC40(0x8)
	float _brakeLerpAmount;  // 0xC48(0x4)
	char pad_3148[8];  // 0xC4C(0x8)
	float _rollLerpAmount;  // 0xC54(0x4)
	char pad_3160[8];  // 0xC58(0x8)
	float _yawLerpAmount;  // 0xC60(0x4)
	char pad_3172[8];  // 0xC64(0x8)
	float _pitchLerpAmount;  // 0xC6C(0x4)
	char pad_3184[8];  // 0xC70(0x8)
	float _controlResetLerp;  // 0xC78(0x4)
	char pad_3196[44];  // 0xC7C(0x2C)
	struct UStaticMeshComponent* _propellerMesh;  // 0xCA8(0x8)
	struct UMaterialInterface* _propellerMaterial;  // 0xCB0(0x8)
	struct UMaterialInstanceDynamic* _propellerMaterialDynamic;  // 0xCB8(0x8)

	void UpdateHandlingParametersOnClient(bool ShouldHaveMouseInput, float engineIgnitionDurationMultiplier, float engineIgnitionFailureChance); // Function ConZ.Airplane.UpdateHandlingParametersOnClient
	void OnPropellerHit(struct UPrimitiveComponent* HitComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComponent, struct FVector NormalImpulse, struct FHitResult& Hit); // Function ConZ.Airplane.OnPropellerHit
}; 



// Class ConZ.PrisonerActionRemovePlantDescription
// Size: 0x48(Inherited: 0x38) 
struct UPrisonerActionRemovePlantDescription : public UPrisonerActionDescription
{
	char pad_56[16];  // 0x38(0x10)

}; 



// Class ConZ.WeaponActionReloadSequence
// Size: 0x90(Inherited: 0x28) 
struct UWeaponActionReloadSequence : public UWeaponAction
{
	struct FBodyWeaponAnimation AnimationStandAndCrouch;  // 0x28(0x10)
	struct FBodyWeaponAnimation AnimationProne;  // 0x38(0x10)
	char pad_72_1 : 7;  // 0x48(0x1)
	bool CanBeInterrupted : 1;  // 0x48(0x1)
	char pad_73[71];  // 0x49(0x47)

	void SetNextMontageSectionFromPrevious(struct FName previousSection, struct FName NextSection); // Function ConZ.WeaponActionReloadSequence.SetNextMontageSectionFromPrevious
	void SetNextMontageSection(struct FName NextSection); // Function ConZ.WeaponActionReloadSequence.SetNextMontageSection
	void OnMontageEnded(struct UAnimMontage* Montage, bool interrupted); // Function ConZ.WeaponActionReloadSequence.OnMontageEnded
	void OnMontageBlendingOutStarted(struct UAnimMontage* Montage, bool interrupted); // Function ConZ.WeaponActionReloadSequence.OnMontageBlendingOutStarted
	bool IgnoreChamberBulletOnEnd(); // Function ConZ.WeaponActionReloadSequence.IgnoreChamberBulletOnEnd
	struct FWeaponReloadData GetReloadData(); // Function ConZ.WeaponActionReloadSequence.GetReloadData
	struct UAnimMontage* GetActiveAnimationWeapon(); // Function ConZ.WeaponActionReloadSequence.GetActiveAnimationWeapon
	struct UAnimMontage* GetActiveAnimationBody(); // Function ConZ.WeaponActionReloadSequence.GetActiveAnimationBody
	float ExecuteUsingData(struct FWeaponReloadData& Data); // Function ConZ.WeaponActionReloadSequence.ExecuteUsingData
	void End(bool Regular); // Function ConZ.WeaponActionReloadSequence.End
	bool CanInterrupt(); // Function ConZ.WeaponActionReloadSequence.CanInterrupt
	bool CanExecuteUsingData(struct FWeaponReloadData& Data); // Function ConZ.WeaponActionReloadSequence.CanExecuteUsingData
}; 



// Class ConZ.AdvancedBlueprintableItemObjective
// Size: 0x378(Inherited: 0x368) 
struct AAdvancedBlueprintableItemObjective : public ABlueprintableItemObjective
{
	struct AMissionDialogueManager* _dialogueManager;  // 0x368(0x8)
	struct UDialogueData* _dialogueData;  // 0x370(0x8)

	void OnTabMenuOpenedHandler(uint8_t  tabMode); // Function ConZ.AdvancedBlueprintableItemObjective.OnTabMenuOpenedHandler
}; 



// Class ConZ.BankATMGoldTrading
// Size: 0x378(Inherited: 0x260) 
struct UBankATMGoldTrading : public UUserWidget
{
	char pad_608[88];  // 0x260(0x58)
	struct UConZCustomInteractionButton* _btnEjectCard;  // 0x2B8(0x8)
	struct UWidgetSwitcher* _buttonSwitcher;  // 0x2C0(0x8)
	struct UBankATMPointingButton* _btnReturn;  // 0x2C8(0x8)
	struct UBankATMPointingButton* _btnSubmit;  // 0x2D0(0x8)
	struct UBankATMPointingButton* _btnNo;  // 0x2D8(0x8)
	struct UBankATMPointingButton* _btnYes;  // 0x2E0(0x8)
	struct UWidgetSwitcher* _subsectionSwitcher;  // 0x2E8(0x8)
	struct UTextBlock* _goldBuyConversionLabel;  // 0x2F0(0x8)
	struct UBankATMVirtualEditbox* _editBuyAmount;  // 0x2F8(0x8)
	struct UTextBlock* _creditsLostLabel;  // 0x300(0x8)
	struct UTextBlock* _goldSellConversionLabel;  // 0x308(0x8)
	struct UBankATMVirtualEditbox* _editSellAmount;  // 0x310(0x8)
	struct UTextBlock* _creditsGainedLabel;  // 0x318(0x8)
	struct UTextBlock* _questionLabel;  // 0x320(0x8)
	struct UTextBlock* _errorLabel;  // 0x328(0x8)
	struct UBankATMGoldValueGraph* _goldValueGraph;  // 0x330(0x8)
	struct UTextBlock* _goldBalanceTextBlock;  // 0x338(0x8)
	struct UTextBlock* _fundsSourceWarning;  // 0x340(0x8)
	struct UAkAudioEvent* _soundSuccess;  // 0x348(0x8)
	struct UAkAudioEvent* _errorSuccess;  // 0x350(0x8)
	char pad_856[32];  // 0x358(0x20)

	void HandleOnEjectClicked(); // Function ConZ.BankATMGoldTrading.HandleOnEjectClicked
}; 



// Class ConZ.AdvancedBuoyancyComponent
// Size: 0x540(Inherited: 0x4E0) 
struct UAdvancedBuoyancyComponent : public UStaticMeshComponent
{
	char pad_1248[12];  // 0x4E0(0xC)
	float _waterKinematicViscosity;  // 0x4EC(0x4)
	float _cPD1;  // 0x4F0(0x4)
	float _cPD2;  // 0x4F4(0x4)
	float _fP;  // 0x4F8(0x4)
	float _cSD1;  // 0x4FC(0x4)
	float _cSD2;  // 0x500(0x4)
	float _fS;  // 0x504(0x4)
	float _maxAcceleration;  // 0x508(0x4)
	float _p;  // 0x50C(0x4)
	float _maxHydrodynamicVelocity;  // 0x510(0x4)
	char pad_1300[44];  // 0x514(0x2C)

}; 



// Class ConZ.CraftingObjective
// Size: 0x348(Inherited: 0x330) 
struct ACraftingObjective : public ARequirementObjective
{
	struct TArray<struct TSoftClassPtr<UObject>> _targetItems;  // 0x330(0x10)
	char pad_832[8];  // 0x340(0x8)

}; 



// Class ConZ.WeaponStateRocketLauncherUnarm
// Size: 0x38(Inherited: 0x30) 
struct UWeaponStateRocketLauncherUnarm : public UWeaponState
{
	char pad_48[8];  // 0x30(0x8)

}; 



// Class ConZ.WashClothesData
// Size: 0x90(Inherited: 0x30) 
struct UWashClothesData : public UDataAsset
{
	struct TMap<AItem*, struct FWashItemData> WashClothes;  // 0x30(0x50)
	USkill* SkillToIncrease;  // 0x80(0x8)
	float SkillIncreaseAmount;  // 0x88(0x4)
	float SkillIncreaseModifier;  // 0x8C(0x4)

}; 



// Class ConZ.DeathmatchParticipantStats
// Size: 0x58(Inherited: 0x48) 
struct UDeathmatchParticipantStats : public UGameEventParticipantStats
{
	float LongestHeadshot;  // 0x48(0x4)
	int32_t MeleeKills;  // 0x4C(0x4)
	float LongestLife;  // 0x50(0x4)
	char pad_84[4];  // 0x54(0x4)

}; 



// Class ConZ.VehicleAttachmentItem
// Size: 0x920(Inherited: 0x910) 
struct AVehicleAttachmentItem : public AItem
{
	char pad_2320[16];  // 0x910(0x10)

}; 



// Class ConZ.AudioSettingsManager
// Size: 0x28(Inherited: 0x28) 
struct UAudioSettingsManager : public UObject
{

}; 



// Class ConZ.AIDetectionTimerHandler
// Size: 0x270(Inherited: 0x220) 
struct AAIDetectionTimerHandler : public AActor
{
	char pad_544[80];  // 0x220(0x50)

	void OnDestroyedEvent(struct AActor* DestroyedActor); // Function ConZ.AIDetectionTimerHandler.OnDestroyedEvent
}; 



// Class ConZ.PrisonerActionDecontaminateWithReplenishableResourceDescription
// Size: 0x88(Inherited: 0x38) 
struct UPrisonerActionDecontaminateWithReplenishableResourceDescription : public UCharacterActionDescription
{
	char pad_56[72];  // 0x38(0x48)
	struct UGameResourceContainerProxyForReplenishableResource* ProxyForReplenishableResource;  // 0x80(0x8)

}; 



// Class ConZ.PrisonerBodyConditionOrSymptomSideEffect_Hallucinations
// Size: 0xC8(Inherited: 0x30) 
struct UPrisonerBodyConditionOrSymptomSideEffect_Hallucinations : public UPrisonerBodyConditionOrSymptomSideEffect
{
	UPrisonerBodySymptom_Hallucinations* _symptomClass;  // 0x30(0x8)
	struct UPrisonerBodySymptomCause_Hallucinations* _symptomCause;  // 0x38(0x8)
	struct FRuntimeFloatCurve _hallucinationsSeverityVsSeverity;  // 0x40(0x88)

}; 



// Class ConZ.CookingRecipeRegistry
// Size: 0x40(Inherited: 0x30) 
struct UCookingRecipeRegistry : public UDataAsset
{
	struct TArray<struct FCookingRecipeRegistryEntry> _entries;  // 0x30(0x10)

}; 



// Class ConZ.VehicleBase
// Size: 0xAE0(Inherited: 0x280) 
struct AVehicleBase : public APawn
{
	char pad_640[408];  // 0x280(0x198)
	struct UVehicleMeshComponent* _vehicleMeshComponent;  // 0x418(0x8)
	char pad_1056[28];  // 0x420(0x1C)
	char pad_1084_1 : 7;  // 0x43C(0x1)
	bool _shouldApplyWaterDrag : 1;  // 0x43C(0x1)
	char pad_1085[3];  // 0x43D(0x3)
	float _waterDragForceCoefficient;  // 0x440(0x4)
	struct FFloatInterval _submergedInWaterDamagePerSecond;  // 0x444(0x8)
	char pad_1100[84];  // 0x44C(0x54)
	struct AVehicleItemContainer* _itemContainer;  // 0x4A0(0x8)
	struct TArray<struct UVehicleAttachment*> _vehicleAttachments;  // 0x4A8(0x10)
	struct TArray<struct UVehicleAttachment*> _repVehicleAttachments;  // 0x4B8(0x10)
	char pad_1224[16];  // 0x4C8(0x10)
	struct FVehicleAttachmentSlot _chassisSlot;  // 0x4D8(0x48)
	char pad_1312[8];  // 0x520(0x8)
	struct FGameplayTagContainer _lockInfluencingAttachmentSlotTags;  // 0x528(0x20)
	struct FGameplayTagContainer _lockingAttachmentSlotTags;  // 0x548(0x20)
	char pad_1384[24];  // 0x568(0x18)
	struct FPackedEntitySetupAndId _repServerEntitySetupAndId;  // 0x580(0x8)
	struct UVehicleForcePushComponent* _forcePushComponent;  // 0x588(0x8)
	struct TMap<struct UVehicleAttachment*, struct UWidgetComponent*> _attachmentHealthWidgets;  // 0x590(0x50)
	UVehicleAttachmentHealthWidget* _attachmentHealthWidget;  // 0x5E0(0x8)
	struct UNetworkPredictionComponent* _networkPrediction;  // 0x5E8(0x8)
	struct FGameplayTag SpawnGroup;  // 0x5F0(0x8)
	char pad_1528[8];  // 0x5F8(0x8)
	AVehicleItemContainer* _itemContainerClass;  // 0x600(0x8)
	struct FRepairableParams _repairableParams;  // 0x608(0x38)
	char pad_1600[1];  // 0x640(0x1)
	char pad_1601_1 : 7;  // 0x641(0x1)
	bool _repIsSimulatingPhysics : 1;  // 0x641(0x1)
	char pad_1602[2];  // 0x642(0x2)
	struct FVector _repLocationWhenNotSimulatingPhysics;  // 0x644(0xC)
	struct FRotator _repRotationWhenNotSimulatingPhysics;  // 0x650(0xC)
	char pad_1628[4];  // 0x65C(0x4)
	float _physicsDormancyTimeout;  // 0x660(0x4)
	char pad_1636[28];  // 0x664(0x1C)
	struct UVehicleServiceComponent* _serviceComponent;  // 0x680(0x8)
	char pad_1672_1 : 7;  // 0x688(0x1)
	bool _isInQuickService : 1;  // 0x688(0x1)
	char pad_1673[191];  // 0x689(0xBF)
	struct UVehicleCameraStabilizerComponent* _cameraStabilizer;  // 0x748(0x8)
	struct TMap<uint8_t , float> _collisionDamageMultipliers;  // 0x750(0x50)
	float _explosiveDamageMultiplier;  // 0x7A0(0x4)
	char pad_1956[4];  // 0x7A4(0x4)
	struct UCurveFloat* _collisionDamageToMultiplierCurve;  // 0x7A8(0x8)
	char pad_1968[4];  // 0x7B0(0x4)
	uint32_t _previewMeshTimePerMesh;  // 0x7B4(0x4)
	char pad_1976[8];  // 0x7B8(0x8)
	struct FText _healthBarCaption;  // 0x7C0(0x18)
	float _collisionDamageReplicationPeriodCooldownThreshold;  // 0x7D8(0x4)
	float _collisionDamageReplicationPeriodTimeoutThreshold;  // 0x7DC(0x4)
	char pad_2016[24];  // 0x7E0(0x18)
	struct FVehicleImpactEffects _impactEffects[5];  // 0x7F8(0x118)
	char pad_2320[96];  // 0x910(0x60)
	float _maxSpeedForInteraction;  // 0x970(0x4)
	float _maxTiltAngleForMounting;  // 0x974(0x4)
	char pad_2424[8];  // 0x978(0x8)
	float _maxSubmergedTime;  // 0x980(0x4)
	float _maxSubmersionFactor;  // 0x984(0x4)
	char pad_2440[8];  // 0x988(0x8)
	UUserWidget* _mountSlotIndicatorsWidget;  // 0x990(0x8)
	char pad_2456[8];  // 0x998(0x8)
	float _inWaterDestructionTimeInSeconds;  // 0x9A0(0x4)
	float _outOfWaterDestructionTimeInSeconds;  // 0x9A4(0x4)
	uint8_t  _repLightsCategoryStates;  // 0x9A8(0x1)
	char pad_2473[23];  // 0x9A9(0x17)
	UVehicleHandlingSkill* _vehicleHandlingSkill;  // 0x9C0(0x8)
	float _timeUntilDestructionInSeconds;  // 0x9C8(0x4)
	char pad_2508_1 : 7;  // 0x9CC(0x1)
	bool _isInWater : 1;  // 0x9CC(0x1)
	char pad_2509[3];  // 0x9CD(0x3)
	float _navigationRelevancyVelocitySquared;  // 0x9D0(0x4)
	char pad_2516[28];  // 0x9D4(0x1C)
	struct UParticleSystem* _smokeParticlesLow;  // 0x9F0(0x8)
	struct UParticleSystem* _smokeParticlesMedium;  // 0x9F8(0x8)
	struct UParticleSystem* _smokeParticlesHigh;  // 0xA00(0x8)
	char pad_2568[8];  // 0xA08(0x8)
	struct UParticleSystemComponent* _smokeParticleSystemComponent;  // 0xA10(0x8)
	struct FVector _smokeParticlesOffset;  // 0xA18(0xC)
	uint8_t  _physicsDominanceGroup;  // 0xA24(0x1)
	char pad_2597[3];  // 0xA25(0x3)
	float _aiNoiseFrequencyPerHour;  // 0xA28(0x4)
	uint8_t  _aiNoiseLevel;  // 0xA2C(0x1)
	char pad_2605[7];  // 0xA2D(0x7)
	struct FVector _aiNoiseOffset;  // 0xA34(0xC)
	struct TArray<struct FGameplayTag> _mountSlotsBySwitchSeatIndex;  // 0xA40(0x10)
	struct FTransform _unlockTransform;  // 0xA50(0x30)
	float _forceUnlockMovementAcceptanceRadius;  // 0xA80(0x4)
	float _absoluteSpeedLimitKmh;  // 0xA84(0x4)
	uint8_t  _aiTeam;  // 0xA88(0x1)
	char pad_2697[87];  // 0xA89(0x57)

	void OnRep_VehicleAttachments(); // Function ConZ.VehicleBase.OnRep_VehicleAttachments
	void OnRep_ServiceComponent(); // Function ConZ.VehicleBase.OnRep_ServiceComponent
	void OnRep_ServerEntitySetupAndId(); // Function ConZ.VehicleBase.OnRep_ServerEntitySetupAndId
	void OnRep_LightsCategoryStates(); // Function ConZ.VehicleBase.OnRep_LightsCategoryStates
	void OnRep_ItemContainer(); // Function ConZ.VehicleBase.OnRep_ItemContainer
}; 



// Class ConZ.CCSkillSliderWidget
// Size: 0x308(Inherited: 0x260) 
struct UCCSkillSliderWidget : public UUserWidget
{
	struct FMulticastInlineDelegate OnSliderChanged;  // 0x260(0x10)
	struct FMulticastInlineDelegate OnSliderSelected;  // 0x270(0x10)
	struct FMulticastInlineDelegate OnSliderDeselected;  // 0x280(0x10)
	struct UTextBlock* _skillName;  // 0x290(0x8)
	struct UCCNonSelectableTextWidget* _nonSelectableText;  // 0x298(0x8)
	struct UTrashSliderWidget* _slider;  // 0x2A0(0x8)
	char pad_680_1 : 7;  // 0x2A8(0x1)
	bool _enabled : 1;  // 0x2A8(0x1)
	char pad_681[7];  // 0x2A9(0x7)
	struct FSkillTemplate _skillTemplate;  // 0x2B0(0x38)
	struct FLinearColor _enabledColor;  // 0x2E8(0x10)
	struct FLinearColor _disabledColor;  // 0x2F8(0x10)

	void HandleValueChanged(float Value); // Function ConZ.CCSkillSliderWidget.HandleValueChanged
}; 



// Class ConZ.AIStatics
// Size: 0x28(Inherited: 0x28) 
struct UAIStatics : public UBlueprintFunctionLibrary
{

}; 



// Class ConZ.DropZoneKey
// Size: 0x920(Inherited: 0x910) 
struct ADropZoneKey : public AItem
{
	struct USphereComponent* SphereComponent;  // 0x910(0x8)
	struct ADropZoneGameEvent* _gameEvent;  // 0x918(0x8)

	void SphereOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function ConZ.DropZoneKey.SphereOverlap
	void SetGameEvent(struct ADropZoneGameEvent* gameEvent); // Function ConZ.DropZoneKey.SetGameEvent
	struct ADropZoneGameEvent* GetGameEvent(); // Function ConZ.DropZoneKey.GetGameEvent
}; 



// Class ConZ.Vehicle
// Size: 0x28(Inherited: 0x28) 
struct UVehicle : public UMountable
{

	bool VehicleHasFuel(); // Function ConZ.Vehicle.VehicleHasFuel
	bool VehicleHasEngine(); // Function ConZ.Vehicle.VehicleHasEngine
	bool VehicleHasBattery(); // Function ConZ.Vehicle.VehicleHasBattery
	void UpdateNavigationMeshes(); // Function ConZ.Vehicle.UpdateNavigationMeshes
	void StopVehicleEngine(); // Function ConZ.Vehicle.StopVehicleEngine
	void StartVehicleEngine(); // Function ConZ.Vehicle.StartVehicleEngine
	bool ShouldShowVehicleHud(); // Function ConZ.Vehicle.ShouldShowVehicleHud
	bool ShouldShowAviationHud(); // Function ConZ.Vehicle.ShouldShowAviationHud
	void SetVehicleWheelTireDeflated(int32_t WheelIndex, bool isDeflated); // Function ConZ.Vehicle.SetVehicleWheelTireDeflated
	void SetVehicleThrottleAmount(float Value); // Function ConZ.Vehicle.SetVehicleThrottleAmount
	void SetVehicleSteerAmount(float Value); // Function ConZ.Vehicle.SetVehicleSteerAmount
	void SetVehicleLightsActive(bool Value); // Function ConZ.Vehicle.SetVehicleLightsActive
	void SetVehicleHornActive(bool Value); // Function ConZ.Vehicle.SetVehicleHornActive
	void SetVehicleHealth(float Value); // Function ConZ.Vehicle.SetVehicleHealth
	void SetVehicleHandbrakeAmount(float Value); // Function ConZ.Vehicle.SetVehicleHandbrakeAmount
	void SetVehicleGearUp(bool Value); // Function ConZ.Vehicle.SetVehicleGearUp
	void SetVehicleGearDown(bool Value); // Function ConZ.Vehicle.SetVehicleGearDown
	void SetVehicleFuelAmount(float Value); // Function ConZ.Vehicle.SetVehicleFuelAmount
	void SetVehicleFreeLookEnabled(bool Value); // Function ConZ.Vehicle.SetVehicleFreeLookEnabled
	void SetVehicleEngineBlockHealth(float Value); // Function ConZ.Vehicle.SetVehicleEngineBlockHealth
	void SetVehicleDoorWindowCollisionAttached(int32_t doorIndex, bool Value); // Function ConZ.Vehicle.SetVehicleDoorWindowCollisionAttached
	void SetVehicleDoorCollisionAttached(int32_t doorIndex, bool Value); // Function ConZ.Vehicle.SetVehicleDoorCollisionAttached
	void SetVehicleBrakeAmount(float Value); // Function ConZ.Vehicle.SetVehicleBrakeAmount
	void SetVehicleBatteryAmount(float Value); // Function ConZ.Vehicle.SetVehicleBatteryAmount
	void SetCurrentVehicleGear(int32_t Value); // Function ConZ.Vehicle.SetCurrentVehicleGear
	struct FDbIntegerId SaveState(struct FDbIntegerId ID); // Function ConZ.Vehicle.SaveState
	void ResetVehicle(); // Function ConZ.Vehicle.ResetVehicle
	bool RepairVehicle(float healthToRepair); // Function ConZ.Vehicle.RepairVehicle
	void LoadState(struct FDbIntegerId ID); // Function ConZ.Vehicle.LoadState
	bool IsVehicleWheelTireDeflated(int32_t WheelIndex); // Function ConZ.Vehicle.IsVehicleWheelTireDeflated
	bool IsVehicleUpright(); // Function ConZ.Vehicle.IsVehicleUpright
	bool IsVehicleInteriorExposed(); // Function ConZ.Vehicle.IsVehicleInteriorExposed
	bool IsVehicleInAir(); // Function ConZ.Vehicle.IsVehicleInAir
	bool IsVehicleHornActive(); // Function ConZ.Vehicle.IsVehicleHornActive
	bool IsVehicleFreeLookEnabled(); // Function ConZ.Vehicle.IsVehicleFreeLookEnabled
	bool IsVehicleDoorWindowCollisionAttached(int32_t doorIndex); // Function ConZ.Vehicle.IsVehicleDoorWindowCollisionAttached
	bool IsVehicleDoorCollisionAttached(int32_t doorIndex); // Function ConZ.Vehicle.IsVehicleDoorCollisionAttached
	bool IsRadioTurnedOn(); // Function ConZ.Vehicle.IsRadioTurnedOn
	float GetVehicleWheelsSteerAmount(); // Function ConZ.Vehicle.GetVehicleWheelsSteerAmount
	struct FVector GetVehicleVelocity(); // Function ConZ.Vehicle.GetVehicleVelocity
	float GetVehicleThrottleAmount(); // Function ConZ.Vehicle.GetVehicleThrottleAmount
	float GetVehicleSteerAmount(); // Function ConZ.Vehicle.GetVehicleSteerAmount
	float GetVehicleHealthRatio(); // Function ConZ.Vehicle.GetVehicleHealthRatio
	struct FText GetVehicleHealthBarCaption(); // Function ConZ.Vehicle.GetVehicleHealthBarCaption
	float GetVehicleHealth(); // Function ConZ.Vehicle.GetVehicleHealth
	float GetVehicleHandbrakeAmount(); // Function ConZ.Vehicle.GetVehicleHandbrakeAmount
	UGameResourceType* GetVehicleFuelResourceType(); // Function ConZ.Vehicle.GetVehicleFuelResourceType
	float GetVehicleFuelAmountRatio(); // Function ConZ.Vehicle.GetVehicleFuelAmountRatio
	float GetVehicleFuelAmount(); // Function ConZ.Vehicle.GetVehicleFuelAmount
	uint8_t  GetVehicleEngineState(); // Function ConZ.Vehicle.GetVehicleEngineState
	float GetVehicleEngineRpm(); // Function ConZ.Vehicle.GetVehicleEngineRpm
	float GetVehicleEngineBlockHealth(); // Function ConZ.Vehicle.GetVehicleEngineBlockHealth
	float GetVehicleBrakeAmount(); // Function ConZ.Vehicle.GetVehicleBrakeAmount
	UGameResourceType* GetVehicleBatteryResourceType(); // Function ConZ.Vehicle.GetVehicleBatteryResourceType
	float GetVehicleBatteryAmountRatio(); // Function ConZ.Vehicle.GetVehicleBatteryAmountRatio
	float GetVehicleBatteryAmount(); // Function ConZ.Vehicle.GetVehicleBatteryAmount
	struct UAnimInstance* GetVehicleAnimInstance(); // Function ConZ.Vehicle.GetVehicleAnimInstance
	int32_t GetNumVehicleReverseGears(); // Function ConZ.Vehicle.GetNumVehicleReverseGears
	int32_t GetNumVehicleForwardGears(); // Function ConZ.Vehicle.GetNumVehicleForwardGears
	int32_t GetNumVehicleDoorWindows(); // Function ConZ.Vehicle.GetNumVehicleDoorWindows
	int32_t GetNumVehicleDoors(); // Function ConZ.Vehicle.GetNumVehicleDoors
	int32_t GetNumMountees(); // Function ConZ.Vehicle.GetNumMountees
	UUserWidget* GetMountSlotIndicatorsWidget(); // Function ConZ.Vehicle.GetMountSlotIndicatorsWidget
	float GetMaxVehicleHealth(); // Function ConZ.Vehicle.GetMaxVehicleHealth
	float GetMaxVehicleFuelAmount(); // Function ConZ.Vehicle.GetMaxVehicleFuelAmount
	float GetMaxVehicleEngineBlockHealth(); // Function ConZ.Vehicle.GetMaxVehicleEngineBlockHealth
	float GetMaxVehicleBatteryAmount(); // Function ConZ.Vehicle.GetMaxVehicleBatteryAmount
	float GetMass(); // Function ConZ.Vehicle.GetMass
	struct AVehicleItemContainer* GetItemContainer(); // Function ConZ.Vehicle.GetItemContainer
	int32_t GetCurrentVehicleGear(); // Function ConZ.Vehicle.GetCurrentVehicleGear
	bool AreVehicleLightsActive(); // Function ConZ.Vehicle.AreVehicleLightsActive
	void ApplyImpactDamage(float Damage, struct FHitResult& HitResult, struct AActor* OtherActor); // Function ConZ.Vehicle.ApplyImpactDamage
}; 



// Class ConZ.WeaponAction
// Size: 0x28(Inherited: 0x28) 
struct UWeaponAction : public UObject
{

	void RemoveCartridgeFromWeapon(); // Function ConZ.WeaponAction.RemoveCartridgeFromWeapon
	void RemoveAttachmentFromWeapon(struct AWeapon* Weapon, struct AWeaponAttachment* Attachment); // Function ConZ.WeaponAction.RemoveAttachmentFromWeapon
	void OnWeaponActionAnimNotify(uint8_t  notifyType); // Function ConZ.WeaponAction.OnWeaponActionAnimNotify
	void OnActionAnimNotify(uint8_t  notifyType); // Function ConZ.WeaponAction.OnActionAnimNotify
	bool IsCharacterOwnerMountedAsDriver(); // Function ConZ.WeaponAction.IsCharacterOwnerMountedAsDriver
	void InsertCartridgeIntoWeaponAtLocation(struct AWeapon* Weapon, struct AAmmunitionItem* ammo, bool backLocation); // Function ConZ.WeaponAction.InsertCartridgeIntoWeaponAtLocation
	void InsertCartridgeIntoWeapon(struct AWeapon* Weapon, struct AAmmunitionItem* ammo); // Function ConZ.WeaponAction.InsertCartridgeIntoWeapon
	void InsertCartridgeIntoMagazine(struct AWeaponAttachmentMagazine* magazine, struct AAmmunitionItem* ammo); // Function ConZ.WeaponAction.InsertCartridgeIntoMagazine
	struct AWeapon* GetWeapon(); // Function ConZ.WeaponAction.GetWeapon
	void AddAttachmentToWeapon(struct AWeapon* Weapon, struct AWeaponAttachment* Attachment); // Function ConZ.WeaponAction.AddAttachmentToWeapon
}; 



// Class ConZ.RemoveCartridge
// Size: 0x58(Inherited: 0x50) 
struct URemoveCartridge : public UWeaponActionUnloadAmmoSequence
{
	struct FName MontageEndSectionName;  // 0x50(0x8)

}; 



// Class ConZ.VehicleMountSlotsWidget
// Size: 0x270(Inherited: 0x260) 
struct UVehicleMountSlotsWidget : public UUserWidget
{
	struct UCanvasPanel* _mountSlotsCanvas;  // 0x260(0x8)
	char pad_616[8];  // 0x268(0x8)

}; 



// Class ConZ.PrisonerActionSearchObject
// Size: 0x118(Inherited: 0x108) 
struct UPrisonerActionSearchObject : public UPrisonerAction
{
	char pad_264[16];  // 0x108(0x10)

}; 



// Class ConZ.Biome
// Size: 0x270(Inherited: 0x220) 
struct ABiome : public AActor
{
	struct USceneComponent* _root;  // 0x220(0x8)
	struct UStaticMeshComponent* _visualizationSphere;  // 0x228(0x8)
	float _radius;  // 0x230(0x4)
	char pad_564[4];  // 0x234(0x4)
	struct FHuntingBiomeParameters _parameters;  // 0x238(0x38)

}; 



// Class ConZ.AkComponentClientOnly
// Size: 0x3E0(Inherited: 0x3E0) 
struct UAkComponentClientOnly : public UAkComponent
{

}; 



// Class ConZ.ArchitecturalCategory
// Size: 0x58(Inherited: 0x30) 
struct UArchitecturalCategory : public UDataAsset
{
	struct FText CategoryName;  // 0x30(0x18)
	struct TArray<struct UBaseBuildingBlockCraftableItem*> BaseBuildingModules;  // 0x48(0x10)

}; 



// Class ConZ.BasicNotificationDescription
// Size: 0x78(Inherited: 0x40) 
struct UBasicNotificationDescription : public UNotificationDescription
{
	struct FText Message;  // 0x40(0x18)
	int32_t FontSize;  // 0x58(0x4)
	char pad_92[4];  // 0x5C(0x4)
	struct UTexture2D* Icon;  // 0x60(0x8)
	int32_t IconSize;  // 0x68(0x4)
	float Duration;  // 0x6C(0x4)
	char pad_112_1 : 7;  // 0x70(0x1)
	bool ping : 1;  // 0x70(0x1)
	char pad_113[7];  // 0x71(0x7)

}; 



// Class ConZ.ConZWorldSettings
// Size: 0x558(Inherited: 0x380) 
struct AConZWorldSettings : public AWorldSettings
{
	char pad_896[8];  // 0x380(0x8)
	struct AWeatherController2* WeatherController2;  // 0x388(0x8)
	struct AWetnessManager* WetnessManager;  // 0x390(0x8)
	struct AGameEventManager* GameEventManager;  // 0x398(0x8)
	struct AWorldEventManager* WorldEventManager;  // 0x3A0(0x8)
	struct ABuildingManager* BuildingManager;  // 0x3A8(0x8)
	struct AItemContainerManager* ItemContainerManager;  // 0x3B0(0x8)
	struct AConZEconomyManager* EconomyManager;  // 0x3B8(0x8)
	struct AGardenManager* FarmingGardenManager;  // 0x3C0(0x8)
	struct ARadiationManager* RadiationManager;  // 0x3C8(0x8)
	struct AHuntingManager* HuntingManager;  // 0x3D0(0x8)
	struct ACookingManager* CookingManager;  // 0x3D8(0x8)
	struct AMugshotRoom* MugshotRoom;  // 0x3E0(0x8)
	struct TArray<struct ARadioStation*> RadioStations;  // 0x3E8(0x10)
	struct UAkAudioEvent* RadioNoiseStartEvent;  // 0x3F8(0x8)
	struct UAkAudioEvent* RadioNoiseStopEvent;  // 0x400(0x8)
	struct UAkAudioEvent* RadioStopEvent;  // 0x408(0x8)
	struct UAkAudioEvent* RadioStationChangeNoiseEvent;  // 0x410(0x8)
	struct UEntitySystemSettings* EntitySystemSettings;  // 0x418(0x8)
	struct FItemSpawningSettings ItemSpawningSettings;  // 0x420(0x44)
	char pad_1124[4];  // 0x464(0x4)
	struct AVolume* IslandBoundsVolume;  // 0x468(0x8)
	char pad_1136_1 : 7;  // 0x470(0x1)
	bool UseVirtualizationSystem : 1;  // 0x470(0x1)
	char pad_1137[3];  // 0x471(0x3)
	struct FBox2D WorldBounds;  // 0x474(0x14)
	struct FGameplayTag HeightMapGameplayTag;  // 0x488(0x8)
	struct FGameplayTag MapPropertiesGameplayTag;  // 0x490(0x8)
	struct FGameplayTag GerstnerWaveOcclusionPropertiesGameplayTag;  // 0x498(0x8)
	struct FGameplayTag OceanOpacityGameplayTag;  // 0x4A0(0x8)
	struct TArray<struct FConZPrisonerSpawnEquipmentProperties> PrisonerSpawnEquipment;  // 0x4A8(0x10)
	char pad_1208_1 : 7;  // 0x4B8(0x1)
	bool SpawnInAir : 1;  // 0x4B8(0x1)
	char pad_1209[3];  // 0x4B9(0x3)
	float FirstSpawnAltitude;  // 0x4BC(0x4)
	float RespawnAltitude;  // 0x4C0(0x4)
	struct FFloatInterval MapMinMaxElevation;  // 0x4C4(0x8)
	char pad_1228[4];  // 0x4CC(0x4)
	struct UAvailabilityGrid* AvailabilityGrid;  // 0x4D0(0x8)
	char pad_1240[104];  // 0x4D8(0x68)
	UAvailabilityGrid* _availabilityGridClass;  // 0x540(0x8)
	struct TArray<struct FVehicleSpawnPointData> _vehicleSpawnPoints;  // 0x548(0x10)

}; 



// Class ConZ.Item
// Size: 0x910(Inherited: 0x220) 
struct AItem : public AActor
{
	char pad_544[160];  // 0x220(0xA0)
	struct FMulticastInlineDelegate DebugTextChanged;  // 0x2C0(0x10)
	struct FMulticastInlineDelegate PickedUpState;  // 0x2D0(0x10)
	struct FMulticastInlineDelegate OnStaticMeshChanged;  // 0x2E0(0x10)
	struct FMulticastInlineDelegate OnSkeletalMeshChanged;  // 0x2F0(0x10)
	char pad_768[16];  // 0x300(0x10)
	struct UStaticMeshComponent* Mesh;  // 0x310(0x8)
	char pad_792[272];  // 0x318(0x110)
	struct UThrowingComponent* ThrowingComponent;  // 0x428(0x8)
	struct FText _caption;  // 0x430(0x18)
	struct FText _description;  // 0x448(0x18)
	int32_t _uses;  // 0x460(0x4)
	float _health;  // 0x464(0x4)
	float _maxHealth;  // 0x468(0x4)
	float _maxHealthPercentageAfterReachingBadQuality;  // 0x46C(0x4)
	float _weight;  // 0x470(0x4)
	float _initialWeightUsed;  // 0x474(0x4)
	float _maxWaterWeightAsRatioOfWeight;  // 0x478(0x4)
	float _radiationDecreaseRate;  // 0x47C(0x4)
	float _maxRadiationAmountPerWeight;  // 0x480(0x4)
	float _baseRadiationPropagationFactor;  // 0x484(0x4)
	char pad_1160_1 : 7;  // 0x488(0x1)
	bool _canEverDecontaminate : 1;  // 0x488(0x1)
	char pad_1161[7];  // 0x489(0x7)
	struct UChoppingRecipeDataAsset* _choppingRecipeDataAsset;  // 0x490(0x8)
	char pad_1176_1 : 7;  // 0x498(0x1)
	bool _shouldBeMaintained : 1;  // 0x498(0x1)
	char pad_1177_1 : 7;  // 0x499(0x1)
	bool _canBeDropped : 1;  // 0x499(0x1)
	char pad_1178_1 : 7;  // 0x49A(0x1)
	bool _canTakeInHands : 1;  // 0x49A(0x1)
	char pad_1179_1 : 7;  // 0x49B(0x1)
	bool _canBeVisibleInVicinity : 1;  // 0x49B(0x1)
	char pad_1180_1 : 7;  // 0x49C(0x1)
	bool _canPlaceItemsOn : 1;  // 0x49C(0x1)
	char pad_1181_1 : 7;  // 0x49D(0x1)
	bool _canPlaceBlueprintsOn : 1;  // 0x49D(0x1)
	char pad_1182[2];  // 0x49E(0x2)
	struct USkeletalMesh* _overrideSkeletalMesh;  // 0x4A0(0x8)
	char pad_1192[8];  // 0x4A8(0x8)
	struct FTransform _overrideSkeletalMeshRelativeTransform;  // 0x4B0(0x30)
	uint8_t  _ifExhausted;  // 0x4E0(0x1)
	char pad_1249[3];  // 0x4E1(0x3)
	float _resourceAmountUsedPerWash;  // 0x4E4(0x4)
	struct UTexture2D* _inventoryIcon;  // 0x4E8(0x8)
	struct UTexture2D* _inventoryIconInHands;  // 0x4F0(0x8)
	struct UTexture2D* _outsideInventoryIcon;  // 0x4F8(0x8)
	uint32_t _sizeX;  // 0x500(0x4)
	uint32_t _sizeY;  // 0x504(0x4)
	struct TArray<struct UBaseItemTag*> _inventoryWhiteList;  // 0x508(0x10)
	struct TArray<struct UBaseItemTag*> _inventoryBlackList;  // 0x518(0x10)
	float _maxContainedWeight;  // 0x528(0x4)
	char pad_1324_1 : 7;  // 0x52C(0x1)
	bool _canContainNonEmptyItems : 1;  // 0x52C(0x1)
	char pad_1325_1 : 7;  // 0x52D(0x1)
	bool _canBeContainedIfNonEmpty : 1;  // 0x52D(0x1)
	char pad_1326_1 : 7;  // 0x52E(0x1)
	bool _isIgnoredBySpawners : 1;  // 0x52E(0x1)
	char pad_1327[1];  // 0x52F(0x1)
	struct FFloatInterval _spawnTimeoutPerPlayer;  // 0x530(0x8)
	struct FItemLocation _itemLocation;  // 0x538(0xF)
	uint8_t  _rarity;  // 0x547(0x1)
	struct FGameplayTagContainer _itemSpawnTypes;  // 0x548(0x20)
	struct FGameplayTag _itemSpawnGroup;  // 0x568(0x8)
	struct FVector _spawnLocationOffset;  // 0x570(0xC)
	struct FRotator _spawnRotationOffset;  // 0x57C(0xC)
	float _spawnRotationRandomization;  // 0x588(0x4)
	float _placementCollisionUpOffset;  // 0x58C(0x4)
	char pad_1424_1 : 7;  // 0x590(0x1)
	bool _shouldOverrideUsageWhenSpawnedBySpawners : 1;  // 0x590(0x1)
	char pad_1425[3];  // 0x591(0x3)
	float _initialUsageWhenSpawnedBySpawners;  // 0x594(0x4)
	float _randomizeUsageWhenSpawnedBySpawners;  // 0x598(0x4)
	char pad_1436[4];  // 0x59C(0x4)
	struct TArray<struct UBaseItemTag*> _itemTags;  // 0x5A0(0x10)
	struct TArray<struct UBaseItemTag*> _ownedItemTags;  // 0x5B0(0x10)
	uint8_t  _noiseLevel;  // 0x5C0(0x1)
	char pad_1473[7];  // 0x5C1(0x7)
	struct FItemMotionNoise _motionNoise;  // 0x5C8(0x8)
	struct UAkAudioEvent* _inventoryHandlingSound;  // 0x5D0(0x8)
	struct UAkAudioEvent* _destroyedSound;  // 0x5D8(0x8)
	struct TArray<UCraftingIngredientType*> _craftingIngredientTypes;  // 0x5E0(0x10)
	uint8_t  _craftingInteraction;  // 0x5F0(0x1)
	char pad_1521[7];  // 0x5F1(0x7)
	struct TArray<struct FCraftingPart> _defaultCraftingParts;  // 0x5F8(0x10)
	float _damageOnUse;  // 0x608(0x4)
	float _damageOverTime;  // 0x60C(0x4)
	float _autoDestructTime;  // 0x610(0x4)
	char pad_1556_1 : 7;  // 0x614(0x1)
	bool _allowContainedItemsDecay : 1;  // 0x614(0x1)
	char pad_1557[7];  // 0x615(0x7)
	char pad_1564_1 : 7;  // 0x61C(0x1)
	bool _shouldDestroyContainedItemsOnDestroyEvent : 1;  // 0x61C(0x1)
	char pad_1565[3];  // 0x61D(0x3)
	float _minTemperatureForHeatDamage;  // 0x620(0x4)
	float _containedDamageStartPercentage;  // 0x624(0x4)
	float _damageResponseFactor;  // 0x628(0x4)
	char pad_1580[4];  // 0x62C(0x4)
	UAttachmentSocketMountType* _attachmentSocketMountType;  // 0x630(0x8)
	struct TArray<struct FAttachmentSocket> _attachmentSockets;  // 0x638(0x10)
	UAttachmentSocketMountType* _holsterAttachmentSocketMountType;  // 0x648(0x8)
	struct TMap<UAttachmentSocketMountType*, struct FAttachmentSocketOffset> _attachmentSocketsOffset;  // 0x650(0x50)
	char pad_1696_1 : 7;  // 0x6A0(0x1)
	bool _enableGlowOnBeginPlay : 1;  // 0x6A0(0x1)
	char pad_1697_1 : 7;  // 0x6A1(0x1)
	bool _enableAwarenessGlow : 1;  // 0x6A1(0x1)
	char pad_1698_1 : 7;  // 0x6A2(0x1)
	bool _enableHoverGlow : 1;  // 0x6A2(0x1)
	char pad_1699[5];  // 0x6A3(0x5)
	struct UStaticMesh* _placementMeshOverride;  // 0x6A8(0x8)
	struct UStaticMesh* _staticMeshHolsterOverride;  // 0x6B0(0x8)
	struct USkeletalMesh* _skeletalMeshHolsterOverride;  // 0x6B8(0x8)
	char pad_1728_1 : 7;  // 0x6C0(0x1)
	bool _hasHighLoadPriorityInVirtualization : 1;  // 0x6C0(0x1)
	char pad_1729[3];  // 0x6C1(0x3)
	float _virtualizationDistanceOffset;  // 0x6C4(0x4)
	char pad_1736_1 : 7;  // 0x6C8(0x1)
	bool _canEverBeVirtualized : 1;  // 0x6C8(0x1)
	char pad_1737[1];  // 0x6C9(0x1)
	char pad_1738_1 : 7;  // 0x6CA(0x1)
	bool _isSubjectToAllowMinesConfig : 1;  // 0x6CA(0x1)
	char pad_1739[1];  // 0x6CB(0x1)
	float _resultHealthMultiplierWhenCraftingIngredient;  // 0x6CC(0x4)
	float _preferredDamagePerUpdate;  // 0x6D0(0x4)
	char pad_1748_1 : 7;  // 0x6D4(0x1)
	bool _useHandCorrections : 1;  // 0x6D4(0x1)
	char pad_1749[3];  // 0x6D5(0x3)
	float _vicinityCheckDistance;  // 0x6D8(0x4)
	float _reachabilityTestZOffset;  // 0x6DC(0x4)
	struct TArray<UObject*> _stackableClasses;  // 0x6E0(0x10)
	int32_t _maxNumOfStacks;  // 0x6F0(0x4)
	float _bloodDryingSpeed;  // 0x6F4(0x4)
	struct FItemStackData _stackData;  // 0x6F8(0x10)
	char pad_1800[8];  // 0x708(0x8)
	struct TArray<struct UItemStateBase*> _craftingPartsData;  // 0x710(0x10)
	char pad_1824[8];  // 0x720(0x8)
	struct USkeletalMeshComponent* _skeletalMeshComponent;  // 0x728(0x8)
	char pad_1840[4];  // 0x730(0x4)
	float _weightUsed;  // 0x734(0x4)
	char pad_1848[24];  // 0x738(0x18)
	struct FPackedEntitySetupAndId _repServerEntitySetupAndId;  // 0x750(0x8)
	struct TArray<struct UItemComponent*> _itemComponents;  // 0x758(0x10)
	struct AActor* _attachParentObject;  // 0x768(0x8)
	struct FVisibilityReplication _visibilityReplication;  // 0x770(0x8)
	char pad_1912[60];  // 0x778(0x3C)
	float _radiationAmount;  // 0x7B4(0x4)
	float _uncraftTime;  // 0x7B8(0x4)
	char pad_1980[4];  // 0x7BC(0x4)
	uint64_t _replicatedState;  // 0x7C0(0x8)
	char pad_1992[1];  // 0x7C8(0x1)
	char _flagsReplicated;  // 0x7C9(0x1)
	char pad_1994[38];  // 0x7CA(0x26)
	struct USceneComponent* _tempSceneComponent;  // 0x7F0(0x8)
	char pad_2040[8];  // 0x7F8(0x8)
	int64_t _expirationTime;  // 0x800(0x8)
