#pragma once 
#include "SDK.h" 
 
 
// DelegateFunction Engine.InputVectorAxisHandlerDynamicSignature__DelegateSignature
// Size: 0xC(Inherited: 0x0) 
struct FInputVectorAxisHandlerDynamicSignature__DelegateSignature
{
	struct FVector AxisValue;  // 0x0(0xC)

}; 
// ScriptStruct Engine.BlendParameter
// Size: 0x20(Inherited: 0x0) 
struct FBlendParameter
{
	struct FString DisplayName;  // 0x0(0x10)
	float Min;  // 0x10(0x4)
	float Max;  // 0x14(0x4)
	int32_t GridNum;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)

}; 
// ScriptStruct Engine.RawDistribution
// Size: 0x20(Inherited: 0x0) 
struct FRawDistribution
{
	struct FDistributionLookupTable Table;  // 0x0(0x20)

}; 
// Function Engine.PrimitiveComponent.IsOverlappingComponent
// Size: 0x10(Inherited: 0x0) 
struct FIsOverlappingComponent
{
	struct UPrimitiveComponent* OtherComp;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function Engine.LightComponent.SetEnableLightShaftBloom
// Size: 0x1(Inherited: 0x0) 
struct FSetEnableLightShaftBloom
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bNewValue : 1;  // 0x0(0x1)

}; 
// Function Engine.Character.IsPlayingRootMotion
// Size: 0x1(Inherited: 0x0) 
struct FIsPlayingRootMotion
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.InputComponent.GetControllerAnalogKeyState
// Size: 0x20(Inherited: 0x0) 
struct FGetControllerAnalogKeyState
{
	struct FKey Key;  // 0x0(0x18)
	float ReturnValue;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)

}; 
// Function Engine.AnimNotifyState.Received_NotifyTick
// Size: 0x18(Inherited: 0x0) 
struct FReceived_NotifyTick
{
	struct USkeletalMeshComponent* MeshComp;  // 0x0(0x8)
	struct UAnimSequenceBase* Animation;  // 0x8(0x8)
	float FrameDeltaTime;  // 0x10(0x4)
	char pad_20_1 : 7;  // 0x14(0x1)
	bool ReturnValue : 1;  // 0x14(0x1)
	char pad_21[3];  // 0x15(0x3)

}; 
// Function Engine.KismetSystemLibrary.GetPrimaryAssetsWithBundleState
// Size: 0x48(Inherited: 0x0) 
struct FGetPrimaryAssetsWithBundleState
{
	struct TArray<struct FName> RequiredBundles;  // 0x0(0x10)
	struct TArray<struct FName> ExcludedBundles;  // 0x10(0x10)
	struct TArray<struct FPrimaryAssetType> ValidTypes;  // 0x20(0x10)
	char pad_48_1 : 7;  // 0x30(0x1)
	bool bForceCurrentState : 1;  // 0x30(0x1)
	char pad_49[7];  // 0x31(0x7)
	struct TArray<struct FPrimaryAssetId> OutPrimaryAssetIdList;  // 0x38(0x10)

}; 
// Function Engine.Actor.K2_SetActorLocation
// Size: 0x9C(Inherited: 0x0) 
struct FK2_SetActorLocation
{
	struct FVector NewLocation;  // 0x0(0xC)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool bSweep : 1;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)
	struct FHitResult SweepHitResult;  // 0x10(0x88)
	char pad_152_1 : 7;  // 0x98(0x1)
	bool bTeleport : 1;  // 0x98(0x1)
	char pad_153_1 : 7;  // 0x99(0x1)
	bool ReturnValue : 1;  // 0x99(0x1)
	char pad_154[2];  // 0x9A(0x2)

}; 
// Function Engine.PhysicsConstraintComponent.GetConstraintForce
// Size: 0x18(Inherited: 0x0) 
struct FGetConstraintForce
{
	struct FVector OutLinearForce;  // 0x0(0xC)
	struct FVector OutAngularForce;  // 0xC(0xC)

}; 
// Function Engine.CurveSourceInterface.GetCurves
// Size: 0x10(Inherited: 0x0) 
struct FGetCurves
{
	struct TArray<struct FNamedCurveValue> OutValues;  // 0x0(0x10)

}; 
// ScriptStruct Engine.VectorRK4SpringInterpolator
// Size: 0x8(Inherited: 0x0) 
struct FVectorRK4SpringInterpolator
{
	float StiffnessConstant;  // 0x0(0x4)
	float DampeningRatio;  // 0x4(0x4)

}; 
// Function Engine.SkeletalMesh.K2_GetAllMorphTargetNames
// Size: 0x10(Inherited: 0x0) 
struct FK2_GetAllMorphTargetNames
{
	struct TArray<struct FString> ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.KismetMathLibrary.BreakVector
// Size: 0x18(Inherited: 0x0) 
struct FBreakVector
{
	struct FVector InVec;  // 0x0(0xC)
	float X;  // 0xC(0x4)
	float Y;  // 0x10(0x4)
	float Z;  // 0x14(0x4)

}; 
// Function Engine.KismetSystemLibrary.CanLaunchURL
// Size: 0x18(Inherited: 0x0) 
struct FCanLaunchURL
{
	struct FString URL;  // 0x0(0x10)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// Function Engine.KismetMathLibrary.Matrix_GetFrustumRightPlane
// Size: 0x60(Inherited: 0x0) 
struct FMatrix_GetFrustumRightPlane
{
	struct FMatrix M;  // 0x0(0x40)
	struct FPlane OutPlane;  // 0x40(0x10)
	char pad_80_1 : 7;  // 0x50(0x1)
	bool ReturnValue : 1;  // 0x50(0x1)
	char pad_81[15];  // 0x51(0xF)

}; 
// Function Engine.KismetSystemLibrary.K2_InvalidateTimerHandle
// Size: 0x10(Inherited: 0x0) 
struct FK2_InvalidateTimerHandle
{
	struct FTimerHandle Handle;  // 0x0(0x8)
	struct FTimerHandle ReturnValue;  // 0x8(0x8)

}; 
// Function Engine.KismetSystemLibrary.ParseCommandLine
// Size: 0x80(Inherited: 0x0) 
struct FParseCommandLine
{
	struct FString InCmdLine;  // 0x0(0x10)
	struct TArray<struct FString> OutTokens;  // 0x10(0x10)
	struct TArray<struct FString> OutSwitches;  // 0x20(0x10)
	struct TMap<struct FString, struct FString> OutParams;  // 0x30(0x50)

}; 
// ScriptStruct Engine.DistributionLookupTable
// Size: 0x20(Inherited: 0x0) 
struct FDistributionLookupTable
{
	float TimeScale;  // 0x0(0x4)
	float TimeBias;  // 0x4(0x4)
	struct TArray<float> Values;  // 0x8(0x10)
	char Op;  // 0x18(0x1)
	char EntryCount;  // 0x19(0x1)
	char EntryStride;  // 0x1A(0x1)
	char SubEntryStride;  // 0x1B(0x1)
	char LockFlag;  // 0x1C(0x1)
	char pad_29[3];  // 0x1D(0x3)

}; 
// ScriptStruct Engine.A2Pose
// Size: 0x10(Inherited: 0x0) 
struct FA2Pose
{
	struct TArray<struct FTransform> Bones;  // 0x0(0x10)

}; 
// SparseDelegateFunction Engine.ComponentWakeSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FComponentWakeSignature__DelegateSignature
{
	struct UPrimitiveComponent* WakingComponent;  // 0x0(0x8)
	struct FName BoneName;  // 0x8(0x8)

}; 
// Function Engine.GameModeBase.K2_OnSwapPlayerControllers
// Size: 0x10(Inherited: 0x0) 
struct FK2_OnSwapPlayerControllers
{
	struct APlayerController* OldPC;  // 0x0(0x8)
	struct APlayerController* NewPC;  // 0x8(0x8)

}; 
// ScriptStruct Engine.HitResult
// Size: 0x88(Inherited: 0x0) 
struct FHitResult
{
	int32_t FaceIndex;  // 0x0(0x4)
	float Time;  // 0x4(0x4)
	float Distance;  // 0x8(0x4)
	struct FVector_NetQuantize Location;  // 0xC(0xC)
	struct FVector_NetQuantize ImpactPoint;  // 0x18(0xC)
	struct FVector_NetQuantizeNormal Normal;  // 0x24(0xC)
	struct FVector_NetQuantizeNormal ImpactNormal;  // 0x30(0xC)
	struct FVector_NetQuantize TraceStart;  // 0x3C(0xC)
	struct FVector_NetQuantize TraceEnd;  // 0x48(0xC)
	float PenetrationDepth;  // 0x54(0x4)
	int32_t Item;  // 0x58(0x4)
	char ElementIndex;  // 0x5C(0x1)
	char bBlockingHit : 1;  // 0x5D(0x1)
	char bStartPenetrating : 1;  // 0x5D(0x1)
	char pad_93_1 : 6;  // 0x5D(0x1)
	char pad_94[3];  // 0x5E(0x3)
	struct TWeakObjectPtr<UPhysicalMaterial> PhysMaterial;  // 0x60(0x8)
	struct TWeakObjectPtr<AActor> Actor;  // 0x68(0x8)
	struct TWeakObjectPtr<UPrimitiveComponent> Component;  // 0x70(0x8)
	struct FName BoneName;  // 0x78(0x8)
	struct FName MyBoneName;  // 0x80(0x8)

}; 
// Function Engine.DirectionalLightComponent.SetDynamicShadowDistanceStationaryLight
// Size: 0x4(Inherited: 0x0) 
struct FSetDynamicShadowDistanceStationaryLight
{
	float NewValue;  // 0x0(0x4)

}; 
// Function Engine.KismetSystemLibrary.SetObjectPropertyByName
// Size: 0x18(Inherited: 0x0) 
struct FSetObjectPropertyByName
{
	struct UObject* Object;  // 0x0(0x8)
	struct FName PropertyName;  // 0x8(0x8)
	struct UObject* Value;  // 0x10(0x8)

}; 
// DelegateFunction Engine.OnSubmixEnvelopeBP__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FOnSubmixEnvelopeBP__DelegateSignature
{
	struct TArray<float> Envelope;  // 0x0(0x10)

}; 
// Function Engine.KismetSystemLibrary.ResetGamepadAssignmentToController
// Size: 0x4(Inherited: 0x0) 
struct FResetGamepadAssignmentToController
{
	int32_t ControllerId;  // 0x0(0x4)

}; 
// Function Engine.PrimitiveComponent.GetMassScale
// Size: 0xC(Inherited: 0x0) 
struct FGetMassScale
{
	struct FName BoneName;  // 0x0(0x8)
	float ReturnValue;  // 0x8(0x4)

}; 
// Function Engine.Actor.MakeMIDForMaterial
// Size: 0x10(Inherited: 0x0) 
struct FMakeMIDForMaterial
{
	struct UMaterialInterface* Parent;  // 0x0(0x8)
	struct UMaterialInstanceDynamic* ReturnValue;  // 0x8(0x8)

}; 
// ScriptStruct Engine.FloatDistribution
// Size: 0x20(Inherited: 0x0) 
struct FFloatDistribution
{
	struct FDistributionLookupTable Table;  // 0x0(0x20)

}; 
// Function Engine.KismetSystemLibrary.Conv_SoftObjectReferenceToString
// Size: 0x38(Inherited: 0x0) 
struct FConv_SoftObjectReferenceToString
{
	struct TSoftObjectPtr<UObject> SoftObjectReference;  // 0x0(0x28)
	struct FString ReturnValue;  // 0x28(0x10)

}; 
// Function Engine.KismetMathLibrary.Matrix_TransformVector4
// Size: 0x60(Inherited: 0x0) 
struct FMatrix_TransformVector4
{
	struct FMatrix M;  // 0x0(0x40)
	struct FVector4 V;  // 0x40(0x10)
	struct FVector4 ReturnValue;  // 0x50(0x10)

}; 
// ScriptStruct Engine.Vector4Distribution
// Size: 0x20(Inherited: 0x0) 
struct FVector4Distribution
{
	struct FDistributionLookupTable Table;  // 0x0(0x20)

}; 
// Function Engine.PrimitiveComponent.GetPhysicsAngularVelocityInRadians
// Size: 0x14(Inherited: 0x0) 
struct FGetPhysicsAngularVelocityInRadians
{
	struct FName BoneName;  // 0x0(0x8)
	struct FVector ReturnValue;  // 0x8(0xC)

}; 
// ScriptStruct Engine.RootMotionExtractionStep
// Size: 0x10(Inherited: 0x0) 
struct FRootMotionExtractionStep
{
	struct UAnimSequence* AnimSequence;  // 0x0(0x8)
	float StartPosition;  // 0x8(0x4)
	float EndPosition;  // 0xC(0x4)

}; 
// ScriptStruct Engine.PerPlatformInt
// Size: 0x4(Inherited: 0x0) 
struct FPerPlatformInt
{
	int32_t Default;  // 0x0(0x4)

}; 
// SparseDelegateFunction Engine.ComponentOnInputTouchEndSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FComponentOnInputTouchEndSignature__DelegateSignature
{
	char ETouchIndex FingerIndex;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct UPrimitiveComponent* TouchedComponent;  // 0x8(0x8)

}; 
// SparseDelegateFunction Engine.ActorHitSignature__DelegateSignature
// Size: 0xA8(Inherited: 0x0) 
struct FActorHitSignature__DelegateSignature
{
	struct AActor* SelfActor;  // 0x0(0x8)
	struct AActor* OtherActor;  // 0x8(0x8)
	struct FVector NormalImpulse;  // 0x10(0xC)
	struct FHitResult Hit;  // 0x1C(0x88)
	char pad_164[4];  // 0xA4(0x4)

}; 
// Function Engine.KismetTextLibrary.AsTimespan_Timespan
// Size: 0x20(Inherited: 0x0) 
struct FAsTimespan_Timespan
{
	struct FTimespan InTimespan;  // 0x0(0x8)
	struct FText ReturnValue;  // 0x8(0x18)

}; 
// ScriptStruct Engine.VectorDistribution
// Size: 0x20(Inherited: 0x0) 
struct FVectorDistribution
{
	struct FDistributionLookupTable Table;  // 0x0(0x20)

}; 
// Function Engine.KismetRenderingLibrary.ReadRenderTargetRawPixel
// Size: 0x28(Inherited: 0x0) 
struct FReadRenderTargetRawPixel
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct UTextureRenderTarget2D* TextureRenderTarget;  // 0x8(0x8)
	int32_t X;  // 0x10(0x4)
	int32_t Y;  // 0x14(0x4)
	struct FLinearColor ReturnValue;  // 0x18(0x10)

}; 
// SparseDelegateFunction Engine.TakePointDamageSignature__DelegateSignature
// Size: 0x58(Inherited: 0x0) 
struct FTakePointDamageSignature__DelegateSignature
{
	struct AActor* DamagedActor;  // 0x0(0x8)
	float Damage;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)
	struct AController* InstigatedBy;  // 0x10(0x8)
	struct FVector HitLocation;  // 0x18(0xC)
	char pad_36[4];  // 0x24(0x4)
	struct UPrimitiveComponent* FHitComponent;  // 0x28(0x8)
	struct FName BoneName;  // 0x30(0x8)
	struct FVector ShotFromDirection;  // 0x38(0xC)
	char pad_68[4];  // 0x44(0x4)
	struct UDamageType* DamageType;  // 0x48(0x8)
	struct AActor* DamageCauser;  // 0x50(0x8)

}; 
// ScriptStruct Engine.TTVectorTrack
// Size: 0x28(Inherited: 0x20) 
struct FTTVectorTrack : public FTTPropertyTrack
{
	struct UCurveVector* CurveVector;  // 0x20(0x8)

}; 
// Function Engine.KismetMathLibrary.BooleanNOR
// Size: 0x3(Inherited: 0x0) 
struct FBooleanNOR
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool A : 1;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool B : 1;  // 0x1(0x1)
	char pad_2_1 : 7;  // 0x2(0x1)
	bool ReturnValue : 1;  // 0x2(0x1)

}; 
// ScriptStruct Engine.FloatRK4SpringInterpolator
// Size: 0x8(Inherited: 0x0) 
struct FFloatRK4SpringInterpolator
{
	float StiffnessConstant;  // 0x0(0x4)
	float DampeningRatio;  // 0x4(0x4)

}; 
// Function Engine.KismetMathLibrary.BreakTimespan2
// Size: 0x20(Inherited: 0x0) 
struct FBreakTimespan2
{
	struct FTimespan InTimespan;  // 0x0(0x8)
	int32_t Days;  // 0x8(0x4)
	int32_t Hours;  // 0xC(0x4)
	int32_t Minutes;  // 0x10(0x4)
	int32_t Seconds;  // 0x14(0x4)
	int32_t FractionNano;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)

}; 
// DelegateFunction Engine.OnAudioMultiEnvelopeValue__DelegateSignature
// Size: 0xC(Inherited: 0x0) 
struct FOnAudioMultiEnvelopeValue__DelegateSignature
{
	float AverageEnvelopeValue;  // 0x0(0x4)
	float MaxEnvelope;  // 0x4(0x4)
	int32_t NumWaveInstances;  // 0x8(0x4)

}; 
// DelegateFunction Engine.OnMontageEndedMCDelegate__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FOnMontageEndedMCDelegate__DelegateSignature
{
	struct UAnimMontage* Montage;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool bInterrupted : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// DelegateFunction Engine.OnAudioPlaybackPercent__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FOnAudioPlaybackPercent__DelegateSignature
{
	struct USoundWave* PlayingSoundWave;  // 0x0(0x8)
	float PlaybackPercent;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function Engine.AnimInstance.GetPropagateNotifiesToLinkedInstances
// Size: 0x1(Inherited: 0x0) 
struct FGetPropagateNotifiesToLinkedInstances
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.GameplayStatics.FindNearestActor
// Size: 0x30(Inherited: 0x0) 
struct FFindNearestActor
{
	struct FVector Origin;  // 0x0(0xC)
	char pad_12[4];  // 0xC(0x4)
	struct TArray<struct AActor*> ActorsToCheck;  // 0x10(0x10)
	float Distance;  // 0x20(0x4)
	char pad_36[4];  // 0x24(0x4)
	struct AActor* ReturnValue;  // 0x28(0x8)

}; 
// ScriptStruct Engine.FormatArgumentData
// Size: 0x40(Inherited: 0x0) 
struct FFormatArgumentData
{
	struct FString ArgumentName;  // 0x0(0x10)
	char EFormatArgumentType ArgumentValueType;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)
	struct FText ArgumentValue;  // 0x18(0x18)
	int32_t ArgumentValueInt;  // 0x30(0x4)
	float ArgumentValueFloat;  // 0x34(0x4)
	uint8_t  ArgumentValueGender;  // 0x38(0x1)
	char pad_57[7];  // 0x39(0x7)

}; 
// Function Engine.KismetSystemLibrary.SetUserActivity
// Size: 0x18(Inherited: 0x0) 
struct FSetUserActivity
{
	struct FUserActivity UserActivity;  // 0x0(0x18)

}; 
// Function Engine.Actor.GetActorEnableCollision
// Size: 0x1(Inherited: 0x0) 
struct FGetActorEnableCollision
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.SoundSubmix.AddSpectralAnalysisDelegate
// Size: 0x40(Inherited: 0x0) 
struct FAddSpectralAnalysisDelegate
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct TArray<struct FSoundSubmixSpectralAnalysisBandSettings> InBandSettings;  // 0x8(0x10)
	struct FDelegate OnSubmixSpectralAnalysisBP;  // 0x18(0x10)
	float UpdateRate;  // 0x28(0x4)
	float DecibelNoiseFloor;  // 0x2C(0x4)
	char pad_48_1 : 7;  // 0x30(0x1)
	bool bDoNormalize : 1;  // 0x30(0x1)
	char pad_49_1 : 7;  // 0x31(0x1)
	bool bDoAutoRange : 1;  // 0x31(0x1)
	char pad_50[2];  // 0x32(0x2)
	float AutoRangeAttackTime;  // 0x34(0x4)
	float AutoRangeReleaseTime;  // 0x38(0x4)
	char pad_60[4];  // 0x3C(0x4)

}; 
// Function Engine.BlueprintPathsLibrary.GameSourceDir
// Size: 0x10(Inherited: 0x0) 
struct FGameSourceDir
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// ScriptStruct Engine.ExpressionInput
// Size: 0x14(Inherited: 0x0) 
struct FExpressionInput
{
	int32_t OutputIndex;  // 0x0(0x4)
	struct FName InputName;  // 0x4(0x8)
	struct FName ExpressionName;  // 0xC(0x8)

}; 
// Function Engine.TimelineComponent.SetFloatCurve
// Size: 0x10(Inherited: 0x0) 
struct FSetFloatCurve
{
	struct UCurveFloat* NewFloatCurve;  // 0x0(0x8)
	struct FName FloatTrackName;  // 0x8(0x8)

}; 
// Function Engine.KismetMathLibrary.Quat_SetFromEuler
// Size: 0x20(Inherited: 0x0) 
struct FQuat_SetFromEuler
{
	struct FQuat Q;  // 0x0(0x10)
	struct FVector Euler;  // 0x10(0xC)
	char pad_28[4];  // 0x1C(0x4)

}; 
// DelegateFunction Engine.InterpToMovementComponent.OnInterpToResetDelegate__DelegateSignature
// Size: 0x8C(Inherited: 0x0) 
struct FOnInterpToResetDelegate__DelegateSignature
{
	struct FHitResult ImpactResult;  // 0x0(0x88)
	float Time;  // 0x88(0x4)

}; 
// Function Engine.KismetStringLibrary.GetSubstring
// Size: 0x28(Inherited: 0x0) 
struct FGetSubstring
{
	struct FString SourceString;  // 0x0(0x10)
	int32_t StartIndex;  // 0x10(0x4)
	int32_t Length;  // 0x14(0x4)
	struct FString ReturnValue;  // 0x18(0x10)

}; 
// Function Engine.Actor.K2_GetComponentsByClass
// Size: 0x18(Inherited: 0x0) 
struct FK2_GetComponentsByClass
{
	UActorComponent* ComponentClass;  // 0x0(0x8)
	struct TArray<struct UActorComponent*> ReturnValue;  // 0x8(0x10)

}; 
// Function Engine.TextRenderComponent.SetVerticalAlignment
// Size: 0x1(Inherited: 0x0) 
struct FSetVerticalAlignment
{
	char EVerticalTextAligment Value;  // 0x0(0x1)

}; 
// SparseDelegateFunction Engine.ComponentBeginCursorOverSignature__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FComponentBeginCursorOverSignature__DelegateSignature
{
	struct UPrimitiveComponent* TouchedComponent;  // 0x0(0x8)

}; 
// ScriptStruct Engine.MaterialAttributesInput
// Size: 0x18(Inherited: 0x14) 
struct FMaterialAttributesInput : public FExpressionInput
{
	int32_t PropertyConnectedBitmask;  // 0x14(0x4)

}; 
// SparseDelegateFunction Engine.ActorEndPlaySignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FActorEndPlaySignature__DelegateSignature
{
	struct AActor* Actor;  // 0x0(0x8)
	char EEndPlayReason EndPlayReason;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function Engine.KismetSystemLibrary.IsStandalone
// Size: 0x10(Inherited: 0x0) 
struct FIsStandalone
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// ScriptStruct Engine.ExpressionOutput
// Size: 0x8(Inherited: 0x0) 
struct FExpressionOutput
{
	struct FName OutputName;  // 0x0(0x8)

}; 
// ScriptStruct Engine.AnimNode_ApplyMeshSpaceAdditive
// Size: 0xD0(Inherited: 0x10) 
struct FAnimNode_ApplyMeshSpaceAdditive : public FAnimNode_Base
{
	struct FPoseLink Base;  // 0x10(0x10)
	struct FPoseLink Additive;  // 0x20(0x10)
	uint8_t  AlphaInputType;  // 0x30(0x1)
	char pad_49[3];  // 0x31(0x3)
	float Alpha;  // 0x34(0x4)
	char bAlphaBoolEnabled : 1;  // 0x38(0x1)
	char pad_56_1 : 7;  // 0x38(0x1)
	char pad_57[8];  // 0x39(0x8)
	struct FInputAlphaBoolBlend AlphaBoolBlend;  // 0x40(0x48)
	struct FName AlphaCurveName;  // 0x88(0x8)
	struct FInputScaleBias AlphaScaleBias;  // 0x90(0x8)
	struct FInputScaleBiasClamp AlphaScaleBiasClamp;  // 0x98(0x30)
	int32_t LODThreshold;  // 0xC8(0x4)
	char pad_204[4];  // 0xCC(0x4)

}; 
// ScriptStruct Engine.PredictProjectilePathPointData
// Size: 0x1C(Inherited: 0x0) 
struct FPredictProjectilePathPointData
{
	struct FVector Location;  // 0x0(0xC)
	struct FVector Velocity;  // 0xC(0xC)
	float Time;  // 0x18(0x4)

}; 
// Function Engine.AnimInstance.GetRelevantAnimTimeFraction
// Size: 0xC(Inherited: 0x0) 
struct FGetRelevantAnimTimeFraction
{
	int32_t MachineIndex;  // 0x0(0x4)
	int32_t StateIndex;  // 0x4(0x4)
	float ReturnValue;  // 0x8(0x4)

}; 
// SparseDelegateFunction Engine.ActorBeginCursorOverSignature__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FActorBeginCursorOverSignature__DelegateSignature
{
	struct AActor* TouchedActor;  // 0x0(0x8)

}; 
// Function Engine.GameUserSettings.LoadSettings
// Size: 0x1(Inherited: 0x0) 
struct FLoadSettings
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bForceReload : 1;  // 0x0(0x1)

}; 
// Function Engine.KismetSystemLibrary.GetViewportRotationEditorOnly
// Size: 0x18(Inherited: 0x0) 
struct FGetViewportRotationEditorOnly
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	int32_t ID;  // 0x8(0x4)
	struct FRotator ReturnValue;  // 0xC(0xC)

}; 
// ScriptStruct Engine.MaterialInput
// Size: 0x14(Inherited: 0x0) 
struct FMaterialInput
{
	int32_t OutputIndex;  // 0x0(0x4)
	struct FName InputName;  // 0x4(0x8)
	struct FName ExpressionName;  // 0xC(0x8)

}; 
// Function Engine.HUD.ReceiveHitBoxClick
// Size: 0x8(Inherited: 0x0) 
struct FReceiveHitBoxClick
{
	struct FName BoxName;  // 0x0(0x8)

}; 
// Function Engine.Canvas.K2_TextSize
// Size: 0x28(Inherited: 0x0) 
struct FK2_TextSize
{
	struct UFont* RenderFont;  // 0x0(0x8)
	struct FString RenderText;  // 0x8(0x10)
	struct FVector2D Scale;  // 0x18(0x8)
	struct FVector2D ReturnValue;  // 0x20(0x8)

}; 
// Function Engine.MovementComponent.SetPlaneConstraintAxisSetting
// Size: 0x1(Inherited: 0x0) 
struct FSetPlaneConstraintAxisSetting
{
	uint8_t  NewAxisSetting;  // 0x0(0x1)

}; 
// SparseDelegateFunction Engine.ActorEndTouchOverSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FActorEndTouchOverSignature__DelegateSignature
{
	char ETouchIndex FingerIndex;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct AActor* TouchedActor;  // 0x8(0x8)

}; 
// ScriptStruct Engine.ColorMaterialInput
// Size: 0x14(Inherited: 0x14) 
struct FColorMaterialInput : public FMaterialInput
{

}; 
// Function Engine.PlayerController.ClientSpawnCameraLensEffect
// Size: 0x8(Inherited: 0x0) 
struct FClientSpawnCameraLensEffect
{
	AEmitterCameraLensEffectBase* LensEffectEmitterClass;  // 0x0(0x8)

}; 
// DelegateFunction Engine.InputAxisHandlerDynamicSignature__DelegateSignature
// Size: 0x4(Inherited: 0x0) 
struct FInputAxisHandlerDynamicSignature__DelegateSignature
{
	float AxisValue;  // 0x0(0x4)

}; 
// Function Engine.SkeletalMeshComponent.SetEnablePhysicsBlending
// Size: 0x1(Inherited: 0x0) 
struct FSetEnablePhysicsBlending
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bNewBlendPhysics : 1;  // 0x0(0x1)

}; 
// SparseDelegateFunction Engine.ComponentCollisionSettingsChangedSignature__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FComponentCollisionSettingsChangedSignature__DelegateSignature
{
	struct UPrimitiveComponent* ChangedComponent;  // 0x0(0x8)

}; 
// DelegateFunction Engine.ConstraintBrokenSignature__DelegateSignature
// Size: 0x4(Inherited: 0x0) 
struct FConstraintBrokenSignature__DelegateSignature
{
	int32_t ConstraintIndex;  // 0x0(0x4)

}; 
// Function Engine.ActorComponent.SetComponentTickEnabled
// Size: 0x1(Inherited: 0x0) 
struct FSetComponentTickEnabled
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bEnabled : 1;  // 0x0(0x1)

}; 
// Function Engine.KismetSystemLibrary.CapsuleTraceSingleForObjects
// Size: 0x108(Inherited: 0x0) 
struct FCapsuleTraceSingleForObjects
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Start;  // 0x8(0xC)
	struct FVector End;  // 0x14(0xC)
	float Radius;  // 0x20(0x4)
	float HalfHeight;  // 0x24(0x4)
	struct TArray<char EObjectTypeQuery> ObjectTypes;  // 0x28(0x10)
	char pad_56_1 : 7;  // 0x38(0x1)
	bool bTraceComplex : 1;  // 0x38(0x1)
	char pad_57[7];  // 0x39(0x7)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x40(0x10)
	char EDrawDebugTrace DrawDebugType;  // 0x50(0x1)
	char pad_81[3];  // 0x51(0x3)
	struct FHitResult OutHit;  // 0x54(0x88)
	char pad_220_1 : 7;  // 0xDC(0x1)
	bool bIgnoreSelf : 1;  // 0xDC(0x1)
	char pad_221[3];  // 0xDD(0x3)
	struct FLinearColor TraceColor;  // 0xE0(0x10)
	struct FLinearColor TraceHitColor;  // 0xF0(0x10)
	float DrawTime;  // 0x100(0x4)
	char pad_260_1 : 7;  // 0x104(0x1)
	bool ReturnValue : 1;  // 0x104(0x1)
	char pad_261[3];  // 0x105(0x3)

}; 
// ScriptStruct Engine.ScalarMaterialInput
// Size: 0x14(Inherited: 0x14) 
struct FScalarMaterialInput : public FMaterialInput
{

}; 
// Function Engine.PlayerController.ServerChangeName
// Size: 0x10(Inherited: 0x0) 
struct FServerChangeName
{
	struct FString S;  // 0x0(0x10)

}; 
// Function Engine.KismetSystemLibrary.BoxTraceMultiForObjects
// Size: 0xA8(Inherited: 0x0) 
struct FBoxTraceMultiForObjects
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Start;  // 0x8(0xC)
	struct FVector End;  // 0x14(0xC)
	struct FVector HalfSize;  // 0x20(0xC)
	struct FRotator Orientation;  // 0x2C(0xC)
	struct TArray<char EObjectTypeQuery> ObjectTypes;  // 0x38(0x10)
	char pad_72_1 : 7;  // 0x48(0x1)
	bool bTraceComplex : 1;  // 0x48(0x1)
	char pad_73[7];  // 0x49(0x7)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x50(0x10)
	char EDrawDebugTrace DrawDebugType;  // 0x60(0x1)
	char pad_97[7];  // 0x61(0x7)
	struct TArray<struct FHitResult> OutHits;  // 0x68(0x10)
	char pad_120_1 : 7;  // 0x78(0x1)
	bool bIgnoreSelf : 1;  // 0x78(0x1)
	char pad_121[3];  // 0x79(0x3)
	struct FLinearColor TraceColor;  // 0x7C(0x10)
	struct FLinearColor TraceHitColor;  // 0x8C(0x10)
	float DrawTime;  // 0x9C(0x4)
	char pad_160_1 : 7;  // 0xA0(0x1)
	bool ReturnValue : 1;  // 0xA0(0x1)
	char pad_161[7];  // 0xA1(0x7)

}; 
// ScriptStruct Engine.ShadingModelMaterialInput
// Size: 0x14(Inherited: 0x14) 
struct FShadingModelMaterialInput : public FMaterialInput
{

}; 
// Function Engine.KismetMathLibrary.MinOfFloatArray
// Size: 0x18(Inherited: 0x0) 
struct FMinOfFloatArray
{
	struct TArray<float> FloatArray;  // 0x0(0x10)
	int32_t IndexOfMinValue;  // 0x10(0x4)
	float MinValue;  // 0x14(0x4)

}; 
// Function Engine.DataTableFunctionLibrary.EvaluateCurveTableRow
// Size: 0x30(Inherited: 0x0) 
struct FEvaluateCurveTableRow
{
	struct UCurveTable* CurveTable;  // 0x0(0x8)
	struct FName RowName;  // 0x8(0x8)
	float InXY;  // 0x10(0x4)
	char EEvaluateCurveTableResult OutResult;  // 0x14(0x1)
	char pad_21[3];  // 0x15(0x3)
	float OutXY;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)
	struct FString ContextString;  // 0x20(0x10)

}; 
// ScriptStruct Engine.RichCurveKey
// Size: 0x1C(Inherited: 0x0) 
struct FRichCurveKey
{
	char ERichCurveInterpMode InterpMode;  // 0x0(0x1)
	char ERichCurveTangentMode TangentMode;  // 0x1(0x1)
	char ERichCurveTangentWeightMode TangentWeightMode;  // 0x2(0x1)
	char pad_3[1];  // 0x3(0x1)
	float Time;  // 0x4(0x4)
	float Value;  // 0x8(0x4)
	float ArriveTangent;  // 0xC(0x4)
	float ArriveTangentWeight;  // 0x10(0x4)
	float LeaveTangent;  // 0x14(0x4)
	float LeaveTangentWeight;  // 0x18(0x4)

}; 
// ScriptStruct Engine.MovementProperties
// Size: 0x1(Inherited: 0x0) 
struct FMovementProperties
{
	char bCanCrouch : 1;  // 0x0(0x1)
	char bCanJump : 1;  // 0x0(0x1)
	char bCanWalk : 1;  // 0x0(0x1)
	char bCanSwim : 1;  // 0x0(0x1)
	char bCanFly : 1;  // 0x0(0x1)
	char pad_0_1 : 3;  // 0x0(0x1)

}; 
// Function Engine.KismetMathLibrary.CreateVectorFromYawPitch
// Size: 0x18(Inherited: 0x0) 
struct FCreateVectorFromYawPitch
{
	float Yaw;  // 0x0(0x4)
	float Pitch;  // 0x4(0x4)
	float Length;  // 0x8(0x4)
	struct FVector ReturnValue;  // 0xC(0xC)

}; 
// Function Engine.KismetMathLibrary.BreakRotator
// Size: 0x18(Inherited: 0x0) 
struct FBreakRotator
{
	struct FRotator InRot;  // 0x0(0xC)
	float Roll;  // 0xC(0x4)
	float Pitch;  // 0x10(0x4)
	float Yaw;  // 0x14(0x4)

}; 
// Function Engine.LightComponent.SetBloomThreshold
// Size: 0x4(Inherited: 0x0) 
struct FSetBloomThreshold
{
	float NewValue;  // 0x0(0x4)

}; 
// Function Engine.StaticMeshComponent.SetReverseCulling
// Size: 0x1(Inherited: 0x0) 
struct FSetReverseCulling
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReverseCulling : 1;  // 0x0(0x1)

}; 
// ScriptStruct Engine.VectorMaterialInput
// Size: 0x14(Inherited: 0x14) 
struct FVectorMaterialInput : public FMaterialInput
{

}; 
// Function Engine.AudioComponent.SetAudioBusSendPreEffect
// Size: 0x10(Inherited: 0x0) 
struct FSetAudioBusSendPreEffect
{
	struct UAudioBus* AudioBus;  // 0x0(0x8)
	float AudioBusSendLevel;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// ScriptStruct Engine.PlatformInterfaceDelegateResult
// Size: 0x38(Inherited: 0x0) 
struct FPlatformInterfaceDelegateResult
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bSuccessful : 1;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct FPlatformInterfaceData Data;  // 0x8(0x30)

}; 
// ScriptStruct Engine.Vector2MaterialInput
// Size: 0x14(Inherited: 0x14) 
struct FVector2MaterialInput : public FMaterialInput
{

}; 
// ScriptStruct Engine.AnimationTransitionBetweenStates
// Size: 0x40(Inherited: 0x8) 
struct FAnimationTransitionBetweenStates : public FAnimationStateBase
{
	int32_t PreviousState;  // 0x8(0x4)
	int32_t nextState;  // 0xC(0x4)
	float CrossfadeDuration;  // 0x10(0x4)
	int32_t StartNotify;  // 0x14(0x4)
	int32_t EndNotify;  // 0x18(0x4)
	int32_t InterruptNotify;  // 0x1C(0x4)
	uint8_t  BlendMode;  // 0x20(0x1)
	char pad_33[7];  // 0x21(0x7)
	struct UCurveFloat* CustomCurve;  // 0x28(0x8)
	struct UBlendProfile* BlendProfile;  // 0x30(0x8)
	char ETransitionLogicType LogicType;  // 0x38(0x1)
	char pad_57[7];  // 0x39(0x7)

}; 
// SparseDelegateFunction Engine.ActorComponentActivatedSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FActorComponentActivatedSignature__DelegateSignature
{
	struct UActorComponent* Component;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool bReset : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function Engine.Actor.RemoveTickPrerequisiteActor
// Size: 0x8(Inherited: 0x0) 
struct FRemoveTickPrerequisiteActor
{
	struct AActor* PrerequisiteActor;  // 0x0(0x8)

}; 
// Function Engine.GameplayStatics.SpawnEmitterAtLocation
// Size: 0x40(Inherited: 0x0) 
struct FSpawnEmitterAtLocation
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct UParticleSystem* EmitterTemplate;  // 0x8(0x8)
	struct FVector Location;  // 0x10(0xC)
	struct FRotator Rotation;  // 0x1C(0xC)
	struct FVector Scale;  // 0x28(0xC)
	char pad_52_1 : 7;  // 0x34(0x1)
	bool bAutoDestroy : 1;  // 0x34(0x1)
	uint8_t  PoolingMethod;  // 0x35(0x1)
	char pad_54_1 : 7;  // 0x36(0x1)
	bool bAutoActivateSystem : 1;  // 0x36(0x1)
	char pad_55[1];  // 0x37(0x1)
	struct UParticleSystemComponent* ReturnValue;  // 0x38(0x8)

}; 
// Function Engine.GameplayStatics.SpawnDialogueAtLocation
// Size: 0x68(Inherited: 0x0) 
struct FSpawnDialogueAtLocation
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct UDialogueWave* Dialogue;  // 0x8(0x8)
	struct FDialogueContext Context;  // 0x10(0x18)
	struct FVector Location;  // 0x28(0xC)
	struct FRotator Rotation;  // 0x34(0xC)
	float VolumeMultiplier;  // 0x40(0x4)
	float PitchMultiplier;  // 0x44(0x4)
	float StartTime;  // 0x48(0x4)
	char pad_76[4];  // 0x4C(0x4)
	struct USoundAttenuation* AttenuationSettings;  // 0x50(0x8)
	char pad_88_1 : 7;  // 0x58(0x1)
	bool bAutoDestroy : 1;  // 0x58(0x1)
	char pad_89[7];  // 0x59(0x7)
	struct UAudioComponent* ReturnValue;  // 0x60(0x8)

}; 
// Function Engine.KismetSystemLibrary.GetDisplayName
// Size: 0x18(Inherited: 0x0) 
struct FGetDisplayName
{
	struct UObject* Object;  // 0x0(0x8)
	struct FString ReturnValue;  // 0x8(0x10)

}; 
// Function Engine.CapsuleComponent.GetUnscaledCapsuleSize
// Size: 0x8(Inherited: 0x0) 
struct FGetUnscaledCapsuleSize
{
	float OutRadius;  // 0x0(0x4)
	float OutHalfHeight;  // 0x4(0x4)

}; 
// SparseDelegateFunction Engine.ActorComponentDeactivateSignature__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FActorComponentDeactivateSignature__DelegateSignature
{
	struct UActorComponent* Component;  // 0x0(0x8)

}; 
// SparseDelegateFunction Engine.ComponentEndTouchOverSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FComponentEndTouchOverSignature__DelegateSignature
{
	char ETouchIndex FingerIndex;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct UPrimitiveComponent* TouchedComponent;  // 0x8(0x8)

}; 
// Function Engine.PrimitiveComponent.GetWalkableSlopeOverride
// Size: 0x10(Inherited: 0x0) 
struct FGetWalkableSlopeOverride
{
	struct FWalkableSlopeOverride ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.SceneComponent.GetComponentVelocity
// Size: 0xC(Inherited: 0x0) 
struct FGetComponentVelocity
{
	struct FVector ReturnValue;  // 0x0(0xC)

}; 
// ScriptStruct Engine.EditedDocumentInfo
// Size: 0x30(Inherited: 0x0) 
struct FEditedDocumentInfo
{
	struct FSoftObjectPath EditedObjectPath;  // 0x0(0x18)
	struct FVector2D SavedViewOffset;  // 0x18(0x8)
	float SavedZoomAmount;  // 0x20(0x4)
	char pad_36[4];  // 0x24(0x4)
	struct UObject* EditedObject;  // 0x28(0x8)

}; 
// Function Engine.SkinnedMeshComponent.IsBoneHiddenByName
// Size: 0xC(Inherited: 0x0) 
struct FIsBoneHiddenByName
{
	struct FName BoneName;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)

}; 
// Function Engine.Actor.DisableInput
// Size: 0x8(Inherited: 0x0) 
struct FDisableInput
{
	struct APlayerController* PlayerController;  // 0x0(0x8)

}; 
// SparseDelegateFunction Engine.PhysicsVolumeChanged__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FPhysicsVolumeChanged__DelegateSignature
{
	struct APhysicsVolume* NewVolume;  // 0x0(0x8)

}; 
// Function Engine.KismetSystemLibrary.ParseParam
// Size: 0x28(Inherited: 0x0) 
struct FParseParam
{
	struct FString inString;  // 0x0(0x10)
	struct FString InParam;  // 0x10(0x10)
	char pad_32_1 : 7;  // 0x20(0x1)
	bool ReturnValue : 1;  // 0x20(0x1)
	char pad_33[7];  // 0x21(0x7)

}; 
// Function Engine.AnimInstance.Montage_JumpToSection
// Size: 0x10(Inherited: 0x0) 
struct FMontage_JumpToSection
{
	struct FName SectionName;  // 0x0(0x8)
	struct UAnimMontage* Montage;  // 0x8(0x8)

}; 
// Function Engine.Pawn.IsLocallyControlled
// Size: 0x1(Inherited: 0x0) 
struct FIsLocallyControlled
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.SkeletalMeshComponent.GetIntegerAttribute
// Size: 0x1C(Inherited: 0x0) 
struct FGetIntegerAttribute
{
	struct FName BoneName;  // 0x0(0x8)
	struct FName AttributeName;  // 0x8(0x8)
	int32_t DefaultValue;  // 0x10(0x4)
	int32_t OutValue;  // 0x14(0x4)
	uint8_t  LookupType;  // 0x18(0x1)
	char pad_25_1 : 7;  // 0x19(0x1)
	bool ReturnValue : 1;  // 0x19(0x1)
	char pad_26[2];  // 0x1A(0x2)

}; 
// Function Engine.SplineComponent.GetUpVectorAtDistanceAlongSpline
// Size: 0x14(Inherited: 0x0) 
struct FGetUpVectorAtDistanceAlongSpline
{
	float Distance;  // 0x0(0x4)
	char ESplineCoordinateSpace CoordinateSpace;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)
	struct FVector ReturnValue;  // 0x8(0xC)

}; 
// Function Engine.DecalComponent.GetFadeInStartDelay
// Size: 0x4(Inherited: 0x0) 
struct FGetFadeInStartDelay
{
	float ReturnValue;  // 0x0(0x4)

}; 
// SparseDelegateFunction Engine.IsRootComponentChanged__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FIsRootComponentChanged__DelegateSignature
{
	struct USceneComponent* UpdatedComponent;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool bIsRootComponent : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// ScriptStruct Engine.PrimaryAssetRulesCustomOverride
// Size: 0x38(Inherited: 0x0) 
struct FPrimaryAssetRulesCustomOverride
{
	struct FPrimaryAssetType PrimaryAssetType;  // 0x0(0x8)
	struct FDirectoryPath FilterDirectory;  // 0x8(0x10)
	struct FString FilterString;  // 0x18(0x10)
	struct FPrimaryAssetRules Rules;  // 0x28(0xC)
	char pad_52[4];  // 0x34(0x4)

}; 
// Function Engine.GameStateBase.HasBegunPlay
// Size: 0x1(Inherited: 0x0) 
struct FHasBegunPlay
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.SceneComponent.SetHiddenInGame
// Size: 0x2(Inherited: 0x0) 
struct FSetHiddenInGame
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool NewHidden : 1;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool bPropagateToChildren : 1;  // 0x1(0x1)

}; 
// DelegateFunction Engine.OnQuartzMetronomeEventBP__DelegateSignature
// Size: 0x18(Inherited: 0x0) 
struct FOnQuartzMetronomeEventBP__DelegateSignature
{
	struct FName ClockName;  // 0x0(0x8)
	uint8_t  QuantizationType;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)
	int32_t NumBars;  // 0xC(0x4)
	int32_t Beat;  // 0x10(0x4)
	float BeatFraction;  // 0x14(0x4)

}; 
// ScriptStruct Engine.LayerActorStats
// Size: 0x10(Inherited: 0x0) 
struct FLayerActorStats
{
	UObject* Type;  // 0x0(0x8)
	int32_t Total;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function Engine.PlayerController.IsInputKeyDown
// Size: 0x20(Inherited: 0x0) 
struct FIsInputKeyDown
{
	struct FKey Key;  // 0x0(0x18)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool ReturnValue : 1;  // 0x18(0x1)
	char pad_25[7];  // 0x19(0x7)

}; 
// Function Engine.AnimInstance.GetOwningComponent
// Size: 0x8(Inherited: 0x0) 
struct FGetOwningComponent
{
	struct USkeletalMeshComponent* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct Engine.VectorParameterValue
// Size: 0x30(Inherited: 0x0) 
struct FVectorParameterValue
{
	struct FMaterialParameterInfo ParameterInfo;  // 0x0(0x10)
	struct FLinearColor ParameterValue;  // 0x10(0x10)
	struct FGuid ExpressionGUID;  // 0x20(0x10)

}; 
// Function Engine.KismetInputLibrary.Key_GetNavigationDirectionFromAnalog
// Size: 0x48(Inherited: 0x0) 
struct FKey_GetNavigationDirectionFromAnalog
{
	struct FAnalogInputEvent InAnalogEvent;  // 0x0(0x40)
	uint8_t  ReturnValue;  // 0x40(0x1)
	char pad_65[7];  // 0x41(0x7)

}; 
// Function Engine.BlueprintPathsLibrary.CreateTempFilename
// Size: 0x40(Inherited: 0x0) 
struct FCreateTempFilename
{
	struct FString Path;  // 0x0(0x10)
	struct FString prefix;  // 0x10(0x10)
	struct FString Extension;  // 0x20(0x10)
	struct FString ReturnValue;  // 0x30(0x10)

}; 
// SparseDelegateFunction Engine.TakeAnyDamageSignature__DelegateSignature
// Size: 0x28(Inherited: 0x0) 
struct FTakeAnyDamageSignature__DelegateSignature
{
	struct AActor* DamagedActor;  // 0x0(0x8)
	float Damage;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)
	struct UDamageType* DamageType;  // 0x10(0x8)
	struct AController* InstigatedBy;  // 0x18(0x8)
	struct AActor* DamageCauser;  // 0x20(0x8)

}; 
// Function Engine.LightComponent.SetShadowBias
// Size: 0x4(Inherited: 0x0) 
struct FSetShadowBias
{
	float NewValue;  // 0x0(0x4)

}; 
// Function Engine.GameMode.SetBandwidthLimit
// Size: 0x4(Inherited: 0x0) 
struct FSetBandwidthLimit
{
	float AsyncIOBandwidthLimit;  // 0x0(0x4)

}; 
// SparseDelegateFunction Engine.TakeRadialDamageSignature__DelegateSignature
// Size: 0xC0(Inherited: 0x0) 
struct FTakeRadialDamageSignature__DelegateSignature
{
	struct AActor* DamagedActor;  // 0x0(0x8)
	float Damage;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)
	struct UDamageType* DamageType;  // 0x10(0x8)
	struct FVector Origin;  // 0x18(0xC)
	struct FHitResult HitInfo;  // 0x24(0x88)
	char pad_172[4];  // 0xAC(0x4)
	struct AController* InstigatedBy;  // 0xB0(0x8)
	struct AActor* DamageCauser;  // 0xB8(0x8)

}; 
// ScriptStruct Engine.MinimalViewInfo
// Size: 0x5F0(Inherited: 0x0) 
struct FMinimalViewInfo
{
	struct FVector Location;  // 0x0(0xC)
	struct FRotator Rotation;  // 0xC(0xC)
	float FOV;  // 0x18(0x4)
	float DesiredFOV;  // 0x1C(0x4)
	float OrthoWidth;  // 0x20(0x4)
	float OrthoNearClipPlane;  // 0x24(0x4)
	float OrthoFarClipPlane;  // 0x28(0x4)
	float AspectRatio;  // 0x2C(0x4)
	char bConstrainAspectRatio : 1;  // 0x30(0x1)
	char bUseFieldOfViewForLOD : 1;  // 0x30(0x1)
	char pad_48_1 : 6;  // 0x30(0x1)
	char pad_49[4];  // 0x31(0x4)
	char ECameraProjectionMode ProjectionMode;  // 0x34(0x1)
	char pad_53[3];  // 0x35(0x3)
	float PostProcessBlendWeight;  // 0x38(0x4)
	char pad_60[4];  // 0x3C(0x4)
	struct FPostProcessSettings PostProcessSettings;  // 0x40(0x560)
	struct FVector2D OffCenterProjectionOffset;  // 0x5A0(0x8)
	char pad_1448[72];  // 0x5A8(0x48)

}; 
// Function Engine.KismetSystemLibrary.GetPrimaryAssetIdFromSoftClassReference
// Size: 0x38(Inherited: 0x0) 
struct FGetPrimaryAssetIdFromSoftClassReference
{
	struct TSoftClassPtr<UObject> SoftClassReference;  // 0x0(0x28)
	struct FPrimaryAssetId ReturnValue;  // 0x28(0x10)

}; 
// Function Engine.KismetSystemLibrary.SetColorPropertyByName
// Size: 0x18(Inherited: 0x0) 
struct FSetColorPropertyByName
{
	struct UObject* Object;  // 0x0(0x8)
	struct FName PropertyName;  // 0x8(0x8)
	struct FColor Value;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function Engine.KismetMathLibrary.Dot_VectorVector
// Size: 0x1C(Inherited: 0x0) 
struct FDot_VectorVector
{
	struct FVector A;  // 0x0(0xC)
	struct FVector B;  // 0xC(0xC)
	float ReturnValue;  // 0x18(0x4)

}; 
// ScriptStruct Engine.Vector_NetQuantize
// Size: 0xC(Inherited: 0xC) 
struct FVector_NetQuantize : public FVector
{

}; 
// Function Engine.AnimNotifyState.GetNotifyName
// Size: 0x10(Inherited: 0x0) 
struct FGetNotifyName
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.GameplayStatics.CreatePlayer
// Size: 0x18(Inherited: 0x0) 
struct FCreatePlayer
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	int32_t ControllerId;  // 0x8(0x4)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool bSpawnPlayerController : 1;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)
	struct APlayerController* ReturnValue;  // 0x10(0x8)

}; 
// ScriptStruct Engine.Vector_NetQuantizeNormal
// Size: 0xC(Inherited: 0xC) 
struct FVector_NetQuantizeNormal : public FVector
{

}; 
// Function Engine.GameUserSettings.GetScreenResolution
// Size: 0x8(Inherited: 0x0) 
struct FGetScreenResolution
{
	struct FIntPoint ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct Engine.KAggregateGeom
// Size: 0x58(Inherited: 0x0) 
struct FKAggregateGeom
{
	struct TArray<struct FKSphereElem> SphereElems;  // 0x0(0x10)
	struct TArray<struct FKBoxElem> BoxElems;  // 0x10(0x10)
	struct TArray<struct FKSphylElem> SphylElems;  // 0x20(0x10)
	struct TArray<struct FKConvexElem> ConvexElems;  // 0x30(0x10)
	struct TArray<struct FKTaperedCapsuleElem> TaperedCapsuleElems;  // 0x40(0x10)
	char pad_80[8];  // 0x50(0x8)

}; 
// SparseDelegateFunction Engine.ComponentBeginTouchOverSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FComponentBeginTouchOverSignature__DelegateSignature
{
	char ETouchIndex FingerIndex;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct UPrimitiveComponent* TouchedComponent;  // 0x8(0x8)

}; 
// ScriptStruct Engine.LensBloomSettings
// Size: 0xB8(Inherited: 0x0) 
struct FLensBloomSettings
{
	struct FGaussianSumBloomSettings GaussianSum;  // 0x0(0x84)
	char pad_132[4];  // 0x84(0x4)
	struct FConvolutionBloomSettings Convolution;  // 0x88(0x28)
	char EBloomMethod Method;  // 0xB0(0x1)
	char pad_177[7];  // 0xB1(0x7)

}; 
// ScriptStruct Engine.MaterialShadingModelField
// Size: 0x2(Inherited: 0x0) 
struct FMaterialShadingModelField
{
	uint16_t ShadingModelField;  // 0x0(0x2)

}; 
// Function Engine.PoseableMeshComponent.CopyPoseFromSkeletalComponent
// Size: 0x8(Inherited: 0x0) 
struct FCopyPoseFromSkeletalComponent
{
	struct USkeletalMeshComponent* InComponentToCopy;  // 0x0(0x8)

}; 
// Function Engine.KismetMathLibrary.Divide_VectorVector
// Size: 0x24(Inherited: 0x0) 
struct FDivide_VectorVector
{
	struct FVector A;  // 0x0(0xC)
	struct FVector B;  // 0xC(0xC)
	struct FVector ReturnValue;  // 0x18(0xC)

}; 
// Function Engine.Actor.SetActorHiddenInGame
// Size: 0x1(Inherited: 0x0) 
struct FSetActorHiddenInGame
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bNewHidden : 1;  // 0x0(0x1)

}; 
// Function Engine.KismetMathLibrary.CInterpTo
// Size: 0x38(Inherited: 0x0) 
struct FCInterpTo
{
	struct FLinearColor Current;  // 0x0(0x10)
	struct FLinearColor Target;  // 0x10(0x10)
	float DeltaTime;  // 0x20(0x4)
	float InterpSpeed;  // 0x24(0x4)
	struct FLinearColor ReturnValue;  // 0x28(0x10)

}; 
// Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamic
// Size: 0x10(Inherited: 0x0) 
struct FCreateAndSetMaterialInstanceDynamic
{
	int32_t ElementIndex;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct UMaterialInstanceDynamic* ReturnValue;  // 0x8(0x8)

}; 
// Function Engine.KismetSystemLibrary.BoxOverlapComponents
// Size: 0x60(Inherited: 0x0) 
struct FBoxOverlapComponents
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector BoxPos;  // 0x8(0xC)
	struct FVector Extent;  // 0x14(0xC)
	struct TArray<char EObjectTypeQuery> ObjectTypes;  // 0x20(0x10)
	UObject* ComponentClassFilter;  // 0x30(0x8)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x38(0x10)
	struct TArray<struct UPrimitiveComponent*> OutComponents;  // 0x48(0x10)
	char pad_88_1 : 7;  // 0x58(0x1)
	bool ReturnValue : 1;  // 0x58(0x1)
	char pad_89[7];  // 0x59(0x7)

}; 
// Function Engine.AnimInstance.HasMarkerBeenHitThisFrame
// Size: 0x14(Inherited: 0x0) 
struct FHasMarkerBeenHitThisFrame
{
	struct FName SyncGroup;  // 0x0(0x8)
	struct FName MarkerName;  // 0x8(0x8)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[3];  // 0x11(0x3)

}; 
// Function Engine.PhysicsConstraintComponent.SetConstraintReferenceOrientation
// Size: 0x1C(Inherited: 0x0) 
struct FSetConstraintReferenceOrientation
{
	char EConstraintFrame Frame;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	struct FVector PriAxis;  // 0x4(0xC)
	struct FVector SecAxis;  // 0x10(0xC)

}; 
// SparseDelegateFunction Engine.ActorBeginOverlapSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FActorBeginOverlapSignature__DelegateSignature
{
	struct AActor* OverlappedActor;  // 0x0(0x8)
	struct AActor* OtherActor;  // 0x8(0x8)

}; 
// DelegateFunction Engine.OnTimelineVector__DelegateSignature
// Size: 0xC(Inherited: 0x0) 
struct FOnTimelineVector__DelegateSignature
{
	struct FVector Output;  // 0x0(0xC)

}; 
// SparseDelegateFunction Engine.ActorEndOverlapSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FActorEndOverlapSignature__DelegateSignature
{
	struct AActor* OverlappedActor;  // 0x0(0x8)
	struct AActor* OtherActor;  // 0x8(0x8)

}; 
// Function Engine.AnimInstance.Montage_GetPlayRate
// Size: 0x10(Inherited: 0x0) 
struct FMontage_GetPlayRate
{
	struct UAnimMontage* Montage;  // 0x0(0x8)
	float ReturnValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function Engine.GameplayStatics.SpawnSound2D
// Size: 0x38(Inherited: 0x0) 
struct FSpawnSound2D
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct USoundBase* Sound;  // 0x8(0x8)
	float VolumeMultiplier;  // 0x10(0x4)
	float PitchMultiplier;  // 0x14(0x4)
	float StartTime;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)
	struct USoundConcurrency* ConcurrencySettings;  // 0x20(0x8)
	char pad_40_1 : 7;  // 0x28(0x1)
	bool bPersistAcrossLevelTransition : 1;  // 0x28(0x1)
	char pad_41_1 : 7;  // 0x29(0x1)
	bool bAutoDestroy : 1;  // 0x29(0x1)
	char pad_42[6];  // 0x2A(0x6)
	struct UAudioComponent* ReturnValue;  // 0x30(0x8)

}; 
// Function Engine.AnimInstance.BlueprintUpdateAnimation
// Size: 0x4(Inherited: 0x0) 
struct FBlueprintUpdateAnimation
{
	float DeltaTimeX;  // 0x0(0x4)

}; 
// Function Engine.KismetMathLibrary.EqualEqual_Int64Int64
// Size: 0x18(Inherited: 0x0) 
struct FEqualEqual_Int64Int64
{
	int64_t A;  // 0x0(0x8)
	int64_t B;  // 0x8(0x8)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// Function Engine.PlayerController.ClientSetCinematicMode
// Size: 0x4(Inherited: 0x0) 
struct FClientSetCinematicMode
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bInCinematicMode : 1;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool bAffectsMovement : 1;  // 0x1(0x1)
	char pad_2_1 : 7;  // 0x2(0x1)
	bool bAffectsTurning : 1;  // 0x2(0x1)
	char pad_3_1 : 7;  // 0x3(0x1)
	bool bAffectsHUD : 1;  // 0x3(0x1)

}; 
// Function Engine.BlueprintPathsLibrary.GetPropertyNameLocalizationPaths
// Size: 0x10(Inherited: 0x0) 
struct FGetPropertyNameLocalizationPaths
{
	struct TArray<struct FString> ReturnValue;  // 0x0(0x10)

}; 
// ScriptStruct Engine.BatchedPoint
// Size: 0x28(Inherited: 0x0) 
struct FBatchedPoint
{
	struct FVector position;  // 0x0(0xC)
	struct FLinearColor Color;  // 0xC(0x10)
	float PointSize;  // 0x1C(0x4)
	float RemainingLifeTime;  // 0x20(0x4)
	char DepthPriority;  // 0x24(0x1)
	char pad_37[3];  // 0x25(0x3)

}; 
// DelegateFunction Engine.ApplicationLifecycleComponent.OnLowPowerModeDelegate__DelegateSignature
// Size: 0x1(Inherited: 0x0) 
struct FOnLowPowerModeDelegate__DelegateSignature
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bInLowPowerMode : 1;  // 0x0(0x1)

}; 
// SparseDelegateFunction Engine.ActorEndCursorOverSignature__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FActorEndCursorOverSignature__DelegateSignature
{
	struct AActor* TouchedActor;  // 0x0(0x8)

}; 
// ScriptStruct Engine.WalkableSlopeOverride
// Size: 0x10(Inherited: 0x0) 
struct FWalkableSlopeOverride
{
	char EWalkableSlopeBehavior WalkableSlopeBehavior;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float WalkableSlopeAngle;  // 0x4(0x4)
	char pad_8[8];  // 0x8(0x8)

}; 
// Function Engine.PlayerController.ClientPlaySound
// Size: 0x10(Inherited: 0x0) 
struct FClientPlaySound
{
	struct USoundBase* Sound;  // 0x0(0x8)
	float VolumeMultiplier;  // 0x8(0x4)
	float PitchMultiplier;  // 0xC(0x4)

}; 
// Function Engine.KismetSystemLibrary.DrawDebugBox
// Size: 0x48(Inherited: 0x0) 
struct FDrawDebugBox
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Center;  // 0x8(0xC)
	struct FVector Extent;  // 0x14(0xC)
	struct FLinearColor LineColor;  // 0x20(0x10)
	struct FRotator Rotation;  // 0x30(0xC)
	float Duration;  // 0x3C(0x4)
	float Thickness;  // 0x40(0x4)
	char pad_68[4];  // 0x44(0x4)

}; 
// SparseDelegateFunction Engine.ActorOnClickedSignature__DelegateSignature
// Size: 0x20(Inherited: 0x0) 
struct FActorOnClickedSignature__DelegateSignature
{
	struct AActor* TouchedActor;  // 0x0(0x8)
	struct FKey ButtonPressed;  // 0x8(0x18)

}; 
// Function Engine.Controller.Possess
// Size: 0x8(Inherited: 0x0) 
struct FPossess
{
	struct APawn* InPawn;  // 0x0(0x8)

}; 
// Function Engine.KismetSystemLibrary.SphereOverlapComponents
// Size: 0x58(Inherited: 0x0) 
struct FSphereOverlapComponents
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector SpherePos;  // 0x8(0xC)
	float SphereRadius;  // 0x14(0x4)
	struct TArray<char EObjectTypeQuery> ObjectTypes;  // 0x18(0x10)
	UObject* ComponentClassFilter;  // 0x28(0x8)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x30(0x10)
	struct TArray<struct UPrimitiveComponent*> OutComponents;  // 0x40(0x10)
	char pad_80_1 : 7;  // 0x50(0x1)
	bool ReturnValue : 1;  // 0x50(0x1)
	char pad_81[7];  // 0x51(0x7)

}; 
// SparseDelegateFunction Engine.ActorOnReleasedSignature__DelegateSignature
// Size: 0x20(Inherited: 0x0) 
struct FActorOnReleasedSignature__DelegateSignature
{
	struct AActor* TouchedActor;  // 0x0(0x8)
	struct FKey ButtonReleased;  // 0x8(0x18)

}; 
// Function Engine.KismetSystemLibrary.LoadAsset
// Size: 0x58(Inherited: 0x0) 
struct FLoadAsset
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct TSoftObjectPtr<UObject> Asset;  // 0x8(0x28)
	struct FDelegate OnLoaded;  // 0x30(0x10)
	struct FLatentActionInfo LatentInfo;  // 0x40(0x18)

}; 
// Function Engine.LightComponent.SetTemperature
// Size: 0x4(Inherited: 0x0) 
struct FSetTemperature
{
	float NewTemperature;  // 0x0(0x4)

}; 
// ScriptStruct Engine.RichCurve
// Size: 0x80(Inherited: 0x70) 
struct FRichCurve : public FRealCurve
{
	struct TArray<struct FRichCurveKey> Keys;  // 0x70(0x10)

}; 
// SparseDelegateFunction Engine.ActorOnInputTouchEndSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FActorOnInputTouchEndSignature__DelegateSignature
{
	char ETouchIndex FingerIndex;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct AActor* TouchedActor;  // 0x8(0x8)

}; 
// Function Engine.StaticMesh.GetMaterialIndex
// Size: 0xC(Inherited: 0x0) 
struct FGetMaterialIndex
{
	struct FName MaterialSlotName;  // 0x0(0x8)
	int32_t ReturnValue;  // 0x8(0x4)

}; 
// Function Engine.InstancedStaticMeshComponent.BatchUpdateInstancesTransform
// Size: 0x50(Inherited: 0x0) 
struct FBatchUpdateInstancesTransform
{
	int32_t StartInstanceIndex;  // 0x0(0x4)
	int32_t NumInstances;  // 0x4(0x4)
	char pad_8[8];  // 0x8(0x8)
	struct FTransform NewInstancesTransform;  // 0x10(0x30)
	char pad_64_1 : 7;  // 0x40(0x1)
	bool bWorldSpace : 1;  // 0x40(0x1)
	char pad_65_1 : 7;  // 0x41(0x1)
	bool bMarkRenderStateDirty : 1;  // 0x41(0x1)
	char pad_66_1 : 7;  // 0x42(0x1)
	bool bTeleport : 1;  // 0x42(0x1)
	char pad_67_1 : 7;  // 0x43(0x1)
	bool ReturnValue : 1;  // 0x43(0x1)
	char pad_68[12];  // 0x44(0xC)

}; 
// Function Engine.KismetMathLibrary.Conv_VectorToTransform
// Size: 0x40(Inherited: 0x0) 
struct FConv_VectorToTransform
{
	struct FVector InLocation;  // 0x0(0xC)
	char pad_12[4];  // 0xC(0x4)
	struct FTransform ReturnValue;  // 0x10(0x30)

}; 
// ScriptStruct Engine.StaticMaterial
// Size: 0x30(Inherited: 0x0) 
struct FStaticMaterial
{
	struct UMaterialInterface* MaterialInterface;  // 0x0(0x8)
	struct FName MaterialSlotName;  // 0x8(0x8)
	struct FName ImportedMaterialSlotName;  // 0x10(0x8)
	struct FMeshUVChannelInfo UVChannelData;  // 0x18(0x14)
	char pad_44[4];  // 0x2C(0x4)

}; 
// Function Engine.GameplayStatics.GetGameMode
// Size: 0x10(Inherited: 0x0) 
struct FGetGameMode
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct AGameModeBase* ReturnValue;  // 0x8(0x8)

}; 
// Function Engine.Actor.GetSquaredHorizontalDistanceTo
// Size: 0x10(Inherited: 0x0) 
struct FGetSquaredHorizontalDistanceTo
{
	struct AActor* OtherActor;  // 0x0(0x8)
	float ReturnValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function Engine.CharacterMovementComponent.CapsuleTouched
// Size: 0xA8(Inherited: 0x0) 
struct FCapsuleTouched
{
	struct UPrimitiveComponent* OverlappedComp;  // 0x0(0x8)
	struct AActor* Other;  // 0x8(0x8)
	struct UPrimitiveComponent* OtherComp;  // 0x10(0x8)
	int32_t OtherBodyIndex;  // 0x18(0x4)
	char pad_28_1 : 7;  // 0x1C(0x1)
	bool bFromSweep : 1;  // 0x1C(0x1)
	char pad_29[3];  // 0x1D(0x3)
	struct FHitResult SweepResult;  // 0x20(0x88)

}; 
// Function Engine.KismetMathLibrary.Vector_Normalize
// Size: 0x10(Inherited: 0x0) 
struct FVector_Normalize
{
	struct FVector A;  // 0x0(0xC)
	float Tolerance;  // 0xC(0x4)

}; 
// SparseDelegateFunction Engine.ActorOnInputTouchBeginSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FActorOnInputTouchBeginSignature__DelegateSignature
{
	char ETouchIndex FingerIndex;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct AActor* TouchedActor;  // 0x8(0x8)

}; 
// Function Engine.PlayerController.SetAudioListenerOverride
// Size: 0x20(Inherited: 0x0) 
struct FSetAudioListenerOverride
{
	struct USceneComponent* AttachToComponent;  // 0x0(0x8)
	struct FVector Location;  // 0x8(0xC)
	struct FRotator Rotation;  // 0x14(0xC)

}; 
// DelegateFunction Engine.PlatformInterfaceDelegate__DelegateSignature
// Size: 0x38(Inherited: 0x0) 
struct FPlatformInterfaceDelegate__DelegateSignature
{
	struct FPlatformInterfaceDelegateResult Result;  // 0x0(0x38)

}; 
// ScriptStruct Engine.MaterialTextureInfo
// Size: 0x10(Inherited: 0x0) 
struct FMaterialTextureInfo
{
	float SamplingScale;  // 0x0(0x4)
	int32_t UVChannelIndex;  // 0x4(0x4)
	struct FName TextureName;  // 0x8(0x8)

}; 
// ScriptStruct Engine.SoundWaveSpectralDataEntry
// Size: 0x8(Inherited: 0x0) 
struct FSoundWaveSpectralDataEntry
{
	float Magnitude;  // 0x0(0x4)
	float NormalizedMagnitude;  // 0x4(0x4)

}; 
// Function Engine.KismetMathLibrary.MaxOfFloatArray
// Size: 0x18(Inherited: 0x0) 
struct FMaxOfFloatArray
{
	struct TArray<float> FloatArray;  // 0x0(0x10)
	int32_t IndexOfMaxValue;  // 0x10(0x4)
	float MaxValue;  // 0x14(0x4)

}; 
// Function Engine.Actor.SetReplicates
// Size: 0x1(Inherited: 0x0) 
struct FSetReplicates
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bInReplicates : 1;  // 0x0(0x1)

}; 
// SparseDelegateFunction Engine.ActorBeginTouchOverSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FActorBeginTouchOverSignature__DelegateSignature
{
	char ETouchIndex FingerIndex;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct AActor* TouchedActor;  // 0x8(0x8)

}; 
// Function Engine.BlueprintSetLibrary.Set_ToArray
// Size: 0x60(Inherited: 0x0) 
struct FSet_ToArray
{
	struct TSet<int32_t> A;  // 0x0(0x50)
	struct TArray<int32_t> Result;  // 0x50(0x10)

}; 
// ScriptStruct Engine.CollectionReference
// Size: 0x8(Inherited: 0x0) 
struct FCollectionReference
{
	struct FName CollectionName;  // 0x0(0x8)

}; 
// Function Engine.KismetMathLibrary.Vector_ComponentMin
// Size: 0x24(Inherited: 0x0) 
struct FVector_ComponentMin
{
	struct FVector A;  // 0x0(0xC)
	struct FVector B;  // 0xC(0xC)
	struct FVector ReturnValue;  // 0x18(0xC)

}; 
// Function Engine.KismetMathLibrary.RGBToHSV
// Size: 0x20(Inherited: 0x0) 
struct FRGBToHSV
{
	struct FLinearColor InColor;  // 0x0(0x10)
	float H;  // 0x10(0x4)
	float S;  // 0x14(0x4)
	float V;  // 0x18(0x4)
	float A;  // 0x1C(0x4)

}; 
// Function Engine.StaticMesh.GetMaterial
// Size: 0x10(Inherited: 0x0) 
struct FGetMaterial
{
	int32_t MaterialIndex;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct UMaterialInterface* ReturnValue;  // 0x8(0x8)

}; 
// Function Engine.MovementComponent.GetPlaneConstraintOrigin
// Size: 0xC(Inherited: 0x0) 
struct FGetPlaneConstraintOrigin
{
	struct FVector ReturnValue;  // 0x0(0xC)

}; 
// ScriptStruct Engine.ParticleReplayTrackKey
// Size: 0xC(Inherited: 0x0) 
struct FParticleReplayTrackKey
{
	float Time;  // 0x0(0x4)
	float Duration;  // 0x4(0x4)
	int32_t ClipIDNumber;  // 0x8(0x4)

}; 
// Function Engine.KismetMathLibrary.Matrix_InverseTransformPosition
// Size: 0x60(Inherited: 0x0) 
struct FMatrix_InverseTransformPosition
{
	struct FMatrix M;  // 0x0(0x40)
	struct FVector V;  // 0x40(0xC)
	struct FVector ReturnValue;  // 0x4C(0xC)
	char pad_88[8];  // 0x58(0x8)

}; 
// Function Engine.SceneComponent.GetSocketQuaternion
// Size: 0x20(Inherited: 0x0) 
struct FGetSocketQuaternion
{
	struct FName InSocketName;  // 0x0(0x8)
	char pad_8[8];  // 0x8(0x8)
	struct FQuat ReturnValue;  // 0x10(0x10)

}; 
// Function Engine.TimecodeProvider.GetFrameRate
// Size: 0x8(Inherited: 0x0) 
struct FGetFrameRate
{
	struct FFrameRate ReturnValue;  // 0x0(0x8)

}; 
// Function Engine.GameStateBase.GetServerWorldTimeSeconds
// Size: 0x4(Inherited: 0x0) 
struct FGetServerWorldTimeSeconds
{
	float ReturnValue;  // 0x0(0x4)

}; 
// SparseDelegateFunction Engine.ActorDestroyedSignature__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FActorDestroyedSignature__DelegateSignature
{
	struct AActor* DestroyedActor;  // 0x0(0x8)

}; 
// DelegateFunction Engine.OnPawnControllerChanged__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FOnPawnControllerChanged__DelegateSignature
{
	struct APawn* Pawn;  // 0x0(0x8)
	struct AController* Controller;  // 0x8(0x8)

}; 
// Function Engine.KismetMathLibrary.RandomInteger64
// Size: 0x10(Inherited: 0x0) 
struct FRandomInteger64
{
	int64_t Max;  // 0x0(0x8)
	int64_t ReturnValue;  // 0x8(0x8)

}; 
// SparseDelegateFunction Engine.ComponentHitSignature__DelegateSignature
// Size: 0xB0(Inherited: 0x0) 
struct FComponentHitSignature__DelegateSignature
{
	struct UPrimitiveComponent* HitComponent;  // 0x0(0x8)
	struct AActor* OtherActor;  // 0x8(0x8)
	struct UPrimitiveComponent* OtherComp;  // 0x10(0x8)
	struct FVector NormalImpulse;  // 0x18(0xC)
	struct FHitResult Hit;  // 0x24(0x88)
	char pad_172[4];  // 0xAC(0x4)

}; 
// Function Engine.KismetSystemLibrary.GetGameName
// Size: 0x10(Inherited: 0x0) 
struct FGetGameName
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// ScriptStruct Engine.BeamModifierOptions
// Size: 0x4(Inherited: 0x0) 
struct FBeamModifierOptions
{
	char bModify : 1;  // 0x0(0x1)
	char bScale : 1;  // 0x0(0x1)
	char bLock : 1;  // 0x0(0x1)
	char pad_0_1 : 5;  // 0x0(0x1)
	char pad_1[4];  // 0x1(0x4)

}; 
// Function Engine.SkeletalMeshComponent.PlayAnimation
// Size: 0x10(Inherited: 0x0) 
struct FPlayAnimation
{
	struct UAnimationAsset* NewAnimToPlay;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool bLooping : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function Engine.PlayerController.GetHitResultUnderCursor
// Size: 0x90(Inherited: 0x0) 
struct FGetHitResultUnderCursor
{
	char ECollisionChannel TraceChannel;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool bTraceComplex : 1;  // 0x1(0x1)
	char pad_2[2];  // 0x2(0x2)
	struct FHitResult HitResult;  // 0x4(0x88)
	char pad_140_1 : 7;  // 0x8C(0x1)
	bool ReturnValue : 1;  // 0x8C(0x1)
	char pad_141[3];  // 0x8D(0x3)

}; 
// Function Engine.KismetMathLibrary.VSizeXY
// Size: 0x10(Inherited: 0x0) 
struct FVSizeXY
{
	struct FVector A;  // 0x0(0xC)
	float ReturnValue;  // 0xC(0x4)

}; 
// DelegateFunction Engine.OnMontageBlendingOutStartedMCDelegate__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FOnMontageBlendingOutStartedMCDelegate__DelegateSignature
{
	struct UAnimMontage* Montage;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool bInterrupted : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// SparseDelegateFunction Engine.ComponentBeginOverlapSignature__DelegateSignature
// Size: 0xA8(Inherited: 0x0) 
struct FComponentBeginOverlapSignature__DelegateSignature
{
	struct UPrimitiveComponent* OverlappedComponent;  // 0x0(0x8)
	struct AActor* OtherActor;  // 0x8(0x8)
	struct UPrimitiveComponent* OtherComp;  // 0x10(0x8)
	int32_t OtherBodyIndex;  // 0x18(0x4)
	char pad_28_1 : 7;  // 0x1C(0x1)
	bool bFromSweep : 1;  // 0x1C(0x1)
	char pad_29[3];  // 0x1D(0x3)
	struct FHitResult SweepResult;  // 0x20(0x88)

}; 
// Function Engine.PlayerController.ClientIgnoreMoveInput
// Size: 0x1(Inherited: 0x0) 
struct FClientIgnoreMoveInput
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bIgnore : 1;  // 0x0(0x1)

}; 
// SparseDelegateFunction Engine.ComponentEndOverlapSignature__DelegateSignature
// Size: 0x20(Inherited: 0x0) 
struct FComponentEndOverlapSignature__DelegateSignature
{
	struct UPrimitiveComponent* OverlappedComponent;  // 0x0(0x8)
	struct AActor* OtherActor;  // 0x8(0x8)
	struct UPrimitiveComponent* OtherComp;  // 0x10(0x8)
	int32_t OtherBodyIndex;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)

}; 
// ScriptStruct Engine.SkeletalMeshOptimizationSettings
// Size: 0x3C(Inherited: 0x0) 
struct FSkeletalMeshOptimizationSettings
{
	char SkeletalMeshTerminationCriterion TerminationCriterion;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float NumOfTrianglesPercentage;  // 0x4(0x4)
	float NumOfVertPercentage;  // 0x8(0x4)
	uint32_t MaxNumOfTriangles;  // 0xC(0x4)
	uint32_t MaxNumOfVerts;  // 0x10(0x4)
	float MaxDeviationPercentage;  // 0x14(0x4)
	char SkeletalMeshOptimizationType ReductionMethod;  // 0x18(0x1)
	char SkeletalMeshOptimizationImportance SilhouetteImportance;  // 0x19(0x1)
	char SkeletalMeshOptimizationImportance TextureImportance;  // 0x1A(0x1)
	char SkeletalMeshOptimizationImportance ShadingImportance;  // 0x1B(0x1)
	char SkeletalMeshOptimizationImportance SkinningImportance;  // 0x1C(0x1)
	char bRemapMorphTargets : 1;  // 0x1D(0x1)
	char bRecalcNormals : 1;  // 0x1D(0x1)
	char pad_29_1 : 6;  // 0x1D(0x1)
	char pad_30[3];  // 0x1E(0x3)
	float WeldingThreshold;  // 0x20(0x4)
	float NormalsThreshold;  // 0x24(0x4)
	int32_t MaxBonesPerVertex;  // 0x28(0x4)
	char bEnforceBoneBoundaries : 1;  // 0x2C(0x1)
	char pad_44_1 : 7;  // 0x2C(0x1)
	char pad_45[4];  // 0x2D(0x4)
	float VolumeImportance;  // 0x30(0x4)
	char bLockEdges : 1;  // 0x34(0x1)
	char bLockColorBounaries : 1;  // 0x34(0x1)
	char pad_52_1 : 6;  // 0x34(0x1)
	char pad_53[4];  // 0x35(0x4)
	int32_t BaseLOD;  // 0x38(0x4)

}; 
// Function Engine.KismetMathLibrary.Vector4_SizeSquared
// Size: 0x20(Inherited: 0x0) 
struct FVector4_SizeSquared
{
	struct FVector4 A;  // 0x0(0x10)
	float ReturnValue;  // 0x10(0x4)
	char pad_20[12];  // 0x14(0xC)

}; 
// Function Engine.AvoidanceManager.GetNewAvoidanceUID
// Size: 0x4(Inherited: 0x0) 
struct FGetNewAvoidanceUID
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function Engine.KismetSystemLibrary.DrawDebugString
// Size: 0x48(Inherited: 0x0) 
struct FDrawDebugString
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector TextLocation;  // 0x8(0xC)
	char pad_20[4];  // 0x14(0x4)
	struct FString Text;  // 0x18(0x10)
	struct AActor* TestBaseActor;  // 0x28(0x8)
	struct FLinearColor TextColor;  // 0x30(0x10)
	float Duration;  // 0x40(0x4)
	char pad_68[4];  // 0x44(0x4)

}; 
// Function Engine.Actor.K2_AddActorWorldOffset
// Size: 0x9C(Inherited: 0x0) 
struct FK2_AddActorWorldOffset
{
	struct FVector DeltaLocation;  // 0x0(0xC)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool bSweep : 1;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)
	struct FHitResult SweepHitResult;  // 0x10(0x88)
	char pad_152_1 : 7;  // 0x98(0x1)
	bool bTeleport : 1;  // 0x98(0x1)
	char pad_153[3];  // 0x99(0x3)

}; 
// ScriptStruct Engine.KBoxElem
// Size: 0x58(Inherited: 0x30) 
struct FKBoxElem : public FKShapeElem
{
	struct FVector Center;  // 0x30(0xC)
	struct FRotator Rotation;  // 0x3C(0xC)
	float X;  // 0x48(0x4)
	float Y;  // 0x4C(0x4)
	float Z;  // 0x50(0x4)
	char pad_84[4];  // 0x54(0x4)

}; 
// Function Engine.KismetSystemLibrary.K2_IsTimerPaused
// Size: 0x20(Inherited: 0x0) 
struct FK2_IsTimerPaused
{
	struct UObject* Object;  // 0x0(0x8)
	struct FString FunctionName;  // 0x8(0x10)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool ReturnValue : 1;  // 0x18(0x1)
	char pad_25[7];  // 0x19(0x7)

}; 
// Function Engine.BlueprintPathsLibrary.EnginePluginsDir
// Size: 0x10(Inherited: 0x0) 
struct FEnginePluginsDir
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// SparseDelegateFunction Engine.ComponentSleepSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FComponentSleepSignature__DelegateSignature
{
	struct UPrimitiveComponent* SleepingComponent;  // 0x0(0x8)
	struct FName BoneName;  // 0x8(0x8)

}; 
// ScriptStruct Engine.A2CSPose
// Size: 0x28(Inherited: 0x10) 
struct FA2CSPose : public FA2Pose
{
	char pad_16[8];  // 0x10(0x8)
	struct TArray<char> ComponentSpaceFlags;  // 0x18(0x10)

}; 
// Function Engine.MatineeActor.SetPosition
// Size: 0x8(Inherited: 0x0) 
struct FSetPosition
{
	float NewPosition;  // 0x0(0x4)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool bJump : 1;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)

}; 
// ScriptStruct Engine.KeyHandleLookupTable
// Size: 0x60(Inherited: 0x0) 
struct FKeyHandleLookupTable
{
	char pad_0[96];  // 0x0(0x60)

}; 
// SparseDelegateFunction Engine.ComponentEndCursorOverSignature__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FComponentEndCursorOverSignature__DelegateSignature
{
	struct UPrimitiveComponent* TouchedComponent;  // 0x0(0x8)

}; 
// ScriptStruct Engine.TextureSourceBlock
// Size: 0x18(Inherited: 0x0) 
struct FTextureSourceBlock
{
	int32_t BlockX;  // 0x0(0x4)
	int32_t BlockY;  // 0x4(0x4)
	int32_t SizeX;  // 0x8(0x4)
	int32_t SizeY;  // 0xC(0x4)
	int32_t NumSlices;  // 0x10(0x4)
	int32_t NumMips;  // 0x14(0x4)

}; 
// Function Engine.SceneComponent.K2_AddLocalTransform
// Size: 0xC0(Inherited: 0x0) 
struct FK2_AddLocalTransform
{
	struct FTransform DeltaTransform;  // 0x0(0x30)
	char pad_48_1 : 7;  // 0x30(0x1)
	bool bSweep : 1;  // 0x30(0x1)
	char pad_49[3];  // 0x31(0x3)
	struct FHitResult SweepHitResult;  // 0x34(0x88)
	char pad_188_1 : 7;  // 0xBC(0x1)
	bool bTeleport : 1;  // 0xBC(0x1)
	char pad_189[3];  // 0xBD(0x3)

}; 
// SparseDelegateFunction Engine.ComponentOnClickedSignature__DelegateSignature
// Size: 0x20(Inherited: 0x0) 
struct FComponentOnClickedSignature__DelegateSignature
{
	struct UPrimitiveComponent* TouchedComponent;  // 0x0(0x8)
	struct FKey ButtonPressed;  // 0x8(0x18)

}; 
// Function Engine.GameplayStatics.IsGamePaused
// Size: 0x10(Inherited: 0x0) 
struct FIsGamePaused
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function Engine.Pawn.GetLastMovementInputVector
// Size: 0xC(Inherited: 0x0) 
struct FGetLastMovementInputVector
{
	struct FVector ReturnValue;  // 0x0(0xC)

}; 
// SparseDelegateFunction Engine.ComponentOnReleasedSignature__DelegateSignature
// Size: 0x20(Inherited: 0x0) 
struct FComponentOnReleasedSignature__DelegateSignature
{
	struct UPrimitiveComponent* TouchedComponent;  // 0x0(0x8)
	struct FKey ButtonReleased;  // 0x8(0x18)

}; 
// Function Engine.SceneComponent.IsAnySimulatingPhysics
// Size: 0x1(Inherited: 0x0) 
struct FIsAnySimulatingPhysics
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.BlueprintPathsLibrary.ConvertFromSandboxPath
// Size: 0x30(Inherited: 0x0) 
struct FConvertFromSandboxPath
{
	struct FString InPath;  // 0x0(0x10)
	struct FString InSandboxName;  // 0x10(0x10)
	struct FString ReturnValue;  // 0x20(0x10)

}; 
// ScriptStruct Engine.BPInterfaceDescription
// Size: 0x18(Inherited: 0x0) 
struct FBPInterfaceDescription
{
	UInterface* Interface;  // 0x0(0x8)
	struct TArray<struct UEdGraph*> Graphs;  // 0x8(0x10)

}; 
// Function Engine.KismetSystemLibrary.GetGameBundleId
// Size: 0x10(Inherited: 0x0) 
struct FGetGameBundleId
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// SparseDelegateFunction Engine.ComponentOnInputTouchBeginSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FComponentOnInputTouchBeginSignature__DelegateSignature
{
	char ETouchIndex FingerIndex;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct UPrimitiveComponent* TouchedComponent;  // 0x8(0x8)

}; 
// Function Engine.Actor.ReceiveActorOnInputTouchEnd
// Size: 0x1(Inherited: 0x0) 
struct FReceiveActorOnInputTouchEnd
{
	char ETouchIndex FingerIndex;  // 0x0(0x1)

}; 
// Function Engine.MovementComponent.ConstrainLocationToPlane
// Size: 0x18(Inherited: 0x0) 
struct FConstrainLocationToPlane
{
	struct FVector Location;  // 0x0(0xC)
	struct FVector ReturnValue;  // 0xC(0xC)

}; 
// DelegateFunction Engine.OnMontageStartedMCDelegate__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FOnMontageStartedMCDelegate__DelegateSignature
{
	struct UAnimMontage* Montage;  // 0x0(0x8)

}; 
// DelegateFunction Engine.PlayMontageAnimNotifyDelegate__DelegateSignature
// Size: 0x28(Inherited: 0x0) 
struct FPlayMontageAnimNotifyDelegate__DelegateSignature
{
	struct FName NotifyName;  // 0x0(0x8)
	struct FBranchingPointNotifyPayload BranchingPointPayload;  // 0x8(0x20)

}; 
// Function Engine.ActorComponent.ComponentHasTag
// Size: 0xC(Inherited: 0x0) 
struct FComponentHasTag
{
	struct FName Tag;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)

}; 
// Function Engine.SceneComponent.SnapTo
// Size: 0x18(Inherited: 0x0) 
struct FSnapTo
{
	struct USceneComponent* InParent;  // 0x0(0x8)
	struct FName InSocketName;  // 0x8(0x8)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// ScriptStruct Engine.BranchingPointNotifyPayload
// Size: 0x20(Inherited: 0x0) 
struct FBranchingPointNotifyPayload
{
	char pad_0[32];  // 0x0(0x20)

}; 
// Function Engine.MaterialInstanceDynamic.K2_InterpolateMaterialInstanceParams
// Size: 0x18(Inherited: 0x0) 
struct FK2_InterpolateMaterialInstanceParams
{
	struct UMaterialInstance* SourceA;  // 0x0(0x8)
	struct UMaterialInstance* SourceB;  // 0x8(0x8)
	float Alpha;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function Engine.KismetSystemLibrary.K2_ClearTimerDelegate
// Size: 0x10(Inherited: 0x0) 
struct FK2_ClearTimerDelegate
{
	struct FDelegate Delegate;  // 0x0(0x10)

}; 
// DelegateFunction Engine.OnAudioFadeChangeSignature__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FOnAudioFadeChangeSignature__DelegateSignature
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bFadeOut : 1;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float FadeTime;  // 0x4(0x4)

}; 
// Function Engine.Actor.K2_DetachFromActor
// Size: 0x3(Inherited: 0x0) 
struct FK2_DetachFromActor
{
	uint8_t  LocationRule;  // 0x0(0x1)
	uint8_t  RotationRule;  // 0x1(0x1)
	uint8_t  ScaleRule;  // 0x2(0x1)

}; 
// ScriptStruct Engine.CameraShakeUpdateParams
// Size: 0x600(Inherited: 0x0) 
struct FCameraShakeUpdateParams
{
	float DeltaTime;  // 0x0(0x4)
	float ShakeScale;  // 0x4(0x4)
	float DynamicScale;  // 0x8(0x4)
	float BlendingWeight;  // 0xC(0x4)
	struct FMinimalViewInfo POV;  // 0x10(0x5F0)

}; 
// Function Engine.PrimitiveComponent.SetOnlyOwnerSee
// Size: 0x1(Inherited: 0x0) 
struct FSetOnlyOwnerSee
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bNewOnlyOwnerSee : 1;  // 0x0(0x1)

}; 
// Function Engine.Emitter.IsActive
// Size: 0x1(Inherited: 0x0) 
struct FIsActive
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.ActorComponent.Activate
// Size: 0x1(Inherited: 0x0) 
struct FActivate
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bReset : 1;  // 0x0(0x1)

}; 
// Function Engine.PrimitiveComponent.SetAllMassScale
// Size: 0x4(Inherited: 0x0) 
struct FSetAllMassScale
{
	float InMassScale;  // 0x0(0x4)

}; 
// Function Engine.KismetSystemLibrary.K2_IsTimerActive
// Size: 0x20(Inherited: 0x0) 
struct FK2_IsTimerActive
{
	struct UObject* Object;  // 0x0(0x8)
	struct FString FunctionName;  // 0x8(0x10)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool ReturnValue : 1;  // 0x18(0x1)
	char pad_25[7];  // 0x19(0x7)

}; 
// Function Engine.KismetSystemLibrary.UnloadPrimaryAsset
// Size: 0x10(Inherited: 0x0) 
struct FUnloadPrimaryAsset
{
	struct FPrimaryAssetId PrimaryAssetId;  // 0x0(0x10)

}; 
// Function Engine.Actor.AddTickPrerequisiteActor
// Size: 0x8(Inherited: 0x0) 
struct FAddTickPrerequisiteActor
{
	struct AActor* PrerequisiteActor;  // 0x0(0x8)

}; 
// Function Engine.SplineComponent.GetWorldDirectionAtDistanceAlongSpline
// Size: 0x10(Inherited: 0x0) 
struct FGetWorldDirectionAtDistanceAlongSpline
{
	float Distance;  // 0x0(0x4)
	struct FVector ReturnValue;  // 0x4(0xC)

}; 
// Function Engine.PhysicsConstraintComponent.SetAngularDriveMode
// Size: 0x1(Inherited: 0x0) 
struct FSetAngularDriveMode
{
	char EAngularDriveMode DriveMode;  // 0x0(0x1)

}; 
// Function Engine.GameplayStatics.ApplyPointDamage
// Size: 0xC0(Inherited: 0x0) 
struct FApplyPointDamage
{
	struct AActor* DamagedActor;  // 0x0(0x8)
	float BaseDamage;  // 0x8(0x4)
	struct FVector HitFromDirection;  // 0xC(0xC)
	struct FHitResult HitInfo;  // 0x18(0x88)
	struct AController* eventInstigator;  // 0xA0(0x8)
	struct AActor* DamageCauser;  // 0xA8(0x8)
	UDamageType* DamageTypeClass;  // 0xB0(0x8)
	float ReturnValue;  // 0xB8(0x4)
	char pad_188[4];  // 0xBC(0x4)

}; 
// ScriptStruct Engine.NetViewer
// Size: 0x30(Inherited: 0x0) 
struct FNetViewer
{
	struct UNetConnection* Connection;  // 0x0(0x8)
	struct AActor* InViewer;  // 0x8(0x8)
	struct AActor* ViewTarget;  // 0x10(0x8)
	struct FVector ViewLocation;  // 0x18(0xC)
	struct FVector ViewDir;  // 0x24(0xC)

}; 
// Function Engine.KismetInputLibrary.PointerEvent_GetLastScreenSpacePosition
// Size: 0x78(Inherited: 0x0) 
struct FPointerEvent_GetLastScreenSpacePosition
{
	struct FPointerEvent Input;  // 0x0(0x70)
	struct FVector2D ReturnValue;  // 0x70(0x8)

}; 
// Function Engine.PlayerController.ServerExecRPC
// Size: 0x10(Inherited: 0x0) 
struct FServerExecRPC
{
	struct FString Msg;  // 0x0(0x10)

}; 
// Function Engine.Actor.AddTickPrerequisiteComponent
// Size: 0x8(Inherited: 0x0) 
struct FAddTickPrerequisiteComponent
{
	struct UActorComponent* PrerequisiteComponent;  // 0x0(0x8)

}; 
// Function Engine.GameUserSettings.IsVSyncDirty
// Size: 0x1(Inherited: 0x0) 
struct FIsVSyncDirty
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.PrimitiveComponent.SetMassOverrideInKg
// Size: 0x10(Inherited: 0x0) 
struct FSetMassOverrideInKg
{
	struct FName BoneName;  // 0x0(0x8)
	float MassInKg;  // 0x8(0x4)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool bOverrideMass : 1;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)

}; 
// Function Engine.ActorComponent.GetComponentTickInterval
// Size: 0x4(Inherited: 0x0) 
struct FGetComponentTickInterval
{
	float ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct Engine.SoundSubmixSendInfo
// Size: 0xB0(Inherited: 0x0) 
struct FSoundSubmixSendInfo
{
	uint8_t  SendLevelControlMethod;  // 0x0(0x1)
	uint8_t  SendStage;  // 0x1(0x1)
	char pad_2[6];  // 0x2(0x6)
	struct USoundSubmixBase* SoundSubmix;  // 0x8(0x8)
	float SendLevel;  // 0x10(0x4)
	float MinSendLevel;  // 0x14(0x4)
	float MaxSendLevel;  // 0x18(0x4)
	float MinSendDistance;  // 0x1C(0x4)
	float MaxSendDistance;  // 0x20(0x4)
	char pad_36[4];  // 0x24(0x4)
	struct FRuntimeFloatCurve CustomSendLevelCurve;  // 0x28(0x88)

}; 
// Function Engine.SplineComponent.GetLocationAtDistanceAlongSpline
// Size: 0x14(Inherited: 0x0) 
struct FGetLocationAtDistanceAlongSpline
{
	float Distance;  // 0x0(0x4)
	char ESplineCoordinateSpace CoordinateSpace;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)
	struct FVector ReturnValue;  // 0x8(0xC)

}; 
// Function Engine.PlayerController.ServerMutePlayer
// Size: 0x28(Inherited: 0x0) 
struct FServerMutePlayer
{
	struct FUniqueNetIdRepl PlayerId;  // 0x0(0x28)

}; 
// Function Engine.AnimInstance.IsSyncGroupBetweenMarkers
// Size: 0x1C(Inherited: 0x0) 
struct FIsSyncGroupBetweenMarkers
{
	struct FName InSyncGroupName;  // 0x0(0x8)
	struct FName PreviousMarker;  // 0x8(0x8)
	struct FName NextMarker;  // 0x10(0x8)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool bRespectMarkerOrder : 1;  // 0x18(0x1)
	char pad_25_1 : 7;  // 0x19(0x1)
	bool ReturnValue : 1;  // 0x19(0x1)
	char pad_26[2];  // 0x1A(0x2)

}; 
// Function Engine.KismetMathLibrary.FromSeconds
// Size: 0x10(Inherited: 0x0) 
struct FFromSeconds
{
	float Seconds;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct FTimespan ReturnValue;  // 0x8(0x8)

}; 
// Function Engine.Actor.GetOwner
// Size: 0x8(Inherited: 0x0) 
struct FGetOwner
{
	struct AActor* ReturnValue;  // 0x0(0x8)

}; 
// Function Engine.PrimitiveComponent.SetDefaultCustomPrimitiveDataVector2
// Size: 0xC(Inherited: 0x0) 
struct FSetDefaultCustomPrimitiveDataVector2
{
	int32_t DataIndex;  // 0x0(0x4)
	struct FVector2D Value;  // 0x4(0x8)

}; 
// Function Engine.KismetSystemLibrary.BoxOverlapActors
// Size: 0x60(Inherited: 0x0) 
struct FBoxOverlapActors
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector BoxPos;  // 0x8(0xC)
	struct FVector BoxExtent;  // 0x14(0xC)
	struct TArray<char EObjectTypeQuery> ObjectTypes;  // 0x20(0x10)
	UObject* ActorClassFilter;  // 0x30(0x8)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x38(0x10)
	struct TArray<struct AActor*> OutActors;  // 0x48(0x10)
	char pad_88_1 : 7;  // 0x58(0x1)
	bool ReturnValue : 1;  // 0x58(0x1)
	char pad_89[7];  // 0x59(0x7)

}; 
// Function Engine.MovementComponent.SetPlaneConstraintNormal
// Size: 0xC(Inherited: 0x0) 
struct FSetPlaneConstraintNormal
{
	struct FVector PlaneNormal;  // 0x0(0xC)

}; 
// Function Engine.GameplayStatics.ProjectWorldToScreen
// Size: 0x20(Inherited: 0x0) 
struct FProjectWorldToScreen
{
	struct APlayerController* Player;  // 0x0(0x8)
	struct FVector WorldPosition;  // 0x8(0xC)
	struct FVector2D screenPosition;  // 0x14(0x8)
	char pad_28_1 : 7;  // 0x1C(0x1)
	bool bPlayerViewportRelative : 1;  // 0x1C(0x1)
	char pad_29_1 : 7;  // 0x1D(0x1)
	bool ReturnValue : 1;  // 0x1D(0x1)
	char pad_30[2];  // 0x1E(0x2)

}; 
// Function Engine.ActorComponent.IsBeingDestroyed
// Size: 0x1(Inherited: 0x0) 
struct FIsBeingDestroyed
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.ForceFeedbackComponent.Play
// Size: 0x4(Inherited: 0x0) 
struct FPlay
{
	float StartTime;  // 0x0(0x4)

}; 
// Function Engine.RectLightComponent.SetBarnDoorLength
// Size: 0x4(Inherited: 0x0) 
struct FSetBarnDoorLength
{
	float NewValue;  // 0x0(0x4)

}; 
// Function Engine.KismetSystemLibrary.K2_IsTimerPausedHandle
// Size: 0x18(Inherited: 0x0) 
struct FK2_IsTimerPausedHandle
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FTimerHandle Handle;  // 0x8(0x8)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// Function Engine.AnimInstance.Montage_GetIsStopped
// Size: 0x10(Inherited: 0x0) 
struct FMontage_GetIsStopped
{
	struct UAnimMontage* Montage;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function Engine.PrimitiveComponent.SetPhysMaterialOverride
// Size: 0x8(Inherited: 0x0) 
struct FSetPhysMaterialOverride
{
	struct UPhysicalMaterial* NewPhysMaterial;  // 0x0(0x8)

}; 
// Function Engine.PrimitiveComponent.GetCollisionObjectType
// Size: 0x1(Inherited: 0x0) 
struct FGetCollisionObjectType
{
	char ECollisionChannel ReturnValue;  // 0x0(0x1)

}; 
// Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector4
// Size: 0x20(Inherited: 0x0) 
struct FSetCustomPrimitiveDataVector4
{
	int32_t DataIndex;  // 0x0(0x4)
	char pad_4[12];  // 0x4(0xC)
	struct FVector4 Value;  // 0x10(0x10)

}; 
// Function Engine.SceneComponent.SetAbsolute
// Size: 0x3(Inherited: 0x0) 
struct FSetAbsolute
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bNewAbsoluteLocation : 1;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool bNewAbsoluteRotation : 1;  // 0x1(0x1)
	char pad_2_1 : 7;  // 0x2(0x1)
	bool bNewAbsoluteScale : 1;  // 0x2(0x1)

}; 
// Function Engine.KismetMathLibrary.Divide_TimespanFloat
// Size: 0x18(Inherited: 0x0) 
struct FDivide_TimespanFloat
{
	struct FTimespan A;  // 0x0(0x8)
	float Scalar;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)
	struct FTimespan ReturnValue;  // 0x10(0x8)

}; 
// Function Engine.DebugCameraController.ReceiveOnActivate
// Size: 0x8(Inherited: 0x0) 
struct FReceiveOnActivate
{
	struct APlayerController* OriginalPC;  // 0x0(0x8)

}; 
// Function Engine.ActorComponent.IsComponentTickEnabled
// Size: 0x1(Inherited: 0x0) 
struct FIsComponentTickEnabled
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.LightComponent.SetForceCachedShadowsForMovablePrimitives
// Size: 0x1(Inherited: 0x0) 
struct FSetForceCachedShadowsForMovablePrimitives
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bNewValue : 1;  // 0x0(0x1)

}; 
// Function Engine.HUD.DrawTextureSimple
// Size: 0x18(Inherited: 0x0) 
struct FDrawTextureSimple
{
	struct UTexture* Texture;  // 0x0(0x8)
	float ScreenX;  // 0x8(0x4)
	float ScreenY;  // 0xC(0x4)
	float Scale;  // 0x10(0x4)
	char pad_20_1 : 7;  // 0x14(0x1)
	bool bScalePosition : 1;  // 0x14(0x1)
	char pad_21[3];  // 0x15(0x3)

}; 
// Function Engine.Actor.K2_DestroyComponent
// Size: 0x8(Inherited: 0x0) 
struct FK2_DestroyComponent
{
	struct UActorComponent* Component;  // 0x0(0x8)

}; 
// Function Engine.SkyAtmosphereComponent.SetMieAbsorption
// Size: 0x10(Inherited: 0x0) 
struct FSetMieAbsorption
{
	struct FLinearColor NewValue;  // 0x0(0x10)

}; 
// Function Engine.HUD.ReceiveDrawHUD
// Size: 0x8(Inherited: 0x0) 
struct FReceiveDrawHUD
{
	int32_t SizeX;  // 0x0(0x4)
	int32_t SizeY;  // 0x4(0x4)

}; 
// Function Engine.KismetSystemLibrary.IsInterstitialAdAvailable
// Size: 0x1(Inherited: 0x0) 
struct FIsInterstitialAdAvailable
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.AnimInstance.GetInstanceMachineWeight
// Size: 0x8(Inherited: 0x0) 
struct FGetInstanceMachineWeight
{
	int32_t MachineIndex;  // 0x0(0x4)
	float ReturnValue;  // 0x4(0x4)

}; 
// Function Engine.KismetMathLibrary.Quat_SetComponents
// Size: 0x20(Inherited: 0x0) 
struct FQuat_SetComponents
{
	struct FQuat Q;  // 0x0(0x10)
	float X;  // 0x10(0x4)
	float Y;  // 0x14(0x4)
	float Z;  // 0x18(0x4)
	float W;  // 0x1C(0x4)

}; 
// Function Engine.Actor.ReceiveEndPlay
// Size: 0x1(Inherited: 0x0) 
struct FReceiveEndPlay
{
	char EEndPlayReason EndPlayReason;  // 0x0(0x1)

}; 
// Function Engine.KismetMathLibrary.RandomUnitVectorInEllipticalConeInRadiansFromStream
// Size: 0x28(Inherited: 0x0) 
struct FRandomUnitVectorInEllipticalConeInRadiansFromStream
{
	struct FVector ConeDir;  // 0x0(0xC)
	float MaxYawInRadians;  // 0xC(0x4)
	float MaxPitchInRadians;  // 0x10(0x4)
	struct FRandomStream Stream;  // 0x14(0x8)
	struct FVector ReturnValue;  // 0x1C(0xC)

}; 
// DelegateFunction Engine.OnQuartzCommandEventBP__DelegateSignature
// Size: 0xC(Inherited: 0x0) 
struct FOnQuartzCommandEventBP__DelegateSignature
{
	uint8_t  EventType;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	struct FName Name;  // 0x4(0x8)

}; 
// Function Engine.InputSettings.GetActionMappingByName
// Size: 0x18(Inherited: 0x0) 
struct FGetActionMappingByName
{
	struct FName InActionName;  // 0x0(0x8)
	struct TArray<struct FInputActionKeyMapping> OutMappings;  // 0x8(0x10)

}; 
// Function Engine.Actor.ReceiveTick
// Size: 0x4(Inherited: 0x0) 
struct FReceiveTick
{
	float DeltaSeconds;  // 0x0(0x4)

}; 
// Function Engine.KismetMathLibrary.GetReflectionVector
// Size: 0x24(Inherited: 0x0) 
struct FGetReflectionVector
{
	struct FVector Direction;  // 0x0(0xC)
	struct FVector SurfaceNormal;  // 0xC(0xC)
	struct FVector ReturnValue;  // 0x18(0xC)

}; 
// ScriptStruct Engine.PlatformInterfaceData
// Size: 0x30(Inherited: 0x0) 
struct FPlatformInterfaceData
{
	struct FName DataName;  // 0x0(0x8)
	char EPlatformInterfaceDataType Type;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)
	int32_t IntValue;  // 0xC(0x4)
	float FloatValue;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)
	struct FString StringValue;  // 0x18(0x10)
	struct UObject* ObjectValue;  // 0x28(0x8)

}; 
// Function Engine.Actor.RemoveTickPrerequisiteComponent
// Size: 0x8(Inherited: 0x0) 
struct FRemoveTickPrerequisiteComponent
{
	struct UActorComponent* PrerequisiteComponent;  // 0x0(0x8)

}; 
// Function Engine.KismetStringLibrary.Conv_IntPointToString
// Size: 0x18(Inherited: 0x0) 
struct FConv_IntPointToString
{
	struct FIntPoint InIntPoint;  // 0x0(0x8)
	struct FString ReturnValue;  // 0x8(0x10)

}; 
// Function Engine.KismetMathLibrary.LessEqual_DateTimeDateTime
// Size: 0x18(Inherited: 0x0) 
struct FLessEqual_DateTimeDateTime
{
	struct FDateTime A;  // 0x0(0x8)
	struct FDateTime B;  // 0x8(0x8)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// Function Engine.PrimitiveComponent.SetWalkableSlopeOverride
// Size: 0x10(Inherited: 0x0) 
struct FSetWalkableSlopeOverride
{
	struct FWalkableSlopeOverride NewOverride;  // 0x0(0x10)

}; 
// Function Engine.KismetMathLibrary.IsZero2D
// Size: 0xC(Inherited: 0x0) 
struct FIsZero2D
{
	struct FVector2D A;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)

}; 
// ScriptStruct Engine.ParticleEmitterReplayFrame
// Size: 0x10(Inherited: 0x0) 
struct FParticleEmitterReplayFrame
{
	char pad_0[16];  // 0x0(0x10)

}; 
// Function Engine.Actor.GetActorBounds
// Size: 0x20(Inherited: 0x0) 
struct FGetActorBounds
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bOnlyCollidingComponents : 1;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	struct FVector Origin;  // 0x4(0xC)
	struct FVector BoxExtent;  // 0x10(0xC)
	char pad_28_1 : 7;  // 0x1C(0x1)
	bool bIncludeFromChildActors : 1;  // 0x1C(0x1)
	char pad_29[3];  // 0x1D(0x3)

}; 
// Function Engine.ActorComponent.SetActive
// Size: 0x2(Inherited: 0x0) 
struct FSetActive
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bNewActive : 1;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool bReset : 1;  // 0x1(0x1)

}; 
// Function Engine.KismetInputLibrary.InputEvent_IsLeftShiftDown
// Size: 0x20(Inherited: 0x0) 
struct FInputEvent_IsLeftShiftDown
{
	struct FInputEvent Input;  // 0x0(0x18)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool ReturnValue : 1;  // 0x18(0x1)
	char pad_25[7];  // 0x19(0x7)

}; 
// Function Engine.Actor.GetActorRelativeScale3D
// Size: 0xC(Inherited: 0x0) 
struct FGetActorRelativeScale3D
{
	struct FVector ReturnValue;  // 0x0(0xC)

}; 
// Function Engine.Actor.GetDistanceTo
// Size: 0x10(Inherited: 0x0) 
struct FGetDistanceTo
{
	struct AActor* OtherActor;  // 0x0(0x8)
	float ReturnValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function Engine.ActorComponent.SetAutoActivate
// Size: 0x1(Inherited: 0x0) 
struct FSetAutoActivate
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bNewAutoActivate : 1;  // 0x0(0x1)

}; 
// ScriptStruct Engine.SoundWaveSpectralData
// Size: 0xC(Inherited: 0x0) 
struct FSoundWaveSpectralData
{
	float FrequencyHz;  // 0x0(0x4)
	float Magnitude;  // 0x4(0x4)
	float NormalizedMagnitude;  // 0x8(0x4)

}; 
// Function Engine.VOIPTalker.CreateTalkerForPlayer
// Size: 0x10(Inherited: 0x0) 
struct FCreateTalkerForPlayer
{
	struct APlayerState* OwningState;  // 0x0(0x8)
	struct UVOIPTalker* ReturnValue;  // 0x8(0x8)

}; 
// Function Engine.KismetSystemLibrary.GetConvenientWindowedResolutions
// Size: 0x18(Inherited: 0x0) 
struct FGetConvenientWindowedResolutions
{
	struct TArray<struct FIntPoint> Resolutions;  // 0x0(0x10)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// Function Engine.PointLightComponent.SetSourceLength
// Size: 0x4(Inherited: 0x0) 
struct FSetSourceLength
{
	float NewValue;  // 0x0(0x4)

}; 
// Function Engine.ActorComponent.SetComponentTickInterval
// Size: 0x4(Inherited: 0x0) 
struct FSetComponentTickInterval
{
	float TickInterval;  // 0x0(0x4)

}; 
// ScriptStruct Engine.InterpControlPoint
// Size: 0x1C(Inherited: 0x0) 
struct FInterpControlPoint
{
	struct FVector PositionControlPoint;  // 0x0(0xC)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool bPositionIsRelative : 1;  // 0xC(0x1)
	char pad_13[15];  // 0xD(0xF)

}; 
// ScriptStruct Engine.AnimationFrameSnapshot
// Size: 0x1(Inherited: 0x0) 
struct FAnimationFrameSnapshot
{
	char pad_0[1];  // 0x0(0x1)

}; 
// ScriptStruct Engine.NavDataConfig
// Size: 0x78(Inherited: 0x30) 
struct FNavDataConfig : public FNavAgentProperties
{
	struct FName Name;  // 0x30(0x8)
	struct FColor Color;  // 0x38(0x4)
	struct FVector DefaultQueryExtent;  // 0x3C(0xC)
	AActor* NavigationDataClass;  // 0x48(0x8)
	struct TSoftClassPtr<UObject> NavDataClass;  // 0x50(0x28)

}; 
// Function Engine.ActorComponent.SetComponentTickIntervalAndCooldown
// Size: 0x4(Inherited: 0x0) 
struct FSetComponentTickIntervalAndCooldown
{
	float TickInterval;  // 0x0(0x4)

}; 
// Function Engine.KismetInternationalizationLibrary.GetCurrentCulture
// Size: 0x10(Inherited: 0x0) 
struct FGetCurrentCulture
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.GameplayStatics.IsSplitscreenForceDisabled
// Size: 0x10(Inherited: 0x0) 
struct FIsSplitscreenForceDisabled
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function Engine.PrimitiveComponent.GetCollisionEnabled
// Size: 0x1(Inherited: 0x0) 
struct FGetCollisionEnabled
{
	char ECollisionEnabled ReturnValue;  // 0x0(0x1)

}; 
// Function Engine.PlayerController.ClientTravel
// Size: 0x28(Inherited: 0x0) 
struct FClientTravel
{
	struct FString URL;  // 0x0(0x10)
	char ETravelType TravelType;  // 0x10(0x1)
	char pad_17_1 : 7;  // 0x11(0x1)
	bool bSeamless : 1;  // 0x11(0x1)
	char pad_18[2];  // 0x12(0x2)
	struct FGuid MapPackageGuid;  // 0x14(0x10)
	char pad_36[4];  // 0x24(0x4)

}; 
// ScriptStruct Engine.StreamingRenderAssetPrimitiveInfo
// Size: 0x30(Inherited: 0x0) 
struct FStreamingRenderAssetPrimitiveInfo
{
	struct UStreamableRenderAsset* RenderAsset;  // 0x0(0x8)
	struct FBoxSphereBounds Bounds;  // 0x8(0x1C)
	float TexelFactor;  // 0x24(0x4)
	uint32_t PackedRelativeBox;  // 0x28(0x4)
	char bAllowInvalidTexelFactorWhenUnregistered : 1;  // 0x2C(0x1)
	char pad_44_1 : 7;  // 0x2C(0x1)
	char pad_45[4];  // 0x2D(0x4)

}; 
// Function Engine.KismetRenderingLibrary.ExportRenderTarget
// Size: 0x30(Inherited: 0x0) 
struct FExportRenderTarget
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct UTextureRenderTarget2D* TextureRenderTarget;  // 0x8(0x8)
	struct FString FilePath;  // 0x10(0x10)
	struct FString Filename;  // 0x20(0x10)

}; 
// Function Engine.ActorComponent.SetIsReplicated
// Size: 0x1(Inherited: 0x0) 
struct FSetIsReplicated
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ShouldReplicate : 1;  // 0x0(0x1)

}; 
// Function Engine.SkinnedMeshComponent.IsMaterialSectionShown
// Size: 0xC(Inherited: 0x0) 
struct FIsMaterialSectionShown
{
	int32_t MaterialID;  // 0x0(0x4)
	int32_t LODIndex;  // 0x4(0x4)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)

}; 
// Function Engine.Actor.SetTickableWhenPaused
// Size: 0x1(Inherited: 0x0) 
struct FSetTickableWhenPaused
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bTickableWhenPaused : 1;  // 0x0(0x1)

}; 
// Function Engine.SceneComponent.K2_GetComponentToWorld
// Size: 0x30(Inherited: 0x0) 
struct FK2_GetComponentToWorld
{
	struct FTransform ReturnValue;  // 0x0(0x30)

}; 
// Function Engine.PlayerController.ServerViewSelf
// Size: 0x10(Inherited: 0x0) 
struct FServerViewSelf
{
	struct FViewTargetTransitionParams TransitionParams;  // 0x0(0x10)

}; 
// ScriptStruct Engine.ExponentialHeightFogData
// Size: 0xC(Inherited: 0x0) 
struct FExponentialHeightFogData
{
	float FogDensity;  // 0x0(0x4)
	float FogHeightFalloff;  // 0x4(0x4)
	float FogHeightOffset;  // 0x8(0x4)

}; 
// Function Engine.Actor.SetTickGroup
// Size: 0x1(Inherited: 0x0) 
struct FSetTickGroup
{
	char ETickingGroup NewTickGroup;  // 0x0(0x1)

}; 
// Function Engine.VisualLoggerKismetLibrary.LogSegment
// Size: 0x50(Inherited: 0x0) 
struct FLogSegment
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector SegmentStart;  // 0x8(0xC)
	struct FVector SegmentEnd;  // 0x14(0xC)
	struct FString Text;  // 0x20(0x10)
	struct FLinearColor ObjectColor;  // 0x30(0x10)
	float Thickness;  // 0x40(0x4)
	struct FName CategoryName;  // 0x44(0x8)
	char pad_76_1 : 7;  // 0x4C(0x1)
	bool bAddToMessageLog : 1;  // 0x4C(0x1)
	char pad_77[3];  // 0x4D(0x3)

}; 
// Function Engine.KismetSystemLibrary.LoadInterstitialAd
// Size: 0x4(Inherited: 0x0) 
struct FLoadInterstitialAd
{
	int32_t AdIdIndex;  // 0x0(0x4)

}; 
// Function Engine.Actor.K2_GetActorRotation
// Size: 0xC(Inherited: 0x0) 
struct FK2_GetActorRotation
{
	struct FRotator ReturnValue;  // 0x0(0xC)

}; 
// ScriptStruct Engine.FilmStockSettings
// Size: 0x14(Inherited: 0x0) 
struct FFilmStockSettings
{
	float Slope;  // 0x0(0x4)
	float Toe;  // 0x4(0x4)
	float Shoulder;  // 0x8(0x4)
	float BlackClip;  // 0xC(0x4)
	float WhiteClip;  // 0x10(0x4)

}; 
// ScriptStruct Engine.SimpleMemberReference
// Size: 0x20(Inherited: 0x0) 
struct FSimpleMemberReference
{
	struct UObject* MemberParent;  // 0x0(0x8)
	struct FName MemberName;  // 0x8(0x8)
	struct FGuid MemberGuid;  // 0x10(0x10)

}; 
// ScriptStruct Engine.TickFunction
// Size: 0x28(Inherited: 0x0) 
struct FTickFunction
{
	char pad_0[8];  // 0x0(0x8)
	char ETickingGroup TickGroup;  // 0x8(0x1)
	char ETickingGroup EndTickGroup;  // 0x9(0x1)
	char bTickEvenWhenPaused : 1;  // 0xA(0x1)
	char bCanEverTick : 1;  // 0xA(0x1)
	char bStartWithTickEnabled : 1;  // 0xA(0x1)
	char bAllowTickOnDedicatedServer : 1;  // 0xA(0x1)
	char pad_10_1 : 4;  // 0xA(0x1)
	char pad_11[2];  // 0xB(0x2)
	float TickInterval;  // 0xC(0x4)
	char pad_16[24];  // 0x10(0x18)

}; 
// ScriptStruct Engine.CollectionVectorParameter
// Size: 0x28(Inherited: 0x18) 
struct FCollectionVectorParameter : public FCollectionParameterBase
{
	struct FLinearColor DefaultValue;  // 0x18(0x10)

}; 
// Function Engine.KismetMathLibrary.Matrix_ScaleTranslation
// Size: 0x90(Inherited: 0x0) 
struct FMatrix_ScaleTranslation
{
	struct FMatrix M;  // 0x0(0x40)
	struct FVector Scale3D;  // 0x40(0xC)
	char pad_76[4];  // 0x4C(0x4)
	struct FMatrix ReturnValue;  // 0x50(0x40)

}; 
// ScriptStruct Engine.ActorComponentTickFunction
// Size: 0x30(Inherited: 0x28) 
struct FActorComponentTickFunction : public FTickFunction
{
	char pad_40[8];  // 0x28(0x8)

}; 
// Function Engine.KismetNodeHelperLibrary.GetRandomUnmarkedBit
// Size: 0x10(Inherited: 0x0) 
struct FGetRandomUnmarkedBit
{
	int32_t Data;  // 0x0(0x4)
	int32_t StartIdx;  // 0x4(0x4)
	int32_t NumBits;  // 0x8(0x4)
	int32_t ReturnValue;  // 0xC(0x4)

}; 
// DelegateFunction Engine.ApplicationLifecycleComponent.OnTemperatureChangeDelegate__DelegateSignature
// Size: 0x1(Inherited: 0x0) 
struct FOnTemperatureChangeDelegate__DelegateSignature
{
	uint8_t  Severity;  // 0x0(0x1)

}; 
// Function Engine.MovementComponent.K2_MoveUpdatedComponent
// Size: 0xA4(Inherited: 0x0) 
struct FK2_MoveUpdatedComponent
{
	struct FVector Delta;  // 0x0(0xC)
	struct FRotator NewRotation;  // 0xC(0xC)
	struct FHitResult OutHit;  // 0x18(0x88)
	char pad_160_1 : 7;  // 0xA0(0x1)
	bool bSweep : 1;  // 0xA0(0x1)
	char pad_161_1 : 7;  // 0xA1(0x1)
	bool bTeleport : 1;  // 0xA1(0x1)
	char pad_162_1 : 7;  // 0xA2(0x1)
	bool ReturnValue : 1;  // 0xA2(0x1)
	char pad_163[1];  // 0xA3(0x1)

}; 
// Function Engine.KismetSystemLibrary.BoxTraceSingleForObjects
// Size: 0x118(Inherited: 0x0) 
struct FBoxTraceSingleForObjects
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Start;  // 0x8(0xC)
	struct FVector End;  // 0x14(0xC)
	struct FVector HalfSize;  // 0x20(0xC)
	struct FRotator Orientation;  // 0x2C(0xC)
	struct TArray<char EObjectTypeQuery> ObjectTypes;  // 0x38(0x10)
	char pad_72_1 : 7;  // 0x48(0x1)
	bool bTraceComplex : 1;  // 0x48(0x1)
	char pad_73[7];  // 0x49(0x7)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x50(0x10)
	char EDrawDebugTrace DrawDebugType;  // 0x60(0x1)
	char pad_97[3];  // 0x61(0x3)
	struct FHitResult OutHit;  // 0x64(0x88)
	char pad_236_1 : 7;  // 0xEC(0x1)
	bool bIgnoreSelf : 1;  // 0xEC(0x1)
	char pad_237[3];  // 0xED(0x3)
	struct FLinearColor TraceColor;  // 0xF0(0x10)
	struct FLinearColor TraceHitColor;  // 0x100(0x10)
	float DrawTime;  // 0x110(0x4)
	char pad_276_1 : 7;  // 0x114(0x1)
	bool ReturnValue : 1;  // 0x114(0x1)
	char pad_277[3];  // 0x115(0x3)

}; 
// Function Engine.PlayerController.ClientSetForceMipLevelsToBeResident
// Size: 0x10(Inherited: 0x0) 
struct FClientSetForceMipLevelsToBeResident
{
	struct UMaterialInterface* Material;  // 0x0(0x8)
	float ForceDuration;  // 0x8(0x4)
	int32_t CinematicTextureGroups;  // 0xC(0x4)

}; 
// DelegateFunction Engine.ApplicationLifecycleComponent.ApplicationStartupArgumentsDelegate__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FApplicationStartupArgumentsDelegate__DelegateSignature
{
	struct TArray<struct FString> StartupArguments;  // 0x0(0x10)

}; 
// Function Engine.PlayerController.ServerUnmutePlayer
// Size: 0x28(Inherited: 0x0) 
struct FServerUnmutePlayer
{
	struct FUniqueNetIdRepl PlayerId;  // 0x0(0x28)

}; 
// ScriptStruct Engine.LevelStreamingStatus
// Size: 0x10(Inherited: 0x0) 
struct FLevelStreamingStatus
{
	struct FName PackageName;  // 0x0(0x8)
	char bShouldBeLoaded : 1;  // 0x8(0x1)
	char bShouldBeVisible : 1;  // 0x8(0x1)
	char pad_8_1 : 6;  // 0x8(0x1)
	char pad_9[4];  // 0x9(0x4)
	uint32_t LODIndex;  // 0xC(0x4)

}; 
// ScriptStruct Engine.HLODISMComponentDesc
// Size: 0x20(Inherited: 0x0) 
struct FHLODISMComponentDesc
{
	struct UStaticMesh* StaticMesh;  // 0x0(0x8)
	struct UMaterialInterface* Material;  // 0x8(0x8)
	struct TArray<struct FTransform> Instances;  // 0x10(0x10)

}; 
// Function Engine.BlueprintPathsLibrary.IsProjectFilePathSet
// Size: 0x1(Inherited: 0x0) 
struct FIsProjectFilePathSet
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// DelegateFunction Engine.OnSubmixSpectralAnalysisBP__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FOnSubmixSpectralAnalysisBP__DelegateSignature
{
	struct TArray<float> Magnitude;  // 0x0(0x10)

}; 
// Function Engine.SceneComponent.K2_SetRelativeLocation
// Size: 0x9C(Inherited: 0x0) 
struct FK2_SetRelativeLocation
{
	struct FVector NewLocation;  // 0x0(0xC)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool bSweep : 1;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)
	struct FHitResult SweepHitResult;  // 0x10(0x88)
	char pad_152_1 : 7;  // 0x98(0x1)
	bool bTeleport : 1;  // 0x98(0x1)
	char pad_153[3];  // 0x99(0x3)

}; 
// Function Engine.KismetMathLibrary.Vector4_IsNAN
// Size: 0x20(Inherited: 0x0) 
struct FVector4_IsNAN
{
	struct FVector4 A;  // 0x0(0x10)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[15];  // 0x11(0xF)

}; 
// ScriptStruct Engine.NavAvoidanceMask
// Size: 0x4(Inherited: 0x0) 
struct FNavAvoidanceMask
{
	char bGroup0 : 1;  // 0x0(0x1)
	char bGroup1 : 1;  // 0x0(0x1)
	char bGroup2 : 1;  // 0x0(0x1)
	char bGroup3 : 1;  // 0x0(0x1)
	char bGroup4 : 1;  // 0x0(0x1)
	char bGroup5 : 1;  // 0x0(0x1)
	char bGroup6 : 1;  // 0x0(0x1)
	char bGroup7 : 1;  // 0x0(0x1)
	char bGroup8 : 1;  // 0x1(0x1)
	char bGroup9 : 1;  // 0x1(0x1)
	char bGroup10 : 1;  // 0x1(0x1)
	char bGroup11 : 1;  // 0x1(0x1)
	char bGroup12 : 1;  // 0x1(0x1)
	char bGroup13 : 1;  // 0x1(0x1)
	char bGroup14 : 1;  // 0x1(0x1)
	char bGroup15 : 1;  // 0x1(0x1)
	char bGroup16 : 1;  // 0x2(0x1)
	char bGroup17 : 1;  // 0x2(0x1)
	char bGroup18 : 1;  // 0x2(0x1)
	char bGroup19 : 1;  // 0x2(0x1)
	char bGroup20 : 1;  // 0x2(0x1)
	char bGroup21 : 1;  // 0x2(0x1)
	char bGroup22 : 1;  // 0x2(0x1)
	char bGroup23 : 1;  // 0x2(0x1)
	char bGroup24 : 1;  // 0x3(0x1)
	char bGroup25 : 1;  // 0x3(0x1)
	char bGroup26 : 1;  // 0x3(0x1)
	char bGroup27 : 1;  // 0x3(0x1)
	char bGroup28 : 1;  // 0x3(0x1)
	char bGroup29 : 1;  // 0x3(0x1)
	char bGroup30 : 1;  // 0x3(0x1)
	char bGroup31 : 1;  // 0x3(0x1)

}; 
// DelegateFunction Engine.OnQuartzMetronomeEvent__DelegateSignature
// Size: 0x18(Inherited: 0x0) 
struct FOnQuartzMetronomeEvent__DelegateSignature
{
	struct FName ClockName;  // 0x0(0x8)
	uint8_t  QuantizationType;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)
	int32_t NumBars;  // 0xC(0x4)
	int32_t Beat;  // 0x10(0x4)
	float BeatFraction;  // 0x14(0x4)

}; 
// ScriptStruct Engine.SupportedSubTrackInfo
// Size: 0x20(Inherited: 0x0) 
struct FSupportedSubTrackInfo
{
	UInterpTrack* SupportedClass;  // 0x0(0x8)
	struct FString SubTrackName;  // 0x8(0x10)
	int32_t GroupIndex;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)

}; 
// Function Engine.ImportanceSamplingLibrary.ImportanceSample
// Size: 0x80(Inherited: 0x0) 
struct FImportanceSample
{
	struct FImportanceTexture Texture;  // 0x0(0x50)
	struct FVector2D Rand;  // 0x50(0x8)
	int32_t Samples;  // 0x58(0x4)
	float Intensity;  // 0x5C(0x4)
	struct FVector2D SamplePosition;  // 0x60(0x8)
	struct FLinearColor SampleColor;  // 0x68(0x10)
	float SampleIntensity;  // 0x78(0x4)
	float SampleSize;  // 0x7C(0x4)

}; 
// DelegateFunction Engine.OnQuartzCommandEvent__DelegateSignature
// Size: 0xC(Inherited: 0x0) 
struct FOnQuartzCommandEvent__DelegateSignature
{
	uint8_t  EventType;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	struct FName Name;  // 0x4(0x8)

}; 
// ScriptStruct Engine.RadialDamageEvent
// Size: 0x40(Inherited: 0x10) 
struct FRadialDamageEvent : public FDamageEvent
{
	struct FRadialDamageParams Params;  // 0x10(0x14)
	struct FVector Origin;  // 0x24(0xC)
	struct TArray<struct FHitResult> ComponentHits;  // 0x30(0x10)

}; 
// ScriptStruct Engine.BlendProfileBoneEntry
// Size: 0x14(Inherited: 0x0) 
struct FBlendProfileBoneEntry
{
	struct FBoneReference BoneReference;  // 0x0(0x10)
	float BlendScale;  // 0x10(0x4)

}; 
// Function Engine.GameplayStatics.GetIntOption
// Size: 0x28(Inherited: 0x0) 
struct FGetIntOption
{
	struct FString Options;  // 0x0(0x10)
	struct FString Key;  // 0x10(0x10)
	int32_t DefaultValue;  // 0x20(0x4)
	int32_t ReturnValue;  // 0x24(0x4)

}; 
// ScriptStruct Engine.LatentActionInfo
// Size: 0x18(Inherited: 0x0) 
struct FLatentActionInfo
{
	int32_t Linkage;  // 0x0(0x4)
	int32_t UUID;  // 0x4(0x4)
	struct FName ExecutionFunction;  // 0x8(0x8)
	struct UObject* CallbackTarget;  // 0x10(0x8)

}; 
// DelegateFunction Engine.OnQueueSubtitles__DelegateSignature
// Size: 0x18(Inherited: 0x0) 
struct FOnQueueSubtitles__DelegateSignature
{
	struct TArray<struct FSubtitleCue> Subtitles;  // 0x0(0x10)
	float CueDuration;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function Engine.InstancedStaticMeshComponent.SetCullDistances
// Size: 0x8(Inherited: 0x0) 
struct FSetCullDistances
{
	int32_t StartCullDistance;  // 0x0(0x4)
	int32_t EndCullDistance;  // 0x4(0x4)

}; 
// Function Engine.SceneComponent.SetRelativeScale3D
// Size: 0xC(Inherited: 0x0) 
struct FSetRelativeScale3D
{
	struct FVector NewScale3D;  // 0x0(0xC)

}; 
// Function Engine.SkeletalMeshComponent.HasValidAnimationInstance
// Size: 0x1(Inherited: 0x0) 
struct FHasValidAnimationInstance
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct Engine.SubtitleCue
// Size: 0x20(Inherited: 0x0) 
struct FSubtitleCue
{
	struct FText Text;  // 0x0(0x18)
	float Time;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)

}; 
// DelegateFunction Engine.OnAudioPlayStateChanged__DelegateSignature
// Size: 0x1(Inherited: 0x0) 
struct FOnAudioPlayStateChanged__DelegateSignature
{
	uint8_t  PlayState;  // 0x0(0x1)

}; 
// DelegateFunction Engine.OnAudioVirtualizationChanged__DelegateSignature
// Size: 0x1(Inherited: 0x0) 
struct FOnAudioVirtualizationChanged__DelegateSignature
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bIsVirtualized : 1;  // 0x0(0x1)

}; 
// Function Engine.SplineComponent.GetRightVectorAtDistanceAlongSpline
// Size: 0x14(Inherited: 0x0) 
struct FGetRightVectorAtDistanceAlongSpline
{
	float Distance;  // 0x0(0x4)
	char ESplineCoordinateSpace CoordinateSpace;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)
	struct FVector ReturnValue;  // 0x8(0xC)

}; 
// Function Engine.KismetMathLibrary.Clamp
// Size: 0x10(Inherited: 0x0) 
struct FClamp
{
	int32_t Value;  // 0x0(0x4)
	int32_t Min;  // 0x4(0x4)
	int32_t Max;  // 0x8(0x4)
	int32_t ReturnValue;  // 0xC(0x4)

}; 
// DelegateFunction Engine.OnAudioSingleEnvelopeValue__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FOnAudioSingleEnvelopeValue__DelegateSignature
{
	struct USoundWave* PlayingSoundWave;  // 0x0(0x8)
	float EnvelopeValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// ScriptStruct Engine.FontCharacter
// Size: 0x18(Inherited: 0x0) 
struct FFontCharacter
{
	int32_t StartU;  // 0x0(0x4)
	int32_t StartV;  // 0x4(0x4)
	int32_t USize;  // 0x8(0x4)
	int32_t VSize;  // 0xC(0x4)
	char TextureIndex;  // 0x10(0x1)
	char pad_17[3];  // 0x11(0x3)
	int32_t VerticalOffset;  // 0x14(0x4)

}; 
// Function Engine.KismetSystemLibrary.LoadAsset_Blocking
// Size: 0x30(Inherited: 0x0) 
struct FLoadAsset_Blocking
{
	struct TSoftObjectPtr<UObject> Asset;  // 0x0(0x28)
	struct UObject* ReturnValue;  // 0x28(0x8)

}; 
// Function Engine.KismetMathLibrary.RandomRotatorFromStream
// Size: 0x18(Inherited: 0x0) 
struct FRandomRotatorFromStream
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bRoll : 1;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	struct FRandomStream Stream;  // 0x4(0x8)
	struct FRotator ReturnValue;  // 0xC(0xC)

}; 
// DelegateFunction Engine.OnForceFeedbackFinished__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FOnForceFeedbackFinished__DelegateSignature
{
	struct UForceFeedbackComponent* ForceFeedbackComponent;  // 0x0(0x8)

}; 
// DelegateFunction Engine.InputActionHandlerDynamicSignature__DelegateSignature
// Size: 0x18(Inherited: 0x0) 
struct FInputActionHandlerDynamicSignature__DelegateSignature
{
	struct FKey Key;  // 0x0(0x18)

}; 
// ScriptStruct Engine.DepthFieldGlowInfo
// Size: 0x24(Inherited: 0x0) 
struct FDepthFieldGlowInfo
{
	char bEnableGlow : 1;  // 0x0(0x1)
	char pad_0_1 : 7;  // 0x0(0x1)
	char pad_1[4];  // 0x1(0x4)
	struct FLinearColor GlowColor;  // 0x4(0x10)
	struct FVector2D GlowOuterRadius;  // 0x14(0x8)
	struct FVector2D GlowInnerRadius;  // 0x1C(0x8)

}; 
// DelegateFunction Engine.InputTouchHandlerDynamicSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FInputTouchHandlerDynamicSignature__DelegateSignature
{
	char ETouchIndex FingerIndex;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	struct FVector Location;  // 0x4(0xC)

}; 
// Function Engine.KismetMathLibrary.RandomIntegerFromStream
// Size: 0x10(Inherited: 0x0) 
struct FRandomIntegerFromStream
{
	int32_t Max;  // 0x0(0x4)
	struct FRandomStream Stream;  // 0x4(0x8)
	int32_t ReturnValue;  // 0xC(0x4)

}; 
// Function Engine.GameplayStatics.SetWorldOriginLocation
// Size: 0x18(Inherited: 0x0) 
struct FSetWorldOriginLocation
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FIntVector NewLocation;  // 0x8(0xC)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function Engine.HUD.DrawText
// Size: 0x38(Inherited: 0x0) 
struct FDrawText
{
	struct FString Text;  // 0x0(0x10)
	struct FLinearColor TextColor;  // 0x10(0x10)
	float ScreenX;  // 0x20(0x4)
	float ScreenY;  // 0x24(0x4)
	struct UFont* Font;  // 0x28(0x8)
	float Scale;  // 0x30(0x4)
	char pad_52_1 : 7;  // 0x34(0x1)
	bool bScalePosition : 1;  // 0x34(0x1)
	char pad_53[3];  // 0x35(0x3)

}; 
// Function Engine.SceneComponent.GetSocketRotation
// Size: 0x14(Inherited: 0x0) 
struct FGetSocketRotation
{
	struct FName InSocketName;  // 0x0(0x8)
	struct FRotator ReturnValue;  // 0x8(0xC)

}; 
// DelegateFunction Engine.InputGestureHandlerDynamicSignature__DelegateSignature
// Size: 0x4(Inherited: 0x0) 
struct FInputGestureHandlerDynamicSignature__DelegateSignature
{
	float Value;  // 0x0(0x4)

}; 
// Function Engine.KismetMathLibrary.GetPI
// Size: 0x4(Inherited: 0x0) 
struct FGetPI
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function Engine.KismetArrayLibrary.Array_RandomFromStream
// Size: 0x20(Inherited: 0x0) 
struct FArray_RandomFromStream
{
	struct TArray<int32_t> TargetArray;  // 0x0(0x10)
	struct FRandomStream RandomStream;  // 0x10(0x8)
	int32_t OutItem;  // 0x18(0x4)
	int32_t OutIndex;  // 0x1C(0x4)

}; 
// Function Engine.Actor.GetInputVectorAxisValue
// Size: 0x28(Inherited: 0x0) 
struct FGetInputVectorAxisValue
{
	struct FKey InputAxisKey;  // 0x0(0x18)
	struct FVector ReturnValue;  // 0x18(0xC)
	char pad_36[4];  // 0x24(0x4)

}; 
// Function Engine.KismetSystemLibrary.GetVolumeButtonsHandledBySystem
// Size: 0x1(Inherited: 0x0) 
struct FGetVolumeButtonsHandledBySystem
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.Actor.K2_SetActorRelativeTransform
// Size: 0xC0(Inherited: 0x0) 
struct FK2_SetActorRelativeTransform
{
	struct FTransform NewRelativeTransform;  // 0x0(0x30)
	char pad_48_1 : 7;  // 0x30(0x1)
	bool bSweep : 1;  // 0x30(0x1)
	char pad_49[3];  // 0x31(0x3)
	struct FHitResult SweepHitResult;  // 0x34(0x88)
	char pad_188_1 : 7;  // 0xBC(0x1)
	bool bTeleport : 1;  // 0xBC(0x1)
	char pad_189[3];  // 0xBD(0x3)

}; 
// ScriptStruct Engine.InstancedStaticMeshLightMapInstanceData
// Size: 0x40(Inherited: 0x0) 
struct FInstancedStaticMeshLightMapInstanceData
{
	struct FTransform Transform;  // 0x0(0x30)
	struct TArray<struct FGuid> MapBuildDataIds;  // 0x30(0x10)

}; 
// Function Engine.PhysicsConstraintComponent.GetCurrentSwing2
// Size: 0x4(Inherited: 0x0) 
struct FGetCurrentSwing2
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function Engine.MovementComponent.ConstrainDirectionToPlane
// Size: 0x18(Inherited: 0x0) 
struct FConstrainDirectionToPlane
{
	struct FVector Direction;  // 0x0(0xC)
	struct FVector ReturnValue;  // 0xC(0xC)

}; 
// Function Engine.SplineComponent.SetSplinePointType
// Size: 0x8(Inherited: 0x0) 
struct FSetSplinePointType
{
	int32_t PointIndex;  // 0x0(0x4)
	char ESplinePointType Type;  // 0x4(0x1)
	char pad_5_1 : 7;  // 0x5(0x1)
	bool bUpdateSpline : 1;  // 0x5(0x1)
	char pad_6[2];  // 0x6(0x2)

}; 
// Function Engine.MovementComponent.ConstrainNormalToPlane
// Size: 0x18(Inherited: 0x0) 
struct FConstrainNormalToPlane
{
	struct FVector Normal;  // 0x0(0xC)
	struct FVector ReturnValue;  // 0xC(0xC)

}; 
// Function Engine.MovementComponent.GetGravityZ
// Size: 0x4(Inherited: 0x0) 
struct FGetGravityZ
{
	float ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct Engine.StaticTerrainLayerWeightParameter
// Size: 0x2C(Inherited: 0x24) 
struct FStaticTerrainLayerWeightParameter : public FStaticParameterBase
{
	int32_t WeightmapIndex;  // 0x24(0x4)
	char pad_40_1 : 7;  // 0x28(0x1)
	bool bWeightBasedBlend : 1;  // 0x28(0x1)
	char pad_41[3];  // 0x29(0x3)

}; 
// ScriptStruct Engine.CachedPoseIndices
// Size: 0x10(Inherited: 0x0) 
struct FCachedPoseIndices
{
	struct TArray<int32_t> OrderedSavedPoseNodeIndices;  // 0x0(0x10)

}; 
// Function Engine.KismetMathLibrary.ClampVectorSize
// Size: 0x20(Inherited: 0x0) 
struct FClampVectorSize
{
	struct FVector A;  // 0x0(0xC)
	float Min;  // 0xC(0x4)
	float Max;  // 0x10(0x4)
	struct FVector ReturnValue;  // 0x14(0xC)

}; 
// Function Engine.MovementComponent.GetMaxSpeed
// Size: 0x4(Inherited: 0x0) 
struct FGetMaxSpeed
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function Engine.KismetSystemLibrary.ConvertToRelativePath
// Size: 0x20(Inherited: 0x0) 
struct FConvertToRelativePath
{
	struct FString Filename;  // 0x0(0x10)
	struct FString ReturnValue;  // 0x10(0x10)

}; 
// Function Engine.SkinnedMeshComponent.SetSkinWeightOverride
// Size: 0x18(Inherited: 0x0) 
struct FSetSkinWeightOverride
{
	int32_t LODIndex;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct TArray<struct FSkelMeshSkinWeightInfo> SkinWeights;  // 0x8(0x10)

}; 
// Function Engine.StereoLayerComponent.SetTexture
// Size: 0x8(Inherited: 0x0) 
struct FSetTexture
{
	struct UTexture* InTexture;  // 0x0(0x8)

}; 
// Function Engine.PrimitiveComponent.SetHiddenInSceneCapture
// Size: 0x1(Inherited: 0x0) 
struct FSetHiddenInSceneCapture
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bValue : 1;  // 0x0(0x1)

}; 
// Function Engine.SplineComponent.GetLocationAtSplinePoint
// Size: 0x14(Inherited: 0x0) 
struct FGetLocationAtSplinePoint
{
	int32_t PointIndex;  // 0x0(0x4)
	char ESplineCoordinateSpace CoordinateSpace;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)
	struct FVector ReturnValue;  // 0x8(0xC)

}; 
// Function Engine.PhysicalAnimationComponent.ApplyPhysicalAnimationSettingsBelow
// Size: 0x30(Inherited: 0x0) 
struct FApplyPhysicalAnimationSettingsBelow
{
	struct FName BodyName;  // 0x0(0x8)
	struct FPhysicalAnimationData PhysicalAnimationData;  // 0x8(0x24)
	char pad_44_1 : 7;  // 0x2C(0x1)
	bool bIncludeSelf : 1;  // 0x2C(0x1)
	char pad_45[3];  // 0x2D(0x3)

}; 
// Function Engine.SceneComponent.GetPhysicsVolume
// Size: 0x8(Inherited: 0x0) 
struct FGetPhysicsVolume
{
	struct APhysicsVolume* ReturnValue;  // 0x0(0x8)

}; 
// Function Engine.SkinnedMeshComponent.TransformToBoneSpace
// Size: 0x38(Inherited: 0x0) 
struct FTransformToBoneSpace
{
	struct FName BoneName;  // 0x0(0x8)
	struct FVector InPosition;  // 0x8(0xC)
	struct FRotator InRotation;  // 0x14(0xC)
	struct FVector OutPosition;  // 0x20(0xC)
	struct FRotator OutRotation;  // 0x2C(0xC)

}; 
// Function Engine.KismetMathLibrary.EqualEqual_DateTimeDateTime
// Size: 0x18(Inherited: 0x0) 
struct FEqualEqual_DateTimeDateTime
{
	struct FDateTime A;  // 0x0(0x8)
	struct FDateTime B;  // 0x8(0x8)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// ScriptStruct Engine.LODSoloTrack
// Size: 0x10(Inherited: 0x0) 
struct FLODSoloTrack
{
	struct TArray<char> SoloEnableSetting;  // 0x0(0x10)

}; 
// Function Engine.MovementComponent.GetPlaneConstraintAxisSetting
// Size: 0x1(Inherited: 0x0) 
struct FGetPlaneConstraintAxisSetting
{
	uint8_t  ReturnValue;  // 0x0(0x1)

}; 
// Function Engine.KismetSystemLibrary.ShowPlatformSpecificAchievementsScreen
// Size: 0x8(Inherited: 0x0) 
struct FShowPlatformSpecificAchievementsScreen
{
	struct APlayerController* SpecificPlayer;  // 0x0(0x8)

}; 
// Function Engine.KismetTextLibrary.Conv_Vector2dToText
// Size: 0x20(Inherited: 0x0) 
struct FConv_Vector2dToText
{
	struct FVector2D InVec;  // 0x0(0x8)
	struct FText ReturnValue;  // 0x8(0x18)

}; 
// Function Engine.KismetMathLibrary.RotatorFromAxisAndAngle
// Size: 0x1C(Inherited: 0x0) 
struct FRotatorFromAxisAndAngle
{
	struct FVector Axis;  // 0x0(0xC)
	float angle;  // 0xC(0x4)
	struct FRotator ReturnValue;  // 0x10(0xC)

}; 
// Function Engine.KismetSystemLibrary.BreakSoftClassPath
// Size: 0x28(Inherited: 0x0) 
struct FBreakSoftClassPath
{
	struct FSoftClassPath InSoftClassPath;  // 0x0(0x18)
	struct FString PathString;  // 0x18(0x10)

}; 
// Function Engine.KismetMathLibrary.NotEqualExactly_Vector2DVector2D
// Size: 0x14(Inherited: 0x0) 
struct FNotEqualExactly_Vector2DVector2D
{
	struct FVector2D A;  // 0x0(0x8)
	struct FVector2D B;  // 0x8(0x8)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[3];  // 0x11(0x3)

}; 
// Function Engine.BlueprintPlatformLibrary.ScheduleLocalNotificationBadgeAtTime
// Size: 0x28(Inherited: 0x0) 
struct FScheduleLocalNotificationBadgeAtTime
{
	struct FDateTime FireDateTime;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool LocalTime : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)
	struct FString ActivationEvent;  // 0x10(0x10)
	int32_t ReturnValue;  // 0x20(0x4)
	char pad_36[4];  // 0x24(0x4)

}; 
// Function Engine.MovementComponent.GetPlaneConstraintNormal
// Size: 0xC(Inherited: 0x0) 
struct FGetPlaneConstraintNormal
{
	struct FVector ReturnValue;  // 0x0(0xC)

}; 
// ScriptStruct Engine.ColorGradePerRangeSettings
// Size: 0x50(Inherited: 0x0) 
struct FColorGradePerRangeSettings
{
	struct FVector4 Saturation;  // 0x0(0x10)
	struct FVector4 Contrast;  // 0x10(0x10)
	struct FVector4 Gamma;  // 0x20(0x10)
	struct FVector4 Gain;  // 0x30(0x10)
	struct FVector4 Offset;  // 0x40(0x10)

}; 
// Function Engine.PhysicsConstraintComponent.SetAngularVelocityDriveTwistAndSwing
// Size: 0x2(Inherited: 0x0) 
struct FSetAngularVelocityDriveTwistAndSwing
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bEnableTwistDrive : 1;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool bEnableSwingDrive : 1;  // 0x1(0x1)

}; 
// ScriptStruct Engine.Vector_NetQuantize100
// Size: 0xC(Inherited: 0xC) 
struct FVector_NetQuantize100 : public FVector
{

}; 
// Function Engine.MovementComponent.IsExceedingMaxSpeed
// Size: 0x8(Inherited: 0x0) 
struct FIsExceedingMaxSpeed
{
	float MaxSpeed;  // 0x0(0x4)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool ReturnValue : 1;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)

}; 
// Function Engine.Actor.K2_GetRootComponent
// Size: 0x8(Inherited: 0x0) 
struct FK2_GetRootComponent
{
	struct USceneComponent* ReturnValue;  // 0x0(0x8)

}; 
// Function Engine.GameplayStatics.GetGlobalTimeDilation
// Size: 0x10(Inherited: 0x0) 
struct FGetGlobalTimeDilation
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	float ReturnValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function Engine.MovementComponent.K2_GetMaxSpeedModifier
// Size: 0x4(Inherited: 0x0) 
struct FK2_GetMaxSpeedModifier
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function Engine.MovementComponent.K2_GetModifiedMaxSpeed
// Size: 0x4(Inherited: 0x0) 
struct FK2_GetModifiedMaxSpeed
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function Engine.KismetMaterialLibrary.CreateDynamicMaterialInstance
// Size: 0x28(Inherited: 0x0) 
struct FCreateDynamicMaterialInstance
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct UMaterialInterface* Parent;  // 0x8(0x8)
	struct FName OptionalName;  // 0x10(0x8)
	uint8_t  CreationFlags;  // 0x18(0x1)
	char pad_25[7];  // 0x19(0x7)
	struct UMaterialInstanceDynamic* ReturnValue;  // 0x20(0x8)

}; 
// ScriptStruct Engine.DirectorTrackCut
// Size: 0x14(Inherited: 0x0) 
struct FDirectorTrackCut
{
	float Time;  // 0x0(0x4)
	float TransitionTime;  // 0x4(0x4)
	struct FName TargetCamGroup;  // 0x8(0x8)
	int32_t ShotNumber;  // 0x10(0x4)

}; 
// Function Engine.AnimInstance.GetLinkedAnimLayerInstancesByGroup
// Size: 0x18(Inherited: 0x0) 
struct FGetLinkedAnimLayerInstancesByGroup
{
	struct FName InGroup;  // 0x0(0x8)
	struct TArray<struct UAnimInstance*> OutLinkedInstances;  // 0x8(0x10)

}; 
// Function Engine.SkeletalMeshComponent.GetAllowedAnimCurveEvaluate
// Size: 0x1(Inherited: 0x0) 
struct FGetAllowedAnimCurveEvaluate
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.AudioComponent.PlayQuantized
// Size: 0x40(Inherited: 0x0) 
struct FPlayQuantized
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct UQuartzClockHandle* InClockHandle;  // 0x8(0x8)
	struct FQuartzQuantizationBoundary InQuantizationBoundary;  // 0x10(0xC)
	struct FDelegate InDelegate;  // 0x1C(0x10)
	float InStartTime;  // 0x2C(0x4)
	float InFadeInDuration;  // 0x30(0x4)
	float InFadeVolumeLevel;  // 0x34(0x4)
	uint8_t  InFadeCurve;  // 0x38(0x1)
	char pad_57[7];  // 0x39(0x7)

}; 
// Function Engine.KismetSystemLibrary.K2_SetTimer
// Size: 0x30(Inherited: 0x0) 
struct FK2_SetTimer
{
	struct UObject* Object;  // 0x0(0x8)
	struct FString FunctionName;  // 0x8(0x10)
	float Time;  // 0x18(0x4)
	char pad_28_1 : 7;  // 0x1C(0x1)
	bool bLooping : 1;  // 0x1C(0x1)
	char pad_29[3];  // 0x1D(0x3)
	float InitialStartDelay;  // 0x20(0x4)
	float InitialStartDelayVariance;  // 0x24(0x4)
	struct FTimerHandle ReturnValue;  // 0x28(0x8)

}; 
// Function Engine.KismetStringLibrary.Left
// Size: 0x28(Inherited: 0x0) 
struct FLeft
{
	struct FString SourceString;  // 0x0(0x10)
	int32_t Count;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)
	struct FString ReturnValue;  // 0x18(0x10)

}; 
// ScriptStruct Engine.SoundAttenuationSettings
// Size: 0x3A0(Inherited: 0xB0) 
struct FSoundAttenuationSettings : public FBaseAttenuationSettings
{
	char bAttenuate : 1;  // 0xB0(0x1)
	char bSpatialize : 1;  // 0xB0(0x1)
	char bAttenuateWithLPF : 1;  // 0xB0(0x1)
	char bEnableListenerFocus : 1;  // 0xB0(0x1)
	char bEnableFocusInterpolation : 1;  // 0xB0(0x1)
	char bEnableOcclusion : 1;  // 0xB0(0x1)
	char bUseComplexCollisionForOcclusion : 1;  // 0xB0(0x1)
	char bEnableReverbSend : 1;  // 0xB0(0x1)
	char bEnablePriorityAttenuation : 1;  // 0xB1(0x1)
	char bApplyNormalizationToStereoSounds : 1;  // 0xB1(0x1)
	char bEnableLogFrequencyScaling : 1;  // 0xB1(0x1)
	char bEnableSubmixSends : 1;  // 0xB1(0x1)
	char pad_177_1 : 4;  // 0xB1(0x1)
	char ESoundSpatializationAlgorithm SpatializationAlgorithm;  // 0xB2(0x1)
	char pad_179[1];  // 0xB3(0x1)
	float BinauralRadius;  // 0xB4(0x4)
	uint8_t  AbsorptionMethod;  // 0xB8(0x1)
	char ECollisionChannel OcclusionTraceChannel;  // 0xB9(0x1)
	uint8_t  ReverbSendMethod;  // 0xBA(0x1)
	uint8_t  PriorityAttenuationMethod;  // 0xBB(0x1)
	float OmniRadius;  // 0xBC(0x4)
	float StereoSpread;  // 0xC0(0x4)
	float LPFRadiusMin;  // 0xC4(0x4)
	float LPFRadiusMax;  // 0xC8(0x4)
	char pad_204[4];  // 0xCC(0x4)
	struct FRuntimeFloatCurve CustomLowpassAirAbsorptionCurve;  // 0xD0(0x88)
	struct FRuntimeFloatCurve CustomHighpassAirAbsorptionCurve;  // 0x158(0x88)
	float LPFFrequencyAtMin;  // 0x1E0(0x4)
	float LPFFrequencyAtMax;  // 0x1E4(0x4)
	float HPFFrequencyAtMin;  // 0x1E8(0x4)
	float HPFFrequencyAtMax;  // 0x1EC(0x4)
	float FocusAzimuth;  // 0x1F0(0x4)
	float NonFocusAzimuth;  // 0x1F4(0x4)
	float FocusDistanceScale;  // 0x1F8(0x4)
	float NonFocusDistanceScale;  // 0x1FC(0x4)
	float FocusPriorityScale;  // 0x200(0x4)
	float NonFocusPriorityScale;  // 0x204(0x4)
	float FocusVolumeAttenuation;  // 0x208(0x4)
	float NonFocusVolumeAttenuation;  // 0x20C(0x4)
	float FocusAttackInterpSpeed;  // 0x210(0x4)
	float FocusReleaseInterpSpeed;  // 0x214(0x4)
	float OcclusionLowPassFilterFrequency;  // 0x218(0x4)
	float OcclusionVolumeAttenuation;  // 0x21C(0x4)
	float OcclusionInterpolationTime;  // 0x220(0x4)
	float ReverbWetLevelMin;  // 0x224(0x4)
	float ReverbWetLevelMax;  // 0x228(0x4)
	float ReverbDistanceMin;  // 0x22C(0x4)
	float ReverbDistanceMax;  // 0x230(0x4)
	float ManualReverbSendLevel;  // 0x234(0x4)
	struct FRuntimeFloatCurve CustomReverbSendCurve;  // 0x238(0x88)
	struct TArray<struct FAttenuationSubmixSendSettings> SubmixSendSettings;  // 0x2C0(0x10)
	float PriorityAttenuationMin;  // 0x2D0(0x4)
	float PriorityAttenuationMax;  // 0x2D4(0x4)
	float PriorityAttenuationDistanceMin;  // 0x2D8(0x4)
	float PriorityAttenuationDistanceMax;  // 0x2DC(0x4)
	float ManualPriorityAttenuation;  // 0x2E0(0x4)
	char pad_740[4];  // 0x2E4(0x4)
	struct FRuntimeFloatCurve CustomPriorityAttenuationCurve;  // 0x2E8(0x88)
	struct FSoundAttenuationPluginSettings PluginSettings;  // 0x370(0x30)

}; 
// Function Engine.KismetStringLibrary.BuildString_Name
// Size: 0x48(Inherited: 0x0) 
struct FBuildString_Name
{
	struct FString AppendTo;  // 0x0(0x10)
	struct FString prefix;  // 0x10(0x10)
	struct FName InName;  // 0x20(0x8)
	struct FString suffix;  // 0x28(0x10)
	struct FString ReturnValue;  // 0x38(0x10)

}; 
// Function Engine.MovementComponent.PhysicsVolumeChanged
// Size: 0x8(Inherited: 0x0) 
struct FPhysicsVolumeChanged
{
	struct APhysicsVolume* NewVolume;  // 0x0(0x8)

}; 
// ScriptStruct Engine.SceneViewExtensionIsActiveFunctor
// Size: 0x50(Inherited: 0x0) 
struct FSceneViewExtensionIsActiveFunctor
{
	char pad_0[80];  // 0x0(0x50)

}; 
// Function Engine.KismetMathLibrary.Divide_IntPointInt
// Size: 0x14(Inherited: 0x0) 
struct FDivide_IntPointInt
{
	struct FIntPoint A;  // 0x0(0x8)
	int32_t B;  // 0x8(0x4)
	struct FIntPoint ReturnValue;  // 0xC(0x8)

}; 
// Function Engine.Actor.SetNetDormancy
// Size: 0x1(Inherited: 0x0) 
struct FSetNetDormancy
{
	char ENetDormancy NewDormancy;  // 0x0(0x1)

}; 
// Function Engine.MovementComponent.SetPlaneConstraintEnabled
// Size: 0x1(Inherited: 0x0) 
struct FSetPlaneConstraintEnabled
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bEnabled : 1;  // 0x0(0x1)

}; 
// ScriptStruct Engine.ParameterChannelNames
// Size: 0x60(Inherited: 0x0) 
struct FParameterChannelNames
{
	struct FText R;  // 0x0(0x18)
	struct FText G;  // 0x18(0x18)
	struct FText B;  // 0x30(0x18)
	struct FText A;  // 0x48(0x18)

}; 
// Function Engine.AnimInstance.GetInstanceAssetPlayerLength
// Size: 0x8(Inherited: 0x0) 
struct FGetInstanceAssetPlayerLength
{
	int32_t AssetPlayerIndex;  // 0x0(0x4)
	float ReturnValue;  // 0x4(0x4)

}; 
// Function Engine.PrimitiveComponent.IgnoreComponentWhenMoving
// Size: 0x10(Inherited: 0x0) 
struct FIgnoreComponentWhenMoving
{
	struct UPrimitiveComponent* Component;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool bShouldIgnore : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function Engine.MovementComponent.SetPlaneConstraintFromVectors
// Size: 0x18(Inherited: 0x0) 
struct FSetPlaneConstraintFromVectors
{
	struct FVector Forward;  // 0x0(0xC)
	struct FVector Up;  // 0xC(0xC)

}; 
// ScriptStruct Engine.CurveEdTab
// Size: 0x30(Inherited: 0x0) 
struct FCurveEdTab
{
	struct FString TabName;  // 0x0(0x10)
	struct TArray<struct FCurveEdEntry> Curves;  // 0x10(0x10)
	float ViewStartInput;  // 0x20(0x4)
	float ViewEndInput;  // 0x24(0x4)
	float ViewStartOutput;  // 0x28(0x4)
	float ViewEndOutput;  // 0x2C(0x4)

}; 
// Function Engine.Actor.ActorHasTag
// Size: 0xC(Inherited: 0x0) 
struct FActorHasTag
{
	struct FName Tag;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)

}; 
// Function Engine.MovementComponent.SetPlaneConstraintOrigin
// Size: 0xC(Inherited: 0x0) 
struct FSetPlaneConstraintOrigin
{
	struct FVector PlaneOrigin;  // 0x0(0xC)

}; 
// Function Engine.Character.ClientAdjustPosition
// Size: 0x38(Inherited: 0x0) 
struct FClientAdjustPosition
{
	float Timestamp;  // 0x0(0x4)
	struct FVector NewLoc;  // 0x4(0xC)
	struct FVector NewVel;  // 0x10(0xC)
	char pad_28[4];  // 0x1C(0x4)
	struct UPrimitiveComponent* NewBase;  // 0x20(0x8)
	struct FName NewBaseBoneName;  // 0x28(0x8)
	char pad_48_1 : 7;  // 0x30(0x1)
	bool bHasBase : 1;  // 0x30(0x1)
	char pad_49_1 : 7;  // 0x31(0x1)
	bool bBaseRelativePosition : 1;  // 0x31(0x1)
	char ServerMovementMode;  // 0x32(0x1)
	char pad_51[5];  // 0x33(0x5)

}; 
// Function Engine.GameplayStatics.SetViewportMouseCaptureMode
// Size: 0x10(Inherited: 0x0) 
struct FSetViewportMouseCaptureMode
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	uint8_t  MouseCaptureMode;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function Engine.KismetSystemLibrary.GetSupportedFullscreenResolutions
// Size: 0x18(Inherited: 0x0) 
struct FGetSupportedFullscreenResolutions
{
	struct TArray<struct FIntPoint> Resolutions;  // 0x0(0x10)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// Function Engine.SubsystemBlueprintLibrary.GetGameInstanceSubsystem
// Size: 0x18(Inherited: 0x0) 
struct FGetGameInstanceSubsystem
{
	struct UObject* ContextObject;  // 0x0(0x8)
	UGameInstanceSubsystem* Class;  // 0x8(0x8)
	struct UGameInstanceSubsystem* ReturnValue;  // 0x10(0x8)

}; 
// Function Engine.PlayerController.ClientPlaySoundAtLocation
// Size: 0x20(Inherited: 0x0) 
struct FClientPlaySoundAtLocation
{
	struct USoundBase* Sound;  // 0x0(0x8)
	struct FVector Location;  // 0x8(0xC)
	float VolumeMultiplier;  // 0x14(0x4)
	float PitchMultiplier;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)

}; 
// Function Engine.MovementComponent.SetUpdatedComponent
// Size: 0x8(Inherited: 0x0) 
struct FSetUpdatedComponent
{
	struct USceneComponent* NewUpdatedComponent;  // 0x0(0x8)

}; 
// Function Engine.Actor.SetActorEnableCollision
// Size: 0x1(Inherited: 0x0) 
struct FSetActorEnableCollision
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bNewActorEnableCollision : 1;  // 0x0(0x1)

}; 
// Function Engine.PhysicsConstraintComponent.SetAngularSwing1Limit
// Size: 0x8(Inherited: 0x0) 
struct FSetAngularSwing1Limit
{
	char EAngularConstraintMotion MotionType;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float Swing1LimitAngle;  // 0x4(0x4)

}; 
// ScriptStruct Engine.InterpEdSelKey
// Size: 0x18(Inherited: 0x0) 
struct FInterpEdSelKey
{
	struct UInterpGroup* Group;  // 0x0(0x8)
	struct UInterpTrack* Track;  // 0x8(0x8)
	int32_t KeyIndex;  // 0x10(0x4)
	float UnsnappedPosition;  // 0x14(0x4)

}; 
// Function Engine.KismetMathLibrary.LinearColor_QuantizeRound
// Size: 0x14(Inherited: 0x0) 
struct FLinearColor_QuantizeRound
{
	struct FLinearColor InColor;  // 0x0(0x10)
	struct FColor ReturnValue;  // 0x10(0x4)

}; 
// Function Engine.Controller.ReceiveInstigatedAnyDamage
// Size: 0x20(Inherited: 0x0) 
struct FReceiveInstigatedAnyDamage
{
	float Damage;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct UDamageType* DamageType;  // 0x8(0x8)
	struct AActor* DamagedActor;  // 0x10(0x8)
	struct AActor* DamageCauser;  // 0x18(0x8)

}; 
// Function Engine.KismetSystemLibrary.DrawDebugCone
// Size: 0x48(Inherited: 0x0) 
struct FDrawDebugCone
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Origin;  // 0x8(0xC)
	struct FVector Direction;  // 0x14(0xC)
	float Length;  // 0x20(0x4)
	float AngleWidth;  // 0x24(0x4)
	float AngleHeight;  // 0x28(0x4)
	int32_t NumSides;  // 0x2C(0x4)
	struct FLinearColor LineColor;  // 0x30(0x10)
	float Duration;  // 0x40(0x4)
	float Thickness;  // 0x44(0x4)

}; 
// Function Engine.SplineComponent.GetDirectionAtSplinePoint
// Size: 0x14(Inherited: 0x0) 
struct FGetDirectionAtSplinePoint
{
	int32_t PointIndex;  // 0x0(0x4)
	char ESplineCoordinateSpace CoordinateSpace;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)
	struct FVector ReturnValue;  // 0x8(0xC)

}; 
// Function Engine.InterpToMovementComponent.AddControlPointPosition
// Size: 0x10(Inherited: 0x0) 
struct FAddControlPointPosition
{
	struct FVector Pos;  // 0x0(0xC)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool bPositionIsRelative : 1;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)

}; 
// Function Engine.KismetMathLibrary.Max
// Size: 0xC(Inherited: 0x0) 
struct FMax
{
	int32_t A;  // 0x0(0x4)
	int32_t B;  // 0x4(0x4)
	int32_t ReturnValue;  // 0x8(0x4)

}; 
// Function Engine.SceneComponent.K2_GetComponentLocation
// Size: 0xC(Inherited: 0x0) 
struct FK2_GetComponentLocation
{
	struct FVector ReturnValue;  // 0x0(0xC)

}; 
// DelegateFunction Engine.InterpToMovementComponent.OnInterpToReverseDelegate__DelegateSignature
// Size: 0x8C(Inherited: 0x0) 
struct FOnInterpToReverseDelegate__DelegateSignature
{
	struct FHitResult ImpactResult;  // 0x0(0x88)
	float Time;  // 0x88(0x4)

}; 
// Function Engine.ParticleSystemComponent.SetBeamEndPoint
// Size: 0x10(Inherited: 0x0) 
struct FSetBeamEndPoint
{
	int32_t EmitterIndex;  // 0x0(0x4)
	struct FVector NewEndPoint;  // 0x4(0xC)

}; 
// Function Engine.KismetMathLibrary.Matrix_GetInverse
// Size: 0x80(Inherited: 0x0) 
struct FMatrix_GetInverse
{
	struct FMatrix M;  // 0x0(0x40)
	struct FMatrix ReturnValue;  // 0x40(0x40)

}; 
// DelegateFunction Engine.InterpToMovementComponent.OnInterpToStopDelegate__DelegateSignature
// Size: 0x8C(Inherited: 0x0) 
struct FOnInterpToStopDelegate__DelegateSignature
{
	struct FHitResult ImpactResult;  // 0x0(0x88)
	float Time;  // 0x88(0x4)

}; 
// ScriptStruct Engine.PostProcessSettings
// Size: 0x560(Inherited: 0x0) 
struct FPostProcessSettings
{
	char bOverride_TemperatureType : 1;  // 0x0(0x1)
	char bOverride_WhiteTemp : 1;  // 0x0(0x1)
	char bOverride_WhiteTint : 1;  // 0x0(0x1)
	char bOverride_ColorSaturation : 1;  // 0x0(0x1)
	char bOverride_ColorContrast : 1;  // 0x0(0x1)
	char bOverride_ColorGamma : 1;  // 0x0(0x1)
	char bOverride_ColorGain : 1;  // 0x0(0x1)
	char bOverride_ColorOffset : 1;  // 0x0(0x1)
	char bOverride_ColorSaturationShadows : 1;  // 0x1(0x1)
	char bOverride_ColorContrastShadows : 1;  // 0x1(0x1)
	char bOverride_ColorGammaShadows : 1;  // 0x1(0x1)
	char bOverride_ColorGainShadows : 1;  // 0x1(0x1)
	char bOverride_ColorOffsetShadows : 1;  // 0x1(0x1)
	char bOverride_ColorSaturationMidtones : 1;  // 0x1(0x1)
	char bOverride_ColorContrastMidtones : 1;  // 0x1(0x1)
	char bOverride_ColorGammaMidtones : 1;  // 0x1(0x1)
	char bOverride_ColorGainMidtones : 1;  // 0x2(0x1)
	char bOverride_ColorOffsetMidtones : 1;  // 0x2(0x1)
	char bOverride_ColorSaturationHighlights : 1;  // 0x2(0x1)
	char bOverride_ColorContrastHighlights : 1;  // 0x2(0x1)
	char bOverride_ColorGammaHighlights : 1;  // 0x2(0x1)
	char bOverride_ColorGainHighlights : 1;  // 0x2(0x1)
	char bOverride_ColorOffsetHighlights : 1;  // 0x2(0x1)
	char bOverride_ColorCorrectionShadowsMax : 1;  // 0x2(0x1)
	char bOverride_ColorCorrectionHighlightsMin : 1;  // 0x3(0x1)
	char bOverride_BlueCorrection : 1;  // 0x3(0x1)
	char bOverride_ExpandGamut : 1;  // 0x3(0x1)
	char bOverride_ToneCurveAmount : 1;  // 0x3(0x1)
	char bOverride_FilmWhitePoint : 1;  // 0x3(0x1)
	char bOverride_FilmSaturation : 1;  // 0x3(0x1)
	char bOverride_FilmChannelMixerRed : 1;  // 0x3(0x1)
	char bOverride_FilmChannelMixerGreen : 1;  // 0x3(0x1)
	char bOverride_FilmChannelMixerBlue : 1;  // 0x4(0x1)
	char bOverride_FilmContrast : 1;  // 0x4(0x1)
	char bOverride_FilmDynamicRange : 1;  // 0x4(0x1)
	char bOverride_FilmHealAmount : 1;  // 0x4(0x1)
	char bOverride_FilmToeAmount : 1;  // 0x4(0x1)
	char bOverride_FilmShadowTint : 1;  // 0x4(0x1)
	char bOverride_FilmShadowTintBlend : 1;  // 0x4(0x1)
	char bOverride_FilmShadowTintAmount : 1;  // 0x4(0x1)
	char bOverride_FilmSlope : 1;  // 0x5(0x1)
	char bOverride_FilmToe : 1;  // 0x5(0x1)
	char bOverride_FilmShoulder : 1;  // 0x5(0x1)
	char bOverride_FilmBlackClip : 1;  // 0x5(0x1)
	char bOverride_FilmWhiteClip : 1;  // 0x5(0x1)
	char bOverride_SceneColorTint : 1;  // 0x5(0x1)
	char bOverride_SceneFringeIntensity : 1;  // 0x5(0x1)
	char bOverride_ChromaticAberrationStartOffset : 1;  // 0x5(0x1)
	char bOverride_AmbientCubemapTint : 1;  // 0x6(0x1)
	char bOverride_AmbientCubemapIntensity : 1;  // 0x6(0x1)
	char bOverride_BloomMethod : 1;  // 0x6(0x1)
	char bOverride_BloomIntensity : 1;  // 0x6(0x1)
	char bOverride_BloomThreshold : 1;  // 0x6(0x1)
	char bOverride_Bloom1Tint : 1;  // 0x6(0x1)
	char bOverride_Bloom1Size : 1;  // 0x6(0x1)
	char bOverride_Bloom2Size : 1;  // 0x6(0x1)
	char bOverride_Bloom2Tint : 1;  // 0x7(0x1)
	char bOverride_Bloom3Tint : 1;  // 0x7(0x1)
	char bOverride_Bloom3Size : 1;  // 0x7(0x1)
	char bOverride_Bloom4Tint : 1;  // 0x7(0x1)
	char bOverride_Bloom4Size : 1;  // 0x7(0x1)
	char bOverride_Bloom5Tint : 1;  // 0x7(0x1)
	char bOverride_Bloom5Size : 1;  // 0x7(0x1)
	char bOverride_Bloom6Tint : 1;  // 0x7(0x1)
	char bOverride_Bloom6Size : 1;  // 0x8(0x1)
	char bOverride_BloomSizeScale : 1;  // 0x8(0x1)
	char bOverride_BloomConvolutionTexture : 1;  // 0x8(0x1)
	char bOverride_BloomConvolutionSize : 1;  // 0x8(0x1)
	char bOverride_BloomConvolutionCenterUV : 1;  // 0x8(0x1)
	char bOverride_BloomConvolutionPreFilter : 1;  // 0x8(0x1)
	char bOverride_BloomConvolutionPreFilterMin : 1;  // 0x8(0x1)
	char bOverride_BloomConvolutionPreFilterMax : 1;  // 0x8(0x1)
	char bOverride_BloomConvolutionPreFilterMult : 1;  // 0x9(0x1)
	char bOverride_BloomConvolutionBufferScale : 1;  // 0x9(0x1)
	char bOverride_BloomDirtMaskIntensity : 1;  // 0x9(0x1)
	char bOverride_BloomDirtMaskTint : 1;  // 0x9(0x1)
	char bOverride_BloomDirtMask : 1;  // 0x9(0x1)
	char bOverride_CameraShutterSpeed : 1;  // 0x9(0x1)
	char bOverride_CameraISO : 1;  // 0x9(0x1)
	char bOverride_AutoExposureMethod : 1;  // 0x9(0x1)
	char bOverride_AutoExposureLowPercent : 1;  // 0xA(0x1)
	char bOverride_AutoExposureHighPercent : 1;  // 0xA(0x1)
	char bOverride_AutoExposureMinBrightness : 1;  // 0xA(0x1)
	char bOverride_AutoExposureMaxBrightness : 1;  // 0xA(0x1)
	char bOverride_AutoExposureCalibrationConstant : 1;  // 0xA(0x1)
	char bOverride_AutoExposureSpeedUp : 1;  // 0xA(0x1)
	char bOverride_AutoExposureSpeedDown : 1;  // 0xA(0x1)
	char bOverride_AutoExposureBias : 1;  // 0xA(0x1)
	char bOverride_AutoExposureBiasCurve : 1;  // 0xB(0x1)
	char bOverride_AutoExposureMeterMask : 1;  // 0xB(0x1)
	char bOverride_AutoExposureApplyPhysicalCameraExposure : 1;  // 0xB(0x1)
	char bOverride_HistogramLogMin : 1;  // 0xB(0x1)
	char bOverride_HistogramLogMax : 1;  // 0xB(0x1)
	char bOverride_LensFlareIntensity : 1;  // 0xB(0x1)
	char bOverride_LensFlareTint : 1;  // 0xB(0x1)
	char bOverride_LensFlareTints : 1;  // 0xB(0x1)
	char bOverride_LensFlareBokehSize : 1;  // 0xC(0x1)
	char bOverride_LensFlareBokehShape : 1;  // 0xC(0x1)
	char bOverride_LensFlareThreshold : 1;  // 0xC(0x1)
	char bOverride_VignetteIntensity : 1;  // 0xC(0x1)
	char bOverride_GrainIntensity : 1;  // 0xC(0x1)
	char bOverride_GrainJitter : 1;  // 0xC(0x1)
	char bOverride_AmbientOcclusionIntensity : 1;  // 0xC(0x1)
	char bOverride_AmbientOcclusionStaticFraction : 1;  // 0xC(0x1)
	char bOverride_AmbientOcclusionRadius : 1;  // 0xD(0x1)
	char bOverride_AmbientOcclusionFadeDistance : 1;  // 0xD(0x1)
	char bOverride_AmbientOcclusionFadeRadius : 1;  // 0xD(0x1)
	char bOverride_AmbientOcclusionDistance : 1;  // 0xD(0x1)
	char bOverride_AmbientOcclusionRadiusInWS : 1;  // 0xD(0x1)
	char bOverride_AmbientOcclusionPower : 1;  // 0xD(0x1)
	char bOverride_AmbientOcclusionBias : 1;  // 0xD(0x1)
	char bOverride_AmbientOcclusionQuality : 1;  // 0xD(0x1)
	char bOverride_AmbientOcclusionMipBlend : 1;  // 0xE(0x1)
	char bOverride_AmbientOcclusionMipScale : 1;  // 0xE(0x1)
	char bOverride_AmbientOcclusionMipThreshold : 1;  // 0xE(0x1)
	char bOverride_AmbientOcclusionTemporalBlendWeight : 1;  // 0xE(0x1)
	char pad_14_1 : 4;  // 0xE(0x1)
	char pad_15[2];  // 0xF(0x2)
	char bOverride_RayTracingAO : 1;  // 0x10(0x1)
	char bOverride_RayTracingAOSamplesPerPixel : 1;  // 0x10(0x1)
	char bOverride_RayTracingAOIntensity : 1;  // 0x10(0x1)
	char bOverride_RayTracingAORadius : 1;  // 0x10(0x1)
	char pad_16_1 : 4;  // 0x10(0x1)
	char pad_17[4];  // 0x11(0x4)
	char bOverride_LPVIntensity : 1;  // 0x14(0x1)
	char bOverride_LPVDirectionalOcclusionIntensity : 1;  // 0x14(0x1)
	char bOverride_LPVDirectionalOcclusionRadius : 1;  // 0x14(0x1)
	char bOverride_LPVDiffuseOcclusionExponent : 1;  // 0x14(0x1)
	char bOverride_LPVSpecularOcclusionExponent : 1;  // 0x14(0x1)
	char bOverride_LPVDiffuseOcclusionIntensity : 1;  // 0x14(0x1)
	char bOverride_LPVSpecularOcclusionIntensity : 1;  // 0x14(0x1)
	char bOverride_LPVSize : 1;  // 0x14(0x1)
	char bOverride_LPVSecondaryOcclusionIntensity : 1;  // 0x15(0x1)
	char bOverride_LPVSecondaryBounceIntensity : 1;  // 0x15(0x1)
	char bOverride_LPVGeometryVolumeBias : 1;  // 0x15(0x1)
	char bOverride_LPVVplInjectionBias : 1;  // 0x15(0x1)
	char bOverride_LPVEmissiveInjectionIntensity : 1;  // 0x15(0x1)
	char bOverride_LPVFadeRange : 1;  // 0x15(0x1)
	char bOverride_LPVDirectionalOcclusionFadeRange : 1;  // 0x15(0x1)
	char bOverride_IndirectLightingColor : 1;  // 0x15(0x1)
	char bOverride_IndirectLightingIntensity : 1;  // 0x16(0x1)
	char bOverride_ColorGradingIntensity : 1;  // 0x16(0x1)
	char bOverride_ColorGradingLUT : 1;  // 0x16(0x1)
	char bOverride_DepthOfFieldFocalDistance : 1;  // 0x16(0x1)
	char bOverride_DepthOfFieldFstop : 1;  // 0x16(0x1)
	char bOverride_DepthOfFieldMinFstop : 1;  // 0x16(0x1)
	char bOverride_DepthOfFieldBladeCount : 1;  // 0x16(0x1)
	char bOverride_DepthOfFieldSensorWidth : 1;  // 0x16(0x1)
	char bOverride_DepthOfFieldDepthBlurRadius : 1;  // 0x17(0x1)
	char bOverride_DepthOfFieldDepthBlurAmount : 1;  // 0x17(0x1)
	char bOverride_DepthOfFieldFocalRegion : 1;  // 0x17(0x1)
	char bOverride_DepthOfFieldNearTransitionRegion : 1;  // 0x17(0x1)
	char bOverride_DepthOfFieldFarTransitionRegion : 1;  // 0x17(0x1)
	char bOverride_DepthOfFieldScale : 1;  // 0x17(0x1)
	char bOverride_DepthOfFieldNearBlurSize : 1;  // 0x17(0x1)
	char bOverride_DepthOfFieldFarBlurSize : 1;  // 0x17(0x1)
	char bOverride_MobileHQGaussian : 1;  // 0x18(0x1)
	char bOverride_DepthOfFieldOcclusion : 1;  // 0x18(0x1)
	char bOverride_DepthOfFieldSkyFocusDistance : 1;  // 0x18(0x1)
	char bOverride_DepthOfFieldVignetteSize : 1;  // 0x18(0x1)
	char bOverride_MotionBlurAmount : 1;  // 0x18(0x1)
	char bOverride_MotionBlurMax : 1;  // 0x18(0x1)
	char bOverride_MotionBlurTargetFPS : 1;  // 0x18(0x1)
	char bOverride_MotionBlurPerObjectSize : 1;  // 0x18(0x1)
	char bOverride_ScreenPercentage : 1;  // 0x19(0x1)
	char bOverride_ScreenSpaceReflectionIntensity : 1;  // 0x19(0x1)
	char bOverride_ScreenSpaceReflectionQuality : 1;  // 0x19(0x1)
	char bOverride_ScreenSpaceReflectionMaxRoughness : 1;  // 0x19(0x1)
	char bOverride_ScreenSpaceReflectionRoughnessScale : 1;  // 0x19(0x1)
	char pad_25_1 : 3;  // 0x19(0x1)
	char pad_26[3];  // 0x1A(0x3)
	char bOverride_ReflectionsType : 1;  // 0x1C(0x1)
	char bOverride_RayTracingReflectionsMaxRoughness : 1;  // 0x1C(0x1)
	char bOverride_RayTracingReflectionsMaxBounces : 1;  // 0x1C(0x1)
	char bOverride_RayTracingReflectionsSamplesPerPixel : 1;  // 0x1C(0x1)
	char bOverride_RayTracingReflectionsShadows : 1;  // 0x1C(0x1)
	char bOverride_RayTracingReflectionsTranslucency : 1;  // 0x1C(0x1)
	char bOverride_TranslucencyType : 1;  // 0x1C(0x1)
	char bOverride_RayTracingTranslucencyMaxRoughness : 1;  // 0x1C(0x1)
	char bOverride_RayTracingTranslucencyRefractionRays : 1;  // 0x1D(0x1)
	char bOverride_RayTracingTranslucencySamplesPerPixel : 1;  // 0x1D(0x1)
	char bOverride_RayTracingTranslucencyShadows : 1;  // 0x1D(0x1)
	char bOverride_RayTracingTranslucencyRefraction : 1;  // 0x1D(0x1)
	char bOverride_RayTracingGI : 1;  // 0x1D(0x1)
	char bOverride_RayTracingGIMaxBounces : 1;  // 0x1D(0x1)
	char bOverride_RayTracingGISamplesPerPixel : 1;  // 0x1D(0x1)
	char bOverride_PathTracingMaxBounces : 1;  // 0x1D(0x1)
	char bOverride_PathTracingSamplesPerPixel : 1;  // 0x1E(0x1)
	char bOverride_PathTracingFilterWidth : 1;  // 0x1E(0x1)
	char bOverride_PathTracingEnableEmissive : 1;  // 0x1E(0x1)
	char bOverride_PathTracingMaxPathExposure : 1;  // 0x1E(0x1)
	char bOverride_PathTracingEnableDenoiser : 1;  // 0x1E(0x1)
	char pad_30_1 : 3;  // 0x1E(0x1)
	char pad_31[2];  // 0x1F(0x2)
	char bMobileHQGaussian : 1;  // 0x20(0x1)
	char pad_32_1 : 7;  // 0x20(0x1)
	char EBloomMethod BloomMethod;  // 0x21(0x1)
	char EAutoExposureMethod AutoExposureMethod;  // 0x22(0x1)
	char ETemperatureMethod TemperatureType;  // 0x23(0x1)
	float WhiteTemp;  // 0x24(0x4)
	float WhiteTint;  // 0x28(0x4)
	char pad_44[4];  // 0x2C(0x4)
	struct FVector4 ColorSaturation;  // 0x30(0x10)
	struct FVector4 ColorContrast;  // 0x40(0x10)
	struct FVector4 ColorGamma;  // 0x50(0x10)
	struct FVector4 ColorGain;  // 0x60(0x10)
	struct FVector4 ColorOffset;  // 0x70(0x10)
	struct FVector4 ColorSaturationShadows;  // 0x80(0x10)
	struct FVector4 ColorContrastShadows;  // 0x90(0x10)
	struct FVector4 ColorGammaShadows;  // 0xA0(0x10)
	struct FVector4 ColorGainShadows;  // 0xB0(0x10)
	struct FVector4 ColorOffsetShadows;  // 0xC0(0x10)
	struct FVector4 ColorSaturationMidtones;  // 0xD0(0x10)
	struct FVector4 ColorContrastMidtones;  // 0xE0(0x10)
	struct FVector4 ColorGammaMidtones;  // 0xF0(0x10)
	struct FVector4 ColorGainMidtones;  // 0x100(0x10)
	struct FVector4 ColorOffsetMidtones;  // 0x110(0x10)
	struct FVector4 ColorSaturationHighlights;  // 0x120(0x10)
	struct FVector4 ColorContrastHighlights;  // 0x130(0x10)
	struct FVector4 ColorGammaHighlights;  // 0x140(0x10)
	struct FVector4 ColorGainHighlights;  // 0x150(0x10)
	struct FVector4 ColorOffsetHighlights;  // 0x160(0x10)
	float ColorCorrectionHighlightsMin;  // 0x170(0x4)
	float ColorCorrectionShadowsMax;  // 0x174(0x4)
	float BlueCorrection;  // 0x178(0x4)
	float ExpandGamut;  // 0x17C(0x4)
	float ToneCurveAmount;  // 0x180(0x4)
	float FilmSlope;  // 0x184(0x4)
	float FilmToe;  // 0x188(0x4)
	float FilmShoulder;  // 0x18C(0x4)
	float FilmBlackClip;  // 0x190(0x4)
	float FilmWhiteClip;  // 0x194(0x4)
	struct FLinearColor FilmWhitePoint;  // 0x198(0x10)
	struct FLinearColor FilmShadowTint;  // 0x1A8(0x10)
	float FilmShadowTintBlend;  // 0x1B8(0x4)
	float FilmShadowTintAmount;  // 0x1BC(0x4)
	float FilmSaturation;  // 0x1C0(0x4)
	struct FLinearColor FilmChannelMixerRed;  // 0x1C4(0x10)
	struct FLinearColor FilmChannelMixerGreen;  // 0x1D4(0x10)
	struct FLinearColor FilmChannelMixerBlue;  // 0x1E4(0x10)
	float FilmContrast;  // 0x1F4(0x4)
	float FilmToeAmount;  // 0x1F8(0x4)
	float FilmHealAmount;  // 0x1FC(0x4)
	float FilmDynamicRange;  // 0x200(0x4)
	struct FLinearColor SceneColorTint;  // 0x204(0x10)
	float SceneFringeIntensity;  // 0x214(0x4)
	float ChromaticAberrationStartOffset;  // 0x218(0x4)
	float BloomIntensity;  // 0x21C(0x4)
	float BloomThreshold;  // 0x220(0x4)
	float BloomSizeScale;  // 0x224(0x4)
	float Bloom1Size;  // 0x228(0x4)
	float Bloom2Size;  // 0x22C(0x4)
	float Bloom3Size;  // 0x230(0x4)
	float Bloom4Size;  // 0x234(0x4)
	float Bloom5Size;  // 0x238(0x4)
	float Bloom6Size;  // 0x23C(0x4)
	struct FLinearColor Bloom1Tint;  // 0x240(0x10)
	struct FLinearColor Bloom2Tint;  // 0x250(0x10)
	struct FLinearColor Bloom3Tint;  // 0x260(0x10)
	struct FLinearColor Bloom4Tint;  // 0x270(0x10)
	struct FLinearColor Bloom5Tint;  // 0x280(0x10)
	struct FLinearColor Bloom6Tint;  // 0x290(0x10)
	float BloomConvolutionSize;  // 0x2A0(0x4)
	char pad_676[4];  // 0x2A4(0x4)
	struct UTexture2D* BloomConvolutionTexture;  // 0x2A8(0x8)
	struct FVector2D BloomConvolutionCenterUV;  // 0x2B0(0x8)
	float BloomConvolutionPreFilterMin;  // 0x2B8(0x4)
	float BloomConvolutionPreFilterMax;  // 0x2BC(0x4)
	float BloomConvolutionPreFilterMult;  // 0x2C0(0x4)
	float BloomConvolutionBufferScale;  // 0x2C4(0x4)
	struct UTexture* BloomDirtMask;  // 0x2C8(0x8)
	float BloomDirtMaskIntensity;  // 0x2D0(0x4)
	struct FLinearColor BloomDirtMaskTint;  // 0x2D4(0x10)
	struct FLinearColor AmbientCubemapTint;  // 0x2E4(0x10)
	float AmbientCubemapIntensity;  // 0x2F4(0x4)
	struct UTextureCube* AmbientCubemap;  // 0x2F8(0x8)
	float CameraShutterSpeed;  // 0x300(0x4)
	float CameraISO;  // 0x304(0x4)
	float DepthOfFieldFstop;  // 0x308(0x4)
	float DepthOfFieldMinFstop;  // 0x30C(0x4)
	int32_t DepthOfFieldBladeCount;  // 0x310(0x4)
	float AutoExposureBias;  // 0x314(0x4)
	float AutoExposureBiasBackup;  // 0x318(0x4)
	char bOverride_AutoExposureBiasBackup : 1;  // 0x31C(0x1)
	char pad_796_1 : 7;  // 0x31C(0x1)
	char pad_797[4];  // 0x31D(0x4)
	char AutoExposureApplyPhysicalCameraExposure : 1;  // 0x320(0x1)
	char pad_800_1 : 7;  // 0x320(0x1)
	char pad_801[8];  // 0x321(0x8)
	struct UCurveFloat* AutoExposureBiasCurve;  // 0x328(0x8)
	struct UTexture* AutoExposureMeterMask;  // 0x330(0x8)
	float AutoExposureLowPercent;  // 0x338(0x4)
	float AutoExposureHighPercent;  // 0x33C(0x4)
	float AutoExposureMinBrightness;  // 0x340(0x4)
	float AutoExposureMaxBrightness;  // 0x344(0x4)
	float AutoExposureSpeedUp;  // 0x348(0x4)
	float AutoExposureSpeedDown;  // 0x34C(0x4)
	float HistogramLogMin;  // 0x350(0x4)
	float HistogramLogMax;  // 0x354(0x4)
	float AutoExposureCalibrationConstant;  // 0x358(0x4)
	float LensFlareIntensity;  // 0x35C(0x4)
	struct FLinearColor LensFlareTint;  // 0x360(0x10)
	float LensFlareBokehSize;  // 0x370(0x4)
	float LensFlareThreshold;  // 0x374(0x4)
	struct UTexture* LensFlareBokehShape;  // 0x378(0x8)
	struct FLinearColor LensFlareTints[8];  // 0x380(0x80)
	float VignetteIntensity;  // 0x400(0x4)
	float GrainJitter;  // 0x404(0x4)
	float GrainIntensity;  // 0x408(0x4)
	float AmbientOcclusionIntensity;  // 0x40C(0x4)
	float AmbientOcclusionStaticFraction;  // 0x410(0x4)
	float AmbientOcclusionRadius;  // 0x414(0x4)
	char AmbientOcclusionRadiusInWS : 1;  // 0x418(0x1)
	char pad_1048_1 : 7;  // 0x418(0x1)
	char pad_1049[4];  // 0x419(0x4)
	float AmbientOcclusionFadeDistance;  // 0x41C(0x4)
	float AmbientOcclusionFadeRadius;  // 0x420(0x4)
	float AmbientOcclusionDistance;  // 0x424(0x4)
	float AmbientOcclusionPower;  // 0x428(0x4)
	float AmbientOcclusionBias;  // 0x42C(0x4)
	float AmbientOcclusionQuality;  // 0x430(0x4)
	float AmbientOcclusionMipBlend;  // 0x434(0x4)
	float AmbientOcclusionMipScale;  // 0x438(0x4)
	float AmbientOcclusionMipThreshold;  // 0x43C(0x4)
	float AmbientOcclusionTemporalBlendWeight;  // 0x440(0x4)
	char RayTracingAO : 1;  // 0x444(0x1)
	char pad_1092_1 : 7;  // 0x444(0x1)
	char pad_1093[4];  // 0x445(0x4)
	int32_t RayTracingAOSamplesPerPixel;  // 0x448(0x4)
	float RayTracingAOIntensity;  // 0x44C(0x4)
	float RayTracingAORadius;  // 0x450(0x4)
	struct FLinearColor IndirectLightingColor;  // 0x454(0x10)
	float IndirectLightingIntensity;  // 0x464(0x4)
	uint8_t  RayTracingGIType;  // 0x468(0x1)
	char pad_1129[3];  // 0x469(0x3)
	int32_t RayTracingGIMaxBounces;  // 0x46C(0x4)
	int32_t RayTracingGISamplesPerPixel;  // 0x470(0x4)
	float ColorGradingIntensity;  // 0x474(0x4)
	struct UTexture* ColorGradingLUT;  // 0x478(0x8)
	float DepthOfFieldSensorWidth;  // 0x480(0x4)
	float DepthOfFieldFocalDistance;  // 0x484(0x4)
	float DepthOfFieldDepthBlurAmount;  // 0x488(0x4)
	float DepthOfFieldDepthBlurRadius;  // 0x48C(0x4)
	float DepthOfFieldFocalRegion;  // 0x490(0x4)
	float DepthOfFieldNearTransitionRegion;  // 0x494(0x4)
	float DepthOfFieldFarTransitionRegion;  // 0x498(0x4)
	float DepthOfFieldScale;  // 0x49C(0x4)
	float DepthOfFieldNearBlurSize;  // 0x4A0(0x4)
	float DepthOfFieldFarBlurSize;  // 0x4A4(0x4)
	float DepthOfFieldOcclusion;  // 0x4A8(0x4)
	float DepthOfFieldSkyFocusDistance;  // 0x4AC(0x4)
	float DepthOfFieldVignetteSize;  // 0x4B0(0x4)
	float MotionBlurAmount;  // 0x4B4(0x4)
	float MotionBlurMax;  // 0x4B8(0x4)
	int32_t MotionBlurTargetFPS;  // 0x4BC(0x4)
	float MotionBlurPerObjectSize;  // 0x4C0(0x4)
	float LPVIntensity;  // 0x4C4(0x4)
	float LPVVplInjectionBias;  // 0x4C8(0x4)
	float LPVSize;  // 0x4CC(0x4)
	float LPVSecondaryOcclusionIntensity;  // 0x4D0(0x4)
	float LPVSecondaryBounceIntensity;  // 0x4D4(0x4)
	float LPVGeometryVolumeBias;  // 0x4D8(0x4)
	float LPVEmissiveInjectionIntensity;  // 0x4DC(0x4)
	float LPVDirectionalOcclusionIntensity;  // 0x4E0(0x4)
	float LPVDirectionalOcclusionRadius;  // 0x4E4(0x4)
	float LPVDiffuseOcclusionExponent;  // 0x4E8(0x4)
	float LPVSpecularOcclusionExponent;  // 0x4EC(0x4)
	float LPVDiffuseOcclusionIntensity;  // 0x4F0(0x4)
	float LPVSpecularOcclusionIntensity;  // 0x4F4(0x4)
	uint8_t  ReflectionsType;  // 0x4F8(0x1)
	char pad_1273[3];  // 0x4F9(0x3)
	float ScreenSpaceReflectionIntensity;  // 0x4FC(0x4)
	float ScreenSpaceReflectionQuality;  // 0x500(0x4)
	float ScreenSpaceReflectionMaxRoughness;  // 0x504(0x4)
	float RayTracingReflectionsMaxRoughness;  // 0x508(0x4)
	int32_t RayTracingReflectionsMaxBounces;  // 0x50C(0x4)
	int32_t RayTracingReflectionsSamplesPerPixel;  // 0x510(0x4)
	uint8_t  RayTracingReflectionsShadows;  // 0x514(0x1)
	char RayTracingReflectionsTranslucency : 1;  // 0x515(0x1)
	char pad_1301_1 : 7;  // 0x515(0x1)
	uint8_t  TranslucencyType;  // 0x516(0x1)
	char pad_1303[1];  // 0x517(0x1)
	float RayTracingTranslucencyMaxRoughness;  // 0x518(0x4)
	int32_t RayTracingTranslucencyRefractionRays;  // 0x51C(0x4)
	int32_t RayTracingTranslucencySamplesPerPixel;  // 0x520(0x4)
	uint8_t  RayTracingTranslucencyShadows;  // 0x524(0x1)
	char RayTracingTranslucencyRefraction : 1;  // 0x525(0x1)
	char pad_1317_1 : 7;  // 0x525(0x1)
	char pad_1318[3];  // 0x526(0x3)
	int32_t PathTracingMaxBounces;  // 0x528(0x4)
	int32_t PathTracingSamplesPerPixel;  // 0x52C(0x4)
	float PathTracingFilterWidth;  // 0x530(0x4)
	char PathTracingEnableEmissive : 1;  // 0x534(0x1)
	char pad_1332_1 : 7;  // 0x534(0x1)
	char pad_1333[4];  // 0x535(0x4)
	float PathTracingMaxPathExposure;  // 0x538(0x4)
	char PathTracingEnableDenoiser : 1;  // 0x53C(0x1)
	char pad_1340_1 : 7;  // 0x53C(0x1)
	char pad_1341[4];  // 0x53D(0x4)
	float LPVFadeRange;  // 0x540(0x4)
	float LPVDirectionalOcclusionFadeRange;  // 0x544(0x4)
	float ScreenPercentage;  // 0x548(0x4)
	char pad_1356[4];  // 0x54C(0x4)
	struct FWeightedBlendables WeightedBlendables;  // 0x550(0x10)

}; 
// DelegateFunction Engine.ProjectileMovementComponent.OnProjectileStopDelegate__DelegateSignature
// Size: 0x88(Inherited: 0x0) 
struct FOnProjectileStopDelegate__DelegateSignature
{
	struct FHitResult ImpactResult;  // 0x0(0x88)

}; 
// Function Engine.KismetSystemLibrary.LoadAssetClass
// Size: 0x58(Inherited: 0x0) 
struct FLoadAssetClass
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct TSoftClassPtr<UObject> AssetClass;  // 0x8(0x28)
	struct FDelegate OnLoaded;  // 0x30(0x10)
	struct FLatentActionInfo LatentInfo;  // 0x40(0x18)

}; 
// Function Engine.AudioComponent.SetLowPassFilterEnabled
// Size: 0x1(Inherited: 0x0) 
struct FSetLowPassFilterEnabled
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool InLowPassFilterEnabled : 1;  // 0x0(0x1)

}; 
// ScriptStruct Engine.SoundClassProperties
// Size: 0x78(Inherited: 0x0) 
struct FSoundClassProperties
{
	float Volume;  // 0x0(0x4)
	float Pitch;  // 0x4(0x4)
	float LowPassFilterFrequency;  // 0x8(0x4)
	float AttenuationDistanceScale;  // 0xC(0x4)
	float LFEBleed;  // 0x10(0x4)
	float VoiceCenterChannelVolume;  // 0x14(0x4)
	float RadioFilterVolume;  // 0x18(0x4)
	float RadioFilterVolumeThreshold;  // 0x1C(0x4)
	char bApplyEffects : 1;  // 0x20(0x1)
	char bAlwaysPlay : 1;  // 0x20(0x1)
	char bIsUISound : 1;  // 0x20(0x1)
	char bIsMusic : 1;  // 0x20(0x1)
	char bCenterChannelOnly : 1;  // 0x20(0x1)
	char bApplyAmbientVolumes : 1;  // 0x20(0x1)
	char bReverb : 1;  // 0x20(0x1)
	char pad_32_1 : 1;  // 0x20(0x1)
	char pad_33[4];  // 0x21(0x4)
	float Default2DReverbSendAmount;  // 0x24(0x4)
	struct FSoundModulationDefaultSettings ModulationSettings;  // 0x28(0x40)
	char EAudioOutputTarget OutputTarget;  // 0x68(0x1)
	uint8_t  LoadingBehavior;  // 0x69(0x1)
	char pad_106[6];  // 0x6A(0x6)
	struct USoundSubmix* DefaultSubmix;  // 0x70(0x8)

}; 
// Function Engine.SkeletalMeshComponent.GetPostProcessInstance
// Size: 0x8(Inherited: 0x0) 
struct FGetPostProcessInstance
{
	struct UAnimInstance* ReturnValue;  // 0x0(0x8)

}; 
// Function Engine.LevelStreaming.IsLevelVisible
// Size: 0x1(Inherited: 0x0) 
struct FIsLevelVisible
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.KismetMathLibrary.Vector_GetAbsMin
// Size: 0x10(Inherited: 0x0) 
struct FVector_GetAbsMin
{
	struct FVector A;  // 0x0(0xC)
	float ReturnValue;  // 0xC(0x4)

}; 
// DelegateFunction Engine.InterpToMovementComponent.OnInterpToWaitBeginDelegate__DelegateSignature
// Size: 0x8C(Inherited: 0x0) 
struct FOnInterpToWaitBeginDelegate__DelegateSignature
{
	struct FHitResult ImpactResult;  // 0x0(0x88)
	float Time;  // 0x88(0x4)

}; 
// Function Engine.SplineComponent.GetFloatPropertyAtSplineInputKey
// Size: 0x10(Inherited: 0x0) 
struct FGetFloatPropertyAtSplineInputKey
{
	float InKey;  // 0x0(0x4)
	struct FName PropertyName;  // 0x4(0x8)
	float ReturnValue;  // 0xC(0x4)

}; 
// DelegateFunction Engine.InterpToMovementComponent.OnInterpToWaitEndDelegate__DelegateSignature
// Size: 0x8C(Inherited: 0x0) 
struct FOnInterpToWaitEndDelegate__DelegateSignature
{
	struct FHitResult ImpactResult;  // 0x0(0x88)
	float Time;  // 0x88(0x4)

}; 
// Function Engine.CurveLinearColorAtlas.GetCurvePosition
// Size: 0x10(Inherited: 0x0) 
struct FGetCurvePosition
{
	struct UCurveLinearColor* InCurve;  // 0x0(0x8)
	float position;  // 0x8(0x4)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool ReturnValue : 1;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)

}; 
// Function Engine.InterpToMovementComponent.RestartMovement
// Size: 0x4(Inherited: 0x0) 
struct FRestartMovement
{
	float InitialDirection;  // 0x0(0x4)

}; 
// Function Engine.PrimitiveComponent.ScaleByMomentOfInertia
// Size: 0x20(Inherited: 0x0) 
struct FScaleByMomentOfInertia
{
	struct FVector InputVector;  // 0x0(0xC)
	struct FName BoneName;  // 0xC(0x8)
	struct FVector ReturnValue;  // 0x14(0xC)

}; 
// Function Engine.SceneComponent.K2_AddLocalRotation
// Size: 0x9C(Inherited: 0x0) 
struct FK2_AddLocalRotation
{
	struct FRotator DeltaRotation;  // 0x0(0xC)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool bSweep : 1;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)
	struct FHitResult SweepHitResult;  // 0x10(0x88)
	char pad_152_1 : 7;  // 0x98(0x1)
	bool bTeleport : 1;  // 0x98(0x1)
	char pad_153[3];  // 0x99(0x3)

}; 
// Function Engine.Actor.SnapRootComponentTo
// Size: 0x10(Inherited: 0x0) 
struct FSnapRootComponentTo
{
	struct AActor* InParentActor;  // 0x0(0x8)
	struct FName InSocketName;  // 0x8(0x8)

}; 
// Function Engine.MatineeActor.SetLoopingState
// Size: 0x1(Inherited: 0x0) 
struct FSetLoopingState
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bNewLooping : 1;  // 0x0(0x1)

}; 
// Function Engine.Actor.GetDotProductTo
// Size: 0x10(Inherited: 0x0) 
struct FGetDotProductTo
{
	struct AActor* OtherActor;  // 0x0(0x8)
	float ReturnValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function Engine.PhysicsConstraintComponent.SetLinearDriveParams
// Size: 0xC(Inherited: 0x0) 
struct FSetLinearDriveParams
{
	float PositionStrength;  // 0x0(0x4)
	float VelocityStrength;  // 0x4(0x4)
	float InForceLimit;  // 0x8(0x4)

}; 
// Function Engine.PrimitiveComponent.SetCullDistance
// Size: 0x4(Inherited: 0x0) 
struct FSetCullDistance
{
	float NewCullDistance;  // 0x0(0x4)

}; 
// Function Engine.ProjectileMovementComponent.StopSimulating
// Size: 0x88(Inherited: 0x0) 
struct FStopSimulating
{
	struct FHitResult HitResult;  // 0x0(0x88)

}; 
// Function Engine.KismetSystemLibrary.DrawDebugLine
// Size: 0x38(Inherited: 0x0) 
struct FDrawDebugLine
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector LineStart;  // 0x8(0xC)
	struct FVector LineEnd;  // 0x14(0xC)
	struct FLinearColor LineColor;  // 0x20(0x10)
	float Duration;  // 0x30(0x4)
	float Thickness;  // 0x34(0x4)

}; 
// Function Engine.KismetMathLibrary.DegAcos
// Size: 0x8(Inherited: 0x0) 
struct FDegAcos
{
	float A;  // 0x0(0x4)
	float ReturnValue;  // 0x4(0x4)

}; 
// Function Engine.GameplayStatics.SetSoundClassDistanceScale
// Size: 0x18(Inherited: 0x0) 
struct FSetSoundClassDistanceScale
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct USoundClass* SoundClass;  // 0x8(0x8)
	float DistanceAttenuationScale;  // 0x10(0x4)
	float TimeSec;  // 0x14(0x4)

}; 
// Function Engine.PlayerController.GetInputKeyTimeDown
// Size: 0x20(Inherited: 0x0) 
struct FGetInputKeyTimeDown
{
	struct FKey Key;  // 0x0(0x18)
	float ReturnValue;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)

}; 
// ScriptStruct Engine.TimelineLinearColorTrack
// Size: 0x40(Inherited: 0x0) 
struct FTimelineLinearColorTrack
{
	struct UCurveLinearColor* LinearColorCurve;  // 0x0(0x8)
	struct FDelegate InterpFunc;  // 0x8(0x10)
	struct FName TrackName;  // 0x18(0x8)
	struct FName LinearColorPropertyName;  // 0x20(0x8)
	char pad_40[24];  // 0x28(0x18)

}; 
// Function Engine.PlayerController.AddRollInput
// Size: 0x4(Inherited: 0x0) 
struct FAddRollInput
{
	float Val;  // 0x0(0x4)

}; 
// Function Engine.StaticMesh.SetStaticMaterials
// Size: 0x10(Inherited: 0x0) 
struct FSetStaticMaterials
{
	struct TArray<struct FStaticMaterial> InStaticMaterials;  // 0x0(0x10)

}; 
// Function Engine.KismetMathLibrary.Divide_IntPointIntPoint
// Size: 0x18(Inherited: 0x0) 
struct FDivide_IntPointIntPoint
{
	struct FIntPoint A;  // 0x0(0x8)
	struct FIntPoint B;  // 0x8(0x8)
	struct FIntPoint ReturnValue;  // 0x10(0x8)

}; 
// Function Engine.PlatformEventsComponent.IsInLaptopMode
// Size: 0x1(Inherited: 0x0) 
struct FIsInLaptopMode
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.GameplayStatics.Blueprint_PredictProjectilePath_Advanced
// Size: 0x128(Inherited: 0x0) 
struct FBlueprint_PredictProjectilePath_Advanced
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FPredictProjectilePathParams PredictParams;  // 0x8(0x60)
	struct FPredictProjectilePathResult PredictResult;  // 0x68(0xB8)
	char pad_288_1 : 7;  // 0x120(0x1)
	bool ReturnValue : 1;  // 0x120(0x1)
	char pad_289[7];  // 0x121(0x7)

}; 
// Function Engine.PlayerController.ClientRestart
// Size: 0x8(Inherited: 0x0) 
struct FClientRestart
{
	struct APawn* NewPawn;  // 0x0(0x8)

}; 
// Function Engine.KismetSystemLibrary.PrintString
// Size: 0x30(Inherited: 0x0) 
struct FPrintString
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FString inString;  // 0x8(0x10)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool bPrintToScreen : 1;  // 0x18(0x1)
	char pad_25_1 : 7;  // 0x19(0x1)
	bool bPrintToLog : 1;  // 0x19(0x1)
	char pad_26[2];  // 0x1A(0x2)
	struct FLinearColor TextColor;  // 0x1C(0x10)
	float Duration;  // 0x2C(0x4)

}; 
// Function Engine.PlatformEventsComponent.IsInTabletMode
// Size: 0x1(Inherited: 0x0) 
struct FIsInTabletMode
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.GameInstance.DebugCreatePlayer
// Size: 0x4(Inherited: 0x0) 
struct FDebugCreatePlayer
{
	int32_t ControllerId;  // 0x0(0x4)

}; 
// Function Engine.PoseableMeshComponent.GetBoneRotationByName
// Size: 0x18(Inherited: 0x0) 
struct FGetBoneRotationByName
{
	struct FName BoneName;  // 0x0(0x8)
	char EBoneSpaces BoneSpace;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)
	struct FRotator ReturnValue;  // 0xC(0xC)

}; 
// Function Engine.BlueprintPathsLibrary.EnterprisePluginsDir
// Size: 0x10(Inherited: 0x0) 
struct FEnterprisePluginsDir
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.AtmosphericFogComponent.SetAltitudeScale
// Size: 0x4(Inherited: 0x0) 
struct FSetAltitudeScale
{
	float NewAltitudeScale;  // 0x0(0x4)

}; 
// Function Engine.PlatformEventsComponent.SupportsConvertibleLaptops
// Size: 0x1(Inherited: 0x0) 
struct FSupportsConvertibleLaptops
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct Engine.AnimGroupInstance
// Size: 0x70(Inherited: 0x0) 
struct FAnimGroupInstance
{
	char pad_0[112];  // 0x0(0x70)

}; 
// Function Engine.KismetSystemLibrary.GetPrimaryAssetIdFromSoftObjectReference
// Size: 0x38(Inherited: 0x0) 
struct FGetPrimaryAssetIdFromSoftObjectReference
{
	struct TSoftObjectPtr<UObject> SoftObjectReference;  // 0x0(0x28)
	struct FPrimaryAssetId ReturnValue;  // 0x28(0x10)

}; 
// Function Engine.KismetMathLibrary.DegAsin
// Size: 0x8(Inherited: 0x0) 
struct FDegAsin
{
	float A;  // 0x0(0x4)
	float ReturnValue;  // 0x4(0x4)

}; 
// ScriptStruct Engine.CameraCacheEntry
// Size: 0x600(Inherited: 0x0) 
struct FCameraCacheEntry
{
	float Timestamp;  // 0x0(0x4)
	char pad_4[12];  // 0x4(0xC)
	struct FMinimalViewInfo POV;  // 0x10(0x5F0)

}; 
// Function Engine.TimelineComponent.SetLinearColorCurve
// Size: 0x10(Inherited: 0x0) 
struct FSetLinearColorCurve
{
	struct UCurveLinearColor* NewLinearColorCurve;  // 0x0(0x8)
	struct FName LinearColorTrackName;  // 0x8(0x8)

}; 
// Function Engine.PrimitiveComponent.K2_BoxOverlapComponent
// Size: 0xD8(Inherited: 0x0) 
struct FK2_BoxOverlapComponent
{
	struct FVector InBoxCentre;  // 0x0(0xC)
	struct FBox InBox;  // 0xC(0x1C)
	char pad_40_1 : 7;  // 0x28(0x1)
	bool bTraceComplex : 1;  // 0x28(0x1)
	char pad_41_1 : 7;  // 0x29(0x1)
	bool bShowTrace : 1;  // 0x29(0x1)
	char pad_42_1 : 7;  // 0x2A(0x1)
	bool bPersistentShowTrace : 1;  // 0x2A(0x1)
	char pad_43[1];  // 0x2B(0x1)
	struct FVector HitLocation;  // 0x2C(0xC)
	struct FVector HitNormal;  // 0x38(0xC)
	struct FName BoneName;  // 0x44(0x8)
	struct FHitResult OutHit;  // 0x4C(0x88)
	char pad_212_1 : 7;  // 0xD4(0x1)
	bool ReturnValue : 1;  // 0xD4(0x1)
	char pad_213[3];  // 0xD5(0x3)

}; 
// DelegateFunction Engine.OnTimelineFloat__DelegateSignature
// Size: 0x4(Inherited: 0x0) 
struct FOnTimelineFloat__DelegateSignature
{
	float Output;  // 0x0(0x4)

}; 
// DelegateFunction Engine.OnTimelineLinearColor__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FOnTimelineLinearColor__DelegateSignature
{
	struct FLinearColor Output;  // 0x0(0x10)

}; 
// Function Engine.SkeletalMeshComponent.SetAnimClass
// Size: 0x8(Inherited: 0x0) 
struct FSetAnimClass
{
	UObject* NewClass;  // 0x0(0x8)

}; 
// Function Engine.MaterialInstanceDynamic.SetTextureParameterValue
// Size: 0x10(Inherited: 0x0) 
struct FSetTextureParameterValue
{
	struct FName ParameterName;  // 0x0(0x8)
	struct UTexture* Value;  // 0x8(0x8)

}; 
// ScriptStruct Engine.SlotEvaluationPose
// Size: 0xE0(Inherited: 0x0) 
struct FSlotEvaluationPose
{
	char EAdditiveAnimationType AdditiveType;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float Weight;  // 0x4(0x4)
	char pad_8[216];  // 0x8(0xD8)

}; 
// Function Engine.SkeletalMeshComponent.SetAllowAnimCurveEvaluation
// Size: 0x1(Inherited: 0x0) 
struct FSetAllowAnimCurveEvaluation
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bInAllow : 1;  // 0x0(0x1)

}; 
// Function Engine.CurveLinearColor.GetLinearColorValue
// Size: 0x14(Inherited: 0x0) 
struct FGetLinearColorValue
{
	float InTime;  // 0x0(0x4)
	struct FLinearColor ReturnValue;  // 0x4(0x10)

}; 
// Function Engine.Actor.GetSquaredDistanceTo
// Size: 0x10(Inherited: 0x0) 
struct FGetSquaredDistanceTo
{
	struct AActor* OtherActor;  // 0x0(0x8)
	float ReturnValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function Engine.PlayerInput.SetMouseSensitivity
// Size: 0x4(Inherited: 0x0) 
struct FSetMouseSensitivity
{
	float Sensitivity;  // 0x0(0x4)

}; 
// ScriptStruct Engine.MeshInstancingSettings
// Size: 0x18(Inherited: 0x0) 
struct FMeshInstancingSettings
{
	AActor* ActorClassToUse;  // 0x0(0x8)
	int32_t InstanceReplacementThreshold;  // 0x8(0x4)
	uint8_t  MeshReplacementMethod;  // 0xC(0x1)
	char pad_13_1 : 7;  // 0xD(0x1)
	bool bSkipMeshesWithVertexColors : 1;  // 0xD(0x1)
	char pad_14_1 : 7;  // 0xE(0x1)
	bool bUseHLODVolumes : 1;  // 0xE(0x1)
	char pad_15[1];  // 0xF(0x1)
	UInstancedStaticMeshComponent* ISMComponentToUse;  // 0x10(0x8)

}; 
// ScriptStruct Engine.PoseLink
// Size: 0x10(Inherited: 0x10) 
struct FPoseLink : public FPoseLinkBase
{

}; 
// DelegateFunction Engine.DataDrivenCVarEngineSubsystem.OnDataDrivenCVarChanged__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FOnDataDrivenCVarChanged__DelegateSignature
{
	struct FString CVarName;  // 0x0(0x10)

}; 
// Function Engine.KismetSystemLibrary.K2_ClearTimerHandle
// Size: 0x10(Inherited: 0x0) 
struct FK2_ClearTimerHandle
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FTimerHandle Handle;  // 0x8(0x8)

}; 
// ScriptStruct Engine.ChannelDefinition
// Size: 0x28(Inherited: 0x0) 
struct FChannelDefinition
{
	struct FName ChannelName;  // 0x0(0x8)
	struct FName ClassName;  // 0x8(0x8)
	UObject* ChannelClass;  // 0x10(0x8)
	int32_t StaticChannelIndex;  // 0x18(0x4)
	char pad_28_1 : 7;  // 0x1C(0x1)
	bool bTickOnCreate : 1;  // 0x1C(0x1)
	char pad_29_1 : 7;  // 0x1D(0x1)
	bool bServerOpen : 1;  // 0x1D(0x1)
	char pad_30_1 : 7;  // 0x1E(0x1)
	bool bClientOpen : 1;  // 0x1E(0x1)
	char pad_31_1 : 7;  // 0x1F(0x1)
	bool bInitialServer : 1;  // 0x1F(0x1)
	char pad_32_1 : 7;  // 0x20(0x1)
	bool bInitialClient : 1;  // 0x20(0x1)
	char pad_33[7];  // 0x21(0x7)

}; 
// ScriptStruct Engine.ConstraintBaseParams
// Size: 0x14(Inherited: 0x0) 
struct FConstraintBaseParams
{
	float Stiffness;  // 0x0(0x4)
	float Damping;  // 0x4(0x4)
	float Restitution;  // 0x8(0x4)
	float ContactDistance;  // 0xC(0x4)
	char bSoftConstraint : 1;  // 0x10(0x1)
	char pad_16_1 : 7;  // 0x10(0x1)
	char pad_17[4];  // 0x11(0x4)

}; 
// Function Engine.KismetMathLibrary.ComposeRotators
// Size: 0x24(Inherited: 0x0) 
struct FComposeRotators
{
	struct FRotator A;  // 0x0(0xC)
	struct FRotator B;  // 0xC(0xC)
	struct FRotator ReturnValue;  // 0x18(0xC)

}; 
// Function Engine.KismetSystemLibrary.GetConsoleVariableBoolValue
// Size: 0x18(Inherited: 0x0) 
struct FGetConsoleVariableBoolValue
{
	struct FString VariableName;  // 0x0(0x10)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// Function Engine.SplineMeshComponent.SetStartScale
// Size: 0xC(Inherited: 0x0) 
struct FSetStartScale
{
	struct FVector2D StartScale;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool bUpdateMesh : 1;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)

}; 
// Function Engine.SphereComponent.GetUnscaledSphereRadius
// Size: 0x4(Inherited: 0x0) 
struct FGetUnscaledSphereRadius
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function Engine.PrimitiveComponent.SetCastInsetShadow
// Size: 0x1(Inherited: 0x0) 
struct FSetCastInsetShadow
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bInCastInsetShadow : 1;  // 0x0(0x1)

}; 
// DelegateFunction Engine.OnCanvasRenderTargetUpdate__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FOnCanvasRenderTargetUpdate__DelegateSignature
{
	struct UCanvas* Canvas;  // 0x0(0x8)
	int32_t Width;  // 0x8(0x4)
	int32_t Height;  // 0xC(0x4)

}; 
// Function Engine.AudioComponent.SetPaused
// Size: 0x1(Inherited: 0x0) 
struct FSetPaused
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bPause : 1;  // 0x0(0x1)

}; 
// Function Engine.Actor.SetActorRelativeScale3D
// Size: 0xC(Inherited: 0x0) 
struct FSetActorRelativeScale3D
{
	struct FVector NewRelativeScale;  // 0x0(0xC)

}; 
// ScriptStruct Engine.EditorMapPerformanceTestDefinition
// Size: 0x20(Inherited: 0x0) 
struct FEditorMapPerformanceTestDefinition
{
	struct FSoftObjectPath PerformanceTestmap;  // 0x0(0x18)
	int32_t TestTimer;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)

}; 
// Function Engine.KismetMathLibrary.MakeRotFromY
// Size: 0x18(Inherited: 0x0) 
struct FMakeRotFromY
{
	struct FVector Y;  // 0x0(0xC)
	struct FRotator ReturnValue;  // 0xC(0xC)

}; 
// Function Engine.BlueprintPlatformLibrary.GetLaunchNotification
// Size: 0x20(Inherited: 0x0) 
struct FGetLaunchNotification
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool NotificationLaunchedApp : 1;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct FString ActivationEvent;  // 0x8(0x10)
	int32_t FireDate;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)

}; 
// Function Engine.Character.ServerMove
// Size: 0x40(Inherited: 0x0) 
struct FServerMove
{
	float Timestamp;  // 0x0(0x4)
	struct FVector_NetQuantize10 InAccel;  // 0x4(0xC)
	struct FVector_NetQuantize100 ClientLoc;  // 0x10(0xC)
	char CompressedMoveFlags;  // 0x1C(0x1)
	char ClientRoll;  // 0x1D(0x1)
	char pad_30[2];  // 0x1E(0x2)
	uint32_t View;  // 0x20(0x4)
	char pad_36[4];  // 0x24(0x4)
	struct UPrimitiveComponent* ClientMovementBase;  // 0x28(0x8)
	struct FName ClientBaseBoneName;  // 0x30(0x8)
	char ClientMovementMode;  // 0x38(0x1)
	char pad_57[3];  // 0x39(0x3)
	float InCrouchedHalfHeight;  // 0x3C(0x4)

}; 
// DelegateFunction Engine.InstigatedAnyDamageSignature__DelegateSignature
// Size: 0x20(Inherited: 0x0) 
struct FInstigatedAnyDamageSignature__DelegateSignature
{
	float Damage;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct UDamageType* DamageType;  // 0x8(0x8)
	struct AActor* DamagedActor;  // 0x10(0x8)
	struct AActor* DamageCauser;  // 0x18(0x8)

}; 
// ScriptStruct Engine.EquirectProps
// Size: 0x48(Inherited: 0x0) 
struct FEquirectProps
{
	struct FBox2D LeftUVRect;  // 0x0(0x14)
	struct FBox2D RightUVRect;  // 0x14(0x14)
	struct FVector2D LeftScale;  // 0x28(0x8)
	struct FVector2D RightScale;  // 0x30(0x8)
	struct FVector2D LeftBias;  // 0x38(0x8)
	struct FVector2D RightBias;  // 0x40(0x8)

}; 
// DelegateFunction Engine.ViewportDisplayCallback__DelegateSignature
// Size: 0x30(Inherited: 0x0) 
struct FViewportDisplayCallback__DelegateSignature
{
	struct FText OutText;  // 0x0(0x18)
	struct FLinearColor OutColor;  // 0x18(0x10)
	char pad_40_1 : 7;  // 0x28(0x1)
	bool ReturnValue : 1;  // 0x28(0x1)
	char pad_41[7];  // 0x29(0x7)

}; 
// Function Engine.KismetInternationalizationLibrary.SetCurrentLocale
// Size: 0x18(Inherited: 0x0) 
struct FSetCurrentLocale
{
	struct FString Culture;  // 0x0(0x10)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool SaveToConfig : 1;  // 0x10(0x1)
	char pad_17_1 : 7;  // 0x11(0x1)
	bool ReturnValue : 1;  // 0x11(0x1)
	char pad_18[6];  // 0x12(0x6)

}; 
// Function Engine.AnimInstance.GetLinkedAnimLayerInstanceByGroupAndClass
// Size: 0x18(Inherited: 0x0) 
struct FGetLinkedAnimLayerInstanceByGroupAndClass
{
	struct FName InGroup;  // 0x0(0x8)
	UAnimInstance* InClass;  // 0x8(0x8)
	struct UAnimInstance* ReturnValue;  // 0x10(0x8)

}; 
// DelegateFunction Engine.OnAsyncHandleSaveGame__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FOnAsyncHandleSaveGame__DelegateSignature
{
	struct USaveGame* SaveGame;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool bSuccess : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function Engine.SceneComponent.K2_SetWorldLocation
// Size: 0x9C(Inherited: 0x0) 
struct FK2_SetWorldLocation
{
	struct FVector NewLocation;  // 0x0(0xC)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool bSweep : 1;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)
	struct FHitResult SweepHitResult;  // 0x10(0x88)
	char pad_152_1 : 7;  // 0x98(0x1)
	bool bTeleport : 1;  // 0x98(0x1)
	char pad_153[3];  // 0x99(0x3)

}; 
// Function Engine.CameraComponent.SetAspectRatio
// Size: 0x4(Inherited: 0x0) 
struct FSetAspectRatio
{
	float InAspectRatio;  // 0x0(0x4)

}; 
// DelegateFunction Engine.MovementModeChangedSignature__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FMovementModeChangedSignature__DelegateSignature
{
	struct ACharacter* Character;  // 0x0(0x8)
	char EMovementMode PrevMovementMode;  // 0x8(0x1)
	char PreviousCustomMode;  // 0x9(0x1)
	char pad_10[6];  // 0xA(0x6)

}; 
// Function Engine.SplineComponent.GetTransformAtSplineInputKey
// Size: 0x40(Inherited: 0x0) 
struct FGetTransformAtSplineInputKey
{
	float InKey;  // 0x0(0x4)
	char ESplineCoordinateSpace CoordinateSpace;  // 0x4(0x1)
	char pad_5_1 : 7;  // 0x5(0x1)
	bool bUseScale : 1;  // 0x5(0x1)
	char pad_6[10];  // 0x6(0xA)
	struct FTransform ReturnValue;  // 0x10(0x30)

}; 
// Function Engine.KismetStringLibrary.EndsWith
// Size: 0x28(Inherited: 0x0) 
struct FEndsWith
{
	struct FString SourceString;  // 0x0(0x10)
	struct FString InSuffix;  // 0x10(0x10)
	char ESearchCase SearchCase;  // 0x20(0x1)
	char pad_33_1 : 7;  // 0x21(0x1)
	bool ReturnValue : 1;  // 0x21(0x1)
	char pad_34[6];  // 0x22(0x6)

}; 
// Function Engine.Actor.GetAttachParentActor
// Size: 0x8(Inherited: 0x0) 
struct FGetAttachParentActor
{
	struct AActor* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct Engine.VertexOffsetUsage
// Size: 0x4(Inherited: 0x0) 
struct FVertexOffsetUsage
{
	int32_t Usage;  // 0x0(0x4)

}; 
// DelegateFunction Engine.CharacterMovementUpdatedSignature__DelegateSignature
// Size: 0x1C(Inherited: 0x0) 
struct FCharacterMovementUpdatedSignature__DelegateSignature
{
	float DeltaSeconds;  // 0x0(0x4)
	struct FVector OldLocation;  // 0x4(0xC)
	struct FVector OldVelocity;  // 0x10(0xC)

}; 
// Function Engine.KismetMathLibrary.Vector_Left
// Size: 0xC(Inherited: 0x0) 
struct FVector_Left
{
	struct FVector ReturnValue;  // 0x0(0xC)

}; 
// Function Engine.KismetMathLibrary.Multiply_VectorInt
// Size: 0x1C(Inherited: 0x0) 
struct FMultiply_VectorInt
{
	struct FVector A;  // 0x0(0xC)
	int32_t B;  // 0xC(0x4)
	struct FVector ReturnValue;  // 0x10(0xC)

}; 
// DelegateFunction Engine.LandedSignature__DelegateSignature
// Size: 0x88(Inherited: 0x0) 
struct FLandedSignature__DelegateSignature
{
	struct FHitResult Hit;  // 0x0(0x88)

}; 
// Function Engine.KismetSystemLibrary.GetPlatformUserDir
// Size: 0x10(Inherited: 0x0) 
struct FGetPlatformUserDir
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.SplineComponent.GetRotationAtSplineInputKey
// Size: 0x14(Inherited: 0x0) 
struct FGetRotationAtSplineInputKey
{
	float InKey;  // 0x0(0x4)
	char ESplineCoordinateSpace CoordinateSpace;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)
	struct FRotator ReturnValue;  // 0x8(0xC)

}; 
// Function Engine.KismetMathLibrary.GreaterGreater_VectorRotator
// Size: 0x24(Inherited: 0x0) 
struct FGreaterGreater_VectorRotator
{
	struct FVector A;  // 0x0(0xC)
	struct FRotator B;  // 0xC(0xC)
	struct FVector ReturnValue;  // 0x18(0xC)

}; 
// Function Engine.ProjectileMovementComponent.IsInterpolationComplete
// Size: 0x1(Inherited: 0x0) 
struct FIsInterpolationComplete
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.KismetInputLibrary.PointerEvent_GetUserIndex
// Size: 0x78(Inherited: 0x0) 
struct FPointerEvent_GetUserIndex
{
	struct FPointerEvent Input;  // 0x0(0x70)
	int32_t ReturnValue;  // 0x70(0x4)
	char pad_116[4];  // 0x74(0x4)

}; 
// Function Engine.KismetSystemLibrary.MoveComponentTo
// Size: 0x48(Inherited: 0x0) 
struct FMoveComponentTo
{
	struct USceneComponent* Component;  // 0x0(0x8)
	struct FVector TargetRelativeLocation;  // 0x8(0xC)
	struct FRotator TargetRelativeRotation;  // 0x14(0xC)
	char pad_32_1 : 7;  // 0x20(0x1)
	bool bEaseOut : 1;  // 0x20(0x1)
	char pad_33_1 : 7;  // 0x21(0x1)
	bool bEaseIn : 1;  // 0x21(0x1)
	char pad_34[2];  // 0x22(0x2)
	float OverTime;  // 0x24(0x4)
	char pad_40_1 : 7;  // 0x28(0x1)
	bool bForceShortestRotationPath : 1;  // 0x28(0x1)
	char EMoveComponentAction MoveAction;  // 0x29(0x1)
	char pad_42[6];  // 0x2A(0x6)
	struct FLatentActionInfo LatentInfo;  // 0x30(0x18)

}; 
// Function Engine.ProjectileMovementComponent.IsVelocityUnderSimulationThreshold
// Size: 0x1(Inherited: 0x0) 
struct FIsVelocityUnderSimulationThreshold
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// ScriptStruct Engine.SkeletalMeshSamplingInfo
// Size: 0x30(Inherited: 0x0) 
struct FSkeletalMeshSamplingInfo
{
	struct TArray<struct FSkeletalMeshSamplingRegion> Regions;  // 0x0(0x10)
	struct FSkeletalMeshSamplingBuiltData BuiltData;  // 0x10(0x20)

}; 
// ScriptStruct Engine.VectorCurve
// Size: 0x198(Inherited: 0x18) 
struct FVectorCurve : public FAnimCurveBase
{
	struct FRichCurve FloatCurves[3];  // 0x18(0x180)

}; 
// Function Engine.VolumetricCloudComponent.SetLayerHeight
// Size: 0x4(Inherited: 0x0) 
struct FSetLayerHeight
{
	float NewValue;  // 0x0(0x4)

}; 
// Function Engine.KismetSystemLibrary.GetPreferredLanguages
// Size: 0x10(Inherited: 0x0) 
struct FGetPreferredLanguages
{
	struct TArray<struct FString> ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.ProjectileMovementComponent.LimitVelocity
// Size: 0x18(Inherited: 0x0) 
struct FLimitVelocity
{
	struct FVector NewVelocity;  // 0x0(0xC)
	struct FVector ReturnValue;  // 0xC(0xC)

}; 
// ScriptStruct Engine.HLODProxyMesh
// Size: 0x30(Inherited: 0x0) 
struct FHLODProxyMesh
{
	 LODActor;  // 0x0(0x1C)
	char pad_28[4];  // 0x1C(0x4)
	struct UStaticMesh* StaticMesh;  // 0x20(0x8)
	struct FName Key;  // 0x28(0x8)

}; 
// ScriptStruct Engine.MaterialLayersFunctions
// Size: 0x40(Inherited: 0x0) 
struct FMaterialLayersFunctions
{
	struct TArray<struct UMaterialFunctionInterface*> Layers;  // 0x0(0x10)
	struct TArray<struct UMaterialFunctionInterface*> Blends;  // 0x10(0x10)
	struct TArray<bool> LayerStates;  // 0x20(0x10)
	struct FString KeyString;  // 0x30(0x10)

}; 
// Function Engine.KismetSystemLibrary.ControlScreensaver
// Size: 0x1(Inherited: 0x0) 
struct FControlScreensaver
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bAllowScreenSaver : 1;  // 0x0(0x1)

}; 
// ScriptStruct Engine.BlueprintDebugData
// Size: 0x1(Inherited: 0x0) 
struct FBlueprintDebugData
{
	char pad_0[1];  // 0x0(0x1)

}; 
// Function Engine.ProjectileMovementComponent.MoveInterpolationTarget
// Size: 0x18(Inherited: 0x0) 
struct FMoveInterpolationTarget
{
	struct FVector NewLocation;  // 0x0(0xC)
	struct FRotator NewRotation;  // 0xC(0xC)

}; 
// DelegateFunction Engine.ProjectileMovementComponent.OnProjectileBounceDelegate__DelegateSignature
// Size: 0x94(Inherited: 0x0) 
struct FOnProjectileBounceDelegate__DelegateSignature
{
	struct FHitResult ImpactResult;  // 0x0(0x88)
	struct FVector ImpactVelocity;  // 0x88(0xC)

}; 
// Function Engine.KismetMathLibrary.Vector_CosineAngle2D
// Size: 0x1C(Inherited: 0x0) 
struct FVector_CosineAngle2D
{
	struct FVector A;  // 0x0(0xC)
	struct FVector B;  // 0xC(0xC)
	float ReturnValue;  // 0x18(0x4)

}; 
// Function Engine.KismetSystemLibrary.LineTraceMulti
// Size: 0x80(Inherited: 0x0) 
struct FLineTraceMulti
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Start;  // 0x8(0xC)
	struct FVector End;  // 0x14(0xC)
	char ETraceTypeQuery TraceChannel;  // 0x20(0x1)
	char pad_33_1 : 7;  // 0x21(0x1)
	bool bTraceComplex : 1;  // 0x21(0x1)
	char pad_34[6];  // 0x22(0x6)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x28(0x10)
	char EDrawDebugTrace DrawDebugType;  // 0x38(0x1)
	char pad_57[7];  // 0x39(0x7)
	struct TArray<struct FHitResult> OutHits;  // 0x40(0x10)
	char pad_80_1 : 7;  // 0x50(0x1)
	bool bIgnoreSelf : 1;  // 0x50(0x1)
	char pad_81[3];  // 0x51(0x3)
	struct FLinearColor TraceColor;  // 0x54(0x10)
	struct FLinearColor TraceHitColor;  // 0x64(0x10)
	float DrawTime;  // 0x74(0x4)
	char pad_120_1 : 7;  // 0x78(0x1)
	bool ReturnValue : 1;  // 0x78(0x1)
	char pad_121[7];  // 0x79(0x7)

}; 
// Function Engine.KismetMathLibrary.Conv_MatrixToRotator
// Size: 0x50(Inherited: 0x0) 
struct FConv_MatrixToRotator
{
	struct FMatrix InMatrix;  // 0x0(0x40)
	struct FRotator ReturnValue;  // 0x40(0xC)
	char pad_76[4];  // 0x4C(0x4)

}; 
// Function Engine.AsyncActionLoadPrimaryAssetList.AsyncLoadPrimaryAssetList
// Size: 0x30(Inherited: 0x0) 
struct FAsyncLoadPrimaryAssetList
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct TArray<struct FPrimaryAssetId> PrimaryAssetList;  // 0x8(0x10)
	struct TArray<struct FName> LoadBundles;  // 0x18(0x10)
	struct UAsyncActionLoadPrimaryAssetList* ReturnValue;  // 0x28(0x8)

}; 
// Function Engine.ProjectileMovementComponent.SetInterpolatedComponent
// Size: 0x8(Inherited: 0x0) 
struct FSetInterpolatedComponent
{
	struct USceneComponent* Component;  // 0x0(0x8)

}; 
// Function Engine.ProjectileMovementComponent.SetVelocityInLocalSpace
// Size: 0xC(Inherited: 0x0) 
struct FSetVelocityInLocalSpace
{
	struct FVector NewVelocity;  // 0x0(0xC)

}; 
// Function Engine.KismetArrayLibrary.Array_Swap
// Size: 0x18(Inherited: 0x0) 
struct FArray_Swap
{
	struct TArray<int32_t> TargetArray;  // 0x0(0x10)
	int32_t FirstIndex;  // 0x10(0x4)
	int32_t SecondIndex;  // 0x14(0x4)

}; 
// Function Engine.KismetSystemLibrary.MakeLiteralFloat
// Size: 0x8(Inherited: 0x0) 
struct FMakeLiteralFloat
{
	float Value;  // 0x0(0x4)
	float ReturnValue;  // 0x4(0x4)

}; 
// Function Engine.BlueprintPathsLibrary.IsRelative
// Size: 0x18(Inherited: 0x0) 
struct FIsRelative
{
	struct FString InPath;  // 0x0(0x10)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFromEnd
// Size: 0x8(Inherited: 0x0) 
struct FGetInstanceAssetPlayerTimeFromEnd
{
	int32_t AssetPlayerIndex;  // 0x0(0x4)
	float ReturnValue;  // 0x4(0x4)

}; 
// Function Engine.GameInstance.DebugRemovePlayer
// Size: 0x4(Inherited: 0x0) 
struct FDebugRemovePlayer
{
	int32_t ControllerId;  // 0x0(0x4)

}; 
// Function Engine.GameInstance.HandleNetworkError
// Size: 0x2(Inherited: 0x0) 
struct FHandleNetworkError
{
	char ENetworkFailure FailureType;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool bIsServer : 1;  // 0x1(0x1)

}; 
// Function Engine.PlayerController.ClientUpdateLevelStreamingStatus
// Size: 0x10(Inherited: 0x0) 
struct FClientUpdateLevelStreamingStatus
{
	struct FName PackageName;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool bNewShouldBeLoaded : 1;  // 0x8(0x1)
	char pad_9_1 : 7;  // 0x9(0x1)
	bool bNewShouldBeVisible : 1;  // 0x9(0x1)
	char pad_10_1 : 7;  // 0xA(0x1)
	bool bNewShouldBlockOnLoad : 1;  // 0xA(0x1)
	char pad_11[1];  // 0xB(0x1)
	int32_t LODIndex;  // 0xC(0x4)

}; 
// Function Engine.KismetSystemLibrary.ComponentOverlapComponents
// Size: 0x80(Inherited: 0x0) 
struct FComponentOverlapComponents
{
	struct UPrimitiveComponent* Component;  // 0x0(0x8)
	char pad_8[8];  // 0x8(0x8)
	struct FTransform ComponentTransform;  // 0x10(0x30)
	struct TArray<char EObjectTypeQuery> ObjectTypes;  // 0x40(0x10)
	UObject* ComponentClassFilter;  // 0x50(0x8)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x58(0x10)
	struct TArray<struct UPrimitiveComponent*> OutComponents;  // 0x68(0x10)
	char pad_120_1 : 7;  // 0x78(0x1)
	bool ReturnValue : 1;  // 0x78(0x1)
	char pad_121[7];  // 0x79(0x7)

}; 
// Function Engine.Actor.ReceiveActorBeginOverlap
// Size: 0x8(Inherited: 0x0) 
struct FReceiveActorBeginOverlap
{
	struct AActor* OtherActor;  // 0x0(0x8)

}; 
// Function Engine.SplineComponent.GetScaleAtDistanceAlongSpline
// Size: 0x10(Inherited: 0x0) 
struct FGetScaleAtDistanceAlongSpline
{
	float Distance;  // 0x0(0x4)
	struct FVector ReturnValue;  // 0x4(0xC)

}; 
// Function Engine.KismetMathLibrary.TimespanRatio
// Size: 0x18(Inherited: 0x0) 
struct FTimespanRatio
{
	struct FTimespan A;  // 0x0(0x8)
	struct FTimespan B;  // 0x8(0x8)
	float ReturnValue;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function Engine.GameInstance.HandleTravelError
// Size: 0x1(Inherited: 0x0) 
struct FHandleTravelError
{
	char ETravelFailure FailureType;  // 0x0(0x1)

}; 
// Function Engine.KismetStringLibrary.StartsWith
// Size: 0x28(Inherited: 0x0) 
struct FStartsWith
{
	struct FString SourceString;  // 0x0(0x10)
	struct FString InPrefix;  // 0x10(0x10)
	char ESearchCase SearchCase;  // 0x20(0x1)
	char pad_33_1 : 7;  // 0x21(0x1)
	bool ReturnValue : 1;  // 0x21(0x1)
	char pad_34[6];  // 0x22(0x6)

}; 
// Function Engine.BlueprintPathsLibrary.RootDir
// Size: 0x10(Inherited: 0x0) 
struct FRootDir
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// ScriptStruct Engine.BoneReference
// Size: 0x10(Inherited: 0x0) 
struct FBoneReference
{
	struct FName BoneName;  // 0x0(0x8)
	char pad_8[8];  // 0x8(0x8)

}; 
// DelegateFunction Engine.PlatformGameInstance.PlatformScreenOrientationChangedDelegate__DelegateSignature
// Size: 0x1(Inherited: 0x0) 
struct FPlatformScreenOrientationChangedDelegate__DelegateSignature
{
	char EScreenOrientation inScreenOrientation;  // 0x0(0x1)

}; 
// DelegateFunction Engine.OnPrimaryAssetClassLoaded__DelegateSignature
// Size: 0x8(Inherited: 0x0) 
struct FOnPrimaryAssetClassLoaded__DelegateSignature
{
	UObject* Loaded;  // 0x0(0x8)

}; 
// Function Engine.SubsystemBlueprintLibrary.GetWorldSubsystem
// Size: 0x18(Inherited: 0x0) 
struct FGetWorldSubsystem
{
	struct UObject* ContextObject;  // 0x0(0x8)
	UWorldSubsystem* Class;  // 0x8(0x8)
	struct UWorldSubsystem* ReturnValue;  // 0x10(0x8)

}; 
// Function Engine.GameplayStatics.FinishSpawningActor
// Size: 0x50(Inherited: 0x0) 
struct FFinishSpawningActor
{
	struct AActor* Actor;  // 0x0(0x8)
	char pad_8[8];  // 0x8(0x8)
	struct FTransform SpawnTransform;  // 0x10(0x30)
	struct AActor* ReturnValue;  // 0x40(0x8)
	char pad_72[8];  // 0x48(0x8)

}; 
// Function Engine.KismetSystemLibrary.DoesImplementInterface
// Size: 0x18(Inherited: 0x0) 
struct FDoesImplementInterface
{
	struct UObject* TestObject;  // 0x0(0x8)
	UInterface* Interface;  // 0x8(0x8)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// DelegateFunction Engine.PlatformGameInstance.PlatformReceivedLocalNotificationDelegate__DelegateSignature
// Size: 0x18(Inherited: 0x0) 
struct FPlatformReceivedLocalNotificationDelegate__DelegateSignature
{
	struct FString inString;  // 0x0(0x10)
	int32_t inInt;  // 0x10(0x4)
	char EApplicationState inAppState;  // 0x14(0x1)
	char pad_21[3];  // 0x15(0x3)

}; 
// Function Engine.KismetSystemLibrary.K2_GetTimerElapsedTime
// Size: 0x20(Inherited: 0x0) 
struct FK2_GetTimerElapsedTime
{
	struct UObject* Object;  // 0x0(0x8)
	struct FString FunctionName;  // 0x8(0x10)
	float ReturnValue;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)

}; 
// Function Engine.KismetSystemLibrary.EqualEqual_PrimaryAssetType
// Size: 0x14(Inherited: 0x0) 
struct FEqualEqual_PrimaryAssetType
{
	struct FPrimaryAssetType A;  // 0x0(0x8)
	struct FPrimaryAssetType B;  // 0x8(0x8)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[3];  // 0x11(0x3)

}; 
// Function Engine.KismetMathLibrary.Divide_VectorFloat
// Size: 0x1C(Inherited: 0x0) 
struct FDivide_VectorFloat
{
	struct FVector A;  // 0x0(0xC)
	float B;  // 0xC(0x4)
	struct FVector ReturnValue;  // 0x10(0xC)

}; 
// DelegateFunction Engine.PlatformGameInstance.PlatformReceivedRemoteNotificationDelegate__DelegateSignature
// Size: 0x18(Inherited: 0x0) 
struct FPlatformReceivedRemoteNotificationDelegate__DelegateSignature
{
	struct FString inString;  // 0x0(0x10)
	char EApplicationState inAppState;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// DelegateFunction Engine.PlatformGameInstance.PlatformFailedToRegisterForRemoteNotificationsDelegate__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FPlatformFailedToRegisterForRemoteNotificationsDelegate__DelegateSignature
{
	struct FString inString;  // 0x0(0x10)

}; 
// Function Engine.KismetMathLibrary.Matrix_GetMaximumAxisScale
// Size: 0x50(Inherited: 0x0) 
struct FMatrix_GetMaximumAxisScale
{
	struct FMatrix M;  // 0x0(0x40)
	float ReturnValue;  // 0x40(0x4)
	char pad_68[12];  // 0x44(0xC)

}; 
// Function Engine.PrimitiveComponent.K2_SphereTraceComponent
// Size: 0xCC(Inherited: 0x0) 
struct FK2_SphereTraceComponent
{
	struct FVector TraceStart;  // 0x0(0xC)
	struct FVector TraceEnd;  // 0xC(0xC)
	float SphereRadius;  // 0x18(0x4)
	char pad_28_1 : 7;  // 0x1C(0x1)
	bool bTraceComplex : 1;  // 0x1C(0x1)
	char pad_29_1 : 7;  // 0x1D(0x1)
	bool bShowTrace : 1;  // 0x1D(0x1)
	char pad_30_1 : 7;  // 0x1E(0x1)
	bool bPersistentShowTrace : 1;  // 0x1E(0x1)
	char pad_31[1];  // 0x1F(0x1)
	struct FVector HitLocation;  // 0x20(0xC)
	struct FVector HitNormal;  // 0x2C(0xC)
	struct FName BoneName;  // 0x38(0x8)
	struct FHitResult OutHit;  // 0x40(0x88)
	char pad_200_1 : 7;  // 0xC8(0x1)
	bool ReturnValue : 1;  // 0xC8(0x1)
	char pad_201[3];  // 0xC9(0x3)

}; 
// Function Engine.PrimitiveComponent.SetSingleSampleShadowFromStationaryLights
// Size: 0x1(Inherited: 0x0) 
struct FSetSingleSampleShadowFromStationaryLights
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bNewSingleSampleShadowFromStationaryLights : 1;  // 0x0(0x1)

}; 
// Function Engine.KismetMathLibrary.MultiplyMultiply_FloatFloat
// Size: 0xC(Inherited: 0x0) 
struct FMultiplyMultiply_FloatFloat
{
	float Base;  // 0x0(0x4)
	float Exp;  // 0x4(0x4)
	float ReturnValue;  // 0x8(0x4)

}; 
// ScriptStruct Engine.ParticleCurvePair
// Size: 0x18(Inherited: 0x0) 
struct FParticleCurvePair
{
	struct FString CurveName;  // 0x0(0x10)
	struct UObject* CurveObject;  // 0x10(0x8)

}; 
// Function Engine.SplineComponent.SetLocationAtSplinePoint
// Size: 0x14(Inherited: 0x0) 
struct FSetLocationAtSplinePoint
{
	int32_t PointIndex;  // 0x0(0x4)
	struct FVector InLocation;  // 0x4(0xC)
	char ESplineCoordinateSpace CoordinateSpace;  // 0x10(0x1)
	char pad_17_1 : 7;  // 0x11(0x1)
	bool bUpdateSpline : 1;  // 0x11(0x1)
	char pad_18[2];  // 0x12(0x2)

}; 
// Function Engine.KismetInputLibrary.InputEvent_IsShiftDown
// Size: 0x20(Inherited: 0x0) 
struct FInputEvent_IsShiftDown
{
	struct FInputEvent Input;  // 0x0(0x18)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool ReturnValue : 1;  // 0x18(0x1)
	char pad_25[7];  // 0x19(0x7)

}; 
// Function Engine.KismetSystemLibrary.EndTransaction
// Size: 0x4(Inherited: 0x0) 
struct FEndTransaction
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct Engine.URL
// Size: 0x68(Inherited: 0x0) 
struct FURL
{
	struct FString Protocol;  // 0x0(0x10)
	struct FString Host;  // 0x10(0x10)
	int32_t Port;  // 0x20(0x4)
	int32_t Valid;  // 0x24(0x4)
	struct FString Map;  // 0x28(0x10)
	struct FString RedirectURL;  // 0x38(0x10)
	struct TArray<struct FString> Op;  // 0x48(0x10)
	struct FString Portal;  // 0x58(0x10)

}; 
// Function Engine.PlayerCameraManager.GetCameraRotation
// Size: 0xC(Inherited: 0x0) 
struct FGetCameraRotation
{
	struct FRotator ReturnValue;  // 0x0(0xC)

}; 
// DelegateFunction Engine.PlatformGameInstance.PlatformRegisteredForUserNotificationsDelegate__DelegateSignature
// Size: 0x4(Inherited: 0x0) 
struct FPlatformRegisteredForUserNotificationsDelegate__DelegateSignature
{
	int32_t inInt;  // 0x0(0x4)

}; 
// ScriptStruct Engine.CanvasUVTri
// Size: 0x60(Inherited: 0x0) 
struct FCanvasUVTri
{
	struct FVector2D V0_Pos;  // 0x0(0x8)
	struct FVector2D V0_UV;  // 0x8(0x8)
	struct FLinearColor V0_Color;  // 0x10(0x10)
	struct FVector2D V1_Pos;  // 0x20(0x8)
	struct FVector2D V1_UV;  // 0x28(0x8)
	struct FLinearColor V1_Color;  // 0x30(0x10)
	struct FVector2D V2_Pos;  // 0x40(0x8)
	struct FVector2D V2_UV;  // 0x48(0x8)
	struct FLinearColor V2_Color;  // 0x50(0x10)

}; 
// Function Engine.KismetSystemLibrary.CapsuleTraceMultiForObjects
// Size: 0x98(Inherited: 0x0) 
struct FCapsuleTraceMultiForObjects
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Start;  // 0x8(0xC)
	struct FVector End;  // 0x14(0xC)
	float Radius;  // 0x20(0x4)
	float HalfHeight;  // 0x24(0x4)
	struct TArray<char EObjectTypeQuery> ObjectTypes;  // 0x28(0x10)
	char pad_56_1 : 7;  // 0x38(0x1)
	bool bTraceComplex : 1;  // 0x38(0x1)
	char pad_57[7];  // 0x39(0x7)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x40(0x10)
	char EDrawDebugTrace DrawDebugType;  // 0x50(0x1)
	char pad_81[7];  // 0x51(0x7)
	struct TArray<struct FHitResult> OutHits;  // 0x58(0x10)
	char pad_104_1 : 7;  // 0x68(0x1)
	bool bIgnoreSelf : 1;  // 0x68(0x1)
	char pad_105[3];  // 0x69(0x3)
	struct FLinearColor TraceColor;  // 0x6C(0x10)
	struct FLinearColor TraceHitColor;  // 0x7C(0x10)
	float DrawTime;  // 0x8C(0x4)
	char pad_144_1 : 7;  // 0x90(0x1)
	bool ReturnValue : 1;  // 0x90(0x1)
	char pad_145[7];  // 0x91(0x7)

}; 
// Function Engine.KismetSystemLibrary.LaunchURL
// Size: 0x10(Inherited: 0x0) 
struct FLaunchURL
{
	struct FString URL;  // 0x0(0x10)

}; 
// Function Engine.PrimitiveComponent.SetMassScale
// Size: 0xC(Inherited: 0x0) 
struct FSetMassScale
{
	struct FName BoneName;  // 0x0(0x8)
	float InMassScale;  // 0x8(0x4)

}; 
// DelegateFunction Engine.PlatformGameInstance.PlatformRegisteredForRemoteNotificationsDelegate__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FPlatformRegisteredForRemoteNotificationsDelegate__DelegateSignature
{
	struct TArray<char> inArray;  // 0x0(0x10)

}; 
// Function Engine.SkeletalMeshComponent.BreakConstraint
// Size: 0x20(Inherited: 0x0) 
struct FBreakConstraint
{
	struct FVector Impulse;  // 0x0(0xC)
	struct FVector HitLocation;  // 0xC(0xC)
	struct FName InBoneName;  // 0x18(0x8)

}; 
// Function Engine.ViewportStatsSubsystem.AddTimedDisplay
// Size: 0x30(Inherited: 0x0) 
struct FAddTimedDisplay
{
	struct FText Text;  // 0x0(0x18)
	struct FLinearColor Color;  // 0x18(0x10)
	float Duration;  // 0x28(0x4)
	char pad_44[4];  // 0x2C(0x4)

}; 
// Function Engine.KismetMathLibrary.NotEqual_NameName
// Size: 0x14(Inherited: 0x0) 
struct FNotEqual_NameName
{
	struct FName A;  // 0x0(0x8)
	struct FName B;  // 0x8(0x8)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[3];  // 0x11(0x3)

}; 
// DelegateFunction Engine.PlatformGameInstance.PlatformStartupArgumentsDelegate__DelegateSignature
// Size: 0x10(Inherited: 0x0) 
struct FPlatformStartupArgumentsDelegate__DelegateSignature
{
	struct TArray<struct FString> StartupArguments;  // 0x0(0x10)

}; 
// ScriptStruct Engine.CustomAttributePerBoneData
// Size: 0x18(Inherited: 0x0) 
struct FCustomAttributePerBoneData
{
	int32_t BoneTreeIndex;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct TArray<struct FCustomAttribute> Attributes;  // 0x8(0x10)

}; 
// ScriptStruct Engine.BookmarkJumpToSettings
// Size: 0x1(Inherited: 0x1) 
struct FBookmarkJumpToSettings : public FBookmarkBaseJumpToSettings
{

}; 
// ScriptStruct Engine.AnimNotifyQueue
// Size: 0x70(Inherited: 0x0) 
struct FAnimNotifyQueue
{
	char pad_0[16];  // 0x0(0x10)
	struct TArray<struct FAnimNotifyEventReference> AnimNotifies;  // 0x10(0x10)
	struct TMap<struct FName, struct FAnimNotifyArray> UnfilteredMontageAnimNotifies;  // 0x20(0x50)

}; 
// ScriptStruct Engine.RootMotionSource_JumpForce
// Size: 0xD0(Inherited: 0xA0) 
struct FRootMotionSource_JumpForce : public FRootMotionSource
{
	struct FRotator Rotation;  // 0x98(0xC)
	float Distance;  // 0xA4(0x4)
	float Height;  // 0xA8(0x4)
	char pad_180_1 : 7;  // 0xB4(0x1)
	bool bDisableTimeout : 1;  // 0xAC(0x1)
	struct UCurveVector* PathOffsetCurve;  // 0xB0(0x8)
	struct UCurveFloat* TimeMappingCurve;  // 0xB8(0x8)
	char pad_197[11];  // 0xC5(0xB)

}; 
// Function Engine.KismetSystemLibrary.AddFloatHistorySample
// Size: 0x48(Inherited: 0x0) 
struct FAddFloatHistorySample
{
	float Value;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct FDebugFloatHistory FloatHistory;  // 0x8(0x20)
	struct FDebugFloatHistory ReturnValue;  // 0x28(0x20)

}; 
// ScriptStruct Engine.DebugFloatHistory
// Size: 0x20(Inherited: 0x0) 
struct FDebugFloatHistory
{
	struct TArray<float> Samples;  // 0x0(0x10)
	float MaxSamples;  // 0x10(0x4)
	float MinValue;  // 0x14(0x4)
	float MaxValue;  // 0x18(0x4)
	char pad_28_1 : 7;  // 0x1C(0x1)
	bool bAutoAdjustMinMax : 1;  // 0x1C(0x1)
	char pad_29[3];  // 0x1D(0x3)

}; 
// ScriptStruct Engine.PerBoneBlendWeights
// Size: 0x10(Inherited: 0x0) 
struct FPerBoneBlendWeights
{
	struct TArray<struct FPerBoneBlendWeight> BoneBlendWeights;  // 0x0(0x10)

}; 
// Function Engine.PrimitiveComponent.GetPhysicsLinearVelocity
// Size: 0x14(Inherited: 0x0) 
struct FGetPhysicsLinearVelocity
{
	struct FName BoneName;  // 0x0(0x8)
	struct FVector ReturnValue;  // 0x8(0xC)

}; 
// Function Engine.Actor.GetParentComponent
// Size: 0x8(Inherited: 0x0) 
struct FGetParentComponent
{
	struct UChildActorComponent* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct Engine.ParticleSystemReplayFrame
// Size: 0x10(Inherited: 0x0) 
struct FParticleSystemReplayFrame
{
	char pad_0[16];  // 0x0(0x10)

}; 
// ScriptStruct Engine.CharacterMovementComponentPostPhysicsTickFunction
// Size: 0x30(Inherited: 0x28) 
struct FCharacterMovementComponentPostPhysicsTickFunction : public FTickFunction
{
	char pad_40[8];  // 0x28(0x8)

}; 
// Function Engine.KismetSystemLibrary.K2_GetTimerElapsedTimeDelegate
// Size: 0x14(Inherited: 0x0) 
struct FK2_GetTimerElapsedTimeDelegate
{
	struct FDelegate Delegate;  // 0x0(0x10)
	float ReturnValue;  // 0x10(0x4)

}; 
// Function Engine.KismetSystemLibrary.ParseParamValue
// Size: 0x38(Inherited: 0x0) 
struct FParseParamValue
{
	struct FString inString;  // 0x0(0x10)
	struct FString InParam;  // 0x10(0x10)
	struct FString OutValue;  // 0x20(0x10)
	char pad_48_1 : 7;  // 0x30(0x1)
	bool ReturnValue : 1;  // 0x30(0x1)
	char pad_49[7];  // 0x31(0x7)

}; 
// Function Engine.KismetSystemLibrary.BeginTransaction
// Size: 0x38(Inherited: 0x0) 
struct FBeginTransaction
{
	struct FString Context;  // 0x0(0x10)
	struct FText Description;  // 0x10(0x18)
	struct UObject* PrimaryObject;  // 0x28(0x8)
	int32_t ReturnValue;  // 0x30(0x4)
	char pad_52[4];  // 0x34(0x4)

}; 
// Function Engine.KismetSystemLibrary.BoxTraceMulti
// Size: 0x98(Inherited: 0x0) 
struct FBoxTraceMulti
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Start;  // 0x8(0xC)
	struct FVector End;  // 0x14(0xC)
	struct FVector HalfSize;  // 0x20(0xC)
	struct FRotator Orientation;  // 0x2C(0xC)
	char ETraceTypeQuery TraceChannel;  // 0x38(0x1)
	char pad_57_1 : 7;  // 0x39(0x1)
	bool bTraceComplex : 1;  // 0x39(0x1)
	char pad_58[6];  // 0x3A(0x6)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x40(0x10)
	char EDrawDebugTrace DrawDebugType;  // 0x50(0x1)
	char pad_81[7];  // 0x51(0x7)
	struct TArray<struct FHitResult> OutHits;  // 0x58(0x10)
	char pad_104_1 : 7;  // 0x68(0x1)
	bool bIgnoreSelf : 1;  // 0x68(0x1)
	char pad_105[3];  // 0x69(0x3)
	struct FLinearColor TraceColor;  // 0x6C(0x10)
	struct FLinearColor TraceHitColor;  // 0x7C(0x10)
	float DrawTime;  // 0x8C(0x4)
	char pad_144_1 : 7;  // 0x90(0x1)
	bool ReturnValue : 1;  // 0x90(0x1)
	char pad_145[7];  // 0x91(0x7)

}; 
// Function Engine.KismetMathLibrary.MakeTimespan
// Size: 0x20(Inherited: 0x0) 
struct FMakeTimespan
{
	int32_t Days;  // 0x0(0x4)
	int32_t Hours;  // 0x4(0x4)
	int32_t Minutes;  // 0x8(0x4)
	int32_t Seconds;  // 0xC(0x4)
	int32_t Milliseconds;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)
	struct FTimespan ReturnValue;  // 0x18(0x8)

}; 
// Function Engine.KismetSystemLibrary.BoxTraceMultiByProfile
// Size: 0xA0(Inherited: 0x0) 
struct FBoxTraceMultiByProfile
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Start;  // 0x8(0xC)
	struct FVector End;  // 0x14(0xC)
	struct FVector HalfSize;  // 0x20(0xC)
	struct FRotator Orientation;  // 0x2C(0xC)
	struct FName ProfileName;  // 0x38(0x8)
	char pad_64_1 : 7;  // 0x40(0x1)
	bool bTraceComplex : 1;  // 0x40(0x1)
	char pad_65[7];  // 0x41(0x7)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x48(0x10)
	char EDrawDebugTrace DrawDebugType;  // 0x58(0x1)
	char pad_89[7];  // 0x59(0x7)
	struct TArray<struct FHitResult> OutHits;  // 0x60(0x10)
	char pad_112_1 : 7;  // 0x70(0x1)
	bool bIgnoreSelf : 1;  // 0x70(0x1)
	char pad_113[3];  // 0x71(0x3)
	struct FLinearColor TraceColor;  // 0x74(0x10)
	struct FLinearColor TraceHitColor;  // 0x84(0x10)
	float DrawTime;  // 0x94(0x4)
	char pad_152_1 : 7;  // 0x98(0x1)
	bool ReturnValue : 1;  // 0x98(0x1)
	char pad_153[7];  // 0x99(0x7)

}; 
// Function Engine.SplineComponent.GetWorldDirectionAtTime
// Size: 0x14(Inherited: 0x0) 
struct FGetWorldDirectionAtTime
{
	float Time;  // 0x0(0x4)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool bUseConstantVelocity : 1;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)
	struct FVector ReturnValue;  // 0x8(0xC)

}; 
// Function Engine.KismetRenderingLibrary.CreateRenderTarget2DArray
// Size: 0x38(Inherited: 0x0) 
struct FCreateRenderTarget2DArray
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	int32_t Width;  // 0x8(0x4)
	int32_t Height;  // 0xC(0x4)
	int32_t Slices;  // 0x10(0x4)
	char ETextureRenderTargetFormat Format;  // 0x14(0x1)
	char pad_21[3];  // 0x15(0x3)
	struct FLinearColor ClearColor;  // 0x18(0x10)
	char pad_40_1 : 7;  // 0x28(0x1)
	bool bAutoGenerateMipMaps : 1;  // 0x28(0x1)
	char pad_41[7];  // 0x29(0x7)
	struct UTextureRenderTarget2DArray* ReturnValue;  // 0x30(0x8)

}; 
// Function Engine.KismetMathLibrary.Vector_ProjectOnToNormal
// Size: 0x24(Inherited: 0x0) 
struct FVector_ProjectOnToNormal
{
	struct FVector V;  // 0x0(0xC)
	struct FVector InNormal;  // 0xC(0xC)
	struct FVector ReturnValue;  // 0x18(0xC)

}; 
// Function Engine.GameStateBase.GetPlayerStartTime
// Size: 0x10(Inherited: 0x0) 
struct FGetPlayerStartTime
{
	struct AController* Controller;  // 0x0(0x8)
	float ReturnValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function Engine.KismetSystemLibrary.BoxTraceSingle
// Size: 0x108(Inherited: 0x0) 
struct FBoxTraceSingle
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Start;  // 0x8(0xC)
	struct FVector End;  // 0x14(0xC)
	struct FVector HalfSize;  // 0x20(0xC)
	struct FRotator Orientation;  // 0x2C(0xC)
	char ETraceTypeQuery TraceChannel;  // 0x38(0x1)
	char pad_57_1 : 7;  // 0x39(0x1)
	bool bTraceComplex : 1;  // 0x39(0x1)
	char pad_58[6];  // 0x3A(0x6)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x40(0x10)
	char EDrawDebugTrace DrawDebugType;  // 0x50(0x1)
	char pad_81[3];  // 0x51(0x3)
	struct FHitResult OutHit;  // 0x54(0x88)
	char pad_220_1 : 7;  // 0xDC(0x1)
	bool bIgnoreSelf : 1;  // 0xDC(0x1)
	char pad_221[3];  // 0xDD(0x3)
	struct FLinearColor TraceColor;  // 0xE0(0x10)
	struct FLinearColor TraceHitColor;  // 0xF0(0x10)
	float DrawTime;  // 0x100(0x4)
	char pad_260_1 : 7;  // 0x104(0x1)
	bool ReturnValue : 1;  // 0x104(0x1)
	char pad_261[3];  // 0x105(0x3)

}; 
// ScriptStruct Engine.BakedFloatCustomAttribute
// Size: 0x90(Inherited: 0x0) 
struct FBakedFloatCustomAttribute
{
	struct FName AttributeName;  // 0x0(0x8)
	struct FSimpleCurve FloatCurve;  // 0x8(0x88)

}; 
// Function Engine.LightComponentBase.SetSamplesPerPixel
// Size: 0x4(Inherited: 0x0) 
struct FSetSamplesPerPixel
{
	int32_t NewValue;  // 0x0(0x4)

}; 
// ScriptStruct Engine.BranchFilter
// Size: 0xC(Inherited: 0x0) 
struct FBranchFilter
{
	struct FName BoneName;  // 0x0(0x8)
	int32_t BlendDepth;  // 0x8(0x4)

}; 
// Function Engine.KismetSystemLibrary.BoxTraceSingleByProfile
// Size: 0x110(Inherited: 0x0) 
struct FBoxTraceSingleByProfile
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Start;  // 0x8(0xC)
	struct FVector End;  // 0x14(0xC)
	struct FVector HalfSize;  // 0x20(0xC)
	struct FRotator Orientation;  // 0x2C(0xC)
	struct FName ProfileName;  // 0x38(0x8)
	char pad_64_1 : 7;  // 0x40(0x1)
	bool bTraceComplex : 1;  // 0x40(0x1)
	char pad_65[7];  // 0x41(0x7)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x48(0x10)
	char EDrawDebugTrace DrawDebugType;  // 0x58(0x1)
	char pad_89[3];  // 0x59(0x3)
	struct FHitResult OutHit;  // 0x5C(0x88)
	char pad_228_1 : 7;  // 0xE4(0x1)
	bool bIgnoreSelf : 1;  // 0xE4(0x1)
	char pad_229[3];  // 0xE5(0x3)
	struct FLinearColor TraceColor;  // 0xE8(0x10)
	struct FLinearColor TraceHitColor;  // 0xF8(0x10)
	float DrawTime;  // 0x108(0x4)
	char pad_268_1 : 7;  // 0x10C(0x1)
	bool ReturnValue : 1;  // 0x10C(0x1)
	char pad_269[3];  // 0x10D(0x3)

}; 
// Function Engine.LevelScriptActor.SetCinematicMode
// Size: 0x5(Inherited: 0x0) 
struct FSetCinematicMode
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bCinematicMode : 1;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool bHidePlayer : 1;  // 0x1(0x1)
	char pad_2_1 : 7;  // 0x2(0x1)
	bool bAffectsHUD : 1;  // 0x2(0x1)
	char pad_3_1 : 7;  // 0x3(0x1)
	bool bAffectsMovement : 1;  // 0x3(0x1)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool bAffectsTurning : 1;  // 0x4(0x1)

}; 
// Function Engine.SkeletalMeshComponent.SetBodyNotifyRigidBodyCollision
// Size: 0xC(Inherited: 0x0) 
struct FSetBodyNotifyRigidBodyCollision
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bNewNotifyRigidBodyCollision : 1;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	struct FName BoneName;  // 0x4(0x8)

}; 
// Function Engine.KismetSystemLibrary.IsValidSoftClassReference
// Size: 0x30(Inherited: 0x0) 
struct FIsValidSoftClassReference
{
	struct TSoftClassPtr<UObject> SoftClassReference;  // 0x0(0x28)
	char pad_40_1 : 7;  // 0x28(0x1)
	bool ReturnValue : 1;  // 0x28(0x1)
	char pad_41[7];  // 0x29(0x7)

}; 
// Function Engine.SkeletalMesh.FindSocketAndIndex
// Size: 0x18(Inherited: 0x0) 
struct FFindSocketAndIndex
{
	struct FName InSocketName;  // 0x0(0x8)
	int32_t OutIndex;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)
	struct USkeletalMeshSocket* ReturnValue;  // 0x10(0x8)

}; 
// Function Engine.KismetMathLibrary.Vector_BoundedToCube
// Size: 0x1C(Inherited: 0x0) 
struct FVector_BoundedToCube
{
	struct FVector InVect;  // 0x0(0xC)
	float InRadius;  // 0xC(0x4)
	struct FVector ReturnValue;  // 0x10(0xC)

}; 
// Function Engine.PlayerController.SetName
// Size: 0x10(Inherited: 0x0) 
struct FSetName
{
	struct FString S;  // 0x0(0x10)

}; 
// Function Engine.KismetSystemLibrary.BreakSoftObjectPath
// Size: 0x28(Inherited: 0x0) 
struct FBreakSoftObjectPath
{
	struct FSoftObjectPath InSoftObjectPath;  // 0x0(0x18)
	struct FString PathString;  // 0x18(0x10)

}; 
// ScriptStruct Engine.HapticFeedbackDetails_Curve
// Size: 0x110(Inherited: 0x0) 
struct FHapticFeedbackDetails_Curve
{
	struct FRuntimeFloatCurve Frequency;  // 0x0(0x88)
	struct FRuntimeFloatCurve Amplitude;  // 0x88(0x88)

}; 
// Function Engine.KismetSystemLibrary.NotEqual_PrimaryAssetType
// Size: 0x14(Inherited: 0x0) 
struct FNotEqual_PrimaryAssetType
{
	struct FPrimaryAssetType A;  // 0x0(0x8)
	struct FPrimaryAssetType B;  // 0x8(0x8)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[3];  // 0x11(0x3)

}; 
// Function Engine.DataTableFunctionLibrary.GetDataTableRowNames
// Size: 0x18(Inherited: 0x0) 
struct FGetDataTableRowNames
{
	struct UDataTable* Table;  // 0x0(0x8)
	struct TArray<struct FName> OutRowNames;  // 0x8(0x10)

}; 
// ScriptStruct Engine.BuildPromotionOpenAssetSettings
// Size: 0x60(Inherited: 0x0) 
struct FBuildPromotionOpenAssetSettings
{
	struct FFilePath BlueprintAsset;  // 0x0(0x10)
	struct FFilePath MaterialAsset;  // 0x10(0x10)
	struct FFilePath ParticleSystemAsset;  // 0x20(0x10)
	struct FFilePath SkeletalMeshAsset;  // 0x30(0x10)
	struct FFilePath StaticMeshAsset;  // 0x40(0x10)
	struct FFilePath TextureAsset;  // 0x50(0x10)

}; 
// Function Engine.KismetSystemLibrary.CancelTransaction
// Size: 0x4(Inherited: 0x0) 
struct FCancelTransaction
{
	int32_t Index;  // 0x0(0x4)

}; 
// Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocityInDegrees
// Size: 0x10(Inherited: 0x0) 
struct FSetPhysicsMaxAngularVelocityInDegrees
{
	float NewMaxAngVel;  // 0x0(0x4)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool bAddToCurrent : 1;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)
	struct FName BoneName;  // 0x8(0x8)

}; 
// Function Engine.KismetSystemLibrary.CapsuleOverlapActors
// Size: 0x60(Inherited: 0x0) 
struct FCapsuleOverlapActors
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector CapsulePos;  // 0x8(0xC)
	float Radius;  // 0x14(0x4)
	float HalfHeight;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)
	struct TArray<char EObjectTypeQuery> ObjectTypes;  // 0x20(0x10)
	UObject* ActorClassFilter;  // 0x30(0x8)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x38(0x10)
	struct TArray<struct AActor*> OutActors;  // 0x48(0x10)
	char pad_88_1 : 7;  // 0x58(0x1)
	bool ReturnValue : 1;  // 0x58(0x1)
	char pad_89[7];  // 0x59(0x7)

}; 
// Function Engine.TimelineComponent.IsPlaying
// Size: 0x1(Inherited: 0x0) 
struct FIsPlaying
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.Controller.SetInitialLocationAndRotation
// Size: 0x18(Inherited: 0x0) 
struct FSetInitialLocationAndRotation
{
	struct FVector NewLocation;  // 0x0(0xC)
	struct FRotator NewRotation;  // 0xC(0xC)

}; 
// Function Engine.SkeletalMeshComponent.SetConstraintProfileForAll
// Size: 0xC(Inherited: 0x0) 
struct FSetConstraintProfileForAll
{
	struct FName ProfileName;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool bDefaultIfNotFound : 1;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)

}; 
// Function Engine.CameraAnimInst.SetScale
// Size: 0x4(Inherited: 0x0) 
struct FSetScale
{
	float NewDuration;  // 0x0(0x4)

}; 
// Function Engine.GameModeBase.GetNumSpectators
// Size: 0x4(Inherited: 0x0) 
struct FGetNumSpectators
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function Engine.KismetSystemLibrary.IsValidSoftObjectReference
// Size: 0x30(Inherited: 0x0) 
struct FIsValidSoftObjectReference
{
	struct TSoftObjectPtr<UObject> SoftObjectReference;  // 0x0(0x28)
	char pad_40_1 : 7;  // 0x28(0x1)
	bool ReturnValue : 1;  // 0x28(0x1)
	char pad_41[7];  // 0x29(0x7)

}; 
// Function Engine.PlayerCameraManager.StopCameraAnimInst
// Size: 0x10(Inherited: 0x0) 
struct FStopCameraAnimInst
{
	struct UCameraAnimInst* AnimInst;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool bImmediate : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function Engine.KismetSystemLibrary.CapsuleOverlapComponents
// Size: 0x60(Inherited: 0x0) 
struct FCapsuleOverlapComponents
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector CapsulePos;  // 0x8(0xC)
	float Radius;  // 0x14(0x4)
	float HalfHeight;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)
	struct TArray<char EObjectTypeQuery> ObjectTypes;  // 0x20(0x10)
	UObject* ComponentClassFilter;  // 0x30(0x8)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x38(0x10)
	struct TArray<struct UPrimitiveComponent*> OutComponents;  // 0x48(0x10)
	char pad_88_1 : 7;  // 0x58(0x1)
	bool ReturnValue : 1;  // 0x58(0x1)
	char pad_89[7];  // 0x59(0x7)

}; 
// Function Engine.PlayerController.ClientSetCameraMode
// Size: 0x8(Inherited: 0x0) 
struct FClientSetCameraMode
{
	struct FName NewCamMode;  // 0x0(0x8)

}; 
// Function Engine.KismetTextLibrary.Conv_BoolToText
// Size: 0x20(Inherited: 0x0) 
struct FConv_BoolToText
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool InBool : 1;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct FText ReturnValue;  // 0x8(0x18)

}; 
// Function Engine.PlayerController.ClientUpdateMultipleLevelsStreamingStatus
// Size: 0x10(Inherited: 0x0) 
struct FClientUpdateMultipleLevelsStreamingStatus
{
	struct TArray<struct FUpdateLevelStreamingLevelStatus> LevelStatuses;  // 0x0(0x10)

}; 
// Function Engine.SkeletalMeshComponent.GetLinkedAnimGraphInstancesByTag
// Size: 0x18(Inherited: 0x0) 
struct FGetLinkedAnimGraphInstancesByTag
{
	struct FName InTag;  // 0x0(0x8)
	struct TArray<struct UAnimInstance*> OutLinkedInstances;  // 0x8(0x10)

}; 
// Function Engine.KismetSystemLibrary.CapsuleTraceMulti
// Size: 0x88(Inherited: 0x0) 
struct FCapsuleTraceMulti
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Start;  // 0x8(0xC)
	struct FVector End;  // 0x14(0xC)
	float Radius;  // 0x20(0x4)
	float HalfHeight;  // 0x24(0x4)
	char ETraceTypeQuery TraceChannel;  // 0x28(0x1)
	char pad_41_1 : 7;  // 0x29(0x1)
	bool bTraceComplex : 1;  // 0x29(0x1)
	char pad_42[6];  // 0x2A(0x6)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x30(0x10)
	char EDrawDebugTrace DrawDebugType;  // 0x40(0x1)
	char pad_65[7];  // 0x41(0x7)
	struct TArray<struct FHitResult> OutHits;  // 0x48(0x10)
	char pad_88_1 : 7;  // 0x58(0x1)
	bool bIgnoreSelf : 1;  // 0x58(0x1)
	char pad_89[3];  // 0x59(0x3)
	struct FLinearColor TraceColor;  // 0x5C(0x10)
	struct FLinearColor TraceHitColor;  // 0x6C(0x10)
	float DrawTime;  // 0x7C(0x4)
	char pad_128_1 : 7;  // 0x80(0x1)
	bool ReturnValue : 1;  // 0x80(0x1)
	char pad_129[7];  // 0x81(0x7)

}; 
// Function Engine.SkyAtmosphereComponent.GetAtmosphereTransmitanceOnGroundAtPlanetTop
// Size: 0x18(Inherited: 0x0) 
struct FGetAtmosphereTransmitanceOnGroundAtPlanetTop
{
	struct UDirectionalLightComponent* DirectionalLight;  // 0x0(0x8)
	struct FLinearColor ReturnValue;  // 0x8(0x10)

}; 
// Function Engine.KismetSystemLibrary.CapsuleTraceMultiByProfile
// Size: 0x90(Inherited: 0x0) 
struct FCapsuleTraceMultiByProfile
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Start;  // 0x8(0xC)
	struct FVector End;  // 0x14(0xC)
	float Radius;  // 0x20(0x4)
	float HalfHeight;  // 0x24(0x4)
	struct FName ProfileName;  // 0x28(0x8)
	char pad_48_1 : 7;  // 0x30(0x1)
	bool bTraceComplex : 1;  // 0x30(0x1)
	char pad_49[7];  // 0x31(0x7)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x38(0x10)
	char EDrawDebugTrace DrawDebugType;  // 0x48(0x1)
	char pad_73[7];  // 0x49(0x7)
	struct TArray<struct FHitResult> OutHits;  // 0x50(0x10)
	char pad_96_1 : 7;  // 0x60(0x1)
	bool bIgnoreSelf : 1;  // 0x60(0x1)
	char pad_97[3];  // 0x61(0x3)
	struct FLinearColor TraceColor;  // 0x64(0x10)
	struct FLinearColor TraceHitColor;  // 0x74(0x10)
	float DrawTime;  // 0x84(0x4)
	char pad_136_1 : 7;  // 0x88(0x1)
	bool ReturnValue : 1;  // 0x88(0x1)
	char pad_137[7];  // 0x89(0x7)

}; 
// ScriptStruct Engine.RootMotionSource_ConstantForce
// Size: 0xB0(Inherited: 0xA0) 
struct FRootMotionSource_ConstantForce : public FRootMotionSource
{
	struct FVector force;  // 0x98(0xC)
	struct UCurveFloat* StrengthOverTime;  // 0xA8(0x8)

}; 
// ScriptStruct Engine.SoundWaveEnvelopeTimeData
// Size: 0x8(Inherited: 0x0) 
struct FSoundWaveEnvelopeTimeData
{
	float Amplitude;  // 0x0(0x4)
	float TimeSec;  // 0x4(0x4)

}; 
// Function Engine.KismetMathLibrary.WeightedMovingAverage_Float
// Size: 0x10(Inherited: 0x0) 
struct FWeightedMovingAverage_Float
{
	float CurrentSample;  // 0x0(0x4)
	float PreviousSample;  // 0x4(0x4)
	float Weight;  // 0x8(0x4)
	float ReturnValue;  // 0xC(0x4)

}; 
// ScriptStruct Engine.InputAxisConfigEntry
// Size: 0x18(Inherited: 0x0) 
struct FInputAxisConfigEntry
{
	struct FName AxisKeyName;  // 0x0(0x8)
	struct FInputAxisProperties AxisProperties;  // 0x8(0x10)

}; 
// Function Engine.KismetSystemLibrary.DrawDebugPoint
// Size: 0x30(Inherited: 0x0) 
struct FDrawDebugPoint
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector position;  // 0x8(0xC)
	float Size;  // 0x14(0x4)
	struct FLinearColor PointColor;  // 0x18(0x10)
	float Duration;  // 0x28(0x4)
	char pad_44[4];  // 0x2C(0x4)

}; 
// Function Engine.KismetSystemLibrary.CapsuleTraceSingle
// Size: 0xF8(Inherited: 0x0) 
struct FCapsuleTraceSingle
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Start;  // 0x8(0xC)
	struct FVector End;  // 0x14(0xC)
	float Radius;  // 0x20(0x4)
	float HalfHeight;  // 0x24(0x4)
	char ETraceTypeQuery TraceChannel;  // 0x28(0x1)
	char pad_41_1 : 7;  // 0x29(0x1)
	bool bTraceComplex : 1;  // 0x29(0x1)
	char pad_42[6];  // 0x2A(0x6)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x30(0x10)
	char EDrawDebugTrace DrawDebugType;  // 0x40(0x1)
	char pad_65[3];  // 0x41(0x3)
	struct FHitResult OutHit;  // 0x44(0x88)
	char pad_204_1 : 7;  // 0xCC(0x1)
	bool bIgnoreSelf : 1;  // 0xCC(0x1)
	char pad_205[3];  // 0xCD(0x3)
	struct FLinearColor TraceColor;  // 0xD0(0x10)
	struct FLinearColor TraceHitColor;  // 0xE0(0x10)
	float DrawTime;  // 0xF0(0x4)
	char pad_244_1 : 7;  // 0xF4(0x1)
	bool ReturnValue : 1;  // 0xF4(0x1)
	char pad_245[3];  // 0xF5(0x3)

}; 
// ScriptStruct Engine.CustomDefine
// Size: 0x20(Inherited: 0x0) 
struct FCustomDefine
{
	struct FString DefineName;  // 0x0(0x10)
	struct FString DefineValue;  // 0x10(0x10)

}; 
// Function Engine.PhysicsConstraintComponent.SetLinearBreakable
// Size: 0x8(Inherited: 0x0) 
struct FSetLinearBreakable
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bLinearBreakable : 1;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float LinearBreakThreshold;  // 0x4(0x4)

}; 
// Function Engine.KismetSystemLibrary.Conv_SoftClassReferenceToString
// Size: 0x38(Inherited: 0x0) 
struct FConv_SoftClassReferenceToString
{
	struct TSoftClassPtr<UObject> SoftClassReference;  // 0x0(0x28)
	struct FString ReturnValue;  // 0x28(0x10)

}; 
// ScriptStruct Engine.BaseAttenuationSettings
// Size: 0xB0(Inherited: 0x0) 
struct FBaseAttenuationSettings
{
	char pad_0[8];  // 0x0(0x8)
	uint8_t  DistanceAlgorithm;  // 0x8(0x1)
	char EAttenuationShape AttenuationShape;  // 0x9(0x1)
	char pad_10[2];  // 0xA(0x2)
	float dBAttenuationAtMax;  // 0xC(0x4)
	uint8_t  FalloffMode;  // 0x10(0x1)
	char pad_17[3];  // 0x11(0x3)
	struct FVector AttenuationShapeExtents;  // 0x14(0xC)
	float ConeOffset;  // 0x20(0x4)
	float FalloffDistance;  // 0x24(0x4)
	struct FRuntimeFloatCurve CustomAttenuationCurve;  // 0x28(0x88)

}; 
// Function Engine.SkeletalMeshComponent.SetTeleportRotationThreshold
// Size: 0x4(Inherited: 0x0) 
struct FSetTeleportRotationThreshold
{
	float Threshold;  // 0x0(0x4)

}; 
// Function Engine.KismetRenderingLibrary.BreakSkinWeightInfo
// Size: 0x5C(Inherited: 0x0) 
struct FBreakSkinWeightInfo
{
	struct FSkelMeshSkinWeightInfo InWeight;  // 0x0(0x3C)
	int32_t Bone0;  // 0x3C(0x4)
	char Weight0;  // 0x40(0x1)
	char pad_65[3];  // 0x41(0x3)
	int32_t Bone1;  // 0x44(0x4)
	char Weight1;  // 0x48(0x1)
	char pad_73[3];  // 0x49(0x3)
	int32_t Bone2;  // 0x4C(0x4)
	char Weight2;  // 0x50(0x1)
	char pad_81[3];  // 0x51(0x3)
	int32_t Bone3;  // 0x54(0x4)
	char Weight3;  // 0x58(0x1)
	char pad_89[3];  // 0x59(0x3)

}; 
// Function Engine.KismetSystemLibrary.CapsuleTraceSingleByProfile
// Size: 0x100(Inherited: 0x0) 
struct FCapsuleTraceSingleByProfile
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Start;  // 0x8(0xC)
	struct FVector End;  // 0x14(0xC)
	float Radius;  // 0x20(0x4)
	float HalfHeight;  // 0x24(0x4)
	struct FName ProfileName;  // 0x28(0x8)
	char pad_48_1 : 7;  // 0x30(0x1)
	bool bTraceComplex : 1;  // 0x30(0x1)
	char pad_49[7];  // 0x31(0x7)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x38(0x10)
	char EDrawDebugTrace DrawDebugType;  // 0x48(0x1)
	char pad_73[3];  // 0x49(0x3)
	struct FHitResult OutHit;  // 0x4C(0x88)
	char pad_212_1 : 7;  // 0xD4(0x1)
	bool bIgnoreSelf : 1;  // 0xD4(0x1)
	char pad_213[3];  // 0xD5(0x3)
	struct FLinearColor TraceColor;  // 0xD8(0x10)
	struct FLinearColor TraceHitColor;  // 0xE8(0x10)
	float DrawTime;  // 0xF8(0x4)
	char pad_252_1 : 7;  // 0xFC(0x1)
	bool ReturnValue : 1;  // 0xFC(0x1)
	char pad_253[3];  // 0xFD(0x3)

}; 
// Function Engine.Actor.K2_OnBecomeViewTarget
// Size: 0x8(Inherited: 0x0) 
struct FK2_OnBecomeViewTarget
{
	struct APlayerController* PC;  // 0x0(0x8)

}; 
// Function Engine.KismetSystemLibrary.ComponentOverlapActors
// Size: 0x80(Inherited: 0x0) 
struct FComponentOverlapActors
{
	struct UPrimitiveComponent* Component;  // 0x0(0x8)
	char pad_8[8];  // 0x8(0x8)
	struct FTransform ComponentTransform;  // 0x10(0x30)
	struct TArray<char EObjectTypeQuery> ObjectTypes;  // 0x40(0x10)
	UObject* ActorClassFilter;  // 0x50(0x8)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x58(0x10)
	struct TArray<struct AActor*> OutActors;  // 0x68(0x10)
	char pad_120_1 : 7;  // 0x78(0x1)
	bool ReturnValue : 1;  // 0x78(0x1)
	char pad_121[7];  // 0x79(0x7)

}; 
// Function Engine.KismetMathLibrary.GetTotalDays
// Size: 0x10(Inherited: 0x0) 
struct FGetTotalDays
{
	struct FTimespan A;  // 0x0(0x8)
	float ReturnValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function Engine.SceneComponent.OnRep_Visibility
// Size: 0x1(Inherited: 0x0) 
struct FOnRep_Visibility
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool oldValue : 1;  // 0x0(0x1)

}; 
// Function Engine.PlayerController.PlayDynamicForceFeedback
// Size: 0x28(Inherited: 0x0) 
struct FPlayDynamicForceFeedback
{
	float Intensity;  // 0x0(0x4)
	float Duration;  // 0x4(0x4)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool bAffectsLeftLarge : 1;  // 0x8(0x1)
	char pad_9_1 : 7;  // 0x9(0x1)
	bool bAffectsLeftSmall : 1;  // 0x9(0x1)
	char pad_10_1 : 7;  // 0xA(0x1)
	bool bAffectsRightLarge : 1;  // 0xA(0x1)
	char pad_11_1 : 7;  // 0xB(0x1)
	bool bAffectsRightSmall : 1;  // 0xB(0x1)
	char EDynamicForceFeedbackAction Action;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)
	struct FLatentActionInfo LatentInfo;  // 0x10(0x18)

}; 
// Function Engine.PhysicsConstraintComponent.SetAngularVelocityDrive
// Size: 0x2(Inherited: 0x0) 
struct FSetAngularVelocityDrive
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bEnableSwingDrive : 1;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool bEnableTwistDrive : 1;  // 0x1(0x1)

}; 
// Function Engine.ImportanceSamplingLibrary.MakeImportanceTexture
// Size: 0x60(Inherited: 0x0) 
struct FMakeImportanceTexture
{
	struct UTexture2D* Texture;  // 0x0(0x8)
	char EImportanceWeight WeightingFunc;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)
	struct FImportanceTexture ReturnValue;  // 0x10(0x50)

}; 
// Function Engine.KismetMathLibrary.GetRightVector
// Size: 0x18(Inherited: 0x0) 
struct FGetRightVector
{
	struct FRotator InRot;  // 0x0(0xC)
	struct FVector ReturnValue;  // 0xC(0xC)

}; 
// Function Engine.CharacterMovementComponent.SetGroupsToIgnoreMask
// Size: 0x4(Inherited: 0x0) 
struct FSetGroupsToIgnoreMask
{
	struct FNavAvoidanceMask GroupMask;  // 0x0(0x4)

}; 
// Function Engine.SkeletalMeshComponent.GetAnimationMode
// Size: 0x1(Inherited: 0x0) 
struct FGetAnimationMode
{
	char EAnimationMode ReturnValue;  // 0x0(0x1)

}; 
// Function Engine.KismetSystemLibrary.Conv_ClassToSoftClassReference
// Size: 0x30(Inherited: 0x0) 
struct FConv_ClassToSoftClassReference
{
	UObject* Class;  // 0x0(0x8)
	struct TSoftClassPtr<UObject> ReturnValue;  // 0x8(0x28)

}; 
// Function Engine.KismetMathLibrary.Vector_One
// Size: 0xC(Inherited: 0x0) 
struct FVector_One
{
	struct FVector ReturnValue;  // 0x0(0xC)

}; 
// Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreActors
// Size: 0x10(Inherited: 0x0) 
struct FCopyArrayOfMoveIgnoreActors
{
	struct TArray<struct AActor*> ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.PlayerController.ClientStopCameraShake
// Size: 0x10(Inherited: 0x0) 
struct FClientStopCameraShake
{
	UCameraShakeBase* Shake;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool bImmediately : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function Engine.KismetSystemLibrary.GetCurrentBundleState
// Size: 0x30(Inherited: 0x0) 
struct FGetCurrentBundleState
{
	struct FPrimaryAssetId PrimaryAssetId;  // 0x0(0x10)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool bForceCurrentState : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)
	struct TArray<struct FName> OutBundles;  // 0x18(0x10)
	char pad_40_1 : 7;  // 0x28(0x1)
	bool ReturnValue : 1;  // 0x28(0x1)
	char pad_41[7];  // 0x29(0x7)

}; 
// Function Engine.KismetSystemLibrary.Conv_InterfaceToObject
// Size: 0x18(Inherited: 0x0) 
struct FConv_InterfaceToObject
{
	struct TScriptInterface<IInterface> Interface;  // 0x0(0x10)
	struct UObject* ReturnValue;  // 0x10(0x8)

}; 
// Function Engine.StaticMeshActor.SetMobility
// Size: 0x1(Inherited: 0x0) 
struct FSetMobility
{
	char EComponentMobility InMobility;  // 0x0(0x1)

}; 
// Function Engine.KismetSystemLibrary.Conv_ObjectToSoftObjectReference
// Size: 0x30(Inherited: 0x0) 
struct FConv_ObjectToSoftObjectReference
{
	struct UObject* Object;  // 0x0(0x8)
	struct TSoftObjectPtr<UObject> ReturnValue;  // 0x8(0x28)

}; 
// Function Engine.CheatManager.Slomo
// Size: 0x4(Inherited: 0x0) 
struct FSlomo
{
	float NewTimeDilation;  // 0x0(0x4)

}; 
// Function Engine.KismetSystemLibrary.Conv_PrimaryAssetIdToString
// Size: 0x20(Inherited: 0x0) 
struct FConv_PrimaryAssetIdToString
{
	struct FPrimaryAssetId PrimaryAssetId;  // 0x0(0x10)
	struct FString ReturnValue;  // 0x10(0x10)

}; 
// DelegateFunction Engine.ParticleCollisionSignature__DelegateSignature
// Size: 0x50(Inherited: 0x0) 
struct FParticleCollisionSignature__DelegateSignature
{
	struct FName EventName;  // 0x0(0x8)
	float EmitterTime;  // 0x8(0x4)
	int32_t ParticleTime;  // 0xC(0x4)
	struct FVector Location;  // 0x10(0xC)
	struct FVector Velocity;  // 0x1C(0xC)
	struct FVector Direction;  // 0x28(0xC)
	struct FVector Normal;  // 0x34(0xC)
	struct FName BoneName;  // 0x40(0x8)
	struct UPhysicalMaterial* PhysMat;  // 0x48(0x8)

}; 
// Function Engine.SplineComponent.GetTangentAtDistanceAlongSpline
// Size: 0x14(Inherited: 0x0) 
struct FGetTangentAtDistanceAlongSpline
{
	float Distance;  // 0x0(0x4)
	char ESplineCoordinateSpace CoordinateSpace;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)
	struct FVector ReturnValue;  // 0x8(0xC)

}; 
// Function Engine.AudioComponent.SetSourceBusSendPreEffect
// Size: 0x10(Inherited: 0x0) 
struct FSetSourceBusSendPreEffect
{
	struct USoundSourceBus* SoundSourceBus;  // 0x0(0x8)
	float SourceBusSendLevel;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function Engine.KismetSystemLibrary.Conv_PrimaryAssetTypeToString
// Size: 0x18(Inherited: 0x0) 
struct FConv_PrimaryAssetTypeToString
{
	struct FPrimaryAssetType PrimaryAssetType;  // 0x0(0x8)
	struct FString ReturnValue;  // 0x8(0x10)

}; 
// ScriptStruct Engine.SoundTrackKey
// Size: 0x18(Inherited: 0x0) 
struct FSoundTrackKey
{
	float Time;  // 0x0(0x4)
	float Volume;  // 0x4(0x4)
	float Pitch;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)
	struct USoundBase* Sound;  // 0x10(0x8)

}; 
// Function Engine.Actor.K2_SetActorRelativeLocation
// Size: 0x9C(Inherited: 0x0) 
struct FK2_SetActorRelativeLocation
{
	struct FVector NewRelativeLocation;  // 0x0(0xC)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool bSweep : 1;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)
	struct FHitResult SweepHitResult;  // 0x10(0x88)
	char pad_152_1 : 7;  // 0x98(0x1)
	bool bTeleport : 1;  // 0x98(0x1)
	char pad_153[3];  // 0x99(0x3)

}; 
// Function Engine.KismetMathLibrary.TimespanZeroValue
// Size: 0x8(Inherited: 0x0) 
struct FTimespanZeroValue
{
	struct FTimespan ReturnValue;  // 0x0(0x8)

}; 
// Function Engine.BoxComponent.GetUnscaledBoxExtent
// Size: 0xC(Inherited: 0x0) 
struct FGetUnscaledBoxExtent
{
	struct FVector ReturnValue;  // 0x0(0xC)

}; 
// Function Engine.KismetSystemLibrary.Conv_SoftClassPathToSoftClassRef
// Size: 0x40(Inherited: 0x0) 
struct FConv_SoftClassPathToSoftClassRef
{
	struct FSoftClassPath SoftClassPath;  // 0x0(0x18)
	struct TSoftClassPtr<UObject> ReturnValue;  // 0x18(0x28)

}; 
// Function Engine.KismetSystemLibrary.Conv_SoftClassReferenceToClass
// Size: 0x30(Inherited: 0x0) 
struct FConv_SoftClassReferenceToClass
{
	struct TSoftClassPtr<UObject> SoftClass;  // 0x0(0x28)
	UObject* ReturnValue;  // 0x28(0x8)

}; 
// Function Engine.KismetMathLibrary.LinearColor_SetFromPow22
// Size: 0x14(Inherited: 0x0) 
struct FLinearColor_SetFromPow22
{
	struct FLinearColor InOutColor;  // 0x0(0x10)
	struct FColor InColor;  // 0x10(0x4)

}; 
// ScriptStruct Engine.KConvexElem
// Size: 0xB0(Inherited: 0x30) 
struct FKConvexElem : public FKShapeElem
{
	struct TArray<struct FVector> VertexData;  // 0x30(0x10)
	struct TArray<int32_t> IndexData;  // 0x40(0x10)
	struct FBox ElemBox;  // 0x50(0x1C)
	char pad_108[4];  // 0x6C(0x4)
	struct FTransform Transform;  // 0x70(0x30)
	char pad_160[16];  // 0xA0(0x10)

}; 
// Function Engine.KismetSystemLibrary.GetClassDisplayName
// Size: 0x18(Inherited: 0x0) 
struct FGetClassDisplayName
{
	UObject* Class;  // 0x0(0x8)
	struct FString ReturnValue;  // 0x8(0x10)

}; 
// Function Engine.KismetSystemLibrary.Conv_SoftObjectReferenceToObject
// Size: 0x30(Inherited: 0x0) 
struct FConv_SoftObjectReferenceToObject
{
	struct TSoftObjectPtr<UObject> SoftObject;  // 0x0(0x28)
	struct UObject* ReturnValue;  // 0x28(0x8)

}; 
// Function Engine.KismetSystemLibrary.K2_TimerExists
// Size: 0x20(Inherited: 0x0) 
struct FK2_TimerExists
{
	struct UObject* Object;  // 0x0(0x8)
	struct FString FunctionName;  // 0x8(0x10)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool ReturnValue : 1;  // 0x18(0x1)
	char pad_25[7];  // 0x19(0x7)

}; 
// Function Engine.KismetSystemLibrary.GetConsoleVariableIntValue
// Size: 0x18(Inherited: 0x0) 
struct FGetConsoleVariableIntValue
{
	struct FString VariableName;  // 0x0(0x10)
	int32_t ReturnValue;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function Engine.KismetMathLibrary.DotProduct2D
// Size: 0x14(Inherited: 0x0) 
struct FDotProduct2D
{
	struct FVector2D A;  // 0x0(0x8)
	struct FVector2D B;  // 0x8(0x8)
	float ReturnValue;  // 0x10(0x4)

}; 
// Function Engine.KismetSystemLibrary.Conv_SoftObjPathToSoftObjRef
// Size: 0x40(Inherited: 0x0) 
struct FConv_SoftObjPathToSoftObjRef
{
	struct FSoftObjectPath SoftObjectPath;  // 0x0(0x18)
	struct TSoftObjectPtr<UObject> ReturnValue;  // 0x18(0x28)

}; 
// Function Engine.SkinnedMeshComponent.HideBoneByName
// Size: 0xC(Inherited: 0x0) 
struct FHideBoneByName
{
	struct FName BoneName;  // 0x0(0x8)
	char EPhysBodyOp PhysBodyOption;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)

}; 
// Function Engine.KismetMathLibrary.Matrix_ApplyScale
// Size: 0x90(Inherited: 0x0) 
struct FMatrix_ApplyScale
{
	struct FMatrix M;  // 0x0(0x40)
	float Scale;  // 0x40(0x4)
	char pad_68[12];  // 0x44(0xC)
	struct FMatrix ReturnValue;  // 0x50(0x40)

}; 
// Function Engine.AnimInstance.GetInstanceTransitionCrossfadeDuration
// Size: 0xC(Inherited: 0x0) 
struct FGetInstanceTransitionCrossfadeDuration
{
	int32_t MachineIndex;  // 0x0(0x4)
	int32_t TransitionIndex;  // 0x4(0x4)
	float ReturnValue;  // 0x8(0x4)

}; 
// Function Engine.PrimitiveComponent.GetClosestPointOnCollision
// Size: 0x24(Inherited: 0x0) 
struct FGetClosestPointOnCollision
{
	struct FVector Point;  // 0x0(0xC)
	struct FVector OutPointOnBody;  // 0xC(0xC)
	struct FName BoneName;  // 0x18(0x8)
	float ReturnValue;  // 0x20(0x4)

}; 
// Function Engine.PlayerController.ClientRepObjRef
// Size: 0x8(Inherited: 0x0) 
struct FClientRepObjRef
{
	struct UObject* Object;  // 0x0(0x8)

}; 
// Function Engine.KismetSystemLibrary.ConvertToAbsolutePath
// Size: 0x20(Inherited: 0x0) 
struct FConvertToAbsolutePath
{
	struct FString Filename;  // 0x0(0x10)
	struct FString ReturnValue;  // 0x10(0x10)

}; 
// Function Engine.Pawn.ConsumeMovementInputVector
// Size: 0xC(Inherited: 0x0) 
struct FConsumeMovementInputVector
{
	struct FVector ReturnValue;  // 0x0(0xC)

}; 
// Function Engine.VolumetricCloudComponent.SetReflectionSampleCountScale
// Size: 0x4(Inherited: 0x0) 
struct FSetReflectionSampleCountScale
{
	float NewValue;  // 0x0(0x4)

}; 
// Function Engine.KismetSystemLibrary.CreateCopyForUndoBuffer
// Size: 0x8(Inherited: 0x0) 
struct FCreateCopyForUndoBuffer
{
	struct UObject* ObjectToModify;  // 0x0(0x8)

}; 
// Function Engine.CharacterMovementComponent.K2_GetWalkableFloorAngle
// Size: 0x4(Inherited: 0x0) 
struct FK2_GetWalkableFloorAngle
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function Engine.KismetSystemLibrary.K2_GetTimerElapsedTimeHandle
// Size: 0x18(Inherited: 0x0) 
struct FK2_GetTimerElapsedTimeHandle
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FTimerHandle Handle;  // 0x8(0x8)
	float ReturnValue;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function Engine.KismetSystemLibrary.GetActorListFromComponentList
// Size: 0x28(Inherited: 0x0) 
struct FGetActorListFromComponentList
{
	struct TArray<struct UPrimitiveComponent*> ComponentList;  // 0x0(0x10)
	UObject* ActorClassFilter;  // 0x10(0x8)
	struct TArray<struct AActor*> OutActorList;  // 0x18(0x10)

}; 
// Function Engine.KismetSystemLibrary.Delay
// Size: 0x28(Inherited: 0x0) 
struct FDelay
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	float Duration;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)
	struct FLatentActionInfo LatentInfo;  // 0x10(0x18)

}; 
// Function Engine.KismetSystemLibrary.SphereTraceMultiByProfile
// Size: 0x88(Inherited: 0x0) 
struct FSphereTraceMultiByProfile
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Start;  // 0x8(0xC)
	struct FVector End;  // 0x14(0xC)
	float Radius;  // 0x20(0x4)
	struct FName ProfileName;  // 0x24(0x8)
	char pad_44_1 : 7;  // 0x2C(0x1)
	bool bTraceComplex : 1;  // 0x2C(0x1)
	char pad_45[3];  // 0x2D(0x3)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x30(0x10)
	char EDrawDebugTrace DrawDebugType;  // 0x40(0x1)
	char pad_65[7];  // 0x41(0x7)
	struct TArray<struct FHitResult> OutHits;  // 0x48(0x10)
	char pad_88_1 : 7;  // 0x58(0x1)
	bool bIgnoreSelf : 1;  // 0x58(0x1)
	char pad_89[3];  // 0x59(0x3)
	struct FLinearColor TraceColor;  // 0x5C(0x10)
	struct FLinearColor TraceHitColor;  // 0x6C(0x10)
	float DrawTime;  // 0x7C(0x4)
	char pad_128_1 : 7;  // 0x80(0x1)
	bool ReturnValue : 1;  // 0x80(0x1)
	char pad_129[7];  // 0x81(0x7)

}; 
// Function Engine.GameplayStatics.GetActorOfClass
// Size: 0x18(Inherited: 0x0) 
struct FGetActorOfClass
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	AActor* ActorClass;  // 0x8(0x8)
	struct AActor* ReturnValue;  // 0x10(0x8)

}; 
// Function Engine.AtmosphericFogComponent.SetDistanceOffset
// Size: 0x4(Inherited: 0x0) 
struct FSetDistanceOffset
{
	float NewDistanceOffset;  // 0x0(0x4)

}; 
// ScriptStruct Engine.FastArraySerializerItem
// Size: 0xC(Inherited: 0x0) 
struct FFastArraySerializerItem
{
	int32_t ReplicationID;  // 0x0(0x4)
	int32_t ReplicationKey;  // 0x4(0x4)
	int32_t MostRecentArrayReplicationKey;  // 0x8(0x4)

}; 
// Function Engine.KismetSystemLibrary.DrawDebugArrow
// Size: 0x40(Inherited: 0x0) 
struct FDrawDebugArrow
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector LineStart;  // 0x8(0xC)
	struct FVector LineEnd;  // 0x14(0xC)
	float ArrowSize;  // 0x20(0x4)
	struct FLinearColor LineColor;  // 0x24(0x10)
	float Duration;  // 0x34(0x4)
	float Thickness;  // 0x38(0x4)
	char pad_60[4];  // 0x3C(0x4)

}; 
// Function Engine.GameplayStatics.PlayDialogue2D
// Size: 0x38(Inherited: 0x0) 
struct FPlayDialogue2D
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct UDialogueWave* Dialogue;  // 0x8(0x8)
	struct FDialogueContext Context;  // 0x10(0x18)
	float VolumeMultiplier;  // 0x28(0x4)
	float PitchMultiplier;  // 0x2C(0x4)
	float StartTime;  // 0x30(0x4)
	char pad_52[4];  // 0x34(0x4)

}; 
// Function Engine.PlayerController.ServerExec
// Size: 0x10(Inherited: 0x0) 
struct FServerExec
{
	struct FString Msg;  // 0x0(0x10)

}; 
// Function Engine.KismetSystemLibrary.DrawDebugCamera
// Size: 0x20(Inherited: 0x0) 
struct FDrawDebugCamera
{
	struct ACameraActor* CameraActor;  // 0x0(0x8)
	struct FLinearColor CameraColor;  // 0x8(0x10)
	float Duration;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)

}; 
// Function Engine.InstancedStaticMeshComponent.UpdateInstanceTransform
// Size: 0x50(Inherited: 0x0) 
struct FUpdateInstanceTransform
{
	int32_t InstanceIndex;  // 0x0(0x4)
	char pad_4[12];  // 0x4(0xC)
	struct FTransform NewInstanceTransform;  // 0x10(0x30)
	char pad_64_1 : 7;  // 0x40(0x1)
	bool bWorldSpace : 1;  // 0x40(0x1)
	char pad_65_1 : 7;  // 0x41(0x1)
	bool bMarkRenderStateDirty : 1;  // 0x41(0x1)
	char pad_66_1 : 7;  // 0x42(0x1)
	bool bTeleport : 1;  // 0x42(0x1)
	char pad_67_1 : 7;  // 0x43(0x1)
	bool ReturnValue : 1;  // 0x43(0x1)
	char pad_68[12];  // 0x44(0xC)

}; 
// ScriptStruct Engine.KTaperedCapsuleElem
// Size: 0x58(Inherited: 0x30) 
struct FKTaperedCapsuleElem : public FKShapeElem
{
	struct FVector Center;  // 0x30(0xC)
	struct FRotator Rotation;  // 0x3C(0xC)
	float Radius0;  // 0x48(0x4)
	float Radius1;  // 0x4C(0x4)
	float Length;  // 0x50(0x4)
	char pad_84[4];  // 0x54(0x4)

}; 
// Function Engine.GameUserSettings.GetResolutionScaleInformation
// Size: 0x10(Inherited: 0x0) 
struct FGetResolutionScaleInformation
{
	float CurrentScaleNormalized;  // 0x0(0x4)
	int32_t CurrentScaleValue;  // 0x4(0x4)
	int32_t MinScaleValue;  // 0x8(0x4)
	int32_t MaxScaleValue;  // 0xC(0x4)

}; 
// Function Engine.HUD.ReceiveHitBoxEndCursorOver
// Size: 0x8(Inherited: 0x0) 
struct FReceiveHitBoxEndCursorOver
{
	struct FName BoxName;  // 0x0(0x8)

}; 
// ScriptStruct Engine.RealCurve
// Size: 0x70(Inherited: 0x68) 
struct FRealCurve : public FIndexedCurve
{
	float DefaultValue;  // 0x68(0x4)
	char ERichCurveExtrapolation PreInfinityExtrap;  // 0x6C(0x1)
	char ERichCurveExtrapolation PostInfinityExtrap;  // 0x6D(0x1)
	char pad_110[2];  // 0x6E(0x2)

}; 
// ScriptStruct Engine.RootMotionSourceGroup
// Size: 0x38(Inherited: 0x0) 
struct FRootMotionSourceGroup
{
	char pad_0[40];  // 0x0(0x28)
	char bHasAdditiveSources : 1;  // 0x28(0x1)
	char bHasOverrideSources : 1;  // 0x28(0x1)
	char bHasOverrideSourcesWithIgnoreZAccumulate : 1;  // 0x28(0x1)
	char bIsAdditiveVelocityApplied : 1;  // 0x28(0x1)
	char pad_40_1 : 4;  // 0x28(0x1)
	struct FRootMotionSourceSettings LastAccumulatedSettings;  // 0x29(0x1)
	char pad_42[2];  // 0x2A(0x2)
	struct FVector_NetQuantize10 LastPreAdditiveVelocity;  // 0x2C(0xC)

}; 
// Function Engine.KismetSystemLibrary.DrawDebugCapsule
// Size: 0x40(Inherited: 0x0) 
struct FDrawDebugCapsule
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Center;  // 0x8(0xC)
	float HalfHeight;  // 0x14(0x4)
	float Radius;  // 0x18(0x4)
	struct FRotator Rotation;  // 0x1C(0xC)
	struct FLinearColor LineColor;  // 0x28(0x10)
	float Duration;  // 0x38(0x4)
	float Thickness;  // 0x3C(0x4)

}; 
// Function Engine.SplineComponent.GetRotationAtTime
// Size: 0x14(Inherited: 0x0) 
struct FGetRotationAtTime
{
	float Time;  // 0x0(0x4)
	char ESplineCoordinateSpace CoordinateSpace;  // 0x4(0x1)
	char pad_5_1 : 7;  // 0x5(0x1)
	bool bUseConstantVelocity : 1;  // 0x5(0x1)
	char pad_6[2];  // 0x6(0x2)
	struct FRotator ReturnValue;  // 0x8(0xC)

}; 
// Function Engine.AmbientSound.FadeOut
// Size: 0x8(Inherited: 0x0) 
struct FFadeOut
{
	float FadeOutDuration;  // 0x0(0x4)
	float FadeVolumeLevel;  // 0x4(0x4)

}; 
// Function Engine.CameraComponent.SetPostProcessBlendWeight
// Size: 0x4(Inherited: 0x0) 
struct FSetPostProcessBlendWeight
{
	float InPostProcessBlendWeight;  // 0x0(0x4)

}; 
// Function Engine.PlayerState.GetPlayerName
// Size: 0x10(Inherited: 0x0) 
struct FGetPlayerName
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.KismetSystemLibrary.SphereTraceSingle
// Size: 0xF0(Inherited: 0x0) 
struct FSphereTraceSingle
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Start;  // 0x8(0xC)
	struct FVector End;  // 0x14(0xC)
	float Radius;  // 0x20(0x4)
	char ETraceTypeQuery TraceChannel;  // 0x24(0x1)
	char pad_37_1 : 7;  // 0x25(0x1)
	bool bTraceComplex : 1;  // 0x25(0x1)
	char pad_38[2];  // 0x26(0x2)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x28(0x10)
	char EDrawDebugTrace DrawDebugType;  // 0x38(0x1)
	char pad_57[3];  // 0x39(0x3)
	struct FHitResult OutHit;  // 0x3C(0x88)
	char pad_196_1 : 7;  // 0xC4(0x1)
	bool bIgnoreSelf : 1;  // 0xC4(0x1)
	char pad_197[3];  // 0xC5(0x3)
	struct FLinearColor TraceColor;  // 0xC8(0x10)
	struct FLinearColor TraceHitColor;  // 0xD8(0x10)
	float DrawTime;  // 0xE8(0x4)
	char pad_236_1 : 7;  // 0xEC(0x1)
	bool ReturnValue : 1;  // 0xEC(0x1)
	char pad_237[3];  // 0xED(0x3)

}; 
// Function Engine.KismetMathLibrary.SelectRotator
// Size: 0x28(Inherited: 0x0) 
struct FSelectRotator
{
	struct FRotator A;  // 0x0(0xC)
	struct FRotator B;  // 0xC(0xC)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool bPickA : 1;  // 0x18(0x1)
	char pad_25[3];  // 0x19(0x3)
	struct FRotator ReturnValue;  // 0x1C(0xC)

}; 
// Function Engine.KismetMathLibrary.Quat_Size
// Size: 0x20(Inherited: 0x0) 
struct FQuat_Size
{
	struct FQuat Q;  // 0x0(0x10)
	float ReturnValue;  // 0x10(0x4)
	char pad_20[12];  // 0x14(0xC)

}; 
// Function Engine.KismetMathLibrary.Conv_IntToFloat
// Size: 0x8(Inherited: 0x0) 
struct FConv_IntToFloat
{
	int32_t inInt;  // 0x0(0x4)
	float ReturnValue;  // 0x4(0x4)

}; 
// Function Engine.Pawn.GetNavAgentLocation
// Size: 0xC(Inherited: 0x0) 
struct FGetNavAgentLocation
{
	struct FVector ReturnValue;  // 0x0(0xC)

}; 
// Function Engine.KismetSystemLibrary.DrawDebugCircle
// Size: 0x50(Inherited: 0x0) 
struct FDrawDebugCircle
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Center;  // 0x8(0xC)
	float Radius;  // 0x14(0x4)
	int32_t NumSegments;  // 0x18(0x4)
	struct FLinearColor LineColor;  // 0x1C(0x10)
	float Duration;  // 0x2C(0x4)
	float Thickness;  // 0x30(0x4)
	struct FVector YAxis;  // 0x34(0xC)
	struct FVector ZAxis;  // 0x40(0xC)
	char pad_76_1 : 7;  // 0x4C(0x1)
	bool bDrawAxis : 1;  // 0x4C(0x1)
	char pad_77[3];  // 0x4D(0x3)

}; 
// ScriptStruct Engine.SkeletonToMeshLinkup
// Size: 0x20(Inherited: 0x0) 
struct FSkeletonToMeshLinkup
{
	struct TArray<int32_t> SkeletonToMeshTable;  // 0x0(0x10)
	struct TArray<int32_t> MeshToSkeletonTable;  // 0x10(0x10)

}; 
// Function Engine.KismetSystemLibrary.DrawDebugConeInDegrees
// Size: 0x48(Inherited: 0x0) 
struct FDrawDebugConeInDegrees
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Origin;  // 0x8(0xC)
	struct FVector Direction;  // 0x14(0xC)
	float Length;  // 0x20(0x4)
	float AngleWidth;  // 0x24(0x4)
	float AngleHeight;  // 0x28(0x4)
	int32_t NumSides;  // 0x2C(0x4)
	struct FLinearColor LineColor;  // 0x30(0x10)
	float Duration;  // 0x40(0x4)
	float Thickness;  // 0x44(0x4)

}; 
// Function Engine.KismetSystemLibrary.SetStructurePropertyByName
// Size: 0x18(Inherited: 0x0) 
struct FSetStructurePropertyByName
{
	struct UObject* Object;  // 0x0(0x8)
	struct FName PropertyName;  // 0x8(0x8)
	struct FGenericStruct Value;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function Engine.MatineeActor.EnableGroupByName
// Size: 0x18(Inherited: 0x0) 
struct FEnableGroupByName
{
	struct FString GroupName;  // 0x0(0x10)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool bEnable : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// Function Engine.KismetMathLibrary.TimespanMaxValue
// Size: 0x8(Inherited: 0x0) 
struct FTimespanMaxValue
{
	struct FTimespan ReturnValue;  // 0x0(0x8)

}; 
// Function Engine.KismetSystemLibrary.GetUniqueDeviceId
// Size: 0x10(Inherited: 0x0) 
struct FGetUniqueDeviceId
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.Actor.ReceiveHit
// Size: 0xC8(Inherited: 0x0) 
struct FReceiveHit
{
	struct UPrimitiveComponent* MyComp;  // 0x0(0x8)
	struct AActor* Other;  // 0x8(0x8)
	struct UPrimitiveComponent* OtherComp;  // 0x10(0x8)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool bSelfMoved : 1;  // 0x18(0x1)
	char pad_25[3];  // 0x19(0x3)
	struct FVector HitLocation;  // 0x1C(0xC)
	struct FVector HitNormal;  // 0x28(0xC)
	struct FVector NormalImpulse;  // 0x34(0xC)
	struct FHitResult Hit;  // 0x40(0x88)

}; 
// Function Engine.KismetMathLibrary.DegSin
// Size: 0x8(Inherited: 0x0) 
struct FDegSin
{
	float A;  // 0x0(0x4)
	float ReturnValue;  // 0x4(0x4)

}; 
// Function Engine.KismetMathLibrary.Conv_BoolToByte
// Size: 0x2(Inherited: 0x0) 
struct FConv_BoolToByte
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool InBool : 1;  // 0x0(0x1)
	char ReturnValue;  // 0x1(0x1)

}; 
// Function Engine.KismetSystemLibrary.IsControllerAssignedToGamepad
// Size: 0x8(Inherited: 0x0) 
struct FIsControllerAssignedToGamepad
{
	int32_t ControllerId;  // 0x0(0x4)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool ReturnValue : 1;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)

}; 
// Function Engine.PlayerController.GetMousePosition
// Size: 0xC(Inherited: 0x0) 
struct FGetMousePosition
{
	float LocationX;  // 0x0(0x4)
	float LocationY;  // 0x4(0x4)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)

}; 
// Function Engine.KismetMathLibrary.Divide_ByteByte
// Size: 0x3(Inherited: 0x0) 
struct FDivide_ByteByte
{
	char A;  // 0x0(0x1)
	char B;  // 0x1(0x1)
	char ReturnValue;  // 0x2(0x1)

}; 
// Function Engine.KismetSystemLibrary.K2_TimerExistsDelegate
// Size: 0x14(Inherited: 0x0) 
struct FK2_TimerExistsDelegate
{
	struct FDelegate Delegate;  // 0x0(0x10)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[3];  // 0x11(0x3)

}; 
// Function Engine.Light.SetLightFunctionScale
// Size: 0xC(Inherited: 0x0) 
struct FSetLightFunctionScale
{
	struct FVector NewLightFunctionScale;  // 0x0(0xC)

}; 
// Function Engine.BlueprintMapLibrary.Map_Find
// Size: 0x60(Inherited: 0x0) 
struct FMap_Find
{
	struct TMap<int32_t, int32_t> TargetMap;  // 0x0(0x50)
	int32_t Key;  // 0x50(0x4)
	int32_t Value;  // 0x54(0x4)
	char pad_88_1 : 7;  // 0x58(0x1)
	bool ReturnValue : 1;  // 0x58(0x1)
	char pad_89[7];  // 0x59(0x7)

}; 
// Function Engine.KismetSystemLibrary.DrawDebugCoordinateSystem
// Size: 0x30(Inherited: 0x0) 
struct FDrawDebugCoordinateSystem
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector AxisLoc;  // 0x8(0xC)
	struct FRotator AxisRot;  // 0x14(0xC)
	float Scale;  // 0x20(0x4)
	float Duration;  // 0x24(0x4)
	float Thickness;  // 0x28(0x4)
	char pad_44[4];  // 0x2C(0x4)

}; 
// ScriptStruct Engine.GaussianSumBloomSettings
// Size: 0x84(Inherited: 0x0) 
struct FGaussianSumBloomSettings
{
	float Intensity;  // 0x0(0x4)
	float Threshold;  // 0x4(0x4)
	float SizeScale;  // 0x8(0x4)
	float Filter1Size;  // 0xC(0x4)
	float Filter2Size;  // 0x10(0x4)
	float Filter3Size;  // 0x14(0x4)
	float Filter4Size;  // 0x18(0x4)
	float Filter5Size;  // 0x1C(0x4)
	float Filter6Size;  // 0x20(0x4)
	struct FLinearColor Filter1Tint;  // 0x24(0x10)
	struct FLinearColor Filter2Tint;  // 0x34(0x10)
	struct FLinearColor Filter3Tint;  // 0x44(0x10)
	struct FLinearColor Filter4Tint;  // 0x54(0x10)
	struct FLinearColor Filter5Tint;  // 0x64(0x10)
	struct FLinearColor Filter6Tint;  // 0x74(0x10)

}; 
// Function Engine.KismetMathLibrary.Cos
// Size: 0x8(Inherited: 0x0) 
struct FCos
{
	float A;  // 0x0(0x4)
	float ReturnValue;  // 0x4(0x4)

}; 
// Function Engine.HUD.AddDebugText
// Size: 0x50(Inherited: 0x0) 
struct FAddDebugText
{
	struct FString DebugText;  // 0x0(0x10)
	struct AActor* SrcActor;  // 0x10(0x8)
	float Duration;  // 0x18(0x4)
	struct FVector Offset;  // 0x1C(0xC)
	struct FVector DesiredOffset;  // 0x28(0xC)
	struct FColor TextColor;  // 0x34(0x4)
	char pad_56_1 : 7;  // 0x38(0x1)
	bool bSkipOverwriteCheck : 1;  // 0x38(0x1)
	char pad_57_1 : 7;  // 0x39(0x1)
	bool bAbsoluteLocation : 1;  // 0x39(0x1)
	char pad_58_1 : 7;  // 0x3A(0x1)
	bool bKeepAttachedToActor : 1;  // 0x3A(0x1)
	char pad_59[5];  // 0x3B(0x5)
	struct UFont* InFont;  // 0x40(0x8)
	float FontScale;  // 0x48(0x4)
	char pad_76_1 : 7;  // 0x4C(0x1)
	bool bDrawShadow : 1;  // 0x4C(0x1)
	char pad_77[3];  // 0x4D(0x3)

}; 
// Function Engine.PhysicsConstraintComponent.SetAngularVelocityDriveSLERP
// Size: 0x1(Inherited: 0x0) 
struct FSetAngularVelocityDriveSLERP
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bEnableSLERP : 1;  // 0x0(0x1)

}; 
// Function Engine.KismetMathLibrary.Conv_Int64ToByte
// Size: 0x10(Inherited: 0x0) 
struct FConv_Int64ToByte
{
	int64_t inInt;  // 0x0(0x8)
	char ReturnValue;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function Engine.KismetSystemLibrary.DrawDebugCylinder
// Size: 0x40(Inherited: 0x0) 
struct FDrawDebugCylinder
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Start;  // 0x8(0xC)
	struct FVector End;  // 0x14(0xC)
	float Radius;  // 0x20(0x4)
	int32_t Segments;  // 0x24(0x4)
	struct FLinearColor LineColor;  // 0x28(0x10)
	float Duration;  // 0x38(0x4)
	float Thickness;  // 0x3C(0x4)

}; 
// Function Engine.SkinnedMeshComponent.SetCapsuleIndirectShadowMinVisibility
// Size: 0x4(Inherited: 0x0) 
struct FSetCapsuleIndirectShadowMinVisibility
{
	float NewValue;  // 0x0(0x4)

}; 
// Function Engine.PlayerCameraManager.StopAllInstancesOfCameraAnim
// Size: 0x10(Inherited: 0x0) 
struct FStopAllInstancesOfCameraAnim
{
	struct UCameraAnim* Anim;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool bImmediate : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function Engine.KismetSystemLibrary.GetProjectDirectory
// Size: 0x10(Inherited: 0x0) 
struct FGetProjectDirectory
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.KismetMathLibrary.LessEqual_Int64Int64
// Size: 0x18(Inherited: 0x0) 
struct FLessEqual_Int64Int64
{
	int64_t A;  // 0x0(0x8)
	int64_t B;  // 0x8(0x8)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// Function Engine.PrimitiveComponent.SetNotifyRigidBodyCollision
// Size: 0x1(Inherited: 0x0) 
struct FSetNotifyRigidBodyCollision
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bNewNotifyRigidBodyCollision : 1;  // 0x0(0x1)

}; 
// Function Engine.PrimitiveComponent.K2_IsPhysicsCollisionEnabled
// Size: 0x1(Inherited: 0x0) 
struct FK2_IsPhysicsCollisionEnabled
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.KismetSystemLibrary.DrawDebugFloatHistoryLocation
// Size: 0x50(Inherited: 0x0) 
struct FDrawDebugFloatHistoryLocation
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FDebugFloatHistory FloatHistory;  // 0x8(0x20)
	struct FVector DrawLocation;  // 0x28(0xC)
	struct FVector2D DrawSize;  // 0x34(0x8)
	struct FLinearColor DrawColor;  // 0x3C(0x10)
	float Duration;  // 0x4C(0x4)

}; 
// ScriptStruct Engine.TexturePlatformData
// Size: 0x30(Inherited: 0x0) 
struct FTexturePlatformData
{
	char pad_0[48];  // 0x0(0x30)

}; 
// Function Engine.PawnMovementComponent.ConsumeInputVector
// Size: 0xC(Inherited: 0x0) 
struct FConsumeInputVector
{
	struct FVector ReturnValue;  // 0x0(0xC)

}; 
// Function Engine.KismetSystemLibrary.DrawDebugFloatHistoryTransform
// Size: 0x80(Inherited: 0x0) 
struct FDrawDebugFloatHistoryTransform
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FDebugFloatHistory FloatHistory;  // 0x8(0x20)
	char pad_40[8];  // 0x28(0x8)
	struct FTransform DrawTransform;  // 0x30(0x30)
	struct FVector2D DrawSize;  // 0x60(0x8)
	struct FLinearColor DrawColor;  // 0x68(0x10)
	float Duration;  // 0x78(0x4)
	char pad_124[4];  // 0x7C(0x4)

}; 
// Function Engine.KismetTextLibrary.Conv_ByteToText
// Size: 0x20(Inherited: 0x0) 
struct FConv_ByteToText
{
	char Value;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct FText ReturnValue;  // 0x8(0x18)

}; 
// DelegateFunction Engine.ParticleDeathSignature__DelegateSignature
// Size: 0x34(Inherited: 0x0) 
struct FParticleDeathSignature__DelegateSignature
{
	struct FName EventName;  // 0x0(0x8)
	float EmitterTime;  // 0x8(0x4)
	int32_t ParticleTime;  // 0xC(0x4)
	struct FVector Location;  // 0x10(0xC)
	struct FVector Velocity;  // 0x1C(0xC)
	struct FVector Direction;  // 0x28(0xC)

}; 
// Function Engine.KismetSystemLibrary.DrawDebugFrustum
// Size: 0x60(Inherited: 0x0) 
struct FDrawDebugFrustum
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	char pad_8[8];  // 0x8(0x8)
	struct FTransform FrustumTransform;  // 0x10(0x30)
	struct FLinearColor FrustumColor;  // 0x40(0x10)
	float Duration;  // 0x50(0x4)
	float Thickness;  // 0x54(0x4)
	char pad_88[8];  // 0x58(0x8)

}; 
// ScriptStruct Engine.RawCurveTracks
// Size: 0x10(Inherited: 0x0) 
struct FRawCurveTracks
{
	struct TArray<struct FFloatCurve> FloatCurves;  // 0x0(0x10)

}; 
// Function Engine.PrimitiveComponent.AddAngularImpulseInRadians
// Size: 0x18(Inherited: 0x0) 
struct FAddAngularImpulseInRadians
{
	struct FVector Impulse;  // 0x0(0xC)
	struct FName BoneName;  // 0xC(0x8)
	char pad_20_1 : 7;  // 0x14(0x1)
	bool bVelChange : 1;  // 0x14(0x1)
	char pad_21[3];  // 0x15(0x3)

}; 
// Function Engine.KismetMathLibrary.Vector_ComponentMax
// Size: 0x24(Inherited: 0x0) 
struct FVector_ComponentMax
{
	struct FVector A;  // 0x0(0xC)
	struct FVector B;  // 0xC(0xC)
	struct FVector ReturnValue;  // 0x18(0xC)

}; 
// Function Engine.KismetSystemLibrary.DrawDebugPlane
// Size: 0x50(Inherited: 0x0) 
struct FDrawDebugPlane
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	char pad_8[8];  // 0x8(0x8)
	struct FPlane PlaneCoordinates;  // 0x10(0x10)
	struct FVector Location;  // 0x20(0xC)
	float Size;  // 0x2C(0x4)
	struct FLinearColor PlaneColor;  // 0x30(0x10)
	float Duration;  // 0x40(0x4)
	char pad_68[12];  // 0x44(0xC)

}; 
// Function Engine.Controller.SetIgnoreMoveInput
// Size: 0x1(Inherited: 0x0) 
struct FSetIgnoreMoveInput
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bNewMoveInput : 1;  // 0x0(0x1)

}; 
// Function Engine.KismetMathLibrary.MakeRotFromXY
// Size: 0x24(Inherited: 0x0) 
struct FMakeRotFromXY
{
	struct FVector X;  // 0x0(0xC)
	struct FVector Y;  // 0xC(0xC)
	struct FRotator ReturnValue;  // 0x18(0xC)

}; 
// Function Engine.KismetSystemLibrary.DrawDebugSphere
// Size: 0x38(Inherited: 0x0) 
struct FDrawDebugSphere
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FVector Center;  // 0x8(0xC)
	float Radius;  // 0x14(0x4)
	int32_t Segments;  // 0x18(0x4)
	struct FLinearColor LineColor;  // 0x1C(0x10)
	float Duration;  // 0x2C(0x4)
	float Thickness;  // 0x30(0x4)
	char pad_52[4];  // 0x34(0x4)

}; 
// ScriptStruct Engine.IndexedCurve
// Size: 0x68(Inherited: 0x0) 
struct FIndexedCurve
{
	char pad_0[8];  // 0x0(0x8)
	struct FKeyHandleMap KeyHandlesToIndices;  // 0x8(0x60)

}; 
// Function Engine.KismetSystemLibrary.EqualEqual_PrimaryAssetId
// Size: 0x24(Inherited: 0x0) 
struct FEqualEqual_PrimaryAssetId
{
	struct FPrimaryAssetId A;  // 0x0(0x10)
	struct FPrimaryAssetId B;  // 0x10(0x10)
	char pad_32_1 : 7;  // 0x20(0x1)
	bool ReturnValue : 1;  // 0x20(0x1)
	char pad_33[3];  // 0x21(0x3)

}; 
// Function Engine.Controller.K2_GetPawn
// Size: 0x8(Inherited: 0x0) 
struct FK2_GetPawn
{
	struct APawn* ReturnValue;  // 0x0(0x8)

}; 
// Function Engine.PrimitiveComponent.WasRecentlyRendered
// Size: 0x8(Inherited: 0x0) 
struct FWasRecentlyRendered
{
	float Tolerance;  // 0x0(0x4)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool ReturnValue : 1;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)

}; 
// Function Engine.KismetSystemLibrary.GetObjectName
// Size: 0x18(Inherited: 0x0) 
struct FGetObjectName
{
	struct UObject* Object;  // 0x0(0x8)
	struct FString ReturnValue;  // 0x8(0x10)

}; 
// Function Engine.KismetMathLibrary.LinearColor_ToRGBE
// Size: 0x14(Inherited: 0x0) 
struct FLinearColor_ToRGBE
{
	struct FLinearColor InLinearColor;  // 0x0(0x10)
	struct FColor ReturnValue;  // 0x10(0x4)

}; 
// Function Engine.KismetSystemLibrary.EqualEqual_SoftClassReference
// Size: 0x58(Inherited: 0x0) 
struct FEqualEqual_SoftClassReference
{
	struct TSoftClassPtr<UObject> A;  // 0x0(0x28)
	struct TSoftClassPtr<UObject> B;  // 0x28(0x28)
	char pad_80_1 : 7;  // 0x50(0x1)
	bool ReturnValue : 1;  // 0x50(0x1)
	char pad_81[7];  // 0x51(0x7)

}; 
// Function Engine.SkyAtmosphereComponent.SetRayleighScatteringScale
// Size: 0x4(Inherited: 0x0) 
struct FSetRayleighScatteringScale
{
	float NewValue;  // 0x0(0x4)

}; 
// Function Engine.KismetSystemLibrary.EqualEqual_SoftObjectReference
// Size: 0x58(Inherited: 0x0) 
struct FEqualEqual_SoftObjectReference
{
	struct TSoftObjectPtr<UObject> A;  // 0x0(0x28)
	struct TSoftObjectPtr<UObject> B;  // 0x28(0x28)
	char pad_80_1 : 7;  // 0x50(0x1)
	bool ReturnValue : 1;  // 0x50(0x1)
	char pad_81[7];  // 0x51(0x7)

}; 
// Function Engine.KismetSystemLibrary.GetViewportLocation
// Size: 0x18(Inherited: 0x0) 
struct FGetViewportLocation
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	int32_t ID;  // 0x8(0x4)
	struct FVector ReturnValue;  // 0xC(0xC)

}; 
// Function Engine.AnimInstance.ResetDynamics
// Size: 0x1(Inherited: 0x0) 
struct FResetDynamics
{
	uint8_t  InTeleportType;  // 0x0(0x1)

}; 
// Function Engine.Actor.ReceiveActorOnInputTouchBegin
// Size: 0x1(Inherited: 0x0) 
struct FReceiveActorOnInputTouchBegin
{
	char ETouchIndex FingerIndex;  // 0x0(0x1)

}; 
// Function Engine.KismetSystemLibrary.ExecuteConsoleCommand
// Size: 0x20(Inherited: 0x0) 
struct FExecuteConsoleCommand
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct FString Command;  // 0x8(0x10)
	struct APlayerController* SpecificPlayer;  // 0x18(0x8)

}; 
// Function Engine.KismetSystemLibrary.GetProjectSavedDirectory
// Size: 0x10(Inherited: 0x0) 
struct FGetProjectSavedDirectory
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.PlayerCameraManager.GetOwningPlayerController
// Size: 0x8(Inherited: 0x0) 
struct FGetOwningPlayerController
{
	struct APlayerController* ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct Engine.ImportanceTexture
// Size: 0x50(Inherited: 0x0) 
struct FImportanceTexture
{
	struct FIntPoint Size;  // 0x0(0x8)
	int32_t NumMips;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)
	struct TArray<float> MarginalCDF;  // 0x10(0x10)
	struct TArray<float> ConditionalCDF;  // 0x20(0x10)
	struct TArray<struct FColor> TextureData;  // 0x30(0x10)
	struct TWeakObjectPtr<UTexture2D> Texture;  // 0x40(0x8)
	char EImportanceWeight Weighting;  // 0x48(0x1)
	char pad_73[7];  // 0x49(0x7)

}; 
// Function Engine.Actor.K2_SetActorRelativeRotation
// Size: 0x9C(Inherited: 0x0) 
struct FK2_SetActorRelativeRotation
{
	struct FRotator NewRelativeRotation;  // 0x0(0xC)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool bSweep : 1;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)
	struct FHitResult SweepHitResult;  // 0x10(0x88)
	char pad_152_1 : 7;  // 0x98(0x1)
	bool bTeleport : 1;  // 0x98(0x1)
	char pad_153[3];  // 0x99(0x3)

}; 
// Function Engine.KismetSystemLibrary.IsValidPrimaryAssetId
// Size: 0x14(Inherited: 0x0) 
struct FIsValidPrimaryAssetId
{
	struct FPrimaryAssetId PrimaryAssetId;  // 0x0(0x10)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[3];  // 0x11(0x3)

}; 
// Function Engine.KismetSystemLibrary.FlushDebugStrings
// Size: 0x8(Inherited: 0x0) 
struct FFlushDebugStrings
{
	struct UObject* WorldContextObject;  // 0x0(0x8)

}; 
// Function Engine.PrimitiveComponent.AddTorque
// Size: 0x18(Inherited: 0x0) 
struct FAddTorque
{
	struct FVector Torque;  // 0x0(0xC)
	struct FName BoneName;  // 0xC(0x8)
	char pad_20_1 : 7;  // 0x14(0x1)
	bool bAccelChange : 1;  // 0x14(0x1)
	char pad_21[3];  // 0x15(0x3)

}; 
// Function Engine.SkeletalMeshComponent.SetAllBodiesBelowSimulatePhysics
// Size: 0xC(Inherited: 0x0) 
struct FSetAllBodiesBelowSimulatePhysics
{
	struct FName InBoneName;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool bNewSimulate : 1;  // 0x8(0x1)
	char pad_9_1 : 7;  // 0x9(0x1)
	bool bIncludeSelf : 1;  // 0x9(0x1)
	char pad_10[2];  // 0xA(0x2)

}; 
// ScriptStruct Engine.NameCurve
// Size: 0x78(Inherited: 0x68) 
struct FNameCurve : public FIndexedCurve
{
	struct TArray<struct FNameCurveKey> Keys;  // 0x68(0x10)

}; 
// Function Engine.KismetSystemLibrary.FlushPersistentDebugLines
// Size: 0x8(Inherited: 0x0) 
struct FFlushPersistentDebugLines
{
	struct UObject* WorldContextObject;  // 0x0(0x8)

}; 
// Function Engine.KismetSystemLibrary.GetClassFromPrimaryAssetId
// Size: 0x18(Inherited: 0x0) 
struct FGetClassFromPrimaryAssetId
{
	struct FPrimaryAssetId PrimaryAssetId;  // 0x0(0x10)
	UObject* ReturnValue;  // 0x10(0x8)

}; 
// Function Engine.PrimitiveComponent.IsGravityEnabled
// Size: 0x1(Inherited: 0x0) 
struct FIsGravityEnabled
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.KismetSystemLibrary.SetClassPropertyByName
// Size: 0x18(Inherited: 0x0) 
struct FSetClassPropertyByName
{
	struct UObject* Object;  // 0x0(0x8)
	struct FName PropertyName;  // 0x8(0x8)
	UObject* Value;  // 0x10(0x8)

}; 
// Function Engine.KismetSystemLibrary.SetTransformPropertyByName
// Size: 0x40(Inherited: 0x0) 
struct FSetTransformPropertyByName
{
	struct UObject* Object;  // 0x0(0x8)
	struct FName PropertyName;  // 0x8(0x8)
	struct FTransform Value;  // 0x10(0x30)

}; 
// Function Engine.Actor.GetComponentsByTag
// Size: 0x20(Inherited: 0x0) 
struct FGetComponentsByTag
{
	UActorComponent* ComponentClass;  // 0x0(0x8)
	struct FName Tag;  // 0x8(0x8)
	struct TArray<struct UActorComponent*> ReturnValue;  // 0x10(0x10)

}; 
// Function Engine.SkeletalMeshComponent.K2_GetClosestPointOnPhysicsAsset
// Size: 0x34(Inherited: 0x0) 
struct FK2_GetClosestPointOnPhysicsAsset
{
	struct FVector WorldPosition;  // 0x0(0xC)
	struct FVector ClosestWorldPosition;  // 0xC(0xC)
	struct FVector Normal;  // 0x18(0xC)
	struct FName BoneName;  // 0x24(0x8)
	float Distance;  // 0x2C(0x4)
	char pad_48_1 : 7;  // 0x30(0x1)
	bool ReturnValue : 1;  // 0x30(0x1)
	char pad_49[3];  // 0x31(0x3)

}; 
// ScriptStruct Engine.BlueprintInputActionDelegateBinding
// Size: 0x18(Inherited: 0x4) 
struct FBlueprintInputActionDelegateBinding : public FBlueprintInputDelegateBinding
{
	struct FName InputActionName;  // 0x4(0x8)
	char EInputEvent InputKeyEvent;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)
	struct FName FunctionNameToBind;  // 0x10(0x8)

}; 
// Function Engine.KismetSystemLibrary.GetAdIDCount
// Size: 0x4(Inherited: 0x0) 
struct FGetAdIDCount
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function Engine.KismetMathLibrary.EqualEqual_ByteByte
// Size: 0x3(Inherited: 0x0) 
struct FEqualEqual_ByteByte
{
	char A;  // 0x0(0x1)
	char B;  // 0x1(0x1)
	char pad_2_1 : 7;  // 0x2(0x1)
	bool ReturnValue : 1;  // 0x2(0x1)

}; 
// Function Engine.ExponentialHeightFogComponent.SetFullyDirectionalInscatteringColorDistance
// Size: 0x4(Inherited: 0x0) 
struct FSetFullyDirectionalInscatteringColorDistance
{
	float Value;  // 0x0(0x4)

}; 
// Function Engine.KismetSystemLibrary.GetCommandLine
// Size: 0x10(Inherited: 0x0) 
struct FGetCommandLine
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.Controller.ReceiveUnPossess
// Size: 0x8(Inherited: 0x0) 
struct FReceiveUnPossess
{
	struct APawn* UnpossessedPawn;  // 0x0(0x8)

}; 
// Function Engine.KismetSystemLibrary.GetComponentBounds
// Size: 0x28(Inherited: 0x0) 
struct FGetComponentBounds
{
	struct USceneComponent* Component;  // 0x0(0x8)
	struct FVector Origin;  // 0x8(0xC)
	struct FVector BoxExtent;  // 0x14(0xC)
	float SphereRadius;  // 0x20(0x4)
	char pad_36[4];  // 0x24(0x4)

}; 
// Function Engine.KismetSystemLibrary.IsSplitScreen
// Size: 0x10(Inherited: 0x0) 
struct FIsSplitScreen
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function Engine.KismetSystemLibrary.GetConsoleVariableFloatValue
// Size: 0x18(Inherited: 0x0) 
struct FGetConsoleVariableFloatValue
{
	struct FString VariableName;  // 0x0(0x10)
	float ReturnValue;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function Engine.KismetMathLibrary.BreakRotIntoAxes
// Size: 0x30(Inherited: 0x0) 
struct FBreakRotIntoAxes
{
	struct FRotator InRot;  // 0x0(0xC)
	struct FVector X;  // 0xC(0xC)
	struct FVector Y;  // 0x18(0xC)
	struct FVector Z;  // 0x24(0xC)

}; 
// Function Engine.InputSettings.RemoveAxisMapping
// Size: 0x30(Inherited: 0x0) 
struct FRemoveAxisMapping
{
	struct FInputAxisKeyMapping KeyMapping;  // 0x0(0x28)
	char pad_40_1 : 7;  // 0x28(0x1)
	bool bForceRebuildKeymaps : 1;  // 0x28(0x1)
	char pad_41[7];  // 0x29(0x7)

}; 
// Function Engine.DataTableFunctionLibrary.GetDataTableColumnAsString
// Size: 0x20(Inherited: 0x0) 
struct FGetDataTableColumnAsString
{
	struct UDataTable* DataTable;  // 0x0(0x8)
	struct FName PropertyName;  // 0x8(0x8)
	struct TArray<struct FString> ReturnValue;  // 0x10(0x10)

}; 
// ScriptStruct Engine.VirtualBone
// Size: 0x18(Inherited: 0x0) 
struct FVirtualBone
{
	struct FName SourceBoneName;  // 0x0(0x8)
	struct FName TargetBoneName;  // 0x8(0x8)
	struct FName VirtualBoneName;  // 0x10(0x8)

}; 
// Function Engine.Actor.IsChildActor
// Size: 0x1(Inherited: 0x0) 
struct FIsChildActor
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.KismetSystemLibrary.GetDefaultLanguage
// Size: 0x10(Inherited: 0x0) 
struct FGetDefaultLanguage
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// ScriptStruct Engine.SkeletalMeshSamplingRegion
// Size: 0x30(Inherited: 0x0) 
struct FSkeletalMeshSamplingRegion
{
	struct FName Name;  // 0x0(0x8)
	int32_t LODIndex;  // 0x8(0x4)
	char bSupportUniformlyDistributedSampling : 1;  // 0xC(0x1)
	char pad_12_1 : 7;  // 0xC(0x1)
	char pad_13[4];  // 0xD(0x4)
	struct TArray<struct FSkeletalMeshSamplingRegionMaterialFilter> MaterialFilters;  // 0x10(0x10)
	struct TArray<struct FSkeletalMeshSamplingRegionBoneFilter> BoneFilters;  // 0x20(0x10)

}; 
// Function Engine.KismetMathLibrary.Conv_IntToByte
// Size: 0x8(Inherited: 0x0) 
struct FConv_IntToByte
{
	int32_t inInt;  // 0x0(0x4)
	char ReturnValue;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)

}; 
// Function Engine.KismetSystemLibrary.SetSoftClassPropertyByName
// Size: 0x38(Inherited: 0x0) 
struct FSetSoftClassPropertyByName
{
	struct UObject* Object;  // 0x0(0x8)
	struct FName PropertyName;  // 0x8(0x8)
	struct TSoftClassPtr<UObject> Value;  // 0x10(0x28)

}; 
// Function Engine.KismetMathLibrary.DynamicWeightedMovingAverage_FVector
// Size: 0x30(Inherited: 0x0) 
struct FDynamicWeightedMovingAverage_FVector
{
	struct FVector CurrentSample;  // 0x0(0xC)
	struct FVector PreviousSample;  // 0xC(0xC)
	float MaxDistance;  // 0x18(0x4)
	float MinWeight;  // 0x1C(0x4)
	float MaxWeight;  // 0x20(0x4)
	struct FVector ReturnValue;  // 0x24(0xC)

}; 
// Function Engine.PlayerController.GetInputMouseDelta
// Size: 0x8(Inherited: 0x0) 
struct FGetInputMouseDelta
{
	float DeltaX;  // 0x0(0x4)
	float DeltaY;  // 0x4(0x4)

}; 
// Function Engine.KismetInputLibrary.Key_GetNavigationActionFromKey
// Size: 0x40(Inherited: 0x0) 
struct FKey_GetNavigationActionFromKey
{
	struct FKeyEvent InKeyEvent;  // 0x0(0x38)
	uint8_t  ReturnValue;  // 0x38(0x1)
	char pad_57[7];  // 0x39(0x7)

}; 
// Function Engine.KismetSystemLibrary.GetDefaultLocale
// Size: 0x10(Inherited: 0x0) 
struct FGetDefaultLocale
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.SplineComponent.AddPoint
// Size: 0x48(Inherited: 0x0) 
struct FAddPoint
{
	struct FSplinePoint Point;  // 0x0(0x44)
	char pad_68_1 : 7;  // 0x44(0x1)
	bool bUpdateSpline : 1;  // 0x44(0x1)
	char pad_69[3];  // 0x45(0x3)

}; 
// Function Engine.AudioComponent.GetCookedEnvelopeData
// Size: 0x8(Inherited: 0x0) 
struct FGetCookedEnvelopeData
{
	float OutEnvelopeData;  // 0x0(0x4)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool ReturnValue : 1;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)

}; 
// Function Engine.AudioComponent.GetCookedEnvelopeDataForAllPlayingSounds
// Size: 0x18(Inherited: 0x0) 
struct FGetCookedEnvelopeDataForAllPlayingSounds
{
	struct TArray<struct FSoundWaveEnvelopeDataPerSound> OutEnvelopeData;  // 0x0(0x10)
	char pad_16_1 : 7;  // 0x10(0x1)
	bool ReturnValue : 1;  // 0x10(0x1)
	char pad_17[7];  // 0x11(0x7)

}; 
// Function Engine.KismetSystemLibrary.GetPlatformUserName
// Size: 0x10(Inherited: 0x0) 
struct FGetPlatformUserName
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.Actor.GetHorizontalDotProductTo
// Size: 0x10(Inherited: 0x0) 
struct FGetHorizontalDotProductTo
{
	struct AActor* OtherActor;  // 0x0(0x8)
	float ReturnValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function Engine.KismetRenderingLibrary.ReadRenderTargetPixel
// Size: 0x20(Inherited: 0x0) 
struct FReadRenderTargetPixel
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct UTextureRenderTarget2D* TextureRenderTarget;  // 0x8(0x8)
	int32_t X;  // 0x10(0x4)
	int32_t Y;  // 0x14(0x4)
	struct FColor ReturnValue;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)

}; 
// Function Engine.KismetSystemLibrary.GetDeviceId
// Size: 0x10(Inherited: 0x0) 
struct FGetDeviceId
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// ScriptStruct Engine.DebugTextInfo
// Size: 0x60(Inherited: 0x0) 
struct FDebugTextInfo
{
	struct AActor* SrcActor;  // 0x0(0x8)
	struct FVector SrcActorOffset;  // 0x8(0xC)
	struct FVector SrcActorDesiredOffset;  // 0x14(0xC)
	struct FString DebugText;  // 0x20(0x10)
	float TimeRemaining;  // 0x30(0x4)
	float Duration;  // 0x34(0x4)
	struct FColor TextColor;  // 0x38(0x4)
	char bAbsoluteLocation : 1;  // 0x3C(0x1)
	char bKeepAttachedToActor : 1;  // 0x3C(0x1)
	char bDrawShadow : 1;  // 0x3C(0x1)
	char pad_60_1 : 5;  // 0x3C(0x1)
	char pad_61[4];  // 0x3D(0x4)
	struct FVector OrigActorLocation;  // 0x40(0xC)
	char pad_76[4];  // 0x4C(0x4)
	struct UFont* Font;  // 0x50(0x8)
	float FontScale;  // 0x58(0x4)
	char pad_92[4];  // 0x5C(0x4)

}; 
// Function Engine.SkeletalMeshComponent.SetAllBodiesBelowPhysicsBlendWeight
// Size: 0x10(Inherited: 0x0) 
struct FSetAllBodiesBelowPhysicsBlendWeight
{
	struct FName InBoneName;  // 0x0(0x8)
	float PhysicsBlendWeight;  // 0x8(0x4)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool bSkipCustomPhysicsType : 1;  // 0xC(0x1)
	char pad_13_1 : 7;  // 0xD(0x1)
	bool bIncludeSelf : 1;  // 0xD(0x1)
	char pad_14[2];  // 0xE(0x2)

}; 
// ScriptStruct Engine.CollisionResponseContainer
// Size: 0x20(Inherited: 0x0) 
struct FCollisionResponseContainer
{
	char ECollisionResponse WorldStatic;  // 0x0(0x1)
	char ECollisionResponse WorldDynamic;  // 0x1(0x1)
	char ECollisionResponse Pawn;  // 0x2(0x1)
	char ECollisionResponse Visibility;  // 0x3(0x1)
	char ECollisionResponse Camera;  // 0x4(0x1)
	char ECollisionResponse PhysicsBody;  // 0x5(0x1)
	char ECollisionResponse Vehicle;  // 0x6(0x1)
	char ECollisionResponse Destructible;  // 0x7(0x1)
	char ECollisionResponse EngineTraceChannel1;  // 0x8(0x1)
	char ECollisionResponse EngineTraceChannel2;  // 0x9(0x1)
	char ECollisionResponse EngineTraceChannel3;  // 0xA(0x1)
	char ECollisionResponse EngineTraceChannel4;  // 0xB(0x1)
	char ECollisionResponse EngineTraceChannel5;  // 0xC(0x1)
	char ECollisionResponse EngineTraceChannel6;  // 0xD(0x1)
	char ECollisionResponse GameTraceChannel1;  // 0xE(0x1)
	char ECollisionResponse GameTraceChannel2;  // 0xF(0x1)
	char ECollisionResponse GameTraceChannel3;  // 0x10(0x1)
	char ECollisionResponse GameTraceChannel4;  // 0x11(0x1)
	char ECollisionResponse GameTraceChannel5;  // 0x12(0x1)
	char ECollisionResponse GameTraceChannel6;  // 0x13(0x1)
	char ECollisionResponse GameTraceChannel7;  // 0x14(0x1)
	char ECollisionResponse GameTraceChannel8;  // 0x15(0x1)
	char ECollisionResponse GameTraceChannel9;  // 0x16(0x1)
	char ECollisionResponse GameTraceChannel10;  // 0x17(0x1)
	char ECollisionResponse GameTraceChannel11;  // 0x18(0x1)
	char ECollisionResponse GameTraceChannel12;  // 0x19(0x1)
	char ECollisionResponse GameTraceChannel13;  // 0x1A(0x1)
	char ECollisionResponse GameTraceChannel14;  // 0x1B(0x1)
	char ECollisionResponse GameTraceChannel15;  // 0x1C(0x1)
	char ECollisionResponse GameTraceChannel16;  // 0x1D(0x1)
	char ECollisionResponse GameTraceChannel17;  // 0x1E(0x1)
	char ECollisionResponse GameTraceChannel18;  // 0x1F(0x1)

}; 
// Function Engine.KismetSystemLibrary.GetEngineVersion
// Size: 0x10(Inherited: 0x0) 
struct FGetEngineVersion
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.KismetSystemLibrary.GetFrameCount
// Size: 0x8(Inherited: 0x0) 
struct FGetFrameCount
{
	int64_t ReturnValue;  // 0x0(0x8)

}; 
// ScriptStruct Engine.ToggleTrackKey
// Size: 0x8(Inherited: 0x0) 
struct FToggleTrackKey
{
	float Time;  // 0x0(0x4)
	char ETrackToggleAction ToggleAction;  // 0x4(0x1)
	char pad_5[3];  // 0x5(0x3)

}; 
// Function Engine.TimecodeProvider.GetDelayedTimecode
// Size: 0x14(Inherited: 0x0) 
struct FGetDelayedTimecode
{
	struct FTimecode ReturnValue;  // 0x0(0x14)

}; 
// Function Engine.KismetSystemLibrary.IsValidPrimaryAssetType
// Size: 0xC(Inherited: 0x0) 
struct FIsValidPrimaryAssetType
{
	struct FPrimaryAssetType PrimaryAssetType;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)

}; 
// ScriptStruct Engine.TrackToSkeletonMap
// Size: 0x4(Inherited: 0x0) 
struct FTrackToSkeletonMap
{
	int32_t BoneTreeIndex;  // 0x0(0x4)

}; 
// Function Engine.KismetSystemLibrary.GetGamepadButtonGlyph
// Size: 0x20(Inherited: 0x0) 
struct FGetGamepadButtonGlyph
{
	struct FString ButtonKey;  // 0x0(0x10)
	int32_t ControllerIndex;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)
	struct UTexture2D* ReturnValue;  // 0x18(0x8)

}; 
// Function Engine.CameraComponent.SetFieldOfView
// Size: 0x4(Inherited: 0x0) 
struct FSetFieldOfView
{
	float InFieldOfView;  // 0x0(0x4)

}; 
// Function Engine.KismetSystemLibrary.NotEqual_SoftObjectReference
// Size: 0x58(Inherited: 0x0) 
struct FNotEqual_SoftObjectReference
{
	struct TSoftObjectPtr<UObject> A;  // 0x0(0x28)
	struct TSoftObjectPtr<UObject> B;  // 0x28(0x28)
	char pad_80_1 : 7;  // 0x50(0x1)
	bool ReturnValue : 1;  // 0x50(0x1)
	char pad_81[7];  // 0x51(0x7)

}; 
// Function Engine.StaticMesh.GetNumLODs
// Size: 0x4(Inherited: 0x0) 
struct FGetNumLODs
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function Engine.KismetSystemLibrary.K2_GetTimerRemainingTime
// Size: 0x20(Inherited: 0x0) 
struct FK2_GetTimerRemainingTime
{
	struct UObject* Object;  // 0x0(0x8)
	struct FString FunctionName;  // 0x8(0x10)
	float ReturnValue;  // 0x18(0x4)
	char pad_28[4];  // 0x1C(0x4)

}; 
// Function Engine.KismetSystemLibrary.GetGamepadControllerName
// Size: 0x18(Inherited: 0x0) 
struct FGetGamepadControllerName
{
	int32_t ControllerId;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct FString ReturnValue;  // 0x8(0x10)

}; 
// Function Engine.BlueprintPathsLibrary.GetPath
// Size: 0x20(Inherited: 0x0) 
struct FGetPath
{
	struct FString InPath;  // 0x0(0x10)
	struct FString ReturnValue;  // 0x10(0x10)

}; 
// Function Engine.KismetSystemLibrary.GetGameTimeInSeconds
// Size: 0x10(Inherited: 0x0) 
struct FGetGameTimeInSeconds
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	float ReturnValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function Engine.KismetSystemLibrary.GetPrimaryAssetIdFromClass
// Size: 0x18(Inherited: 0x0) 
struct FGetPrimaryAssetIdFromClass
{
	UObject* Class;  // 0x0(0x8)
	struct FPrimaryAssetId ReturnValue;  // 0x8(0x10)

}; 
// Function Engine.SceneComponent.GetChildrenComponents
// Size: 0x18(Inherited: 0x0) 
struct FGetChildrenComponents
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bIncludeAllDescendants : 1;  // 0x0(0x1)
	char pad_1[7];  // 0x1(0x7)
	struct TArray<struct USceneComponent*> Children;  // 0x8(0x10)

}; 
// Function Engine.KismetSystemLibrary.GetLocalCurrencyCode
// Size: 0x10(Inherited: 0x0) 
struct FGetLocalCurrencyCode
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// ScriptStruct Engine.IntegralKey
// Size: 0x8(Inherited: 0x0) 
struct FIntegralKey
{
	float Time;  // 0x0(0x4)
	int32_t Value;  // 0x4(0x4)

}; 
// Function Engine.KismetMathLibrary.Matrix_TransformPosition
// Size: 0x60(Inherited: 0x0) 
struct FMatrix_TransformPosition
{
	struct FMatrix M;  // 0x0(0x40)
	struct FVector V;  // 0x40(0xC)
	char pad_76[4];  // 0x4C(0x4)
	struct FVector4 ReturnValue;  // 0x50(0x10)

}; 
// Function Engine.GameplayStatics.GrassOverlappingSphereCount
// Size: 0x28(Inherited: 0x0) 
struct FGrassOverlappingSphereCount
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	struct UStaticMesh* StaticMesh;  // 0x8(0x8)
	struct FVector CenterPosition;  // 0x10(0xC)
	float Radius;  // 0x1C(0x4)
	int32_t ReturnValue;  // 0x20(0x4)
	char pad_36[4];  // 0x24(0x4)

}; 
// ScriptStruct Engine.AudioReverbEffect
// Size: 0x48(Inherited: 0x8) 
struct FAudioReverbEffect : public FAudioEffectParameters
{
	char pad_8[64];  // 0x8(0x40)

}; 
// Function Engine.PrimitiveComponent.AddForceAtLocation
// Size: 0x20(Inherited: 0x0) 
struct FAddForceAtLocation
{
	struct FVector force;  // 0x0(0xC)
	struct FVector Location;  // 0xC(0xC)
	struct FName BoneName;  // 0x18(0x8)

}; 
// Function Engine.KismetSystemLibrary.GetLocalCurrencySymbol
// Size: 0x10(Inherited: 0x0) 
struct FGetLocalCurrencySymbol
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.Actor.GetTransform
// Size: 0x30(Inherited: 0x0) 
struct FGetTransform
{
	struct FTransform ReturnValue;  // 0x0(0x30)

}; 
// Function Engine.PrimitiveComponent.GetCenterOfMass
// Size: 0x14(Inherited: 0x0) 
struct FGetCenterOfMass
{
	struct FName BoneName;  // 0x0(0x8)
	struct FVector ReturnValue;  // 0x8(0xC)

}; 
// Function Engine.PlayerController.ClientPrestreamTextures
// Size: 0x18(Inherited: 0x0) 
struct FClientPrestreamTextures
{
	struct AActor* ForcedActor;  // 0x0(0x8)
	float ForceDuration;  // 0x8(0x4)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool bEnableStreaming : 1;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)
	int32_t CinematicTextureGroups;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)

}; 
// Function Engine.KismetSystemLibrary.GetMinYResolutionFor3DView
// Size: 0x4(Inherited: 0x0) 
struct FGetMinYResolutionFor3DView
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function Engine.PrimitiveComponent.GetAngularDamping
// Size: 0x4(Inherited: 0x0) 
struct FGetAngularDamping
{
	float ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct Engine.MeshSectionInfo
// Size: 0x8(Inherited: 0x0) 
struct FMeshSectionInfo
{
	int32_t MaterialIndex;  // 0x0(0x4)
	char pad_4_1 : 7;  // 0x4(0x1)
	bool bEnableCollision : 1;  // 0x4(0x1)
	char pad_5_1 : 7;  // 0x5(0x1)
	bool bCastShadow : 1;  // 0x5(0x1)
	char pad_6_1 : 7;  // 0x6(0x1)
	bool bVisibleInRayTracing : 1;  // 0x6(0x1)
	char pad_7_1 : 7;  // 0x7(0x1)
	bool bForceOpaque : 1;  // 0x7(0x1)

}; 
// Function Engine.KismetMathLibrary.Less_IntInt
// Size: 0xC(Inherited: 0x0) 
struct FLess_IntInt
{
	int32_t A;  // 0x0(0x4)
	int32_t B;  // 0x4(0x4)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)

}; 
// Function Engine.KismetSystemLibrary.GetMinYResolutionForUI
// Size: 0x4(Inherited: 0x0) 
struct FGetMinYResolutionForUI
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function Engine.SkeletalMeshComponent.GetDisablePostProcessBlueprint
// Size: 0x1(Inherited: 0x0) 
struct FGetDisablePostProcessBlueprint
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.KismetSystemLibrary.GetObjectFromPrimaryAssetId
// Size: 0x18(Inherited: 0x0) 
struct FGetObjectFromPrimaryAssetId
{
	struct FPrimaryAssetId PrimaryAssetId;  // 0x0(0x10)
	struct UObject* ReturnValue;  // 0x10(0x8)

}; 
// Function Engine.KismetSystemLibrary.SetWindowTitle
// Size: 0x18(Inherited: 0x0) 
struct FSetWindowTitle
{
	struct FText Title;  // 0x0(0x18)

}; 
// Function Engine.KismetSystemLibrary.GetOuterObject
// Size: 0x10(Inherited: 0x0) 
struct FGetOuterObject
{
	struct UObject* Object;  // 0x0(0x8)
	struct UObject* ReturnValue;  // 0x8(0x8)

}; 
// ScriptStruct Engine.ScreenMessageString
// Size: 0x30(Inherited: 0x0) 
struct FScreenMessageString
{
	uint64_t Key;  // 0x0(0x8)
	struct FString ScreenMessage;  // 0x8(0x10)
	struct FColor DisplayColor;  // 0x18(0x4)
	float TimeToDisplay;  // 0x1C(0x4)
	float CurrentTimeDisplayed;  // 0x20(0x4)
	struct FVector2D TextScale;  // 0x24(0x8)
	char pad_44[4];  // 0x2C(0x4)

}; 
// Function Engine.ParticleSystemComponent.GetBeamSourcePoint
// Size: 0x18(Inherited: 0x0) 
struct FGetBeamSourcePoint
{
	int32_t EmitterIndex;  // 0x0(0x4)
	int32_t SourceIndex;  // 0x4(0x4)
	struct FVector OutSourcePoint;  // 0x8(0xC)
	char pad_20_1 : 7;  // 0x14(0x1)
	bool ReturnValue : 1;  // 0x14(0x1)
	char pad_21[3];  // 0x15(0x3)

}; 
// ScriptStruct Engine.AtmospherePrecomputeInstanceData
// Size: 0x160(Inherited: 0xB8) 
struct FAtmospherePrecomputeInstanceData : public FSceneComponentInstanceData
{
	char pad_184[168];  // 0xB8(0xA8)

}; 
// Function Engine.KismetMathLibrary.Vector4_Zero
// Size: 0x10(Inherited: 0x0) 
struct FVector4_Zero
{
	struct FVector4 ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.Actor.GetLifeSpan
// Size: 0x4(Inherited: 0x0) 
struct FGetLifeSpan
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function Engine.KismetSystemLibrary.GetPathName
// Size: 0x18(Inherited: 0x0) 
struct FGetPathName
{
	struct UObject* Object;  // 0x0(0x8)
	struct FString ReturnValue;  // 0x8(0x10)

}; 
// Function Engine.SkinnedMeshComponent.ClearSkinWeightOverride
// Size: 0x4(Inherited: 0x0) 
struct FClearSkinWeightOverride
{
	int32_t LODIndex;  // 0x0(0x4)

}; 
// Function Engine.KismetInputLibrary.PointerEvent_GetTouchpadIndex
// Size: 0x78(Inherited: 0x0) 
struct FPointerEvent_GetTouchpadIndex
{
	struct FPointerEvent Input;  // 0x0(0x70)
	int32_t ReturnValue;  // 0x70(0x4)
	char pad_116[4];  // 0x74(0x4)

}; 
// Function Engine.SceneComponent.K2_AddWorldOffset
// Size: 0x9C(Inherited: 0x0) 
struct FK2_AddWorldOffset
{
	struct FVector DeltaLocation;  // 0x0(0xC)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool bSweep : 1;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)
	struct FHitResult SweepHitResult;  // 0x10(0x88)
	char pad_152_1 : 7;  // 0x98(0x1)
	bool bTeleport : 1;  // 0x98(0x1)
	char pad_153[3];  // 0x99(0x3)

}; 
// Function Engine.SkeletalMeshComponent.SetAllMotorsAngularVelocityDrive
// Size: 0x3(Inherited: 0x0) 
struct FSetAllMotorsAngularVelocityDrive
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bEnableSwingDrive : 1;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool bEnableTwistDrive : 1;  // 0x1(0x1)
	char pad_2_1 : 7;  // 0x2(0x1)
	bool bSkipCustomPhysicsType : 1;  // 0x2(0x1)

}; 
// Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreComponents
// Size: 0x10(Inherited: 0x0) 
struct FCopyArrayOfMoveIgnoreComponents
{
	struct TArray<struct UPrimitiveComponent*> ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.Actor.K2_AddActorLocalOffset
// Size: 0x9C(Inherited: 0x0) 
struct FK2_AddActorLocalOffset
{
	struct FVector DeltaLocation;  // 0x0(0xC)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool bSweep : 1;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)
	struct FHitResult SweepHitResult;  // 0x10(0x88)
	char pad_152_1 : 7;  // 0x98(0x1)
	bool bTeleport : 1;  // 0x98(0x1)
	char pad_153[3];  // 0x99(0x3)

}; 
// Function Engine.KismetSystemLibrary.GetPrimaryAssetIdFromObject
// Size: 0x18(Inherited: 0x0) 
struct FGetPrimaryAssetIdFromObject
{
	struct UObject* Object;  // 0x0(0x8)
	struct FPrimaryAssetId ReturnValue;  // 0x8(0x10)

}; 
// Function Engine.KismetSystemLibrary.SetSuppressViewportTransitionMessage
// Size: 0x10(Inherited: 0x0) 
struct FSetSuppressViewportTransitionMessage
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool bState : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function Engine.GameplayStatics.GetAccurateRealTime
// Size: 0x8(Inherited: 0x0) 
struct FGetAccurateRealTime
{
	int32_t Seconds;  // 0x0(0x4)
	float PartialSeconds;  // 0x4(0x4)

}; 
// Function Engine.SplineComponent.GetWorldLocationAtSplinePoint
// Size: 0x10(Inherited: 0x0) 
struct FGetWorldLocationAtSplinePoint
{
	int32_t PointIndex;  // 0x0(0x4)
	struct FVector ReturnValue;  // 0x4(0xC)

}; 
// Function Engine.GameplayStatics.GetPlayerPawn
// Size: 0x18(Inherited: 0x0) 
struct FGetPlayerPawn
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	int32_t PlayerIndex;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)
	struct APawn* ReturnValue;  // 0x10(0x8)

}; 
// Function Engine.AnimSingleNodeInstance.SetPositionWithPreviousTime
// Size: 0xC(Inherited: 0x0) 
struct FSetPositionWithPreviousTime
{
	float InPosition;  // 0x0(0x4)
	float InPreviousTime;  // 0x4(0x4)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool bFireNotifies : 1;  // 0x8(0x1)
	char pad_9[3];  // 0x9(0x3)

}; 
// Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector2
// Size: 0xC(Inherited: 0x0) 
struct FSetCustomPrimitiveDataVector2
{
	int32_t DataIndex;  // 0x0(0x4)
	struct FVector2D Value;  // 0x4(0x8)

}; 
// Function Engine.PlayerController.ServerAcknowledgePossession
// Size: 0x8(Inherited: 0x0) 
struct FServerAcknowledgePossession
{
	struct APawn* P;  // 0x0(0x8)

}; 
// Function Engine.KismetSystemLibrary.GetPrimaryAssetIdList
// Size: 0x18(Inherited: 0x0) 
struct FGetPrimaryAssetIdList
{
	struct FPrimaryAssetType PrimaryAssetType;  // 0x0(0x8)
	struct TArray<struct FPrimaryAssetId> OutPrimaryAssetIdList;  // 0x8(0x10)

}; 
// ScriptStruct Engine.RootMotionMovementParams
// Size: 0x40(Inherited: 0x0) 
struct FRootMotionMovementParams
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bHasRootMotion : 1;  // 0x0(0x1)
	char pad_1[3];  // 0x1(0x3)
	float BlendWeight;  // 0x4(0x4)
	char pad_8[8];  // 0x8(0x8)
	struct FTransform RootMotionTransform;  // 0x10(0x30)

}; 
// ScriptStruct Engine.BlueprintInputDelegateBinding
// Size: 0x4(Inherited: 0x0) 
struct FBlueprintInputDelegateBinding
{
	char bConsumeInput : 1;  // 0x0(0x1)
	char bExecuteWhenPaused : 1;  // 0x0(0x1)
	char bOverrideParentBinding : 1;  // 0x0(0x1)
	char pad_0_1 : 5;  // 0x0(0x1)
	char pad_1[4];  // 0x1(0x4)

}; 
// ScriptStruct Engine.CollisionResponse
// Size: 0x30(Inherited: 0x0) 
struct FCollisionResponse
{
	struct FCollisionResponseContainer ResponseToChannels;  // 0x0(0x20)
	struct TArray<struct FResponseChannel> ResponseArray;  // 0x20(0x10)

}; 
// Function Engine.GameplayStatics.EnableLiveStreaming
// Size: 0x1(Inherited: 0x0) 
struct FEnableLiveStreaming
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool Enable : 1;  // 0x0(0x1)

}; 
// Function Engine.Actor.GetActorTickInterval
// Size: 0x4(Inherited: 0x0) 
struct FGetActorTickInterval
{
	float ReturnValue;  // 0x0(0x4)

}; 
// ScriptStruct Engine.ComponentSpacePoseLink
// Size: 0x10(Inherited: 0x10) 
struct FComponentSpacePoseLink : public FPoseLinkBase
{

}; 
// Function Engine.KismetSystemLibrary.GetProjectContentDirectory
// Size: 0x10(Inherited: 0x0) 
struct FGetProjectContentDirectory
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.KismetSystemLibrary.GetRenderingDetailMode
// Size: 0x4(Inherited: 0x0) 
struct FGetRenderingDetailMode
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function Engine.KismetSystemLibrary.GetRenderingMaterialQualityLevel
// Size: 0x4(Inherited: 0x0) 
struct FGetRenderingMaterialQualityLevel
{
	int32_t ReturnValue;  // 0x0(0x4)

}; 
// Function Engine.SceneComponent.GetAllSocketNames
// Size: 0x10(Inherited: 0x0) 
struct FGetAllSocketNames
{
	struct TArray<struct FName> ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.KismetSystemLibrary.GetSoftClassReferenceFromPrimaryAssetId
// Size: 0x38(Inherited: 0x0) 
struct FGetSoftClassReferenceFromPrimaryAssetId
{
	struct FPrimaryAssetId PrimaryAssetId;  // 0x0(0x10)
	struct TSoftClassPtr<UObject> ReturnValue;  // 0x10(0x28)

}; 
// Function Engine.PlayerController.ClientRetryClientRestart
// Size: 0x8(Inherited: 0x0) 
struct FClientRetryClientRestart
{
	struct APawn* NewPawn;  // 0x0(0x8)

}; 
// Function Engine.GameUserSettings.SetAudioQualityLevel
// Size: 0x4(Inherited: 0x0) 
struct FSetAudioQualityLevel
{
	int32_t QualityLevel;  // 0x0(0x4)

}; 
// Function Engine.KismetSystemLibrary.GetSoftObjectReferenceFromPrimaryAssetId
// Size: 0x38(Inherited: 0x0) 
struct FGetSoftObjectReferenceFromPrimaryAssetId
{
	struct FPrimaryAssetId PrimaryAssetId;  // 0x0(0x10)
	struct TSoftObjectPtr<UObject> ReturnValue;  // 0x10(0x28)

}; 
// Function Engine.GameUserSettings.GetFrameRateLimit
// Size: 0x4(Inherited: 0x0) 
struct FGetFrameRateLimit
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function Engine.Actor.DetachRootComponentFromParent
// Size: 0x1(Inherited: 0x0) 
struct FDetachRootComponentFromParent
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool bMaintainWorldPosition : 1;  // 0x0(0x1)

}; 
// ScriptStruct Engine.FontImportOptionsData
// Size: 0xB0(Inherited: 0x0) 
struct FFontImportOptionsData
{
	struct FString FontName;  // 0x0(0x10)
	float Height;  // 0x10(0x4)
	char bEnableAntialiasing : 1;  // 0x14(0x1)
	char bEnableBold : 1;  // 0x14(0x1)
	char bEnableItalic : 1;  // 0x14(0x1)
	char bEnableUnderline : 1;  // 0x14(0x1)
	char bAlphaOnly : 1;  // 0x14(0x1)
	char pad_20_1 : 3;  // 0x14(0x1)
	char pad_21[4];  // 0x15(0x4)
	char EFontImportCharacterSet CharacterSet;  // 0x18(0x1)
	char pad_25[7];  // 0x19(0x7)
	struct FString Chars;  // 0x20(0x10)
	struct FString UnicodeRange;  // 0x30(0x10)
	struct FString CharsFilePath;  // 0x40(0x10)
	struct FString CharsFileWildcard;  // 0x50(0x10)
	char bCreatePrintableOnly : 1;  // 0x60(0x1)
	char bIncludeASCIIRange : 1;  // 0x60(0x1)
	char pad_96_1 : 6;  // 0x60(0x1)
	char pad_97[4];  // 0x61(0x4)
	struct FLinearColor ForegroundColor;  // 0x64(0x10)
	char bEnableDropShadow : 1;  // 0x74(0x1)
	char pad_116_1 : 7;  // 0x74(0x1)
	char pad_117[4];  // 0x75(0x4)
	int32_t TexturePageWidth;  // 0x78(0x4)
	int32_t TexturePageMaxHeight;  // 0x7C(0x4)
	int32_t XPadding;  // 0x80(0x4)
	int32_t YPadding;  // 0x84(0x4)
	int32_t ExtendBoxTop;  // 0x88(0x4)
	int32_t ExtendBoxBottom;  // 0x8C(0x4)
	int32_t ExtendBoxRight;  // 0x90(0x4)
	int32_t ExtendBoxLeft;  // 0x94(0x4)
	char bEnableLegacyMode : 1;  // 0x98(0x1)
	char pad_152_1 : 7;  // 0x98(0x1)
	char pad_153[4];  // 0x99(0x4)
	int32_t Kerning;  // 0x9C(0x4)
	char bUseDistanceFieldAlpha : 1;  // 0xA0(0x1)
	char pad_160_1 : 7;  // 0xA0(0x1)
	char pad_161[4];  // 0xA1(0x4)
	int32_t DistanceFieldScaleFactor;  // 0xA4(0x4)
	float DistanceFieldScanRadiusScale;  // 0xA8(0x4)
	char pad_172[4];  // 0xAC(0x4)

}; 
// Function Engine.TimelineComponent.IsLooping
// Size: 0x1(Inherited: 0x0) 
struct FIsLooping
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.Character.ClientAdjustRootMotionSourcePosition
// Size: 0x80(Inherited: 0x0) 
struct FClientAdjustRootMotionSourcePosition
{
	float Timestamp;  // 0x0(0x4)
	char pad_4[4];  // 0x4(0x4)
	struct FRootMotionSourceGroup ServerRootMotion;  // 0x8(0x38)
	char pad_64_1 : 7;  // 0x40(0x1)
	bool bHasAnimRootMotion : 1;  // 0x40(0x1)
	char pad_65[3];  // 0x41(0x3)
	float ServerMontageTrackPosition;  // 0x44(0x4)
	struct FVector ServerLoc;  // 0x48(0xC)
	struct FVector_NetQuantizeNormal ServerRotation;  // 0x54(0xC)
	float ServerVelZ;  // 0x60(0x4)
	char pad_100[4];  // 0x64(0x4)
	struct UPrimitiveComponent* ServerBase;  // 0x68(0x8)
	struct FName ServerBoneName;  // 0x70(0x8)
	char pad_120_1 : 7;  // 0x78(0x1)
	bool bHasBase : 1;  // 0x78(0x1)
	char pad_121_1 : 7;  // 0x79(0x1)
	bool bBaseRelativePosition : 1;  // 0x79(0x1)
	char ServerMovementMode;  // 0x7A(0x1)
	char pad_123[5];  // 0x7B(0x5)

}; 
// Function Engine.Character.RootMotionDebugClientPrintOnScreen
// Size: 0x10(Inherited: 0x0) 
struct FRootMotionDebugClientPrintOnScreen
{
	struct FString inString;  // 0x0(0x10)

}; 
// Function Engine.KismetSystemLibrary.GetSystemPath
// Size: 0x18(Inherited: 0x0) 
struct FGetSystemPath
{
	struct UObject* Object;  // 0x0(0x8)
	struct FString ReturnValue;  // 0x8(0x10)

}; 
// Function Engine.SkinnedMeshComponent.GetParentBone
// Size: 0x10(Inherited: 0x0) 
struct FGetParentBone
{
	struct FName BoneName;  // 0x0(0x8)
	struct FName ReturnValue;  // 0x8(0x8)

}; 
// Function Engine.KismetSystemLibrary.IsDedicatedServer
// Size: 0x10(Inherited: 0x0) 
struct FIsDedicatedServer
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function Engine.KismetSystemLibrary.IsInterstitialAdRequested
// Size: 0x1(Inherited: 0x0) 
struct FIsInterstitialAdRequested
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.LevelScriptActor.WorldOriginLocationChanged
// Size: 0x18(Inherited: 0x0) 
struct FWorldOriginLocationChanged
{
	struct FIntVector OldOriginLocation;  // 0x0(0xC)
	struct FIntVector NewOriginLocation;  // 0xC(0xC)

}; 
// ScriptStruct Engine.FloatCurve
// Size: 0x98(Inherited: 0x18) 
struct FFloatCurve : public FAnimCurveBase
{
	struct FRichCurve FloatCurve;  // 0x18(0x80)

}; 
// Function Engine.KismetSystemLibrary.IsPackagedForDistribution
// Size: 0x1(Inherited: 0x0) 
struct FIsPackagedForDistribution
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.Character.ServerMoveOld
// Size: 0x18(Inherited: 0x0) 
struct FServerMoveOld
{
	float OldTimeStamp;  // 0x0(0x4)
	struct FVector_NetQuantize10 OldAccel;  // 0x4(0xC)
	char OldMoveFlags;  // 0x10(0x1)
	char pad_17[3];  // 0x11(0x3)
	float InCrouchedHalfHeight;  // 0x14(0x4)

}; 
// Function Engine.KismetMathLibrary.Matrix_GetScaleVector
// Size: 0x50(Inherited: 0x0) 
struct FMatrix_GetScaleVector
{
	struct FMatrix M;  // 0x0(0x40)
	float Tolerance;  // 0x40(0x4)
	struct FVector ReturnValue;  // 0x44(0xC)

}; 
// Function Engine.KismetArrayLibrary.Array_RemoveItem
// Size: 0x18(Inherited: 0x0) 
struct FArray_RemoveItem
{
	struct TArray<int32_t> TargetArray;  // 0x0(0x10)
	int32_t Item;  // 0x10(0x4)
	char pad_20_1 : 7;  // 0x14(0x1)
	bool ReturnValue : 1;  // 0x14(0x1)
	char pad_21[3];  // 0x15(0x3)

}; 
// Function Engine.Actor.GetVelocity
// Size: 0xC(Inherited: 0x0) 
struct FGetVelocity
{
	struct FVector ReturnValue;  // 0x0(0xC)

}; 
// Function Engine.KismetSystemLibrary.IsLoggedIn
// Size: 0x10(Inherited: 0x0) 
struct FIsLoggedIn
{
	struct APlayerController* SpecificPlayer;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function Engine.KismetMathLibrary.ClampAxes2D
// Size: 0x18(Inherited: 0x0) 
struct FClampAxes2D
{
	struct FVector2D A;  // 0x0(0x8)
	float MinAxisVal;  // 0x8(0x4)
	float MaxAxisVal;  // 0xC(0x4)
	struct FVector2D ReturnValue;  // 0x10(0x8)

}; 
// Function Engine.Emitter.SetActorParameter
// Size: 0x10(Inherited: 0x0) 
struct FSetActorParameter
{
	struct FName ParameterName;  // 0x0(0x8)
	struct AActor* Param;  // 0x8(0x8)

}; 
// Function Engine.KismetMathLibrary.MakeRotFromYZ
// Size: 0x24(Inherited: 0x0) 
struct FMakeRotFromYZ
{
	struct FVector Y;  // 0x0(0xC)
	struct FVector Z;  // 0xC(0xC)
	struct FRotator ReturnValue;  // 0x18(0xC)

}; 
// Function Engine.PlayerController.WasInputKeyJustPressed
// Size: 0x20(Inherited: 0x0) 
struct FWasInputKeyJustPressed
{
	struct FKey Key;  // 0x0(0x18)
	char pad_24_1 : 7;  // 0x18(0x1)
	bool ReturnValue : 1;  // 0x18(0x1)
	char pad_25[7];  // 0x19(0x7)

}; 
// Function Engine.KismetSystemLibrary.IsScreensaverEnabled
// Size: 0x1(Inherited: 0x0) 
struct FIsScreensaverEnabled
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.KismetMathLibrary.GetMinute
// Size: 0x10(Inherited: 0x0) 
struct FGetMinute
{
	struct FDateTime A;  // 0x0(0x8)
	int32_t ReturnValue;  // 0x8(0x4)
	char pad_12[4];  // 0xC(0x4)

}; 
// Function Engine.KismetSystemLibrary.SetRotatorPropertyByName
// Size: 0x20(Inherited: 0x0) 
struct FSetRotatorPropertyByName
{
	struct UObject* Object;  // 0x0(0x8)
	struct FName PropertyName;  // 0x8(0x8)
	struct FRotator Value;  // 0x10(0xC)
	char pad_28[4];  // 0x1C(0x4)

}; 
// ScriptStruct Engine.SkelMeshSkinWeightInfo
// Size: 0x3C(Inherited: 0x0) 
struct FSkelMeshSkinWeightInfo
{
	int32_t Bones[c];  // 0x0(0x30)
	char Weights[c];  // 0x30(0xC)

}; 
// Function Engine.SphereComponent.GetScaledSphereRadius
// Size: 0x4(Inherited: 0x0) 
struct FGetScaledSphereRadius
{
	float ReturnValue;  // 0x0(0x4)

}; 
// Function Engine.HUD.DrawMaterialTriangle
// Size: 0x68(Inherited: 0x0) 
struct FDrawMaterialTriangle
{
	struct UMaterialInterface* Material;  // 0x0(0x8)
	struct FVector2D V0_Pos;  // 0x8(0x8)
	struct FVector2D V1_Pos;  // 0x10(0x8)
	struct FVector2D V2_Pos;  // 0x18(0x8)
	struct FVector2D V0_UV;  // 0x20(0x8)
	struct FVector2D V1_UV;  // 0x28(0x8)
	struct FVector2D V2_UV;  // 0x30(0x8)
	struct FLinearColor V0_Color;  // 0x38(0x10)
	struct FLinearColor V1_Color;  // 0x48(0x10)
	struct FLinearColor V2_Color;  // 0x58(0x10)

}; 
// Function Engine.KismetSystemLibrary.IsServer
// Size: 0x10(Inherited: 0x0) 
struct FIsServer
{
	struct UObject* WorldContextObject;  // 0x0(0x8)
	char pad_8_1 : 7;  // 0x8(0x1)
	bool ReturnValue : 1;  // 0x8(0x1)
	char pad_9[7];  // 0x9(0x7)

}; 
// Function Engine.KismetMathLibrary.Vector_UnwindEuler
// Size: 0xC(Inherited: 0x0) 
struct FVector_UnwindEuler
{
	struct FVector A;  // 0x0(0xC)

}; 
// Function Engine.KismetMathLibrary.GetAbs2D
// Size: 0x10(Inherited: 0x0) 
struct FGetAbs2D
{
	struct FVector2D A;  // 0x0(0x8)
	struct FVector2D ReturnValue;  // 0x8(0x8)

}; 
// Function Engine.CharacterMovementComponent.AddImpulse
// Size: 0x10(Inherited: 0x0) 
struct FAddImpulse
{
	struct FVector Impulse;  // 0x0(0xC)
	char pad_12_1 : 7;  // 0xC(0x1)
	bool bVelocityChange : 1;  // 0xC(0x1)
	char pad_13[3];  // 0xD(0x3)

}; 
// Function Engine.SkeletalMesh.GetMorphTargets
// Size: 0x10(Inherited: 0x0) 
struct FGetMorphTargets
{
	struct TArray<struct UMorphTarget*> ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.BlueprintPathsLibrary.FeaturePackDir
// Size: 0x10(Inherited: 0x0) 
struct FFeaturePackDir
{
	struct FString ReturnValue;  // 0x0(0x10)

}; 
// Function Engine.KismetSystemLibrary.K2_SetTimerDelegate
// Size: 0x28(Inherited: 0x0) 
struct FK2_SetTimerDelegate
{
	struct FDelegate Delegate;  // 0x0(0x10)
	float Time;  // 0x10(0x4)
	char pad_20_1 : 7;  // 0x14(0x1)
	bool bLooping : 1;  // 0x14(0x1)
	char pad_21[3];  // 0x15(0x3)
	float InitialStartDelay;  // 0x18(0x4)
	float InitialStartDelayVariance;  // 0x1C(0x4)
	struct FTimerHandle ReturnValue;  // 0x20(0x8)

}; 
// Function Engine.PrimitiveComponent.AddAngularImpulseInDegrees
// Size: 0x18(Inherited: 0x0) 
struct FAddAngularImpulseInDegrees
{
	struct FVector Impulse;  // 0x0(0xC)
	struct FName BoneName;  // 0xC(0x8)
	char pad_20_1 : 7;  // 0x14(0x1)
	bool bVelChange : 1;  // 0x14(0x1)
	char pad_21[3];  // 0x15(0x3)

}; 
// Function Engine.SkeletalMeshComponent.GetIntegerAttribute_Ref
// Size: 0x18(Inherited: 0x0) 
struct FGetIntegerAttribute_Ref
{
	struct FName BoneName;  // 0x0(0x8)
	struct FName AttributeName;  // 0x8(0x8)
	int32_t OutValue;  // 0x10(0x4)
	uint8_t  LookupType;  // 0x14(0x1)
	char pad_21_1 : 7;  // 0x15(0x1)
	bool ReturnValue : 1;  // 0x15(0x1)
	char pad_22[2];  // 0x16(0x2)

}; 
// Function Engine.KismetMathLibrary.Conv_VectorToVector2D
// Size: 0x14(Inherited: 0x0) 
struct FConv_VectorToVector2D
{
	struct FVector InVector;  // 0x0(0xC)
	struct FVector2D ReturnValue;  // 0xC(0x8)

}; 
// Function Engine.KismetSystemLibrary.IsUnattended
// Size: 0x1(Inherited: 0x0) 
struct FIsUnattended
{
	char pad_0_1 : 7;  // 0x0(0x1)
	bool ReturnValue : 1;  // 0x0(0x1)

}; 
// Function Engine.SceneComponent.GetRelativeTransform
// Size: 0x30(Inherited: 0x0) 
struct FGetRelativeTransform
{
