#pragma once 
#include <Engine_Structs.h>
 
 
 
// Class Engine.LightmassPortalComponent
// Size: 0x200(Inherited: 0x200) 
struct ULightmassPortalComponent : public USceneComponent
{
	struct UBoxComponent* PreviewBox;  // 0x1F8(0x8)

}; 



// Class Engine.Player
// Size: 0x48(Inherited: 0x28) 
struct UPlayer : public UObject
{
	char pad_40[8];  // 0x28(0x8)
	struct APlayerController* PlayerController;  // 0x30(0x8)
	int32_t CurrentNetSpeed;  // 0x38(0x4)
	int32_t ConfiguredInternetSpeed;  // 0x3C(0x4)
	int32_t ConfiguredLanSpeed;  // 0x40(0x4)
	char pad_68[4];  // 0x44(0x4)

}; 



// Class Engine.Actor
// Size: 0x220(Inherited: 0x28) 
struct AActor : public UObject
{
	struct FActorTickFunction PrimaryActorTick;  // 0x28(0x30)
	char bNetTemporary : 1;  // 0x58(0x1)
	char bNetStartup : 1;  // 0x58(0x1)
	char bOnlyRelevantToOwner : 1;  // 0x58(0x1)
	char bAlwaysRelevant : 1;  // 0x58(0x1)
	char bReplicateMovement : 1;  // 0x58(0x1)
	char bHidden : 1;  // 0x58(0x1)
	char bTearOff : 1;  // 0x58(0x1)
	char bForceNetAddressable : 1;  // 0x58(0x1)
	char bExchangedRoles : 1;  // 0x59(0x1)
	char bNetLoadOnClient : 1;  // 0x59(0x1)
	char bNetUseOwnerRelevancy : 1;  // 0x59(0x1)
	char bRelevantForNetworkReplays : 1;  // 0x59(0x1)
	char bRelevantForLevelBounds : 1;  // 0x59(0x1)
	char bReplayRewindable : 1;  // 0x59(0x1)
	char bAllowTickBeforeBeginPlay : 1;  // 0x59(0x1)
	char bAutoDestroyWhenFinished : 1;  // 0x59(0x1)
	char bCanBeDamaged : 1;  // 0x5A(0x1)
	char bBlockInput : 1;  // 0x5A(0x1)
	char bCollideWhenPlacing : 1;  // 0x5A(0x1)
	char bFindCameraComponentWhenViewTarget : 1;  // 0x5A(0x1)
	char bGenerateOverlapEventsDuringLevelStreaming : 1;  // 0x5A(0x1)
	char bIgnoresOriginShifting : 1;  // 0x5A(0x1)
	char bEnableAutoLODGeneration : 1;  // 0x5A(0x1)
	char bIsEditorOnlyActor : 1;  // 0x5A(0x1)
	char bActorSeamlessTraveled : 1;  // 0x5B(0x1)
	char bReplicates : 1;  // 0x5B(0x1)
	char bCanBeInCluster : 1;  // 0x5B(0x1)
	char bAllowReceiveTickEventOnDedicatedServer : 1;  // 0x5B(0x1)
	char pad_91_1 : 4;  // 0x5B(0x1)
	char pad_92_1 : 3;  // 0x5C(0x1)
	char bActorEnableCollision : 1;  // 0x5C(0x1)
	char bActorIsBeingDestroyed : 1;  // 0x5C(0x1)
	char pad_92_2 : 3;  // 0x5C(0x1)
	uint8_t  UpdateOverlapsMethodDuringLevelStreaming;  // 0x5D(0x1)
	uint8_t  DefaultUpdateOverlapsMethodDuringLevelStreaming;  // 0x5E(0x1)
	char ENetRole RemoteRole;  // 0x5F(0x1)
	struct FRepMovement ReplicatedMovement;  // 0x60(0x34)
	float InitialLifeSpan;  // 0x94(0x4)
	float CustomTimeDilation;  // 0x98(0x4)
	char pad_156[4];  // 0x9C(0x4)
	struct FRepAttachment AttachmentReplication;  // 0xA0(0x40)
	struct AActor* Owner;  // 0xE0(0x8)
	struct FName NetDriverName;  // 0xE8(0x8)
	char ENetRole Role;  // 0xF0(0x1)
	char ENetDormancy NetDormancy;  // 0xF1(0x1)
	uint8_t  SpawnCollisionHandlingMethod;  // 0xF2(0x1)
	char EAutoReceiveInput AutoReceiveInput;  // 0xF3(0x1)
	int32_t InputPriority;  // 0xF4(0x4)
	struct UInputComponent* InputComponent;  // 0xF8(0x8)
	float NetCullDistanceSquared;  // 0x100(0x4)
	int32_t NetTag;  // 0x104(0x4)
	float NetUpdateFrequency;  // 0x108(0x4)
	float MinNetUpdateFrequency;  // 0x10C(0x4)
	float NetPriority;  // 0x110(0x4)
	char pad_276[4];  // 0x114(0x4)
	struct APawn* Instigator;  // 0x118(0x8)
	struct TArray<struct AActor*> Children;  // 0x120(0x10)
	struct USceneComponent* RootComponent;  // 0x130(0x8)
	struct TArray<struct AMatineeActor*> ControllingMatineeActors;  // 0x138(0x10)
	char pad_328[8];  // 0x148(0x8)
	struct TArray<struct FName> Layers;  // 0x150(0x10)
	struct TWeakObjectPtr<UChildActorComponent> ParentComponent;  // 0x160(0x8)
	char pad_360[8];  // 0x168(0x8)
	struct TArray<struct FName> Tags;  // 0x170(0x10)
	struct FMulticastSparseDelegate OnTakeAnyDamage;  // 0x180(0x1)
	struct FMulticastSparseDelegate OnTakePointDamage;  // 0x181(0x1)
	struct FMulticastSparseDelegate OnTakeRadialDamage;  // 0x182(0x1)
	struct FMulticastSparseDelegate OnActorBeginOverlap;  // 0x183(0x1)
	struct FMulticastSparseDelegate OnActorEndOverlap;  // 0x184(0x1)
	struct FMulticastSparseDelegate OnBeginCursorOver;  // 0x185(0x1)
	struct FMulticastSparseDelegate OnEndCursorOver;  // 0x186(0x1)
	struct FMulticastSparseDelegate OnClicked;  // 0x187(0x1)
	struct FMulticastSparseDelegate OnReleased;  // 0x188(0x1)
	struct FMulticastSparseDelegate OnInputTouchBegin;  // 0x189(0x1)
	struct FMulticastSparseDelegate OnInputTouchEnd;  // 0x18A(0x1)
	struct FMulticastSparseDelegate OnInputTouchEnter;  // 0x18B(0x1)
	struct FMulticastSparseDelegate OnInputTouchLeave;  // 0x18C(0x1)
	struct FMulticastSparseDelegate OnActorHit;  // 0x18D(0x1)
	struct FMulticastSparseDelegate OnDestroyed;  // 0x18E(0x1)
	struct FMulticastSparseDelegate OnEndPlay;  // 0x18F(0x1)
	char pad_400[96];  // 0x190(0x60)
	struct TArray<struct UActorComponent*> InstanceComponents;  // 0x1F0(0x10)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents;  // 0x200(0x10)
	char pad_528[16];  // 0x210(0x10)

	bool WasRecentlyRendered(float Tolerance); // Function Engine.Actor.WasRecentlyRendered
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript
	void TearOff(); // Function Engine.Actor.TearOff
	void SnapRootComponentTo(struct AActor* InParentActor, struct FName InSocketName); // Function Engine.Actor.SnapRootComponentTo
	void SetTickGroup(char ETickingGroup NewTickGroup); // Function Engine.Actor.SetTickGroup
	void SetTickableWhenPaused(bool bTickableWhenPaused); // Function Engine.Actor.SetTickableWhenPaused
	void SetReplicates(bool bInReplicates); // Function Engine.Actor.SetReplicates
	void SetReplicateMovement(bool bInReplicateMovement); // Function Engine.Actor.SetReplicateMovement
	void SetOwner(struct AActor* NewOwner); // Function Engine.Actor.SetOwner
	void SetNetDormancy(char ENetDormancy NewDormancy); // Function Engine.Actor.SetNetDormancy
	void SetLifeSpan(float InLifespan); // Function Engine.Actor.SetLifeSpan
	void SetAutoDestroyWhenFinished(bool bVal); // Function Engine.Actor.SetAutoDestroyWhenFinished
	void SetActorTickInterval(float TickInterval); // Function Engine.Actor.SetActorTickInterval
	void SetActorTickEnabled(bool bEnabled); // Function Engine.Actor.SetActorTickEnabled
	void SetActorScale3D(struct FVector NewScale3D); // Function Engine.Actor.SetActorScale3D
	void SetActorRelativeScale3D(struct FVector NewRelativeScale); // Function Engine.Actor.SetActorRelativeScale3D
	void SetActorHiddenInGame(bool bNewHidden); // Function Engine.Actor.SetActorHiddenInGame
	void SetActorEnableCollision(bool bNewActorEnableCollision); // Function Engine.Actor.SetActorEnableCollision
	void RemoveTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.Actor.RemoveTickPrerequisiteComponent
	void RemoveTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.Actor.RemoveTickPrerequisiteActor
	void ReceiveTick(float DeltaSeconds); // Function Engine.Actor.ReceiveTick
	void ReceiveRadialDamage(float DamageReceived, struct UDamageType* DamageType, struct FVector Origin, struct FHitResult& HitInfo, struct AController* InstigatedBy, struct AActor* DamageCauser); // Function Engine.Actor.ReceiveRadialDamage
	void ReceivePointDamage(float Damage, struct UDamageType* DamageType, struct FVector HitLocation, struct FVector HitNormal, struct UPrimitiveComponent* HitComponent, struct FName BoneName, struct FVector ShotFromDirection, struct AController* InstigatedBy, struct AActor* DamageCauser, struct FHitResult& HitInfo); // Function Engine.Actor.ReceivePointDamage
	void ReceiveHit(struct UPrimitiveComponent* MyComp, struct AActor* Other, struct UPrimitiveComponent* OtherComp, bool bSelfMoved, struct FVector HitLocation, struct FVector HitNormal, struct FVector NormalImpulse, struct FHitResult& Hit); // Function Engine.Actor.ReceiveHit
	void ReceiveEndPlay(char EEndPlayReason EndPlayReason); // Function Engine.Actor.ReceiveEndPlay
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay
	void ReceiveAnyDamage(float Damage, struct UDamageType* DamageType, struct AController* InstigatedBy, struct AActor* DamageCauser); // Function Engine.Actor.ReceiveAnyDamage
	void ReceiveActorOnReleased(struct FKey ButtonReleased); // Function Engine.Actor.ReceiveActorOnReleased
	void ReceiveActorOnInputTouchLeave(char ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchLeave
	void ReceiveActorOnInputTouchEnter(char ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchEnter
	void ReceiveActorOnInputTouchEnd(char ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchEnd
	void ReceiveActorOnInputTouchBegin(char ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchBegin
	void ReceiveActorOnClicked(struct FKey ButtonPressed); // Function Engine.Actor.ReceiveActorOnClicked
	void ReceiveActorEndOverlap(struct AActor* OtherActor); // Function Engine.Actor.ReceiveActorEndOverlap
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver
	void ReceiveActorBeginOverlap(struct AActor* OtherActor); // Function Engine.Actor.ReceiveActorBeginOverlap
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver
	void PrestreamTextures(float Seconds, bool bEnableStreaming, int32_t CinematicTextureGroups); // Function Engine.Actor.PrestreamTextures
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication
	void MakeNoise(float Loudness, struct APawn* NoiseInstigator, struct FVector NoiseLocation, float MaxRange, struct FName Tag); // Function Engine.Actor.MakeNoise
	struct UMaterialInstanceDynamic* MakeMIDForMaterial(struct UMaterialInterface* Parent); // Function Engine.Actor.MakeMIDForMaterial
	bool K2_TeleportTo(struct FVector DestLocation, struct FRotator DestRotation); // Function Engine.Actor.K2_TeleportTo
	bool K2_SetActorTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorTransform
	bool K2_SetActorRotation(struct FRotator NewRotation, bool bTeleportPhysics); // Function Engine.Actor.K2_SetActorRotation
	void K2_SetActorRelativeTransform(struct FTransform& NewRelativeTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeTransform
	void K2_SetActorRelativeRotation(struct FRotator NewRelativeRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeRotation
	void K2_SetActorRelativeLocation(struct FVector NewRelativeLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeLocation
	bool K2_SetActorLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorLocationAndRotation
	bool K2_SetActorLocation(struct FVector NewLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorLocation
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset
	void K2_OnEndViewTarget(struct APlayerController* PC); // Function Engine.Actor.K2_OnEndViewTarget
	void K2_OnBecomeViewTarget(struct APlayerController* PC); // Function Engine.Actor.K2_OnBecomeViewTarget
	struct USceneComponent* K2_GetRootComponent(); // Function Engine.Actor.K2_GetRootComponent
	struct TArray<struct UActorComponent*> K2_GetComponentsByClass(UActorComponent* ComponentClass); // Function Engine.Actor.K2_GetComponentsByClass
	struct FRotator K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation
	struct FVector K2_GetActorLocation(); // Function Engine.Actor.K2_GetActorLocation
	void K2_DetachFromActor(uint8_t  LocationRule, uint8_t  RotationRule, uint8_t  ScaleRule); // Function Engine.Actor.K2_DetachFromActor
	void K2_DestroyComponent(struct UActorComponent* Component); // Function Engine.Actor.K2_DestroyComponent
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor
	void K2_AttachToComponent(struct USceneComponent* Parent, struct FName SocketName, uint8_t  LocationRule, uint8_t  RotationRule, uint8_t  ScaleRule, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachToComponent
	void K2_AttachToActor(struct AActor* ParentActor, struct FName SocketName, uint8_t  LocationRule, uint8_t  RotationRule, uint8_t  ScaleRule, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachToActor
	void K2_AttachRootComponentToActor(struct AActor* InParentActor, struct FName InSocketName, char EAttachLocation AttachLocationType, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachRootComponentToActor
	void K2_AttachRootComponentTo(struct USceneComponent* InParent, struct FName InSocketName, char EAttachLocation AttachLocationType, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachRootComponentTo
	void K2_AddActorWorldTransformKeepScale(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldTransformKeepScale
	void K2_AddActorWorldTransform(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldTransform
	void K2_AddActorWorldRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldRotation
	void K2_AddActorWorldOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldOffset
	void K2_AddActorLocalTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalTransform
	void K2_AddActorLocalRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalRotation
	void K2_AddActorLocalOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalOffset
	bool IsOverlappingActor(struct AActor* Other); // Function Engine.Actor.IsOverlappingActor
	bool IsChildActor(); // Function Engine.Actor.IsChildActor
	bool IsActorTickEnabled(); // Function Engine.Actor.IsActorTickEnabled
	bool IsActorBeingDestroyed(); // Function Engine.Actor.IsActorBeingDestroyed
	bool HasAuthority(); // Function Engine.Actor.HasAuthority
	float GetVerticalDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetVerticalDistanceTo
	struct FVector GetVelocity(); // Function Engine.Actor.GetVelocity
	struct FTransform GetTransform(); // Function Engine.Actor.GetTransform
	bool GetTickableWhenPaused(); // Function Engine.Actor.GetTickableWhenPaused
	float GetSquaredHorizontalDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetSquaredHorizontalDistanceTo
	float GetSquaredDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetSquaredDistanceTo
	char ENetRole GetRemoteRole(); // Function Engine.Actor.GetRemoteRole
	struct UChildActorComponent* GetParentComponent(); // Function Engine.Actor.GetParentComponent
	struct AActor* GetParentActor(); // Function Engine.Actor.GetParentActor
	struct AActor* GetOwner(); // Function Engine.Actor.GetOwner
	void GetOverlappingComponents(struct TArray<struct UPrimitiveComponent*>& OverlappingComponents); // Function Engine.Actor.GetOverlappingComponents
	void GetOverlappingActors(struct TArray<struct AActor*>& OverlappingActors, AActor* ClassFilter); // Function Engine.Actor.GetOverlappingActors
	char ENetRole GetLocalRole(); // Function Engine.Actor.GetLocalRole
	float GetLifeSpan(); // Function Engine.Actor.GetLifeSpan
	struct AController* GetInstigatorController(); // Function Engine.Actor.GetInstigatorController
	struct APawn* GetInstigator(); // Function Engine.Actor.GetInstigator
	struct FVector GetInputVectorAxisValue(struct FKey InputAxisKey); // Function Engine.Actor.GetInputVectorAxisValue
	float GetInputAxisValue(struct FName InputAxisName); // Function Engine.Actor.GetInputAxisValue
	float GetInputAxisKeyValue(struct FKey InputAxisKey); // Function Engine.Actor.GetInputAxisKeyValue
	float GetHorizontalDotProductTo(struct AActor* OtherActor); // Function Engine.Actor.GetHorizontalDotProductTo
	float GetHorizontalDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetHorizontalDistanceTo
	float GetGameTimeSinceCreation(); // Function Engine.Actor.GetGameTimeSinceCreation
	float GetDotProductTo(struct AActor* OtherActor); // Function Engine.Actor.GetDotProductTo
	float GetDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetDistanceTo
	struct TArray<struct UActorComponent*> GetComponentsByTag(UActorComponent* ComponentClass, struct FName Tag); // Function Engine.Actor.GetComponentsByTag
	struct TArray<struct UActorComponent*> GetComponentsByInterface(UInterface* Interface); // Function Engine.Actor.GetComponentsByInterface
	struct UActorComponent* GetComponentByClass(UActorComponent* ComponentClass); // Function Engine.Actor.GetComponentByClass
	struct FName GetAttachParentSocketName(); // Function Engine.Actor.GetAttachParentSocketName
	struct AActor* GetAttachParentActor(); // Function Engine.Actor.GetAttachParentActor
	void GetAttachedActors(struct TArray<struct AActor*>& OutActors, bool bResetArray); // Function Engine.Actor.GetAttachedActors
	void GetAllChildActors(struct TArray<struct AActor*>& ChildActors, bool bIncludeDescendants); // Function Engine.Actor.GetAllChildActors
	struct FVector GetActorUpVector(); // Function Engine.Actor.GetActorUpVector
	float GetActorTimeDilation(); // Function Engine.Actor.GetActorTimeDilation
	float GetActorTickInterval(); // Function Engine.Actor.GetActorTickInterval
	struct FVector GetActorScale3D(); // Function Engine.Actor.GetActorScale3D
	struct FVector GetActorRightVector(); // Function Engine.Actor.GetActorRightVector
	struct FVector GetActorRelativeScale3D(); // Function Engine.Actor.GetActorRelativeScale3D
	struct FVector GetActorForwardVector(); // Function Engine.Actor.GetActorForwardVector
	void GetActorEyesViewPoint(struct FVector& OutLocation, struct FRotator& OutRotation); // Function Engine.Actor.GetActorEyesViewPoint
	bool GetActorEnableCollision(); // Function Engine.Actor.GetActorEnableCollision
	void GetActorBounds(bool bOnlyCollidingComponents, struct FVector& Origin, struct FVector& BoxExtent, bool bIncludeFromChildActors); // Function Engine.Actor.GetActorBounds
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate
	void FlushNetDormancy(); // Function Engine.Actor.FlushNetDormancy
	void FinishAddComponent(struct UActorComponent* Component, bool bManualAttachment, struct FTransform& RelativeTransform); // Function Engine.Actor.FinishAddComponent
	void EnableInput(struct APlayerController* PlayerController); // Function Engine.Actor.EnableInput
	void DisableInput(struct APlayerController* PlayerController); // Function Engine.Actor.DisableInput
	void DetachRootComponentFromParent(bool bMaintainWorldPosition); // Function Engine.Actor.DetachRootComponentFromParent
	void AddTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.Actor.AddTickPrerequisiteComponent
	void AddTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.Actor.AddTickPrerequisiteActor
	struct UActorComponent* AddComponentByClass(UActorComponent* Class, bool bManualAttachment, struct FTransform& RelativeTransform, bool bDeferredFinish); // Function Engine.Actor.AddComponentByClass
	struct UActorComponent* AddComponent(struct FName TemplateName, bool bManualAttachment, struct FTransform& RelativeTransform, struct UObject* ComponentTemplateContext, bool bDeferredFinish); // Function Engine.Actor.AddComponent
	bool ActorHasTag(struct FName Tag); // Function Engine.Actor.ActorHasTag
}; 



// Class Engine.MaterialExpressionScreenPosition
// Size: 0x40(Inherited: 0x40) 
struct UMaterialExpressionScreenPosition : public UMaterialExpression
{

}; 



// Class Engine.BlueprintCore
// Size: 0x50(Inherited: 0x28) 
struct UBlueprintCore : public UObject
{
	UObject* SkeletonGeneratedClass;  // 0x28(0x8)
	UObject* GeneratedClass;  // 0x30(0x8)
	char pad_56_1 : 7;  // 0x38(0x1)
	bool bLegacyNeedToPurgeSkelRefs : 1;  // 0x38(0x1)
	char pad_57[3];  // 0x39(0x3)
	struct FGuid BlueprintGuid;  // 0x3C(0x10)
	char pad_76[4];  // 0x4C(0x4)

}; 



// Class Engine.MaterialExpressionParticleMotionBlurFade
// Size: 0x40(Inherited: 0x40) 
struct UMaterialExpressionParticleMotionBlurFade : public UMaterialExpression
{

}; 



// Class Engine.Pawn
// Size: 0x280(Inherited: 0x220) 
struct APawn : public AActor
{
	char pad_544[8];  // 0x220(0x8)
	char bUseControllerRotationPitch : 1;  // 0x228(0x1)
	char bUseControllerRotationYaw : 1;  // 0x228(0x1)
	char bUseControllerRotationRoll : 1;  // 0x228(0x1)
	char bCanAffectNavigationGeneration : 1;  // 0x228(0x1)
	char pad_552_1 : 4;  // 0x228(0x1)
	char pad_553[4];  // 0x229(0x4)
	float BaseEyeHeight;  // 0x22C(0x4)
	char EAutoReceiveInput AutoPossessPlayer;  // 0x230(0x1)
	uint8_t  AutoPossessAI;  // 0x231(0x1)
	char RemoteViewPitch;  // 0x232(0x1)
	char pad_563[5];  // 0x233(0x5)
	AController* AIControllerClass;  // 0x238(0x8)
	struct APlayerState* PlayerState;  // 0x240(0x8)
	char pad_584[8];  // 0x248(0x8)
	struct AController* LastHitBy;  // 0x250(0x8)
	struct AController* Controller;  // 0x258(0x8)
	char pad_608[4];  // 0x260(0x4)
	struct FVector ControlInputVector;  // 0x264(0xC)
	struct FVector LastControlInputVector;  // 0x270(0xC)
	char pad_636[4];  // 0x27C(0x4)

	void SpawnDefaultController(); // Function Engine.Pawn.SpawnDefaultController
	void SetCanAffectNavigationGeneration(bool bNewValue, bool bForceUpdate); // Function Engine.Pawn.SetCanAffectNavigationGeneration
	void ReceiveUnpossessed(struct AController* OldController); // Function Engine.Pawn.ReceiveUnpossessed
	void ReceivePossessed(struct AController* NewController); // Function Engine.Pawn.ReceivePossessed
	void PawnMakeNoise(float Loudness, struct FVector NoiseLocation, bool bUseNoiseMakerLocation, struct AActor* NoiseMaker); // Function Engine.Pawn.PawnMakeNoise
	void OnRep_PlayerState(); // Function Engine.Pawn.OnRep_PlayerState
	void OnRep_Controller(); // Function Engine.Pawn.OnRep_Controller
	void LaunchPawn(struct FVector LaunchVelocity, bool bXYOverride, bool bZOverride); // Function Engine.Pawn.LaunchPawn
	struct FVector K2_GetMovementInputVector(); // Function Engine.Pawn.K2_GetMovementInputVector
	bool IsPlayerControlled(); // Function Engine.Pawn.IsPlayerControlled
	bool IsPawnControlled(); // Function Engine.Pawn.IsPawnControlled
	bool IsMoveInputIgnored(); // Function Engine.Pawn.IsMoveInputIgnored
	bool IsLocallyControlled(); // Function Engine.Pawn.IsLocallyControlled
	bool IsControlled(); // Function Engine.Pawn.IsControlled
	bool IsBotControlled(); // Function Engine.Pawn.IsBotControlled
	struct FVector GetPendingMovementInputVector(); // Function Engine.Pawn.GetPendingMovementInputVector
	struct FVector GetNavAgentLocation(); // Function Engine.Pawn.GetNavAgentLocation
	struct UPawnMovementComponent* GetMovementComponent(); // Function Engine.Pawn.GetMovementComponent
	struct AActor* GetMovementBaseActor(struct APawn* Pawn); // Function Engine.Pawn.GetMovementBaseActor
	struct FVector GetLastMovementInputVector(); // Function Engine.Pawn.GetLastMovementInputVector
	struct FRotator GetControlRotation(); // Function Engine.Pawn.GetControlRotation
	struct AController* GetController(); // Function Engine.Pawn.GetController
	struct FRotator GetBaseAimRotation(); // Function Engine.Pawn.GetBaseAimRotation
	void DetachFromControllerPendingDestroy(); // Function Engine.Pawn.DetachFromControllerPendingDestroy
	struct FVector ConsumeMovementInputVector(); // Function Engine.Pawn.ConsumeMovementInputVector
	void AddMovementInput(struct FVector WorldDirection, float ScaleValue, bool bForce); // Function Engine.Pawn.AddMovementInput
	void AddControllerYawInput(float Val); // Function Engine.Pawn.AddControllerYawInput
	void AddControllerRollInput(float Val); // Function Engine.Pawn.AddControllerRollInput
	void AddControllerPitchInput(float Val); // Function Engine.Pawn.AddControllerPitchInput
}; 



// Class Engine.MaterialExpressionLogarithm2
// Size: 0x58(Inherited: 0x40) 
struct UMaterialExpressionLogarithm2 : public UMaterialExpression
{
	struct FExpressionInput X;  // 0x40(0x14)
	char pad_84[4];  // 0x54(0x4)

}; 



// Class Engine.LocalLightComponent
// Size: 0x340(Inherited: 0x330) 
struct ULocalLightComponent : public ULightComponent
{
	uint8_t  IntensityUnits;  // 0x328(0x1)
	float Radius;  // 0x32C(0x4)
	float AttenuationRadius;  // 0x330(0x4)
	struct FLightmassPointLightSettings LightmassSettings;  // 0x334(0xC)

	void SetIntensityUnits(uint8_t  NewIntensityUnits); // Function Engine.LocalLightComponent.SetIntensityUnits
	void SetAttenuationRadius(float NewRadius); // Function Engine.LocalLightComponent.SetAttenuationRadius
	float GetUnitsConversionFactor(uint8_t  SrcUnits, uint8_t  TargetUnits, float CosHalfConeAngle); // Function Engine.LocalLightComponent.GetUnitsConversionFactor
}; 



// Class Engine.SoundWaveProcedural
// Size: 0x3C0(Inherited: 0x370) 
struct USoundWaveProcedural : public USoundWave
{
	char pad_880[80];  // 0x370(0x50)

}; 



// Class Engine.SkeletalMeshComponent
// Size: 0xED0(Inherited: 0x6A0) 
struct USkeletalMeshComponent : public USkinnedMeshComponent
{
	UObject* AnimBlueprintGeneratedClass;  // 0x6A0(0x8)
	UAnimInstance* AnimClass;  // 0x6A8(0x8)
	struct UAnimInstance* AnimScriptInstance;  // 0x6B0(0x8)
	struct UAnimInstance* PostProcessAnimInstance;  // 0x6B8(0x8)
	struct FSingleAnimationPlayData AnimationData;  // 0x6C0(0x18)
	char pad_1752[16];  // 0x6D8(0x10)
	struct FVector RootBoneTranslation;  // 0x6E8(0xC)
	struct FVector LineCheckBoundsScale;  // 0x6F4(0xC)
	char pad_1792[48];  // 0x700(0x30)
	struct TArray<struct UAnimInstance*> LinkedInstances;  // 0x730(0x10)
	struct TArray<struct FTransform> CachedBoneSpaceTransforms;  // 0x740(0x10)
	struct TArray<struct FTransform> CachedComponentSpaceTransforms;  // 0x750(0x10)
	char pad_1888[336];  // 0x760(0x150)
	float GlobalAnimRateScale;  // 0x8B0(0x4)
	char EKinematicBonesUpdateToPhysics KinematicBonesUpdateType;  // 0x8B4(0x1)
	char EPhysicsTransformUpdateMode PhysicsTransformUpdateMode;  // 0x8B5(0x1)
	char pad_2230[1];  // 0x8B6(0x1)
	char EAnimationMode AnimationMode;  // 0x8B7(0x1)
	char pad_2232[1];  // 0x8B8(0x1)
	char bDisablePostProcessBlueprint : 1;  // 0x8B9(0x1)
	char pad_2233_1 : 1;  // 0x8B9(0x1)
	char bUpdateOverlapsOnAnimationFinalize : 1;  // 0x8B9(0x1)
	char pad_2233_2 : 1;  // 0x8B9(0x1)
	char bHasValidBodies : 1;  // 0x8B9(0x1)
	char bBlendPhysics : 1;  // 0x8B9(0x1)
	char bEnablePhysicsOnDedicatedServer : 1;  // 0x8B9(0x1)
	char bUpdateJointsFromAnimation : 1;  // 0x8B9(0x1)
	char bDisableClothSimulation : 1;  // 0x8BA(0x1)
	char pad_2234_1 : 7;  // 0x8BA(0x1)
	char pad_2235[6];  // 0x8BB(0x6)
	char pad_2240_1 : 1;  // 0x8C0(0x1)
	char bDisableRigidBodyAnimNode : 1;  // 0x8C0(0x1)
	char bAllowAnimCurveEvaluation : 1;  // 0x8C0(0x1)
	char bDisableAnimCurves : 1;  // 0x8C0(0x1)
	char pad_2240_2 : 3;  // 0x8C0(0x1)
	char bCollideWithEnvironment : 1;  // 0x8C0(0x1)
	char bCollideWithAttachedChildren : 1;  // 0x8C1(0x1)
	char bLocalSpaceSimulation : 1;  // 0x8C1(0x1)
	char bResetAfterTeleport : 1;  // 0x8C1(0x1)
	char pad_2241_1 : 1;  // 0x8C1(0x1)
	char bDeferKinematicBoneUpdate : 1;  // 0x8C1(0x1)
	char bNoSkeletonUpdate : 1;  // 0x8C1(0x1)
	char bPauseAnims : 1;  // 0x8C1(0x1)
	char bUseRefPoseOnInitAnim : 1;  // 0x8C1(0x1)
	char bEnablePerPolyCollision : 1;  // 0x8C2(0x1)
	char bForceRefpose : 1;  // 0x8C2(0x1)
	char bOnlyAllowAutonomousTickPose : 1;  // 0x8C2(0x1)
	char bIsAutonomousTickPose : 1;  // 0x8C2(0x1)
	char bOldForceRefPose : 1;  // 0x8C2(0x1)
	char bShowPrePhysBones : 1;  // 0x8C2(0x1)
	char bRequiredBonesUpToDate : 1;  // 0x8C2(0x1)
	char bAnimTreeInitialised : 1;  // 0x8C2(0x1)
	char bIncludeComponentLocationIntoBounds : 1;  // 0x8C3(0x1)
	char bEnableLineCheckWithBounds : 1;  // 0x8C3(0x1)
	char bPropagateCurvesToSlaves : 1;  // 0x8C3(0x1)
	char bSkipKinematicUpdateWhenInterpolating : 1;  // 0x8C3(0x1)
	char bSkipBoundsUpdateWhenInterpolating : 1;  // 0x8C3(0x1)
	char pad_2243_1 : 2;  // 0x8C3(0x1)
	char bNeedsQueuedAnimEventsDispatched : 1;  // 0x8C3(0x1)
	char pad_2244[2];  // 0x8C4(0x2)
	uint16_t CachedAnimCurveUidVersion;  // 0x8C6(0x2)
	float ClothBlendWeight;  // 0x8C8(0x4)
	char pad_2252_1 : 7;  // 0x8CC(0x1)
	bool bWaitForParallelClothTask : 1;  // 0x8CC(0x1)
	char pad_2253[3];  // 0x8CD(0x3)
	struct TArray<struct FName> DisallowedAnimCurves;  // 0x8D0(0x10)
	struct UBodySetup* BodySetup;  // 0x8E0(0x8)
	char pad_2280[8];  // 0x8E8(0x8)
	struct FMulticastInlineDelegate OnConstraintBroken;  // 0x8F0(0x10)
	UClothingSimulationFactory* ClothingSimulationFactory;  // 0x900(0x8)
	char pad_2312[208];  // 0x908(0xD0)
	float TeleportDistanceThreshold;  // 0x9D8(0x4)
	float TeleportRotationThreshold;  // 0x9DC(0x4)
	char pad_2528[8];  // 0x9E0(0x8)
	uint32_t LastPoseTickFrame;  // 0x9E8(0x4)
	char pad_2540[84];  // 0x9EC(0x54)
	struct UClothingSimulationInteractor* ClothingInteractor;  // 0xA40(0x8)
	char pad_2632[200];  // 0xA48(0xC8)
	struct FMulticastInlineDelegate OnAnimInitialized;  // 0xB10(0x10)
	char pad_2848[944];  // 0xB20(0x3B0)

	void UnlinkAnimClassLayers(UAnimInstance* InClass); // Function Engine.SkeletalMeshComponent.UnlinkAnimClassLayers
	void UnbindClothFromMasterPoseComponent(bool bRestoreSimulationSpace); // Function Engine.SkeletalMeshComponent.UnbindClothFromMasterPoseComponent
	void ToggleDisablePostProcessBlueprint(); // Function Engine.SkeletalMeshComponent.ToggleDisablePostProcessBlueprint
	void TermBodiesBelow(struct FName ParentBoneName); // Function Engine.SkeletalMeshComponent.TermBodiesBelow
	void SuspendClothingSimulation(); // Function Engine.SkeletalMeshComponent.SuspendClothingSimulation
	void Stop(); // Function Engine.SkeletalMeshComponent.Stop
	void SnapshotPose(struct FPoseSnapshot& Snapshot); // Function Engine.SkeletalMeshComponent.SnapshotPose
	void SetUpdateClothInEditor(bool NewUpdateState); // Function Engine.SkeletalMeshComponent.SetUpdateClothInEditor
	void SetUpdateAnimationInEditor(bool NewUpdateState); // Function Engine.SkeletalMeshComponent.SetUpdateAnimationInEditor
	void SetTeleportRotationThreshold(float Threshold); // Function Engine.SkeletalMeshComponent.SetTeleportRotationThreshold
	void SetTeleportDistanceThreshold(float Threshold); // Function Engine.SkeletalMeshComponent.SetTeleportDistanceThreshold
	void SetPosition(float InPos, bool bFireNotifies); // Function Engine.SkeletalMeshComponent.SetPosition
	void SetPlayRate(float Rate); // Function Engine.SkeletalMeshComponent.SetPlayRate
	void SetPhysicsBlendWeight(float PhysicsBlendWeight); // Function Engine.SkeletalMeshComponent.SetPhysicsBlendWeight
	void SetNotifyRigidBodyCollisionBelow(bool bNewNotifyRigidBodyCollision, struct FName BoneName, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetNotifyRigidBodyCollisionBelow
	void SetMorphTarget(struct FName MorphTargetName, float Value, bool bRemoveZeroWeight); // Function Engine.SkeletalMeshComponent.SetMorphTarget
	void SetEnablePhysicsBlending(bool bNewBlendPhysics); // Function Engine.SkeletalMeshComponent.SetEnablePhysicsBlending
	void SetEnableGravityOnAllBodiesBelow(bool bEnableGravity, struct FName BoneName, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetEnableGravityOnAllBodiesBelow
	void SetEnableBodyGravity(bool bEnableGravity, struct FName BoneName); // Function Engine.SkeletalMeshComponent.SetEnableBodyGravity
	void SetDisablePostProcessBlueprint(bool bInDisablePostProcess); // Function Engine.SkeletalMeshComponent.SetDisablePostProcessBlueprint
	void SetDisableAnimCurves(bool bInDisableAnimCurves); // Function Engine.SkeletalMeshComponent.SetDisableAnimCurves
	void SetConstraintProfileForAll(struct FName ProfileName, bool bDefaultIfNotFound); // Function Engine.SkeletalMeshComponent.SetConstraintProfileForAll
	void SetConstraintProfile(struct FName JointName, struct FName ProfileName, bool bDefaultIfNotFound); // Function Engine.SkeletalMeshComponent.SetConstraintProfile
	void SetClothMaxDistanceScale(float Scale); // Function Engine.SkeletalMeshComponent.SetClothMaxDistanceScale
	void SetBodyNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision, struct FName BoneName); // Function Engine.SkeletalMeshComponent.SetBodyNotifyRigidBodyCollision
	void SetAnimClass(UObject* NewClass); // Function Engine.SkeletalMeshComponent.SetAnimClass
	void SetAnimationMode(char EAnimationMode InAnimationMode); // Function Engine.SkeletalMeshComponent.SetAnimationMode
	void SetAnimation(struct UAnimationAsset* NewAnimToPlay); // Function Engine.SkeletalMeshComponent.SetAnimation
	void SetAngularLimits(struct FName InBoneName, float Swing1LimitAngle, float TwistLimitAngle, float Swing2LimitAngle); // Function Engine.SkeletalMeshComponent.SetAngularLimits
	void SetAllowRigidBodyAnimNode(bool bInAllow, bool bReinitAnim); // Function Engine.SkeletalMeshComponent.SetAllowRigidBodyAnimNode
	void SetAllowedAnimCurvesEvaluation(struct TArray<struct FName>& List, bool bAllow); // Function Engine.SkeletalMeshComponent.SetAllowedAnimCurvesEvaluation
	void SetAllowAnimCurveEvaluation(bool bInAllow); // Function Engine.SkeletalMeshComponent.SetAllowAnimCurveEvaluation
	void SetAllMotorsAngularVelocityDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllMotorsAngularVelocityDrive
	void SetAllMotorsAngularPositionDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllMotorsAngularPositionDrive
	void SetAllMotorsAngularDriveParams(float InSpring, float InDamping, float InForceLimit, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllMotorsAngularDriveParams
	void SetAllBodiesSimulatePhysics(bool bNewSimulate); // Function Engine.SkeletalMeshComponent.SetAllBodiesSimulatePhysics
	void SetAllBodiesPhysicsBlendWeight(float PhysicsBlendWeight, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllBodiesPhysicsBlendWeight
	void SetAllBodiesBelowSimulatePhysics(struct FName& InBoneName, bool bNewSimulate, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetAllBodiesBelowSimulatePhysics
	void SetAllBodiesBelowPhysicsBlendWeight(struct FName& InBoneName, float PhysicsBlendWeight, bool bSkipCustomPhysicsType, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetAllBodiesBelowPhysicsBlendWeight
	void ResumeClothingSimulation(); // Function Engine.SkeletalMeshComponent.ResumeClothingSimulation
	void ResetClothTeleportMode(); // Function Engine.SkeletalMeshComponent.ResetClothTeleportMode
	void ResetAnimInstanceDynamics(uint8_t  InTeleportType); // Function Engine.SkeletalMeshComponent.ResetAnimInstanceDynamics
	void ResetAllowedAnimCurveEvaluation(); // Function Engine.SkeletalMeshComponent.ResetAllowedAnimCurveEvaluation
	void ResetAllBodiesSimulatePhysics(); // Function Engine.SkeletalMeshComponent.ResetAllBodiesSimulatePhysics
	void PlayAnimation(struct UAnimationAsset* NewAnimToPlay, bool bLooping); // Function Engine.SkeletalMeshComponent.PlayAnimation
	void Play(bool bLooping); // Function Engine.SkeletalMeshComponent.Play
	void OverrideAnimationData(struct UAnimationAsset* InAnimToPlay, bool bIsLooping, bool bIsPlaying, float position, float PlayRate); // Function Engine.SkeletalMeshComponent.OverrideAnimationData
	void LinkAnimGraphByTag(struct FName InTag, UAnimInstance* InClass); // Function Engine.SkeletalMeshComponent.LinkAnimGraphByTag
	void LinkAnimClassLayers(UAnimInstance* InClass); // Function Engine.SkeletalMeshComponent.LinkAnimClassLayers
	bool K2_GetClosestPointOnPhysicsAsset(struct FVector& WorldPosition, struct FVector& ClosestWorldPosition, struct FVector& Normal, struct FName& BoneName, float& Distance); // Function Engine.SkeletalMeshComponent.K2_GetClosestPointOnPhysicsAsset
	bool IsPlaying(); // Function Engine.SkeletalMeshComponent.IsPlaying
	bool IsClothingSimulationSuspended(); // Function Engine.SkeletalMeshComponent.IsClothingSimulationSuspended
	bool IsBodyGravityEnabled(struct FName BoneName); // Function Engine.SkeletalMeshComponent.IsBodyGravityEnabled
	bool HasValidAnimationInstance(); // Function Engine.SkeletalMeshComponent.HasValidAnimationInstance
	float GetTeleportRotationThreshold(); // Function Engine.SkeletalMeshComponent.GetTeleportRotationThreshold
	float GetTeleportDistanceThreshold(); // Function Engine.SkeletalMeshComponent.GetTeleportDistanceThreshold
	bool GetStringAttribute_Ref(struct FName& BoneName, struct FName& AttributeName, struct FString& OutValue, uint8_t  LookupType); // Function Engine.SkeletalMeshComponent.GetStringAttribute_Ref
	bool GetStringAttribute(struct FName& BoneName, struct FName& AttributeName, struct FString DefaultValue, struct FString& OutValue, uint8_t  LookupType); // Function Engine.SkeletalMeshComponent.GetStringAttribute
	struct FVector GetSkeletalCenterOfMass(); // Function Engine.SkeletalMeshComponent.GetSkeletalCenterOfMass
	struct UAnimInstance* GetPostProcessInstance(); // Function Engine.SkeletalMeshComponent.GetPostProcessInstance
	float GetPosition(); // Function Engine.SkeletalMeshComponent.GetPosition
	float GetPlayRate(); // Function Engine.SkeletalMeshComponent.GetPlayRate
	float GetMorphTarget(struct FName MorphTargetName); // Function Engine.SkeletalMeshComponent.GetMorphTarget
	struct UAnimInstance* GetLinkedAnimLayerInstanceByGroup(struct FName InGroup); // Function Engine.SkeletalMeshComponent.GetLinkedAnimLayerInstanceByGroup
	struct UAnimInstance* GetLinkedAnimLayerInstanceByClass(UAnimInstance* InClass); // Function Engine.SkeletalMeshComponent.GetLinkedAnimLayerInstanceByClass
	void GetLinkedAnimGraphInstancesByTag(struct FName InTag, struct TArray<struct UAnimInstance*>& OutLinkedInstances); // Function Engine.SkeletalMeshComponent.GetLinkedAnimGraphInstancesByTag
	struct UAnimInstance* GetLinkedAnimGraphInstanceByTag(struct FName InTag); // Function Engine.SkeletalMeshComponent.GetLinkedAnimGraphInstanceByTag
	bool GetIntegerAttribute_Ref(struct FName& BoneName, struct FName& AttributeName, int32_t& OutValue, uint8_t  LookupType); // Function Engine.SkeletalMeshComponent.GetIntegerAttribute_Ref
	bool GetIntegerAttribute(struct FName& BoneName, struct FName& AttributeName, int32_t DefaultValue, int32_t& OutValue, uint8_t  LookupType); // Function Engine.SkeletalMeshComponent.GetIntegerAttribute
	bool GetFloatAttribute_Ref(struct FName& BoneName, struct FName& AttributeName, float& OutValue, uint8_t  LookupType); // Function Engine.SkeletalMeshComponent.GetFloatAttribute_Ref
	bool GetFloatAttribute(struct FName& BoneName, struct FName& AttributeName, float DefaultValue, float& OutValue, uint8_t  LookupType); // Function Engine.SkeletalMeshComponent.GetFloatAttribute
	bool GetDisablePostProcessBlueprint(); // Function Engine.SkeletalMeshComponent.GetDisablePostProcessBlueprint
	bool GetDisableAnimCurves(); // Function Engine.SkeletalMeshComponent.GetDisableAnimCurves
	void GetCurrentJointAngles(struct FName InBoneName, float& Swing1Angle, float& TwistAngle, float& Swing2Angle); // Function Engine.SkeletalMeshComponent.GetCurrentJointAngles
	float GetClothMaxDistanceScale(); // Function Engine.SkeletalMeshComponent.GetClothMaxDistanceScale
	struct UClothingSimulationInteractor* GetClothingSimulationInteractor(); // Function Engine.SkeletalMeshComponent.GetClothingSimulationInteractor
	float GetBoneMass(struct FName BoneName, bool bScaleMass); // Function Engine.SkeletalMeshComponent.GetBoneMass
	struct UAnimInstance* GetAnimInstance(); // Function Engine.SkeletalMeshComponent.GetAnimInstance
	UObject* GetAnimClass(); // Function Engine.SkeletalMeshComponent.GetAnimClass
	char EAnimationMode GetAnimationMode(); // Function Engine.SkeletalMeshComponent.GetAnimationMode
	bool GetAllowRigidBodyAnimNode(); // Function Engine.SkeletalMeshComponent.GetAllowRigidBodyAnimNode
	bool GetAllowedAnimCurveEvaluate(); // Function Engine.SkeletalMeshComponent.GetAllowedAnimCurveEvaluate
	void ForceClothNextUpdateTeleportAndReset(); // Function Engine.SkeletalMeshComponent.ForceClothNextUpdateTeleportAndReset
	void ForceClothNextUpdateTeleport(); // Function Engine.SkeletalMeshComponent.ForceClothNextUpdateTeleport
	struct FName FindConstraintBoneName(int32_t ConstraintIndex); // Function Engine.SkeletalMeshComponent.FindConstraintBoneName
	void ClearMorphTargets(); // Function Engine.SkeletalMeshComponent.ClearMorphTargets
	void BreakConstraint(struct FVector Impulse, struct FVector HitLocation, struct FName InBoneName); // Function Engine.SkeletalMeshComponent.BreakConstraint
	void BindClothToMasterPoseComponent(); // Function Engine.SkeletalMeshComponent.BindClothToMasterPoseComponent
	void AllowAnimCurveEvaluation(struct FName NameOfCurve, bool bAllow); // Function Engine.SkeletalMeshComponent.AllowAnimCurveEvaluation
	void AddImpulseToAllBodiesBelow(struct FVector Impulse, struct FName BoneName, bool bVelChange, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.AddImpulseToAllBodiesBelow
	void AddForceToAllBodiesBelow(struct FVector force, struct FName BoneName, bool bAccelChange, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.AddForceToAllBodiesBelow
	void AccumulateAllBodiesBelowPhysicsBlendWeight(struct FName& InBoneName, float AddPhysicsBlendWeight, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.AccumulateAllBodiesBelowPhysicsBlendWeight
}; 



// Class Engine.DynamicSubsystem
// Size: 0x30(Inherited: 0x30) 
struct UDynamicSubsystem : public USubsystem
{

}; 



// Class Engine.KismetStringTableLibrary
// Size: 0x28(Inherited: 0x28) 
struct UKismetStringTableLibrary : public UBlueprintFunctionLibrary
{

	bool IsRegisteredTableId(struct FName TableId); // Function Engine.KismetStringTableLibrary.IsRegisteredTableId
	bool IsRegisteredTableEntry(struct FName TableId, struct FString Key); // Function Engine.KismetStringTableLibrary.IsRegisteredTableEntry
	struct FString GetTableNamespace(struct FName TableId); // Function Engine.KismetStringTableLibrary.GetTableNamespace
	struct FString GetTableEntrySourceString(struct FName TableId, struct FString Key); // Function Engine.KismetStringTableLibrary.GetTableEntrySourceString
	struct FString GetTableEntryMetaData(struct FName TableId, struct FString Key, struct FName MetaDataId); // Function Engine.KismetStringTableLibrary.GetTableEntryMetaData
	struct TArray<struct FName> GetRegisteredStringTables(); // Function Engine.KismetStringTableLibrary.GetRegisteredStringTables
	struct TArray<struct FName> GetMetaDataIdsFromStringTableEntry(struct FName TableId, struct FString Key); // Function Engine.KismetStringTableLibrary.GetMetaDataIdsFromStringTableEntry
	struct TArray<struct FString> GetKeysFromStringTable(struct FName TableId); // Function Engine.KismetStringTableLibrary.GetKeysFromStringTable
}; 



// Class Engine.KismetSystemLibrary
// Size: 0x28(Inherited: 0x28) 
struct UKismetSystemLibrary : public UBlueprintFunctionLibrary
{

	void UnregisterForRemoteNotifications(); // Function Engine.KismetSystemLibrary.UnregisterForRemoteNotifications
	void UnloadPrimaryAssetList(struct TArray<struct FPrimaryAssetId>& PrimaryAssetIdList); // Function Engine.KismetSystemLibrary.UnloadPrimaryAssetList
	void UnloadPrimaryAsset(struct FPrimaryAssetId PrimaryAssetId); // Function Engine.KismetSystemLibrary.UnloadPrimaryAsset
	void TransactObject(struct UObject* Object); // Function Engine.KismetSystemLibrary.TransactObject
	void TickLatentActionsEditorOnly(struct UObject* WorldContextObject, struct UObject* Object, float dTime); // Function Engine.KismetSystemLibrary.TickLatentActionsEditorOnly
	void StackTrace(); // Function Engine.KismetSystemLibrary.StackTrace
	bool SphereTraceSingleForObjects(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, float Radius, struct TArray<char EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct FHitResult& OutHit, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.SphereTraceSingleForObjects
	bool SphereTraceSingleByProfile(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, float Radius, struct FName ProfileName, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct FHitResult& OutHit, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.SphereTraceSingleByProfile
	bool SphereTraceSingle(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, float Radius, char ETraceTypeQuery TraceChannel, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct FHitResult& OutHit, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.SphereTraceSingle
	bool SphereTraceMultiForObjects(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, float Radius, struct TArray<char EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct TArray<struct FHitResult>& OutHits, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.SphereTraceMultiForObjects
	bool SphereTraceMultiByProfile(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, float Radius, struct FName ProfileName, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct TArray<struct FHitResult>& OutHits, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.SphereTraceMultiByProfile
	bool SphereTraceMulti(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, float Radius, char ETraceTypeQuery TraceChannel, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct TArray<struct FHitResult>& OutHits, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.SphereTraceMulti
	bool SphereOverlapComponents(struct UObject* WorldContextObject, struct FVector SpherePos, float SphereRadius, struct TArray<char EObjectTypeQuery>& ObjectTypes, UObject* ComponentClassFilter, struct TArray<struct AActor*>& ActorsToIgnore, struct TArray<struct UPrimitiveComponent*>& OutComponents); // Function Engine.KismetSystemLibrary.SphereOverlapComponents
	bool SphereOverlapActors(struct UObject* WorldContextObject, struct FVector SpherePos, float SphereRadius, struct TArray<char EObjectTypeQuery>& ObjectTypes, UObject* ActorClassFilter, struct TArray<struct AActor*>& ActorsToIgnore, struct TArray<struct AActor*>& OutActors); // Function Engine.KismetSystemLibrary.SphereOverlapActors
	void SnapshotObject(struct UObject* Object); // Function Engine.KismetSystemLibrary.SnapshotObject
	void ShowPlatformSpecificLeaderboardScreen(struct FString CategoryName); // Function Engine.KismetSystemLibrary.ShowPlatformSpecificLeaderboardScreen
	void ShowPlatformSpecificAchievementsScreen(struct APlayerController* SpecificPlayer); // Function Engine.KismetSystemLibrary.ShowPlatformSpecificAchievementsScreen
	void ShowInterstitialAd(); // Function Engine.KismetSystemLibrary.ShowInterstitialAd
	void ShowAdBanner(int32_t AdIdIndex, bool bShowOnBottomOfScreen); // Function Engine.KismetSystemLibrary.ShowAdBanner
	void SetWindowTitle(struct FText& Title); // Function Engine.KismetSystemLibrary.SetWindowTitle
	void SetVolumeButtonsHandledBySystem(bool bEnabled); // Function Engine.KismetSystemLibrary.SetVolumeButtonsHandledBySystem
	void SetVectorPropertyByName(struct UObject* Object, struct FName PropertyName, struct FVector& Value); // Function Engine.KismetSystemLibrary.SetVectorPropertyByName
	void SetUserActivity(struct FUserActivity& UserActivity); // Function Engine.KismetSystemLibrary.SetUserActivity
	void SetTransformPropertyByName(struct UObject* Object, struct FName PropertyName, struct FTransform& Value); // Function Engine.KismetSystemLibrary.SetTransformPropertyByName
	void SetTextPropertyByName(struct UObject* Object, struct FName PropertyName, struct FText& Value); // Function Engine.KismetSystemLibrary.SetTextPropertyByName
	void SetSuppressViewportTransitionMessage(struct UObject* WorldContextObject, bool bState); // Function Engine.KismetSystemLibrary.SetSuppressViewportTransitionMessage
	void SetStructurePropertyByName(struct UObject* Object, struct FName PropertyName, struct FGenericStruct& Value); // Function Engine.KismetSystemLibrary.SetStructurePropertyByName
	void SetStringPropertyByName(struct UObject* Object, struct FName PropertyName, struct FString Value); // Function Engine.KismetSystemLibrary.SetStringPropertyByName
	void SetSoftObjectPropertyByName(struct UObject* Object, struct FName PropertyName, struct TSoftObjectPtr<UObject>& Value); // Function Engine.KismetSystemLibrary.SetSoftObjectPropertyByName
	void SetSoftClassPropertyByName(struct UObject* Object, struct FName PropertyName, struct TSoftClassPtr<UObject>& Value); // Function Engine.KismetSystemLibrary.SetSoftClassPropertyByName
	void SetRotatorPropertyByName(struct UObject* Object, struct FName PropertyName, struct FRotator& Value); // Function Engine.KismetSystemLibrary.SetRotatorPropertyByName
	void SetObjectPropertyByName(struct UObject* Object, struct FName PropertyName, struct UObject* Value); // Function Engine.KismetSystemLibrary.SetObjectPropertyByName
	void SetNamePropertyByName(struct UObject* Object, struct FName PropertyName, struct FName& Value); // Function Engine.KismetSystemLibrary.SetNamePropertyByName
	void SetLinearColorPropertyByName(struct UObject* Object, struct FName PropertyName, struct FLinearColor& Value); // Function Engine.KismetSystemLibrary.SetLinearColorPropertyByName
	void SetIntPropertyByName(struct UObject* Object, struct FName PropertyName, int32_t Value); // Function Engine.KismetSystemLibrary.SetIntPropertyByName
	void SetInterfacePropertyByName(struct UObject* Object, struct FName PropertyName, struct TScriptInterface<IInterface>& Value); // Function Engine.KismetSystemLibrary.SetInterfacePropertyByName
	void SetInt64PropertyByName(struct UObject* Object, struct FName PropertyName, int64_t Value); // Function Engine.KismetSystemLibrary.SetInt64PropertyByName
	void SetGamepadsBlockDeviceFeedback(bool bBlock); // Function Engine.KismetSystemLibrary.SetGamepadsBlockDeviceFeedback
	void SetFloatPropertyByName(struct UObject* Object, struct FName PropertyName, float Value); // Function Engine.KismetSystemLibrary.SetFloatPropertyByName
	void SetFieldPathPropertyByName(struct UObject* Object, struct FName PropertyName, struct TFieldPath<FNone>& Value); // Function Engine.KismetSystemLibrary.SetFieldPathPropertyByName
	void SetColorPropertyByName(struct UObject* Object, struct FName PropertyName, struct FColor& Value); // Function Engine.KismetSystemLibrary.SetColorPropertyByName
	void SetCollisionProfileNameProperty(struct UObject* Object, struct FName PropertyName, struct FCollisionProfileName& Value); // Function Engine.KismetSystemLibrary.SetCollisionProfileNameProperty
	void SetClassPropertyByName(struct UObject* Object, struct FName PropertyName, UObject* Value); // Function Engine.KismetSystemLibrary.SetClassPropertyByName
	void SetBytePropertyByName(struct UObject* Object, struct FName PropertyName, char Value); // Function Engine.KismetSystemLibrary.SetBytePropertyByName
	void SetBoolPropertyByName(struct UObject* Object, struct FName PropertyName, bool Value); // Function Engine.KismetSystemLibrary.SetBoolPropertyByName
	void RetriggerableDelay(struct UObject* WorldContextObject, float Duration, struct FLatentActionInfo LatentInfo); // Function Engine.KismetSystemLibrary.RetriggerableDelay
	void ResetGamepadAssignmentToController(int32_t ControllerId); // Function Engine.KismetSystemLibrary.ResetGamepadAssignmentToController
	void ResetGamepadAssignments(); // Function Engine.KismetSystemLibrary.ResetGamepadAssignments
	void RegisterForRemoteNotifications(); // Function Engine.KismetSystemLibrary.RegisterForRemoteNotifications
	void QuitGame(struct UObject* WorldContextObject, struct APlayerController* SpecificPlayer, char EQuitPreference QuitPreference, bool bIgnorePlatformRestrictions); // Function Engine.KismetSystemLibrary.QuitGame
	void PrintWarning(struct FString inString); // Function Engine.KismetSystemLibrary.PrintWarning
	void PrintText(struct UObject* WorldContextObject, struct FText InText, bool bPrintToScreen, bool bPrintToLog, struct FLinearColor TextColor, float Duration); // Function Engine.KismetSystemLibrary.PrintText
	void PrintString(struct UObject* WorldContextObject, struct FString inString, bool bPrintToScreen, bool bPrintToLog, struct FLinearColor TextColor, float Duration); // Function Engine.KismetSystemLibrary.PrintString
	bool ParseParamValue(struct FString inString, struct FString InParam, struct FString& OutValue); // Function Engine.KismetSystemLibrary.ParseParamValue
	bool ParseParam(struct FString inString, struct FString InParam); // Function Engine.KismetSystemLibrary.ParseParam
	void ParseCommandLine(struct FString InCmdLine, struct TArray<struct FString>& OutTokens, struct TArray<struct FString>& OutSwitches, struct TMap<struct FString, struct FString>& OutParams); // Function Engine.KismetSystemLibrary.ParseCommandLine
	void OnAssetLoaded__DelegateSignature(struct UObject* Loaded); // DelegateFunction Engine.KismetSystemLibrary.OnAssetLoaded__DelegateSignature
	void OnAssetClassLoaded__DelegateSignature(UObject* Loaded); // DelegateFunction Engine.KismetSystemLibrary.OnAssetClassLoaded__DelegateSignature
	bool NotEqual_SoftObjectReference(struct TSoftObjectPtr<UObject>& A, struct TSoftObjectPtr<UObject>& B); // Function Engine.KismetSystemLibrary.NotEqual_SoftObjectReference
	bool NotEqual_SoftClassReference(struct TSoftClassPtr<UObject>& A, struct TSoftClassPtr<UObject>& B); // Function Engine.KismetSystemLibrary.NotEqual_SoftClassReference
	bool NotEqual_PrimaryAssetType(struct FPrimaryAssetType A, struct FPrimaryAssetType B); // Function Engine.KismetSystemLibrary.NotEqual_PrimaryAssetType
	bool NotEqual_PrimaryAssetId(struct FPrimaryAssetId A, struct FPrimaryAssetId B); // Function Engine.KismetSystemLibrary.NotEqual_PrimaryAssetId
	struct FString NormalizeFilename(struct FString InFilename); // Function Engine.KismetSystemLibrary.NormalizeFilename
	void MoveComponentTo(struct USceneComponent* Component, struct FVector TargetRelativeLocation, struct FRotator TargetRelativeRotation, bool bEaseOut, bool bEaseIn, float OverTime, bool bForceShortestRotationPath, char EMoveComponentAction MoveAction, struct FLatentActionInfo LatentInfo); // Function Engine.KismetSystemLibrary.MoveComponentTo
	struct FSoftObjectPath MakeSoftObjectPath(struct FString PathString); // Function Engine.KismetSystemLibrary.MakeSoftObjectPath
	struct FSoftClassPath MakeSoftClassPath(struct FString PathString); // Function Engine.KismetSystemLibrary.MakeSoftClassPath
	struct FText MakeLiteralText(struct FText Value); // Function Engine.KismetSystemLibrary.MakeLiteralText
	struct FString MakeLiteralString(struct FString Value); // Function Engine.KismetSystemLibrary.MakeLiteralString
	struct FName MakeLiteralName(struct FName Value); // Function Engine.KismetSystemLibrary.MakeLiteralName
	int32_t MakeLiteralInt(int32_t Value); // Function Engine.KismetSystemLibrary.MakeLiteralInt
	float MakeLiteralFloat(float Value); // Function Engine.KismetSystemLibrary.MakeLiteralFloat
	char MakeLiteralByte(char Value); // Function Engine.KismetSystemLibrary.MakeLiteralByte
	bool MakeLiteralBool(bool Value); // Function Engine.KismetSystemLibrary.MakeLiteralBool
	void LoadInterstitialAd(int32_t AdIdIndex); // Function Engine.KismetSystemLibrary.LoadInterstitialAd
	UObject* LoadClassAsset_Blocking(struct TSoftClassPtr<UObject> AssetClass); // Function Engine.KismetSystemLibrary.LoadClassAsset_Blocking
	void LoadAssetClass(struct UObject* WorldContextObject, struct TSoftClassPtr<UObject> AssetClass, struct FDelegate OnLoaded, struct FLatentActionInfo LatentInfo); // Function Engine.KismetSystemLibrary.LoadAssetClass
	struct UObject* LoadAsset_Blocking(struct TSoftObjectPtr<UObject> Asset); // Function Engine.KismetSystemLibrary.LoadAsset_Blocking
	void LoadAsset(struct UObject* WorldContextObject, struct TSoftObjectPtr<UObject> Asset, struct FDelegate OnLoaded, struct FLatentActionInfo LatentInfo); // Function Engine.KismetSystemLibrary.LoadAsset
	bool LineTraceSingleForObjects(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, struct TArray<char EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct FHitResult& OutHit, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.LineTraceSingleForObjects
	bool LineTraceSingleByProfile(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, struct FName ProfileName, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct FHitResult& OutHit, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.LineTraceSingleByProfile
	bool LineTraceSingle(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, char ETraceTypeQuery TraceChannel, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct FHitResult& OutHit, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.LineTraceSingle
	bool LineTraceMultiForObjects(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, struct TArray<char EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct TArray<struct FHitResult>& OutHits, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.LineTraceMultiForObjects
	bool LineTraceMultiByProfile(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, struct FName ProfileName, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct TArray<struct FHitResult>& OutHits, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.LineTraceMultiByProfile
	bool LineTraceMulti(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, char ETraceTypeQuery TraceChannel, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct TArray<struct FHitResult>& OutHits, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.LineTraceMulti
	void LaunchURL(struct FString URL); // Function Engine.KismetSystemLibrary.LaunchURL
	void K2_UnPauseTimerHandle(struct UObject* WorldContextObject, struct FTimerHandle Handle); // Function Engine.KismetSystemLibrary.K2_UnPauseTimerHandle
	void K2_UnPauseTimerDelegate(struct FDelegate Delegate); // Function Engine.KismetSystemLibrary.K2_UnPauseTimerDelegate
	void K2_UnPauseTimer(struct UObject* Object, struct FString FunctionName); // Function Engine.KismetSystemLibrary.K2_UnPauseTimer
	bool K2_TimerExistsHandle(struct UObject* WorldContextObject, struct FTimerHandle Handle); // Function Engine.KismetSystemLibrary.K2_TimerExistsHandle
	bool K2_TimerExistsDelegate(struct FDelegate Delegate); // Function Engine.KismetSystemLibrary.K2_TimerExistsDelegate
	bool K2_TimerExists(struct UObject* Object, struct FString FunctionName); // Function Engine.KismetSystemLibrary.K2_TimerExists
	struct FTimerHandle K2_SetTimerDelegate(struct FDelegate Delegate, float Time, bool bLooping, float InitialStartDelay, float InitialStartDelayVariance); // Function Engine.KismetSystemLibrary.K2_SetTimerDelegate
	struct FTimerHandle K2_SetTimer(struct UObject* Object, struct FString FunctionName, float Time, bool bLooping, float InitialStartDelay, float InitialStartDelayVariance); // Function Engine.KismetSystemLibrary.K2_SetTimer
	void K2_PauseTimerHandle(struct UObject* WorldContextObject, struct FTimerHandle Handle); // Function Engine.KismetSystemLibrary.K2_PauseTimerHandle
	void K2_PauseTimerDelegate(struct FDelegate Delegate); // Function Engine.KismetSystemLibrary.K2_PauseTimerDelegate
	void K2_PauseTimer(struct UObject* Object, struct FString FunctionName); // Function Engine.KismetSystemLibrary.K2_PauseTimer
	bool K2_IsValidTimerHandle(struct FTimerHandle Handle); // Function Engine.KismetSystemLibrary.K2_IsValidTimerHandle
	bool K2_IsTimerPausedHandle(struct UObject* WorldContextObject, struct FTimerHandle Handle); // Function Engine.KismetSystemLibrary.K2_IsTimerPausedHandle
	bool K2_IsTimerPausedDelegate(struct FDelegate Delegate); // Function Engine.KismetSystemLibrary.K2_IsTimerPausedDelegate
	bool K2_IsTimerPaused(struct UObject* Object, struct FString FunctionName); // Function Engine.KismetSystemLibrary.K2_IsTimerPaused
	bool K2_IsTimerActiveHandle(struct UObject* WorldContextObject, struct FTimerHandle Handle); // Function Engine.KismetSystemLibrary.K2_IsTimerActiveHandle
	bool K2_IsTimerActiveDelegate(struct FDelegate Delegate); // Function Engine.KismetSystemLibrary.K2_IsTimerActiveDelegate
	bool K2_IsTimerActive(struct UObject* Object, struct FString FunctionName); // Function Engine.KismetSystemLibrary.K2_IsTimerActive
	struct FTimerHandle K2_InvalidateTimerHandle(struct FTimerHandle& Handle); // Function Engine.KismetSystemLibrary.K2_InvalidateTimerHandle
	float K2_GetTimerRemainingTimeHandle(struct UObject* WorldContextObject, struct FTimerHandle Handle); // Function Engine.KismetSystemLibrary.K2_GetTimerRemainingTimeHandle
	float K2_GetTimerRemainingTimeDelegate(struct FDelegate Delegate); // Function Engine.KismetSystemLibrary.K2_GetTimerRemainingTimeDelegate
	float K2_GetTimerRemainingTime(struct UObject* Object, struct FString FunctionName); // Function Engine.KismetSystemLibrary.K2_GetTimerRemainingTime
	float K2_GetTimerElapsedTimeHandle(struct UObject* WorldContextObject, struct FTimerHandle Handle); // Function Engine.KismetSystemLibrary.K2_GetTimerElapsedTimeHandle
	float K2_GetTimerElapsedTimeDelegate(struct FDelegate Delegate); // Function Engine.KismetSystemLibrary.K2_GetTimerElapsedTimeDelegate
	float K2_GetTimerElapsedTime(struct UObject* Object, struct FString FunctionName); // Function Engine.KismetSystemLibrary.K2_GetTimerElapsedTime
	void K2_ClearTimerHandle(struct UObject* WorldContextObject, struct FTimerHandle Handle); // Function Engine.KismetSystemLibrary.K2_ClearTimerHandle
	void K2_ClearTimerDelegate(struct FDelegate Delegate); // Function Engine.KismetSystemLibrary.K2_ClearTimerDelegate
	void K2_ClearTimer(struct UObject* Object, struct FString FunctionName); // Function Engine.KismetSystemLibrary.K2_ClearTimer
	void K2_ClearAndInvalidateTimerHandle(struct UObject* WorldContextObject, struct FTimerHandle& Handle); // Function Engine.KismetSystemLibrary.K2_ClearAndInvalidateTimerHandle
	bool IsValidSoftObjectReference(struct TSoftObjectPtr<UObject>& SoftObjectReference); // Function Engine.KismetSystemLibrary.IsValidSoftObjectReference
	bool IsValidSoftClassReference(struct TSoftClassPtr<UObject>& SoftClassReference); // Function Engine.KismetSystemLibrary.IsValidSoftClassReference
	bool IsValidPrimaryAssetType(struct FPrimaryAssetType PrimaryAssetType); // Function Engine.KismetSystemLibrary.IsValidPrimaryAssetType
	bool IsValidPrimaryAssetId(struct FPrimaryAssetId PrimaryAssetId); // Function Engine.KismetSystemLibrary.IsValidPrimaryAssetId
	bool IsValidClass(UObject* Class); // Function Engine.KismetSystemLibrary.IsValidClass
	bool IsValid(struct UObject* Object); // Function Engine.KismetSystemLibrary.IsValid
	bool IsUnattended(); // Function Engine.KismetSystemLibrary.IsUnattended
	bool IsStandalone(struct UObject* WorldContextObject); // Function Engine.KismetSystemLibrary.IsStandalone
	bool IsSplitScreen(struct UObject* WorldContextObject); // Function Engine.KismetSystemLibrary.IsSplitScreen
	bool IsServer(struct UObject* WorldContextObject); // Function Engine.KismetSystemLibrary.IsServer
	bool IsScreensaverEnabled(); // Function Engine.KismetSystemLibrary.IsScreensaverEnabled
	bool IsPackagedForDistribution(); // Function Engine.KismetSystemLibrary.IsPackagedForDistribution
	bool IsLoggedIn(struct APlayerController* SpecificPlayer); // Function Engine.KismetSystemLibrary.IsLoggedIn
	bool IsInterstitialAdRequested(); // Function Engine.KismetSystemLibrary.IsInterstitialAdRequested
	bool IsInterstitialAdAvailable(); // Function Engine.KismetSystemLibrary.IsInterstitialAdAvailable
	bool IsDedicatedServer(struct UObject* WorldContextObject); // Function Engine.KismetSystemLibrary.IsDedicatedServer
	bool IsControllerAssignedToGamepad(int32_t ControllerId); // Function Engine.KismetSystemLibrary.IsControllerAssignedToGamepad
	void HideAdBanner(); // Function Engine.KismetSystemLibrary.HideAdBanner
	bool GetVolumeButtonsHandledBySystem(); // Function Engine.KismetSystemLibrary.GetVolumeButtonsHandledBySystem
	struct FRotator GetViewportRotationEditorOnly(struct UObject* WorldContextObject, int32_t ID); // Function Engine.KismetSystemLibrary.GetViewportRotationEditorOnly
	struct FVector GetViewportLocation(struct UObject* WorldContextObject, int32_t ID); // Function Engine.KismetSystemLibrary.GetViewportLocation
	struct FString GetUniqueDeviceId(); // Function Engine.KismetSystemLibrary.GetUniqueDeviceId
	struct FString GetSystemPath(struct UObject* Object); // Function Engine.KismetSystemLibrary.GetSystemPath
	bool GetSupportedFullscreenResolutions(struct TArray<struct FIntPoint>& Resolutions); // Function Engine.KismetSystemLibrary.GetSupportedFullscreenResolutions
	struct TSoftObjectPtr<UObject> GetSoftObjectReferenceFromPrimaryAssetId(struct FPrimaryAssetId PrimaryAssetId); // Function Engine.KismetSystemLibrary.GetSoftObjectReferenceFromPrimaryAssetId
	struct TSoftClassPtr<UObject> GetSoftClassReferenceFromPrimaryAssetId(struct FPrimaryAssetId PrimaryAssetId); // Function Engine.KismetSystemLibrary.GetSoftClassReferenceFromPrimaryAssetId
	int32_t GetRenderingMaterialQualityLevel(); // Function Engine.KismetSystemLibrary.GetRenderingMaterialQualityLevel
	int32_t GetRenderingDetailMode(); // Function Engine.KismetSystemLibrary.GetRenderingDetailMode
	struct FString GetProjectSavedDirectory(); // Function Engine.KismetSystemLibrary.GetProjectSavedDirectory
	struct FString GetProjectDirectory(); // Function Engine.KismetSystemLibrary.GetProjectDirectory
	struct FString GetProjectContentDirectory(); // Function Engine.KismetSystemLibrary.GetProjectContentDirectory
	void GetPrimaryAssetsWithBundleState(struct TArray<struct FName>& RequiredBundles, struct TArray<struct FName>& ExcludedBundles, struct TArray<struct FPrimaryAssetType>& ValidTypes, bool bForceCurrentState, struct TArray<struct FPrimaryAssetId>& OutPrimaryAssetIdList); // Function Engine.KismetSystemLibrary.GetPrimaryAssetsWithBundleState
	void GetPrimaryAssetIdList(struct FPrimaryAssetType PrimaryAssetType, struct TArray<struct FPrimaryAssetId>& OutPrimaryAssetIdList); // Function Engine.KismetSystemLibrary.GetPrimaryAssetIdList
	struct FPrimaryAssetId GetPrimaryAssetIdFromSoftObjectReference(struct TSoftObjectPtr<UObject> SoftObjectReference); // Function Engine.KismetSystemLibrary.GetPrimaryAssetIdFromSoftObjectReference
	struct FPrimaryAssetId GetPrimaryAssetIdFromSoftClassReference(struct TSoftClassPtr<UObject> SoftClassReference); // Function Engine.KismetSystemLibrary.GetPrimaryAssetIdFromSoftClassReference
	struct FPrimaryAssetId GetPrimaryAssetIdFromObject(struct UObject* Object); // Function Engine.KismetSystemLibrary.GetPrimaryAssetIdFromObject
	struct FPrimaryAssetId GetPrimaryAssetIdFromClass(UObject* Class); // Function Engine.KismetSystemLibrary.GetPrimaryAssetIdFromClass
	struct TArray<struct FString> GetPreferredLanguages(); // Function Engine.KismetSystemLibrary.GetPreferredLanguages
	struct FString GetPlatformUserName(); // Function Engine.KismetSystemLibrary.GetPlatformUserName
	struct FString GetPlatformUserDir(); // Function Engine.KismetSystemLibrary.GetPlatformUserDir
	struct FString GetPathName(struct UObject* Object); // Function Engine.KismetSystemLibrary.GetPathName
	struct UObject* GetOuterObject(struct UObject* Object); // Function Engine.KismetSystemLibrary.GetOuterObject
	struct FString GetObjectName(struct UObject* Object); // Function Engine.KismetSystemLibrary.GetObjectName
	struct UObject* GetObjectFromPrimaryAssetId(struct FPrimaryAssetId PrimaryAssetId); // Function Engine.KismetSystemLibrary.GetObjectFromPrimaryAssetId
	int32_t GetMinYResolutionForUI(); // Function Engine.KismetSystemLibrary.GetMinYResolutionForUI
	int32_t GetMinYResolutionFor3DView(); // Function Engine.KismetSystemLibrary.GetMinYResolutionFor3DView
	struct FString GetLocalCurrencySymbol(); // Function Engine.KismetSystemLibrary.GetLocalCurrencySymbol
	struct FString GetLocalCurrencyCode(); // Function Engine.KismetSystemLibrary.GetLocalCurrencyCode
	float GetGameTimeInSeconds(struct UObject* WorldContextObject); // Function Engine.KismetSystemLibrary.GetGameTimeInSeconds
	struct FString GetGamepadControllerName(int32_t ControllerId); // Function Engine.KismetSystemLibrary.GetGamepadControllerName
	struct UTexture2D* GetGamepadButtonGlyph(struct FString ButtonKey, int32_t ControllerIndex); // Function Engine.KismetSystemLibrary.GetGamepadButtonGlyph
	struct FString GetGameName(); // Function Engine.KismetSystemLibrary.GetGameName
	struct FString GetGameBundleId(); // Function Engine.KismetSystemLibrary.GetGameBundleId
	int64_t GetFrameCount(); // Function Engine.KismetSystemLibrary.GetFrameCount
	struct FString GetEngineVersion(); // Function Engine.KismetSystemLibrary.GetEngineVersion
	struct FString GetDisplayName(struct UObject* Object); // Function Engine.KismetSystemLibrary.GetDisplayName
	struct FString GetDeviceId(); // Function Engine.KismetSystemLibrary.GetDeviceId
	struct FString GetDefaultLocale(); // Function Engine.KismetSystemLibrary.GetDefaultLocale
	struct FString GetDefaultLanguage(); // Function Engine.KismetSystemLibrary.GetDefaultLanguage
	bool GetCurrentBundleState(struct FPrimaryAssetId PrimaryAssetId, bool bForceCurrentState, struct TArray<struct FName>& OutBundles); // Function Engine.KismetSystemLibrary.GetCurrentBundleState
	bool GetConvenientWindowedResolutions(struct TArray<struct FIntPoint>& Resolutions); // Function Engine.KismetSystemLibrary.GetConvenientWindowedResolutions
	int32_t GetConsoleVariableIntValue(struct FString VariableName); // Function Engine.KismetSystemLibrary.GetConsoleVariableIntValue
	float GetConsoleVariableFloatValue(struct FString VariableName); // Function Engine.KismetSystemLibrary.GetConsoleVariableFloatValue
	bool GetConsoleVariableBoolValue(struct FString VariableName); // Function Engine.KismetSystemLibrary.GetConsoleVariableBoolValue
	void GetComponentBounds(struct USceneComponent* Component, struct FVector& Origin, struct FVector& BoxExtent, float& SphereRadius); // Function Engine.KismetSystemLibrary.GetComponentBounds
	struct FString GetCommandLine(); // Function Engine.KismetSystemLibrary.GetCommandLine
	UObject* GetClassFromPrimaryAssetId(struct FPrimaryAssetId PrimaryAssetId); // Function Engine.KismetSystemLibrary.GetClassFromPrimaryAssetId
	struct FString GetClassDisplayName(UObject* Class); // Function Engine.KismetSystemLibrary.GetClassDisplayName
	int32_t GetAdIDCount(); // Function Engine.KismetSystemLibrary.GetAdIDCount
	void GetActorListFromComponentList(struct TArray<struct UPrimitiveComponent*>& ComponentList, UObject* ActorClassFilter, struct TArray<struct AActor*>& OutActorList); // Function Engine.KismetSystemLibrary.GetActorListFromComponentList
	void GetActorBounds(struct AActor* Actor, struct FVector& Origin, struct FVector& BoxExtent); // Function Engine.KismetSystemLibrary.GetActorBounds
	void ForceCloseAdBanner(); // Function Engine.KismetSystemLibrary.ForceCloseAdBanner
	void FlushPersistentDebugLines(struct UObject* WorldContextObject); // Function Engine.KismetSystemLibrary.FlushPersistentDebugLines
	void FlushDebugStrings(struct UObject* WorldContextObject); // Function Engine.KismetSystemLibrary.FlushDebugStrings
	void ExecuteConsoleCommand(struct UObject* WorldContextObject, struct FString Command, struct APlayerController* SpecificPlayer); // Function Engine.KismetSystemLibrary.ExecuteConsoleCommand
	bool EqualEqual_SoftObjectReference(struct TSoftObjectPtr<UObject>& A, struct TSoftObjectPtr<UObject>& B); // Function Engine.KismetSystemLibrary.EqualEqual_SoftObjectReference
	bool EqualEqual_SoftClassReference(struct TSoftClassPtr<UObject>& A, struct TSoftClassPtr<UObject>& B); // Function Engine.KismetSystemLibrary.EqualEqual_SoftClassReference
	bool EqualEqual_PrimaryAssetType(struct FPrimaryAssetType A, struct FPrimaryAssetType B); // Function Engine.KismetSystemLibrary.EqualEqual_PrimaryAssetType
	bool EqualEqual_PrimaryAssetId(struct FPrimaryAssetId A, struct FPrimaryAssetId B); // Function Engine.KismetSystemLibrary.EqualEqual_PrimaryAssetId
	int32_t EndTransaction(); // Function Engine.KismetSystemLibrary.EndTransaction
	void DrawDebugString(struct UObject* WorldContextObject, struct FVector TextLocation, struct FString Text, struct AActor* TestBaseActor, struct FLinearColor TextColor, float Duration); // Function Engine.KismetSystemLibrary.DrawDebugString
	void DrawDebugSphere(struct UObject* WorldContextObject, struct FVector Center, float Radius, int32_t Segments, struct FLinearColor LineColor, float Duration, float Thickness); // Function Engine.KismetSystemLibrary.DrawDebugSphere
	void DrawDebugPoint(struct UObject* WorldContextObject, struct FVector position, float Size, struct FLinearColor PointColor, float Duration); // Function Engine.KismetSystemLibrary.DrawDebugPoint
	void DrawDebugPlane(struct UObject* WorldContextObject, struct FPlane& PlaneCoordinates, struct FVector Location, float Size, struct FLinearColor PlaneColor, float Duration); // Function Engine.KismetSystemLibrary.DrawDebugPlane
	void DrawDebugLine(struct UObject* WorldContextObject, struct FVector LineStart, struct FVector LineEnd, struct FLinearColor LineColor, float Duration, float Thickness); // Function Engine.KismetSystemLibrary.DrawDebugLine
	void DrawDebugFrustum(struct UObject* WorldContextObject, struct FTransform& FrustumTransform, struct FLinearColor FrustumColor, float Duration, float Thickness); // Function Engine.KismetSystemLibrary.DrawDebugFrustum
	void DrawDebugFloatHistoryTransform(struct UObject* WorldContextObject, struct FDebugFloatHistory& FloatHistory, struct FTransform& DrawTransform, struct FVector2D DrawSize, struct FLinearColor DrawColor, float Duration); // Function Engine.KismetSystemLibrary.DrawDebugFloatHistoryTransform
	void DrawDebugFloatHistoryLocation(struct UObject* WorldContextObject, struct FDebugFloatHistory& FloatHistory, struct FVector DrawLocation, struct FVector2D DrawSize, struct FLinearColor DrawColor, float Duration); // Function Engine.KismetSystemLibrary.DrawDebugFloatHistoryLocation
	void DrawDebugCylinder(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, float Radius, int32_t Segments, struct FLinearColor LineColor, float Duration, float Thickness); // Function Engine.KismetSystemLibrary.DrawDebugCylinder
	void DrawDebugCoordinateSystem(struct UObject* WorldContextObject, struct FVector AxisLoc, struct FRotator AxisRot, float Scale, float Duration, float Thickness); // Function Engine.KismetSystemLibrary.DrawDebugCoordinateSystem
	void DrawDebugConeInDegrees(struct UObject* WorldContextObject, struct FVector Origin, struct FVector Direction, float Length, float AngleWidth, float AngleHeight, int32_t NumSides, struct FLinearColor LineColor, float Duration, float Thickness); // Function Engine.KismetSystemLibrary.DrawDebugConeInDegrees
	void DrawDebugCone(struct UObject* WorldContextObject, struct FVector Origin, struct FVector Direction, float Length, float AngleWidth, float AngleHeight, int32_t NumSides, struct FLinearColor LineColor, float Duration, float Thickness); // Function Engine.KismetSystemLibrary.DrawDebugCone
	void DrawDebugCircle(struct UObject* WorldContextObject, struct FVector Center, float Radius, int32_t NumSegments, struct FLinearColor LineColor, float Duration, float Thickness, struct FVector YAxis, struct FVector ZAxis, bool bDrawAxis); // Function Engine.KismetSystemLibrary.DrawDebugCircle
	void DrawDebugCapsule(struct UObject* WorldContextObject, struct FVector Center, float HalfHeight, float Radius, struct FRotator Rotation, struct FLinearColor LineColor, float Duration, float Thickness); // Function Engine.KismetSystemLibrary.DrawDebugCapsule
	void DrawDebugCamera(struct ACameraActor* CameraActor, struct FLinearColor CameraColor, float Duration); // Function Engine.KismetSystemLibrary.DrawDebugCamera
	void DrawDebugBox(struct UObject* WorldContextObject, struct FVector Center, struct FVector Extent, struct FLinearColor LineColor, struct FRotator Rotation, float Duration, float Thickness); // Function Engine.KismetSystemLibrary.DrawDebugBox
	void DrawDebugArrow(struct UObject* WorldContextObject, struct FVector LineStart, struct FVector LineEnd, float ArrowSize, struct FLinearColor LineColor, float Duration, float Thickness); // Function Engine.KismetSystemLibrary.DrawDebugArrow
	bool DoesImplementInterface(struct UObject* TestObject, UInterface* Interface); // Function Engine.KismetSystemLibrary.DoesImplementInterface
	void Delay(struct UObject* WorldContextObject, float Duration, struct FLatentActionInfo LatentInfo); // Function Engine.KismetSystemLibrary.Delay
	void CreateCopyForUndoBuffer(struct UObject* ObjectToModify); // Function Engine.KismetSystemLibrary.CreateCopyForUndoBuffer
	struct FString ConvertToRelativePath(struct FString Filename); // Function Engine.KismetSystemLibrary.ConvertToRelativePath
	struct FString ConvertToAbsolutePath(struct FString Filename); // Function Engine.KismetSystemLibrary.ConvertToAbsolutePath
	struct TSoftObjectPtr<UObject> Conv_SoftObjPathToSoftObjRef(struct FSoftObjectPath& SoftObjectPath); // Function Engine.KismetSystemLibrary.Conv_SoftObjPathToSoftObjRef
	struct FString Conv_SoftObjectReferenceToString(struct TSoftObjectPtr<UObject>& SoftObjectReference); // Function Engine.KismetSystemLibrary.Conv_SoftObjectReferenceToString
	struct UObject* Conv_SoftObjectReferenceToObject(struct TSoftObjectPtr<UObject>& SoftObject); // Function Engine.KismetSystemLibrary.Conv_SoftObjectReferenceToObject
	struct FString Conv_SoftClassReferenceToString(struct TSoftClassPtr<UObject>& SoftClassReference); // Function Engine.KismetSystemLibrary.Conv_SoftClassReferenceToString
	UObject* Conv_SoftClassReferenceToClass(struct TSoftClassPtr<UObject>& SoftClass); // Function Engine.KismetSystemLibrary.Conv_SoftClassReferenceToClass
	struct TSoftClassPtr<UObject> Conv_SoftClassPathToSoftClassRef(struct FSoftClassPath& SoftClassPath); // Function Engine.KismetSystemLibrary.Conv_SoftClassPathToSoftClassRef
	struct FString Conv_PrimaryAssetTypeToString(struct FPrimaryAssetType PrimaryAssetType); // Function Engine.KismetSystemLibrary.Conv_PrimaryAssetTypeToString
	struct FString Conv_PrimaryAssetIdToString(struct FPrimaryAssetId PrimaryAssetId); // Function Engine.KismetSystemLibrary.Conv_PrimaryAssetIdToString
	struct TSoftObjectPtr<UObject> Conv_ObjectToSoftObjectReference(struct UObject* Object); // Function Engine.KismetSystemLibrary.Conv_ObjectToSoftObjectReference
	struct UObject* Conv_InterfaceToObject(struct TScriptInterface<IInterface>& Interface); // Function Engine.KismetSystemLibrary.Conv_InterfaceToObject
	struct TSoftClassPtr<UObject> Conv_ClassToSoftClassReference(UObject*& Class); // Function Engine.KismetSystemLibrary.Conv_ClassToSoftClassReference
	void ControlScreensaver(bool bAllowScreenSaver); // Function Engine.KismetSystemLibrary.ControlScreensaver
	bool ComponentOverlapComponents(struct UPrimitiveComponent* Component, struct FTransform& ComponentTransform, struct TArray<char EObjectTypeQuery>& ObjectTypes, UObject* ComponentClassFilter, struct TArray<struct AActor*>& ActorsToIgnore, struct TArray<struct UPrimitiveComponent*>& OutComponents); // Function Engine.KismetSystemLibrary.ComponentOverlapComponents
	bool ComponentOverlapActors(struct UPrimitiveComponent* Component, struct FTransform& ComponentTransform, struct TArray<char EObjectTypeQuery>& ObjectTypes, UObject* ActorClassFilter, struct TArray<struct AActor*>& ActorsToIgnore, struct TArray<struct AActor*>& OutActors); // Function Engine.KismetSystemLibrary.ComponentOverlapActors
	void CollectGarbage(); // Function Engine.KismetSystemLibrary.CollectGarbage
	bool CapsuleTraceSingleForObjects(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, float Radius, float HalfHeight, struct TArray<char EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct FHitResult& OutHit, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.CapsuleTraceSingleForObjects
	bool CapsuleTraceSingleByProfile(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, float Radius, float HalfHeight, struct FName ProfileName, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct FHitResult& OutHit, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.CapsuleTraceSingleByProfile
	bool CapsuleTraceSingle(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, float Radius, float HalfHeight, char ETraceTypeQuery TraceChannel, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct FHitResult& OutHit, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.CapsuleTraceSingle
	bool CapsuleTraceMultiForObjects(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, float Radius, float HalfHeight, struct TArray<char EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct TArray<struct FHitResult>& OutHits, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.CapsuleTraceMultiForObjects
	bool CapsuleTraceMultiByProfile(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, float Radius, float HalfHeight, struct FName ProfileName, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct TArray<struct FHitResult>& OutHits, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.CapsuleTraceMultiByProfile
	bool CapsuleTraceMulti(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, float Radius, float HalfHeight, char ETraceTypeQuery TraceChannel, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct TArray<struct FHitResult>& OutHits, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.CapsuleTraceMulti
	bool CapsuleOverlapComponents(struct UObject* WorldContextObject, struct FVector CapsulePos, float Radius, float HalfHeight, struct TArray<char EObjectTypeQuery>& ObjectTypes, UObject* ComponentClassFilter, struct TArray<struct AActor*>& ActorsToIgnore, struct TArray<struct UPrimitiveComponent*>& OutComponents); // Function Engine.KismetSystemLibrary.CapsuleOverlapComponents
	bool CapsuleOverlapActors(struct UObject* WorldContextObject, struct FVector CapsulePos, float Radius, float HalfHeight, struct TArray<char EObjectTypeQuery>& ObjectTypes, UObject* ActorClassFilter, struct TArray<struct AActor*>& ActorsToIgnore, struct TArray<struct AActor*>& OutActors); // Function Engine.KismetSystemLibrary.CapsuleOverlapActors
	bool CanLaunchURL(struct FString URL); // Function Engine.KismetSystemLibrary.CanLaunchURL
	void CancelTransaction(int32_t Index); // Function Engine.KismetSystemLibrary.CancelTransaction
	void BreakSoftObjectPath(struct FSoftObjectPath InSoftObjectPath, struct FString& PathString); // Function Engine.KismetSystemLibrary.BreakSoftObjectPath
	void BreakSoftClassPath(struct FSoftClassPath InSoftClassPath, struct FString& PathString); // Function Engine.KismetSystemLibrary.BreakSoftClassPath
	bool BoxTraceSingleForObjects(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, struct FVector HalfSize, struct FRotator Orientation, struct TArray<char EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct FHitResult& OutHit, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.BoxTraceSingleForObjects
	bool BoxTraceSingleByProfile(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, struct FVector HalfSize, struct FRotator Orientation, struct FName ProfileName, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct FHitResult& OutHit, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.BoxTraceSingleByProfile
	bool BoxTraceSingle(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, struct FVector HalfSize, struct FRotator Orientation, char ETraceTypeQuery TraceChannel, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct FHitResult& OutHit, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.BoxTraceSingle
	bool BoxTraceMultiForObjects(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, struct FVector HalfSize, struct FRotator Orientation, struct TArray<char EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct TArray<struct FHitResult>& OutHits, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.BoxTraceMultiForObjects
	bool BoxTraceMultiByProfile(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, struct FVector HalfSize, struct FRotator Orientation, struct FName ProfileName, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct TArray<struct FHitResult>& OutHits, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.BoxTraceMultiByProfile
	bool BoxTraceMulti(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, struct FVector HalfSize, struct FRotator Orientation, char ETraceTypeQuery TraceChannel, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, char EDrawDebugTrace DrawDebugType, struct TArray<struct FHitResult>& OutHits, bool bIgnoreSelf, struct FLinearColor TraceColor, struct FLinearColor TraceHitColor, float DrawTime); // Function Engine.KismetSystemLibrary.BoxTraceMulti
	bool BoxOverlapComponents(struct UObject* WorldContextObject, struct FVector BoxPos, struct FVector Extent, struct TArray<char EObjectTypeQuery>& ObjectTypes, UObject* ComponentClassFilter, struct TArray<struct AActor*>& ActorsToIgnore, struct TArray<struct UPrimitiveComponent*>& OutComponents); // Function Engine.KismetSystemLibrary.BoxOverlapComponents
	bool BoxOverlapActors(struct UObject* WorldContextObject, struct FVector BoxPos, struct FVector BoxExtent, struct TArray<char EObjectTypeQuery>& ObjectTypes, UObject* ActorClassFilter, struct TArray<struct AActor*>& ActorsToIgnore, struct TArray<struct AActor*>& OutActors); // Function Engine.KismetSystemLibrary.BoxOverlapActors
	int32_t BeginTransaction(struct FString Context, struct FText Description, struct UObject* PrimaryObject); // Function Engine.KismetSystemLibrary.BeginTransaction
	struct FDebugFloatHistory AddFloatHistorySample(float Value, struct FDebugFloatHistory& FloatHistory); // Function Engine.KismetSystemLibrary.AddFloatHistorySample
}; 



// Class Engine.MaterialExpressionShadingPathSwitch
// Size: 0x90(Inherited: 0x40) 
struct UMaterialExpressionShadingPathSwitch : public UMaterialExpression
{
	struct FExpressionInput Default;  // 0x40(0x14)
	struct FExpressionInput Inputs[3];  // 0x54(0x3C)

}; 



// Class Engine.AnimNotify
// Size: 0x38(Inherited: 0x28) 
struct UAnimNotify : public UObject
{
	char pad_40[16];  // 0x28(0x10)

	bool Received_Notify(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Engine.AnimNotify.Received_Notify
	struct FString GetNotifyName(); // Function Engine.AnimNotify.GetNotifyName
}; 



// Class Engine.ParticleSystemReplay
// Size: 0x40(Inherited: 0x28) 
struct UParticleSystemReplay : public UObject
{
	int32_t ClipIDNumber;  // 0x28(0x4)
	char pad_44[20];  // 0x2C(0x14)

}; 



// Class Engine.PrimitiveComponent
// Size: 0x450(Inherited: 0x200) 
struct UPrimitiveComponent : public USceneComponent
{
	float MinDrawDistance;  // 0x200(0x4)
	char pad_516_1 : 7;  // 0x204(0x1)
	bool UseHLODMinDrawDistance : 1;  // 0x204(0x1)
	char pad_517[3];  // 0x205(0x3)
	float LDMaxDrawDistance;  // 0x208(0x4)
	float CachedMaxDrawDistance;  // 0x20C(0x4)
	char ESceneDepthPriorityGroup DepthPriorityGroup;  // 0x210(0x1)
	char ESceneDepthPriorityGroup ViewOwnerDepthPriorityGroup;  // 0x211(0x1)
	char EIndirectLightingCacheQuality IndirectLightingCacheQuality;  // 0x212(0x1)
	uint8_t  LightmapType;  // 0x213(0x1)
	char bUseMaxLODAsImposter : 1;  // 0x214(0x1)
	char bBatchImpostersAsInstances : 1;  // 0x214(0x1)
	char bNeverDistanceCull : 1;  // 0x214(0x1)
	char pad_532_1 : 4;  // 0x214(0x1)
	char bAlwaysCreatePhysicsState : 1;  // 0x214(0x1)
	char bGenerateOverlapEvents : 1;  // 0x215(0x1)
	char bMultiBodyOverlap : 1;  // 0x215(0x1)
	char bTraceComplexOnMove : 1;  // 0x215(0x1)
	char bReturnMaterialOnMove : 1;  // 0x215(0x1)
	char bUseViewOwnerDepthPriorityGroup : 1;  // 0x215(0x1)
	char bAllowCullDistanceVolume : 1;  // 0x215(0x1)
	char bHasMotionBlurVelocityMeshes : 1;  // 0x215(0x1)
	char bVisibleInReflectionCaptures : 1;  // 0x215(0x1)
	char bVisibleInRealTimeSkyCaptures : 1;  // 0x216(0x1)
	char bVisibleInRayTracing : 1;  // 0x216(0x1)
	char bRenderInMainPass : 1;  // 0x216(0x1)
	char bRenderInDepthPass : 1;  // 0x216(0x1)
	char bReceivesDecals : 1;  // 0x216(0x1)
	char bOwnerNoSee : 1;  // 0x216(0x1)
	char bOnlyOwnerSee : 1;  // 0x216(0x1)
	char bTreatAsBackgroundForOcclusion : 1;  // 0x216(0x1)
	char bUseAsOccluder : 1;  // 0x217(0x1)
	char bSelectable : 1;  // 0x217(0x1)
	char bForceMipStreaming : 1;  // 0x217(0x1)
	char bHasPerInstanceHitProxies : 1;  // 0x217(0x1)
	char CastShadow : 1;  // 0x217(0x1)
	char bAffectDynamicIndirectLighting : 1;  // 0x217(0x1)
	char bAffectDistanceFieldLighting : 1;  // 0x217(0x1)
	char bCastDynamicShadow : 1;  // 0x217(0x1)
	char bCastStaticShadow : 1;  // 0x218(0x1)
	char bCastVolumetricTranslucentShadow : 1;  // 0x218(0x1)
	char bCastContactShadow : 1;  // 0x218(0x1)
	char bSelfShadowOnly : 1;  // 0x218(0x1)
	char bCastFarShadow : 1;  // 0x218(0x1)
	char bCastInsetShadow : 1;  // 0x218(0x1)
	char bCastCinematicShadow : 1;  // 0x218(0x1)
	char bCastHiddenShadow : 1;  // 0x218(0x1)
	char bCastShadowAsTwoSided : 1;  // 0x219(0x1)
	char bLightAsIfStatic : 1;  // 0x219(0x1)
	char bLightAttachmentsAsGroup : 1;  // 0x219(0x1)
	char bExcludeFromLightAttachmentGroup : 1;  // 0x219(0x1)
	char bReceiveMobileCSMShadows : 1;  // 0x219(0x1)
	char bSingleSampleShadowFromStationaryLights : 1;  // 0x219(0x1)
	char bIgnoreRadialImpulse : 1;  // 0x219(0x1)
	char bIgnoreRadialForce : 1;  // 0x219(0x1)
	char bApplyImpulseOnDamage : 1;  // 0x21A(0x1)
	char bReplicatePhysicsToAutonomousProxy : 1;  // 0x21A(0x1)
	char bFillCollisionUnderneathForNavmesh : 1;  // 0x21A(0x1)
	char AlwaysLoadOnClient : 1;  // 0x21A(0x1)
	char AlwaysLoadOnServer : 1;  // 0x21A(0x1)
	char bUseEditorCompositing : 1;  // 0x21A(0x1)
	char bRenderCustomDepth : 1;  // 0x21A(0x1)
	char bVisibleInSceneCaptureOnly : 1;  // 0x21A(0x1)
	char bHiddenInSceneCapture : 1;  // 0x21B(0x1)
	char pad_539_1 : 7;  // 0x21B(0x1)
	char EHasCustomNavigableGeometry bHasCustomNavigableGeometry;  // 0x21C(0x1)
	char pad_541[1];  // 0x21D(0x1)
	char ECanBeCharacterBase CanCharacterStepUpOn;  // 0x21E(0x1)
	struct FLightingChannels LightingChannels;  // 0x21F(0x1)
	uint8_t  CustomDepthStencilWriteMask;  // 0x220(0x1)
	char pad_545[3];  // 0x221(0x3)
	int32_t CustomDepthStencilValue;  // 0x224(0x4)
	struct FCustomPrimitiveData CustomPrimitiveData;  // 0x228(0x10)
	struct FCustomPrimitiveData CustomPrimitiveDataInternal;  // 0x238(0x10)
	char pad_584[8];  // 0x248(0x8)
	int32_t TranslucencySortPriority;  // 0x250(0x4)
	float TranslucencySortDistanceOffset;  // 0x254(0x4)
	int32_t VisibilityId;  // 0x258(0x4)
	char pad_604[4];  // 0x25C(0x4)
	struct TArray<struct URuntimeVirtualTexture*> RuntimeVirtualTextures;  // 0x260(0x10)
	int8_t VirtualTextureLodBias;  // 0x270(0x1)
	int8_t VirtualTextureCullMips;  // 0x271(0x1)
	int8_t VirtualTextureMinCoverage;  // 0x272(0x1)
	uint8_t  VirtualTextureRenderPassType;  // 0x273(0x1)
	char pad_628[4];  // 0x274(0x4)
	float LpvBiasMultiplier;  // 0x278(0x4)
	char pad_636[8];  // 0x27C(0x8)
	float BoundsScale;  // 0x284(0x4)
	char pad_648[16];  // 0x288(0x10)
	struct TArray<struct AActor*> MoveIgnoreActors;  // 0x298(0x10)
	struct TArray<struct UPrimitiveComponent*> MoveIgnoreComponents;  // 0x2A8(0x10)
	char pad_696[16];  // 0x2B8(0x10)
	struct FBodyInstance BodyInstance;  // 0x2C8(0x158)
	struct FMulticastSparseDelegate OnComponentHit;  // 0x420(0x1)
	struct FMulticastSparseDelegate OnComponentBeginOverlap;  // 0x421(0x1)
	struct FMulticastSparseDelegate OnComponentEndOverlap;  // 0x422(0x1)
	struct FMulticastSparseDelegate OnComponentWake;  // 0x423(0x1)
	struct FMulticastSparseDelegate OnComponentSleep;  // 0x424(0x1)
	char pad_1061[1];  // 0x425(0x1)
	struct FMulticastSparseDelegate OnBeginCursorOver;  // 0x426(0x1)
	struct FMulticastSparseDelegate OnEndCursorOver;  // 0x427(0x1)
	struct FMulticastSparseDelegate OnClicked;  // 0x428(0x1)
	struct FMulticastSparseDelegate OnReleased;  // 0x429(0x1)
	struct FMulticastSparseDelegate OnInputTouchBegin;  // 0x42A(0x1)
	struct FMulticastSparseDelegate OnInputTouchEnd;  // 0x42B(0x1)
	struct FMulticastSparseDelegate OnInputTouchEnter;  // 0x42C(0x1)
	struct FMulticastSparseDelegate OnInputTouchLeave;  // 0x42D(0x1)
	char pad_1070[26];  // 0x42E(0x1A)
	struct UPrimitiveComponent* LODParentPrimitive;  // 0x448(0x8)

	bool WasRecentlyRendered(float Tolerance); // Function Engine.PrimitiveComponent.WasRecentlyRendered
	void WakeRigidBody(struct FName BoneName); // Function Engine.PrimitiveComponent.WakeRigidBody
	void WakeAllRigidBodies(); // Function Engine.PrimitiveComponent.WakeAllRigidBodies
	void SetWalkableSlopeOverride(struct FWalkableSlopeOverride& NewOverride); // Function Engine.PrimitiveComponent.SetWalkableSlopeOverride
	void SetVisibleInSceneCaptureOnly(bool bValue); // Function Engine.PrimitiveComponent.SetVisibleInSceneCaptureOnly
	void SetUseCCD(bool InUseCCD, struct FName BoneName); // Function Engine.PrimitiveComponent.SetUseCCD
	void SetTranslucentSortPriority(int32_t NewTranslucentSortPriority); // Function Engine.PrimitiveComponent.SetTranslucentSortPriority
	void SetTranslucencySortDistanceOffset(float NewTranslucencySortDistanceOffset); // Function Engine.PrimitiveComponent.SetTranslucencySortDistanceOffset
	void SetSingleSampleShadowFromStationaryLights(bool bNewSingleSampleShadowFromStationaryLights); // Function Engine.PrimitiveComponent.SetSingleSampleShadowFromStationaryLights
	void SetSimulatePhysics(bool bSimulate); // Function Engine.PrimitiveComponent.SetSimulatePhysics
	void SetRenderInMainPass(bool bValue); // Function Engine.PrimitiveComponent.SetRenderInMainPass
	void SetRenderCustomDepth(bool bValue); // Function Engine.PrimitiveComponent.SetRenderCustomDepth
	void SetReceivesDecals(bool bNewReceivesDecals); // Function Engine.PrimitiveComponent.SetReceivesDecals
	void SetPhysMaterialOverride(struct UPhysicalMaterial* NewPhysMaterial); // Function Engine.PrimitiveComponent.SetPhysMaterialOverride
	void SetPhysicsMaxAngularVelocityInRadians(float NewMaxAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocityInRadians
	void SetPhysicsMaxAngularVelocityInDegrees(float NewMaxAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocityInDegrees
	void SetPhysicsMaxAngularVelocity(float NewMaxAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocity
	void SetPhysicsLinearVelocity(struct FVector NewVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsLinearVelocity
	void SetPhysicsAngularVelocityInRadians(struct FVector NewAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocityInRadians
	void SetPhysicsAngularVelocityInDegrees(struct FVector NewAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocityInDegrees
	void SetPhysicsAngularVelocity(struct FVector NewAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocity
	void SetOwnerNoSee(bool bNewOwnerNoSee); // Function Engine.PrimitiveComponent.SetOwnerNoSee
	void SetOnlyOwnerSee(bool bNewOnlyOwnerSee); // Function Engine.PrimitiveComponent.SetOnlyOwnerSee
	void SetNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision); // Function Engine.PrimitiveComponent.SetNotifyRigidBodyCollision
	void SetMinDrawDistance(float NewMinDrawDistance); // Function Engine.PrimitiveComponent.SetMinDrawDistance
	void SetMaterialByName(struct FName MaterialSlotName, struct UMaterialInterface* Material); // Function Engine.PrimitiveComponent.SetMaterialByName
	void SetMaterial(int32_t ElementIndex, struct UMaterialInterface* Material); // Function Engine.PrimitiveComponent.SetMaterial
	void SetMassScale(struct FName BoneName, float InMassScale); // Function Engine.PrimitiveComponent.SetMassScale
	void SetMassOverrideInKg(struct FName BoneName, float MassInKg, bool bOverrideMass); // Function Engine.PrimitiveComponent.SetMassOverrideInKg
	void SetLinearDamping(float InDamping); // Function Engine.PrimitiveComponent.SetLinearDamping
	void SetLightingChannels(bool bChannel0, bool bChannel1, bool bChannel2); // Function Engine.PrimitiveComponent.SetLightingChannels
	void SetLightAttachmentsAsGroup(bool bInLightAttachmentsAsGroup); // Function Engine.PrimitiveComponent.SetLightAttachmentsAsGroup
	void SetHiddenInSceneCapture(bool bValue); // Function Engine.PrimitiveComponent.SetHiddenInSceneCapture
	void SetGenerateOverlapEvents(bool bInGenerateOverlapEvents); // Function Engine.PrimitiveComponent.SetGenerateOverlapEvents
	void SetExcludeFromLightAttachmentGroup(bool bInExcludeFromLightAttachmentGroup); // Function Engine.PrimitiveComponent.SetExcludeFromLightAttachmentGroup
	void SetEnableGravity(bool bGravityEnabled); // Function Engine.PrimitiveComponent.SetEnableGravity
	void SetDefaultCustomPrimitiveDataVector4(int32_t DataIndex, struct FVector4 Value); // Function Engine.PrimitiveComponent.SetDefaultCustomPrimitiveDataVector4
	void SetDefaultCustomPrimitiveDataVector3(int32_t DataIndex, struct FVector Value); // Function Engine.PrimitiveComponent.SetDefaultCustomPrimitiveDataVector3
	void SetDefaultCustomPrimitiveDataVector2(int32_t DataIndex, struct FVector2D Value); // Function Engine.PrimitiveComponent.SetDefaultCustomPrimitiveDataVector2
	void SetDefaultCustomPrimitiveDataFloat(int32_t DataIndex, float Value); // Function Engine.PrimitiveComponent.SetDefaultCustomPrimitiveDataFloat
	void SetCustomPrimitiveDataVector4(int32_t DataIndex, struct FVector4 Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector4
	void SetCustomPrimitiveDataVector3(int32_t DataIndex, struct FVector Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector3
	void SetCustomPrimitiveDataVector2(int32_t DataIndex, struct FVector2D Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector2
	void SetCustomPrimitiveDataFloat(int32_t DataIndex, float Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataFloat
	void SetCustomDepthStencilWriteMask(uint8_t  WriteMaskBit); // Function Engine.PrimitiveComponent.SetCustomDepthStencilWriteMask
	void SetCustomDepthStencilValue(int32_t Value); // Function Engine.PrimitiveComponent.SetCustomDepthStencilValue
	void SetCullDistance(float NewCullDistance); // Function Engine.PrimitiveComponent.SetCullDistance
	void SetConstraintMode(char EDOFMode ConstraintMode); // Function Engine.PrimitiveComponent.SetConstraintMode
	void SetCollisionResponseToChannel(char ECollisionChannel Channel, char ECollisionResponse NewResponse); // Function Engine.PrimitiveComponent.SetCollisionResponseToChannel
	void SetCollisionResponseToAllChannels(char ECollisionResponse NewResponse); // Function Engine.PrimitiveComponent.SetCollisionResponseToAllChannels
	void SetCollisionProfileName(struct FName InCollisionProfileName, bool bUpdateOverlaps); // Function Engine.PrimitiveComponent.SetCollisionProfileName
	void SetCollisionObjectType(char ECollisionChannel Channel); // Function Engine.PrimitiveComponent.SetCollisionObjectType
	void SetCollisionEnabled(char ECollisionEnabled NewType); // Function Engine.PrimitiveComponent.SetCollisionEnabled
	void SetCenterOfMass(struct FVector CenterOfMassOffset, struct FName BoneName); // Function Engine.PrimitiveComponent.SetCenterOfMass
	void SetCastShadow(bool NewCastShadow); // Function Engine.PrimitiveComponent.SetCastShadow
	void SetCastInsetShadow(bool bInCastInsetShadow); // Function Engine.PrimitiveComponent.SetCastInsetShadow
	void SetCastHiddenShadow(bool NewCastHiddenShadow); // Function Engine.PrimitiveComponent.SetCastHiddenShadow
	void SetBoundsScale(float NewBoundsScale); // Function Engine.PrimitiveComponent.SetBoundsScale
	void SetAngularDamping(float InDamping); // Function Engine.PrimitiveComponent.SetAngularDamping
	void SetAllUseCCD(bool InUseCCD); // Function Engine.PrimitiveComponent.SetAllUseCCD
	void SetAllPhysicsLinearVelocity(struct FVector NewVel, bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetAllPhysicsLinearVelocity
	void SetAllPhysicsAngularVelocityInRadians(struct FVector& NewAngVel, bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetAllPhysicsAngularVelocityInRadians
	void SetAllPhysicsAngularVelocityInDegrees(struct FVector& NewAngVel, bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetAllPhysicsAngularVelocityInDegrees
	void SetAllMassScale(float InMassScale); // Function Engine.PrimitiveComponent.SetAllMassScale
	struct FVector ScaleByMomentOfInertia(struct FVector InputVector, struct FName BoneName); // Function Engine.PrimitiveComponent.ScaleByMomentOfInertia
	void PutRigidBodyToSleep(struct FName BoneName); // Function Engine.PrimitiveComponent.PutRigidBodyToSleep
	bool K2_SphereTraceComponent(struct FVector TraceStart, struct FVector TraceEnd, float SphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector& HitLocation, struct FVector& HitNormal, struct FName& BoneName, struct FHitResult& OutHit); // Function Engine.PrimitiveComponent.K2_SphereTraceComponent
	bool K2_SphereOverlapComponent(struct FVector InSphereCentre, float InSphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector& HitLocation, struct FVector& HitNormal, struct FName& BoneName, struct FHitResult& OutHit); // Function Engine.PrimitiveComponent.K2_SphereOverlapComponent
	bool K2_LineTraceComponent(struct FVector TraceStart, struct FVector TraceEnd, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector& HitLocation, struct FVector& HitNormal, struct FName& BoneName, struct FHitResult& OutHit); // Function Engine.PrimitiveComponent.K2_LineTraceComponent
	bool K2_IsQueryCollisionEnabled(); // Function Engine.PrimitiveComponent.K2_IsQueryCollisionEnabled
	bool K2_IsPhysicsCollisionEnabled(); // Function Engine.PrimitiveComponent.K2_IsPhysicsCollisionEnabled
	bool K2_IsCollisionEnabled(); // Function Engine.PrimitiveComponent.K2_IsCollisionEnabled
	bool K2_BoxOverlapComponent(struct FVector InBoxCentre, struct FBox InBox, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector& HitLocation, struct FVector& HitNormal, struct FName& BoneName, struct FHitResult& OutHit); // Function Engine.PrimitiveComponent.K2_BoxOverlapComponent
	bool IsOverlappingComponent(struct UPrimitiveComponent* OtherComp); // Function Engine.PrimitiveComponent.IsOverlappingComponent
	bool IsOverlappingActor(struct AActor* Other); // Function Engine.PrimitiveComponent.IsOverlappingActor
	bool IsGravityEnabled(); // Function Engine.PrimitiveComponent.IsGravityEnabled
	bool IsAnyRigidBodyAwake(); // Function Engine.PrimitiveComponent.IsAnyRigidBodyAwake
	void IgnoreComponentWhenMoving(struct UPrimitiveComponent* Component, bool bShouldIgnore); // Function Engine.PrimitiveComponent.IgnoreComponentWhenMoving
	void IgnoreActorWhenMoving(struct AActor* Actor, bool bShouldIgnore); // Function Engine.PrimitiveComponent.IgnoreActorWhenMoving
	struct FWalkableSlopeOverride GetWalkableSlopeOverride(); // Function Engine.PrimitiveComponent.GetWalkableSlopeOverride
	struct FVector GetPhysicsLinearVelocityAtPoint(struct FVector Point, struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocityAtPoint
	struct FVector GetPhysicsLinearVelocity(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocity
	struct FVector GetPhysicsAngularVelocityInRadians(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocityInRadians
	struct FVector GetPhysicsAngularVelocityInDegrees(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocityInDegrees
	struct FVector GetPhysicsAngularVelocity(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocity
	void GetOverlappingComponents(struct TArray<struct UPrimitiveComponent*>& OutOverlappingComponents); // Function Engine.PrimitiveComponent.GetOverlappingComponents
	void GetOverlappingActors(struct TArray<struct AActor*>& OverlappingActors, AActor* ClassFilter); // Function Engine.PrimitiveComponent.GetOverlappingActors
	int32_t GetNumMaterials(); // Function Engine.PrimitiveComponent.GetNumMaterials
	struct UMaterialInterface* GetMaterialFromCollisionFaceIndex(int32_t FaceIndex, int32_t& SectionIndex); // Function Engine.PrimitiveComponent.GetMaterialFromCollisionFaceIndex
	struct UMaterialInterface* GetMaterial(int32_t ElementIndex); // Function Engine.PrimitiveComponent.GetMaterial
	float GetMassScale(struct FName BoneName); // Function Engine.PrimitiveComponent.GetMassScale
	float GetMass(); // Function Engine.PrimitiveComponent.GetMass
	float GetLinearDamping(); // Function Engine.PrimitiveComponent.GetLinearDamping
	struct FVector GetInertiaTensor(struct FName BoneName); // Function Engine.PrimitiveComponent.GetInertiaTensor
	bool GetGenerateOverlapEvents(); // Function Engine.PrimitiveComponent.GetGenerateOverlapEvents
	char ECollisionResponse GetCollisionResponseToChannel(char ECollisionChannel Channel); // Function Engine.PrimitiveComponent.GetCollisionResponseToChannel
	struct FName GetCollisionProfileName(); // Function Engine.PrimitiveComponent.GetCollisionProfileName
	char ECollisionChannel GetCollisionObjectType(); // Function Engine.PrimitiveComponent.GetCollisionObjectType
	char ECollisionEnabled GetCollisionEnabled(); // Function Engine.PrimitiveComponent.GetCollisionEnabled
	float GetClosestPointOnCollision(struct FVector& Point, struct FVector& OutPointOnBody, struct FName BoneName); // Function Engine.PrimitiveComponent.GetClosestPointOnCollision
	struct FVector GetCenterOfMass(struct FName BoneName); // Function Engine.PrimitiveComponent.GetCenterOfMass
	float GetAngularDamping(); // Function Engine.PrimitiveComponent.GetAngularDamping
	struct UMaterialInstanceDynamic* CreateDynamicMaterialInstance(int32_t ElementIndex, struct UMaterialInterface* SourceMaterial, struct FName OptionalName); // Function Engine.PrimitiveComponent.CreateDynamicMaterialInstance
	struct UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamicFromMaterial(int32_t ElementIndex, struct UMaterialInterface* Parent); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamicFromMaterial
	struct UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamic(int32_t ElementIndex); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamic
	struct TArray<struct UPrimitiveComponent*> CopyArrayOfMoveIgnoreComponents(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreComponents
	struct TArray<struct AActor*> CopyArrayOfMoveIgnoreActors(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreActors
	void ClearMoveIgnoreComponents(); // Function Engine.PrimitiveComponent.ClearMoveIgnoreComponents
	void ClearMoveIgnoreActors(); // Function Engine.PrimitiveComponent.ClearMoveIgnoreActors
	bool CanCharacterStepUp(struct APawn* Pawn); // Function Engine.PrimitiveComponent.CanCharacterStepUp
	void AddTorqueInRadians(struct FVector Torque, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddTorqueInRadians
	void AddTorqueInDegrees(struct FVector Torque, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddTorqueInDegrees
	void AddTorque(struct FVector Torque, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddTorque
	void AddRadialImpulse(struct FVector Origin, float Radius, float Strength, char ERadialImpulseFalloff Falloff, bool bVelChange); // Function Engine.PrimitiveComponent.AddRadialImpulse
	void AddRadialForce(struct FVector Origin, float Radius, float Strength, char ERadialImpulseFalloff Falloff, bool bAccelChange); // Function Engine.PrimitiveComponent.AddRadialForce
	void AddImpulseAtLocation(struct FVector Impulse, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddImpulseAtLocation
	void AddImpulse(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddImpulse
	void AddForceAtLocationLocal(struct FVector force, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddForceAtLocationLocal
	void AddForceAtLocation(struct FVector force, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddForceAtLocation
	void AddForce(struct FVector force, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddForce
	void AddAngularImpulseInRadians(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddAngularImpulseInRadians
	void AddAngularImpulseInDegrees(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddAngularImpulseInDegrees
	void AddAngularImpulse(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddAngularImpulse
}; 



// Class Engine.LightComponent
// Size: 0x330(Inherited: 0x230) 
struct ULightComponent : public ULightComponentBase
{
	float Temperature;  // 0x228(0x4)
	float MaxDrawDistance;  // 0x22C(0x4)
	float MaxDistanceFadeRange;  // 0x230(0x4)
	char bUseTemperature : 1;  // 0x234(0x1)
	int32_t ShadowMapChannel;  // 0x238(0x4)
	float MinRoughness;  // 0x240(0x4)
	float SpecularScale;  // 0x244(0x4)
	float ShadowResolutionScale;  // 0x248(0x4)
	float ShadowBias;  // 0x24C(0x4)
	float ShadowSlopeBias;  // 0x250(0x4)
	float ShadowSharpen;  // 0x254(0x4)
	float ContactShadowLength;  // 0x258(0x4)
	char ContactShadowLengthInWS : 1;  // 0x25C(0x1)
	char InverseSquaredFalloff : 1;  // 0x25C(0x1)
	char CastTranslucentShadows : 1;  // 0x25C(0x1)
	char bCastShadowsFromCinematicObjectsOnly : 1;  // 0x25C(0x1)
	char bAffectDynamicIndirectLighting : 1;  // 0x25C(0x1)
	char bForceCachedShadowsForMovablePrimitives : 1;  // 0x25C(0x1)
	char pad_604_1 : 1;  // 0x25C(0x1)
	char pad_605[4];  // 0x25D(0x4)
	struct FLightingChannels LightingChannels;  // 0x260(0x1)
	char pad_609[7];  // 0x261(0x7)
	struct UMaterialInterface* LightFunctionMaterial;  // 0x268(0x8)
	struct FVector LightFunctionScale;  // 0x270(0xC)
	char pad_636[4];  // 0x27C(0x4)
	struct UTextureLightProfile* IESTexture;  // 0x280(0x8)
	char bUseIESBrightness : 1;  // 0x288(0x1)
	char pad_648_1 : 7;  // 0x288(0x1)
	char pad_649[4];  // 0x289(0x4)
	float IESBrightnessScale;  // 0x28C(0x4)
	float LightFunctionFadeDistance;  // 0x290(0x4)
	float DisabledBrightness;  // 0x294(0x4)
	char bEnableLightShaftBloom : 1;  // 0x298(0x1)
	char pad_664_1 : 7;  // 0x298(0x1)
	char pad_665[4];  // 0x299(0x4)
	float BloomScale;  // 0x29C(0x4)
	float BloomThreshold;  // 0x2A0(0x4)
	float BloomMaxBrightness;  // 0x2A4(0x4)
	struct FColor BloomTint;  // 0x2A8(0x4)
	char pad_684_1 : 7;  // 0x2AC(0x1)
	bool bUseRayTracedDistanceFieldShadows : 1;  // 0x2AC(0x1)
	char pad_685[3];  // 0x2AD(0x3)
	float RayStartOffsetDepthScale;  // 0x2B0(0x4)
	char pad_692[124];  // 0x2B4(0x7C)

	void SetVolumetricScatteringIntensity(float NewIntensity); // Function Engine.LightComponent.SetVolumetricScatteringIntensity
	void SetUseTemperature(bool bNewValue); // Function Engine.LightComponent.SetUseTemperature
	void SetUseIESBrightness(bool bNewValue); // Function Engine.LightComponent.SetUseIESBrightness
	void SetTransmission(bool bNewValue); // Function Engine.LightComponent.SetTransmission
	void SetTemperature(float NewTemperature); // Function Engine.LightComponent.SetTemperature
	void SetSpecularScale(float NewValue); // Function Engine.LightComponent.SetSpecularScale
	void SetShadowSlopeBias(float NewValue); // Function Engine.LightComponent.SetShadowSlopeBias
	void SetShadowBias(float NewValue); // Function Engine.LightComponent.SetShadowBias
	void SetLightingChannels(bool bChannel0, bool bChannel1, bool bChannel2); // Function Engine.LightComponent.SetLightingChannels
	void SetLightFunctionScale(struct FVector NewLightFunctionScale); // Function Engine.LightComponent.SetLightFunctionScale
	void SetLightFunctionMaterial(struct UMaterialInterface* NewLightFunctionMaterial); // Function Engine.LightComponent.SetLightFunctionMaterial
	void SetLightFunctionFadeDistance(float NewLightFunctionFadeDistance); // Function Engine.LightComponent.SetLightFunctionFadeDistance
	void SetLightFunctionDisabledBrightness(float NewValue); // Function Engine.LightComponent.SetLightFunctionDisabledBrightness
	void SetLightColor(struct FLinearColor NewLightColor, bool bSRGB); // Function Engine.LightComponent.SetLightColor
	void SetIntensity(float NewIntensity); // Function Engine.LightComponent.SetIntensity
	void SetIndirectLightingIntensity(float NewIntensity); // Function Engine.LightComponent.SetIndirectLightingIntensity
	void SetIESTexture(struct UTextureLightProfile* NewValue); // Function Engine.LightComponent.SetIESTexture
	void SetIESBrightnessScale(float NewValue); // Function Engine.LightComponent.SetIESBrightnessScale
	void SetForceCachedShadowsForMovablePrimitives(bool bNewValue); // Function Engine.LightComponent.SetForceCachedShadowsForMovablePrimitives
	void SetEnableLightShaftBloom(bool bNewValue); // Function Engine.LightComponent.SetEnableLightShaftBloom
	void SetBloomTint(struct FColor NewValue); // Function Engine.LightComponent.SetBloomTint
	void SetBloomThreshold(float NewValue); // Function Engine.LightComponent.SetBloomThreshold
	void SetBloomScale(float NewValue); // Function Engine.LightComponent.SetBloomScale
	void SetBloomMaxBrightness(float NewValue); // Function Engine.LightComponent.SetBloomMaxBrightness
	void SetAffectTranslucentLighting(bool bNewValue); // Function Engine.LightComponent.SetAffectTranslucentLighting
	void SetAffectDynamicIndirectLighting(bool bNewValue); // Function Engine.LightComponent.SetAffectDynamicIndirectLighting
}; 



// Class Engine.MaterialExpressionArcsine
// Size: 0x58(Inherited: 0x40) 
struct UMaterialExpressionArcsine : public UMaterialExpression
{
	struct FExpressionInput Input;  // 0x40(0x14)
	char pad_84[4];  // 0x54(0x4)

}; 



// Class Engine.BookMark2D
// Size: 0x38(Inherited: 0x28) 
struct UBookMark2D : public UBookmarkBase
{
	float Zoom2D;  // 0x28(0x4)
	struct FIntPoint Location;  // 0x2C(0x8)
	char pad_52[4];  // 0x34(0x4)

}; 



// Class Engine.InterpTrackSound
// Size: 0xA8(Inherited: 0x90) 
struct UInterpTrackSound : public UInterpTrackVectorBase
{
	struct TArray<struct FSoundTrackKey> Sounds;  // 0x90(0x10)
	char bPlayOnReverse : 1;  // 0xA0(0x1)
	char bContinueSoundOnMatineeEnd : 1;  // 0xA0(0x1)
	char bSuppressSubtitles : 1;  // 0xA0(0x1)
	char bTreatAsDialogue : 1;  // 0xA0(0x1)
	char bAttach : 1;  // 0xA0(0x1)
	char pad_160_1 : 3;  // 0xA0(0x1)
	char pad_161[8];  // 0xA1(0x8)

}; 



// Class Engine.ParticleModuleAttractorBase
// Size: 0x30(Inherited: 0x30) 
struct UParticleModuleAttractorBase : public UParticleModule
{

}; 



// Class Engine.MaterialExpressionTextureSampleParameter
// Size: 0x80(Inherited: 0x60) 
struct UMaterialExpressionTextureSampleParameter : public UMaterialExpressionTextureSample
{
	struct FName ParameterName;  // 0x60(0x8)
	struct FGuid ExpressionGUID;  // 0x68(0x10)
	struct FName Group;  // 0x78(0x8)

}; 



// Class Engine.StereoLayerShapeCubemap
// Size: 0x28(Inherited: 0x28) 
struct UStereoLayerShapeCubemap : public UStereoLayerShape
{

}; 



// Class Engine.InterpTrackVectorMaterialParam
// Size: 0xA8(Inherited: 0x90) 
struct UInterpTrackVectorMaterialParam : public UInterpTrackVectorBase
{
	struct TArray<struct UMaterialInterface*> TargetMaterials;  // 0x90(0x10)
	struct FName ParamName;  // 0xA0(0x8)

}; 



// Class Engine.ActorComponent
// Size: 0xB0(Inherited: 0x28) 
struct UActorComponent : public UObject
{
	char pad_40[8];  // 0x28(0x8)
	struct FActorComponentTickFunction PrimaryComponentTick;  // 0x30(0x30)
	struct TArray<struct FName> ComponentTags;  // 0x60(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData;  // 0x70(0x10)
	char pad_128[4];  // 0x80(0x4)
	int32_t UCSSerializationIndex;  // 0x84(0x4)
	char pad_136_1 : 3;  // 0x88(0x1)
	char bNetAddressable : 1;  // 0x88(0x1)
	char bReplicates : 1;  // 0x88(0x1)
	char pad_136_2 : 3;  // 0x88(0x1)
	char pad_137_1 : 7;  // 0x89(0x1)
	char bAutoActivate : 1;  // 0x89(0x1)
	char bIsActive : 1;  // 0x8A(0x1)
	char bEditableWhenInherited : 1;  // 0x8A(0x1)
	char pad_138_1 : 1;  // 0x8A(0x1)
	char bCanEverAffectNavigation : 1;  // 0x8A(0x1)
	char pad_138_2 : 1;  // 0x8A(0x1)
	char bIsEditorOnly : 1;  // 0x8A(0x1)
	char pad_138_3 : 2;  // 0x8A(0x1)
	char pad_139[2];  // 0x8B(0x2)
	uint8_t  CreationMethod;  // 0x8C(0x1)
	struct FMulticastSparseDelegate OnComponentActivated;  // 0x8D(0x1)
	struct FMulticastSparseDelegate OnComponentDeactivated;  // 0x8E(0x1)
	char pad_143[1];  // 0x8F(0x1)
	struct TArray<struct FSimpleMemberReference> UCSModifiedProperties;  // 0x90(0x10)
	char pad_160[16];  // 0xA0(0x10)

	void ToggleActive(); // Function Engine.ActorComponent.ToggleActive
	void SetTickGroup(char ETickingGroup NewTickGroup); // Function Engine.ActorComponent.SetTickGroup
	void SetTickableWhenPaused(bool bTickableWhenPaused); // Function Engine.ActorComponent.SetTickableWhenPaused
	void SetIsReplicated(bool ShouldReplicate); // Function Engine.ActorComponent.SetIsReplicated
	void SetComponentTickIntervalAndCooldown(float TickInterval); // Function Engine.ActorComponent.SetComponentTickIntervalAndCooldown
	void SetComponentTickInterval(float TickInterval); // Function Engine.ActorComponent.SetComponentTickInterval
	void SetComponentTickEnabled(bool bEnabled); // Function Engine.ActorComponent.SetComponentTickEnabled
	void SetAutoActivate(bool bNewAutoActivate); // Function Engine.ActorComponent.SetAutoActivate
	void SetActive(bool bNewActive, bool bReset); // Function Engine.ActorComponent.SetActive
	void RemoveTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.ActorComponent.RemoveTickPrerequisiteComponent
	void RemoveTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.ActorComponent.RemoveTickPrerequisiteActor
	void ReceiveTick(float DeltaSeconds); // Function Engine.ActorComponent.ReceiveTick
	void ReceiveEndPlay(char EEndPlayReason EndPlayReason); // Function Engine.ActorComponent.ReceiveEndPlay
	void ReceiveBeginPlay(); // Function Engine.ActorComponent.ReceiveBeginPlay
	void OnRep_IsActive(); // Function Engine.ActorComponent.OnRep_IsActive
	void K2_DestroyComponent(struct UObject* Object); // Function Engine.ActorComponent.K2_DestroyComponent
	bool IsComponentTickEnabled(); // Function Engine.ActorComponent.IsComponentTickEnabled
	bool IsBeingDestroyed(); // Function Engine.ActorComponent.IsBeingDestroyed
	bool IsActive(); // Function Engine.ActorComponent.IsActive
	struct AActor* GetOwner(); // Function Engine.ActorComponent.GetOwner
	float GetComponentTickInterval(); // Function Engine.ActorComponent.GetComponentTickInterval
	void Deactivate(); // Function Engine.ActorComponent.Deactivate
	bool ComponentHasTag(struct FName Tag); // Function Engine.ActorComponent.ComponentHasTag
	void AddTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.ActorComponent.AddTickPrerequisiteComponent
	void AddTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.ActorComponent.AddTickPrerequisiteActor
	void Activate(bool bReset); // Function Engine.ActorComponent.Activate
}; 



// Class Engine.AnimStateMachineTypes
// Size: 0x28(Inherited: 0x28) 
struct UAnimStateMachineTypes : public UObject
{

}; 



// Class Engine.FontImportOptions
// Size: 0xD8(Inherited: 0x28) 
struct UFontImportOptions : public UObject
{
	struct FFontImportOptionsData Data;  // 0x28(0xB0)

}; 



// Class Engine.AnimInstance
// Size: 0x2C0(Inherited: 0x28) 
struct UAnimInstance : public UObject
{
	struct USkeleton* CurrentSkeleton;  // 0x28(0x8)
	char ERootMotionMode RootMotionMode;  // 0x30(0x1)
	char bUseMultiThreadedAnimationUpdate : 1;  // 0x31(0x1)
	char bUsingCopyPoseFromMesh : 1;  // 0x31(0x1)
	char pad_49_1 : 2;  // 0x31(0x1)
	char bReceiveNotifiesFromLinkedInstances : 1;  // 0x31(0x1)
	char bPropagateNotifiesToLinkedInstances : 1;  // 0x31(0x1)
	char bQueueMontageEvents : 1;  // 0x31(0x1)
	char pad_49_2 : 1;  // 0x31(0x1)
	char pad_50[7];  // 0x32(0x7)
	struct FMulticastInlineDelegate OnMontageBlendingOut;  // 0x38(0x10)
	struct FMulticastInlineDelegate OnMontageStarted;  // 0x48(0x10)
	struct FMulticastInlineDelegate OnMontageEnded;  // 0x58(0x10)
	struct FMulticastInlineDelegate OnAllMontageInstancesEnded;  // 0x68(0x10)
	char pad_120[136];  // 0x78(0x88)
	struct FAnimNotifyQueue NotifyQueue;  // 0x100(0x70)
	struct TArray<struct FAnimNotifyEvent> ActiveAnimNotifyState;  // 0x170(0x10)
	char pad_384[320];  // 0x180(0x140)

	void UnlockAIResources(bool bUnlockMovement, bool UnlockAILogic); // Function Engine.AnimInstance.UnlockAIResources
	void UnlinkAnimClassLayers(UAnimInstance* InClass); // Function Engine.AnimInstance.UnlinkAnimClassLayers
	struct APawn* TryGetPawnOwner(); // Function Engine.AnimInstance.TryGetPawnOwner
	void StopSlotAnimation(float InBlendOutTime, struct FName SlotNodeName); // Function Engine.AnimInstance.StopSlotAnimation
	void SnapshotPose(struct FPoseSnapshot& Snapshot); // Function Engine.AnimInstance.SnapshotPose
	void SetRootMotionMode(char ERootMotionMode Value); // Function Engine.AnimInstance.SetRootMotionMode
	void SetReceiveNotifiesFromLinkedInstances(bool bSet); // Function Engine.AnimInstance.SetReceiveNotifiesFromLinkedInstances
	void SetPropagateNotifiesToLinkedInstances(bool bSet); // Function Engine.AnimInstance.SetPropagateNotifiesToLinkedInstances
	void SetMorphTarget(struct FName MorphTargetName, float Value); // Function Engine.AnimInstance.SetMorphTarget
	void SavePoseSnapshot(struct FName SnapshotName); // Function Engine.AnimInstance.SavePoseSnapshot
	void ResetDynamics(uint8_t  InTeleportType); // Function Engine.AnimInstance.ResetDynamics
	struct UAnimMontage* PlaySlotAnimationAsDynamicMontage(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32_t LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage
	float PlaySlotAnimation(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32_t LoopCount); // Function Engine.AnimInstance.PlaySlotAnimation
	void Montage_StopGroupByName(float InBlendOutTime, struct FName GroupName); // Function Engine.AnimInstance.Montage_StopGroupByName
	void Montage_Stop(float InBlendOutTime, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Stop
	void Montage_SetPosition(struct UAnimMontage* Montage, float NewPosition); // Function Engine.AnimInstance.Montage_SetPosition
	void Montage_SetPlayRate(struct UAnimMontage* Montage, float NewPlayRate); // Function Engine.AnimInstance.Montage_SetPlayRate
	void Montage_SetNextSection(struct FName SectionNameToChange, struct FName NextSection, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_SetNextSection
	void Montage_Resume(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Resume
	float Montage_Play(struct UAnimMontage* MontageToPlay, float InPlayRate, uint8_t  ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages); // Function Engine.AnimInstance.Montage_Play
	void Montage_Pause(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Pause
	void Montage_JumpToSectionsEnd(struct FName SectionName, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_JumpToSectionsEnd
	void Montage_JumpToSection(struct FName SectionName, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_JumpToSection
	bool Montage_IsPlaying(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_IsPlaying
	bool Montage_IsActive(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_IsActive
	float Montage_GetPosition(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetPosition
	float Montage_GetPlayRate(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetPlayRate
	bool Montage_GetIsStopped(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetIsStopped
	struct FName Montage_GetCurrentSection(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetCurrentSection
	float Montage_GetBlendTime(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetBlendTime
	void LockAIResources(bool bLockMovement, bool LockAILogic); // Function Engine.AnimInstance.LockAIResources
	void LinkAnimGraphByTag(struct FName InTag, UAnimInstance* InClass); // Function Engine.AnimInstance.LinkAnimGraphByTag
	void LinkAnimClassLayers(UAnimInstance* InClass); // Function Engine.AnimInstance.LinkAnimClassLayers
	bool IsSyncGroupBetweenMarkers(struct FName InSyncGroupName, struct FName PreviousMarker, struct FName NextMarker, bool bRespectMarkerOrder); // Function Engine.AnimInstance.IsSyncGroupBetweenMarkers
	bool IsPlayingSlotAnimation(struct UAnimSequenceBase* Asset, struct FName SlotNodeName); // Function Engine.AnimInstance.IsPlayingSlotAnimation
	bool IsAnyMontagePlaying(); // Function Engine.AnimInstance.IsAnyMontagePlaying
	bool HasMarkerBeenHitThisFrame(struct FName SyncGroup, struct FName MarkerName); // Function Engine.AnimInstance.HasMarkerBeenHitThisFrame
	bool GetTimeToClosestMarker(struct FName SyncGroup, struct FName MarkerName, float& OutMarkerTime); // Function Engine.AnimInstance.GetTimeToClosestMarker
	struct FMarkerSyncAnimPosition GetSyncGroupPosition(struct FName InSyncGroupName); // Function Engine.AnimInstance.GetSyncGroupPosition
	float GetRelevantAnimTimeRemainingFraction(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeRemainingFraction
	float GetRelevantAnimTimeRemaining(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeRemaining
	float GetRelevantAnimTimeFraction(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeFraction
	float GetRelevantAnimTime(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTime
	float GetRelevantAnimLength(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimLength
	bool GetReceiveNotifiesFromLinkedInstances(); // Function Engine.AnimInstance.GetReceiveNotifiesFromLinkedInstances
	bool GetPropagateNotifiesToLinkedInstances(); // Function Engine.AnimInstance.GetPropagateNotifiesToLinkedInstances
	struct USkeletalMeshComponent* GetOwningComponent(); // Function Engine.AnimInstance.GetOwningComponent
	struct AActor* GetOwningActor(); // Function Engine.AnimInstance.GetOwningActor
	void GetLinkedAnimLayerInstancesByGroup(struct FName InGroup, struct TArray<struct UAnimInstance*>& OutLinkedInstances); // Function Engine.AnimInstance.GetLinkedAnimLayerInstancesByGroup
	struct UAnimInstance* GetLinkedAnimLayerInstanceByGroupAndClass(struct FName InGroup, UAnimInstance* InClass); // Function Engine.AnimInstance.GetLinkedAnimLayerInstanceByGroupAndClass
	struct UAnimInstance* GetLinkedAnimLayerInstanceByGroup(struct FName InGroup); // Function Engine.AnimInstance.GetLinkedAnimLayerInstanceByGroup
	struct UAnimInstance* GetLinkedAnimLayerInstanceByClass(UAnimInstance* InClass); // Function Engine.AnimInstance.GetLinkedAnimLayerInstanceByClass
	void GetLinkedAnimGraphInstancesByTag(struct FName InTag, struct TArray<struct UAnimInstance*>& OutLinkedInstances); // Function Engine.AnimInstance.GetLinkedAnimGraphInstancesByTag
	struct UAnimInstance* GetLinkedAnimGraphInstanceByTag(struct FName InTag); // Function Engine.AnimInstance.GetLinkedAnimGraphInstanceByTag
	float GetInstanceTransitionTimeElapsedFraction(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionTimeElapsedFraction
	float GetInstanceTransitionTimeElapsed(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionTimeElapsed
	float GetInstanceTransitionCrossfadeDuration(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionCrossfadeDuration
	float GetInstanceStateWeight(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetInstanceStateWeight
	float GetInstanceMachineWeight(int32_t MachineIndex); // Function Engine.AnimInstance.GetInstanceMachineWeight
	float GetInstanceCurrentStateElapsedTime(int32_t MachineIndex); // Function Engine.AnimInstance.GetInstanceCurrentStateElapsedTime
	float GetInstanceAssetPlayerTimeFromEndFraction(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFromEndFraction
	float GetInstanceAssetPlayerTimeFromEnd(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFromEnd
	float GetInstanceAssetPlayerTimeFraction(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFraction
	float GetInstanceAssetPlayerTime(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTime
	float GetInstanceAssetPlayerLength(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerLength
	float GetCurveValue(struct FName CurveName); // Function Engine.AnimInstance.GetCurveValue
	struct FName GetCurrentStateName(int32_t MachineIndex); // Function Engine.AnimInstance.GetCurrentStateName
	struct UAnimMontage* GetCurrentActiveMontage(); // Function Engine.AnimInstance.GetCurrentActiveMontage
	void GetAllCurveNames(struct TArray<struct FName>& OutNames); // Function Engine.AnimInstance.GetAllCurveNames
	void GetActiveCurveNames(uint8_t  curveType, struct TArray<struct FName>& OutNames); // Function Engine.AnimInstance.GetActiveCurveNames
	void ClearMorphTargets(); // Function Engine.AnimInstance.ClearMorphTargets
	float CalculateDirection(struct FVector& Velocity, struct FRotator& BaseRotation); // Function Engine.AnimInstance.CalculateDirection
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Engine.AnimInstance.BlueprintUpdateAnimation
	void BlueprintPostEvaluateAnimation(); // Function Engine.AnimInstance.BlueprintPostEvaluateAnimation
	void BlueprintLinkedAnimationLayersInitialized(); // Function Engine.AnimInstance.BlueprintLinkedAnimationLayersInitialized
	void BlueprintInitializeAnimation(); // Function Engine.AnimInstance.BlueprintInitializeAnimation
	void BlueprintBeginPlay(); // Function Engine.AnimInstance.BlueprintBeginPlay
}; 



// Class Engine.ProjectileMovementComponent
// Size: 0x1D0(Inherited: 0xF0) 
struct UProjectileMovementComponent : public UMovementComponent
{
	float InitialSpeed;  // 0xF0(0x4)
	float MaxSpeed;  // 0xF4(0x4)
	char bRotationFollowsVelocity : 1;  // 0xF8(0x1)
	char bRotationRemainsVertical : 1;  // 0xF8(0x1)
	char bShouldBounce : 1;  // 0xF8(0x1)
	char bInitialVelocityInLocalSpace : 1;  // 0xF8(0x1)
	char bForceSubStepping : 1;  // 0xF8(0x1)
	char bSimulationEnabled : 1;  // 0xF8(0x1)
	char bSweepCollision : 1;  // 0xF8(0x1)
	char bIsHomingProjectile : 1;  // 0xF8(0x1)
	char bBounceAngleAffectsFriction : 1;  // 0xF9(0x1)
	char bIsSliding : 1;  // 0xF9(0x1)
	char bInterpMovement : 1;  // 0xF9(0x1)
	char bInterpRotation : 1;  // 0xF9(0x1)
	char pad_249_1 : 4;  // 0xF9(0x1)
	char pad_250[3];  // 0xFA(0x3)
	float PreviousHitTime;  // 0xFC(0x4)
	struct FVector PreviousHitNormal;  // 0x100(0xC)
	float ProjectileGravityScale;  // 0x10C(0x4)
	float Buoyancy;  // 0x110(0x4)
	float Bounciness;  // 0x114(0x4)
	float Friction;  // 0x118(0x4)
	float BounceVelocityStopSimulatingThreshold;  // 0x11C(0x4)
	float MinFrictionFraction;  // 0x120(0x4)
	char pad_292[4];  // 0x124(0x4)
	struct FMulticastInlineDelegate OnProjectileBounce;  // 0x128(0x10)
	struct FMulticastInlineDelegate OnProjectileStop;  // 0x138(0x10)
	float HomingAccelerationMagnitude;  // 0x148(0x4)
	struct TWeakObjectPtr<USceneComponent> HomingTargetComponent;  // 0x14C(0x8)
	float MaxSimulationTimeStep;  // 0x154(0x4)
	int32_t MaxSimulationIterations;  // 0x158(0x4)
	int32_t BounceAdditionalIterations;  // 0x15C(0x4)
	float InterpLocationTime;  // 0x160(0x4)
	float InterpRotationTime;  // 0x164(0x4)
	float InterpLocationMaxLagDistance;  // 0x168(0x4)
	float InterpLocationSnapToTargetDistance;  // 0x16C(0x4)
	char pad_368[96];  // 0x170(0x60)

	void StopSimulating(struct FHitResult& HitResult); // Function Engine.ProjectileMovementComponent.StopSimulating
	void SetVelocityInLocalSpace(struct FVector NewVelocity); // Function Engine.ProjectileMovementComponent.SetVelocityInLocalSpace
	void SetInterpolatedComponent(struct USceneComponent* Component); // Function Engine.ProjectileMovementComponent.SetInterpolatedComponent
	void ResetInterpolation(); // Function Engine.ProjectileMovementComponent.ResetInterpolation
	void OnProjectileStopDelegate__DelegateSignature(struct FHitResult& ImpactResult); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileStopDelegate__DelegateSignature
	void OnProjectileBounceDelegate__DelegateSignature(struct FHitResult& ImpactResult, struct FVector& ImpactVelocity); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileBounceDelegate__DelegateSignature
	void MoveInterpolationTarget(struct FVector& NewLocation, struct FRotator& NewRotation); // Function Engine.ProjectileMovementComponent.MoveInterpolationTarget
	struct FVector LimitVelocity(struct FVector NewVelocity); // Function Engine.ProjectileMovementComponent.LimitVelocity
	bool IsVelocityUnderSimulationThreshold(); // Function Engine.ProjectileMovementComponent.IsVelocityUnderSimulationThreshold
	bool IsInterpolationComplete(); // Function Engine.ProjectileMovementComponent.IsInterpolationComplete
}; 



// Class Engine.AssetMappingTable
// Size: 0x38(Inherited: 0x28) 
struct UAssetMappingTable : public UObject
{
	struct TArray<struct FAssetMapping> MappedAssets;  // 0x28(0x10)

}; 



// Class Engine.MaterialExpressionNamedRerouteDeclaration
// Size: 0x70(Inherited: 0x40) 
struct UMaterialExpressionNamedRerouteDeclaration : public UMaterialExpressionNamedRerouteBase
{
	struct FExpressionInput Input;  // 0x40(0x14)
	struct FName Name;  // 0x54(0x8)
	struct FGuid VariableGuid;  // 0x5C(0x10)
	char pad_108[4];  // 0x6C(0x4)

}; 



// Class Engine.MaterialExpressionHairAttributes
// Size: 0x48(Inherited: 0x40) 
struct UMaterialExpressionHairAttributes : public UMaterialExpression
{
	char bUseTangentSpace : 1;  // 0x40(0x1)
	char pad_64_1 : 7;  // 0x40(0x1)
	char pad_65[8];  // 0x41(0x8)

}; 



// Class Engine.SceneComponent
// Size: 0x200(Inherited: 0xB0) 
struct USceneComponent : public UActorComponent
{
	char pad_176[8];  // 0xB0(0x8)
	struct TWeakObjectPtr<APhysicsVolume> PhysicsVolume;  // 0xB8(0x8)
	struct USceneComponent* AttachParent;  // 0xC0(0x8)
	struct FName AttachSocketName;  // 0xC8(0x8)
	struct TArray<struct USceneComponent*> AttachChildren;  // 0xD0(0x10)
	struct TArray<struct USceneComponent*> ClientAttachedChildren;  // 0xE0(0x10)
	char pad_240[44];  // 0xF0(0x2C)
	struct FVector RelativeLocation;  // 0x11C(0xC)
	struct FRotator RelativeRotation;  // 0x128(0xC)
	struct FVector RelativeScale3D;  // 0x134(0xC)
	struct FVector ComponentVelocity;  // 0x140(0xC)
	char bComponentToWorldUpdated : 1;  // 0x14C(0x1)
	char pad_332_1 : 1;  // 0x14C(0x1)
	char bAbsoluteLocation : 1;  // 0x14C(0x1)
	char bAbsoluteRotation : 1;  // 0x14C(0x1)
	char bAbsoluteScale : 1;  // 0x14C(0x1)
	char bVisible : 1;  // 0x14C(0x1)
	char bShouldBeAttached : 1;  // 0x14C(0x1)
	char bShouldSnapLocationWhenAttached : 1;  // 0x14C(0x1)
	char bShouldSnapRotationWhenAttached : 1;  // 0x14D(0x1)
	char bShouldUpdatePhysicsVolume : 1;  // 0x14D(0x1)
	char bHiddenInGame : 1;  // 0x14D(0x1)
	char bBoundsChangeTriggersStreamingDataRebuild : 1;  // 0x14D(0x1)
	char bUseAttachParentBound : 1;  // 0x14D(0x1)
	char pad_333_1 : 3;  // 0x14D(0x1)
	char pad_334[2];  // 0x14E(0x2)
	char EComponentMobility Mobility;  // 0x14F(0x1)
	char EDetailMode DetailMode;  // 0x150(0x1)
	struct FMulticastSparseDelegate PhysicsVolumeChangedDelegate;  // 0x151(0x1)
	char pad_338[174];  // 0x152(0xAE)

	void ToggleVisibility(bool bPropagateToChildren); // Function Engine.SceneComponent.ToggleVisibility
	bool SnapTo(struct USceneComponent* InParent, struct FName InSocketName); // Function Engine.SceneComponent.SnapTo
	void SetWorldScale3D(struct FVector NewScale); // Function Engine.SceneComponent.SetWorldScale3D
	void SetVisibility(bool bNewVisibility, bool bPropagateToChildren); // Function Engine.SceneComponent.SetVisibility
	void SetShouldUpdatePhysicsVolume(bool bInShouldUpdatePhysicsVolume); // Function Engine.SceneComponent.SetShouldUpdatePhysicsVolume
	void SetRelativeScale3D(struct FVector NewScale3D); // Function Engine.SceneComponent.SetRelativeScale3D
	void SetMobility(char EComponentMobility NewMobility); // Function Engine.SceneComponent.SetMobility
	void SetHiddenInGame(bool NewHidden, bool bPropagateToChildren); // Function Engine.SceneComponent.SetHiddenInGame
	void SetAbsolute(bool bNewAbsoluteLocation, bool bNewAbsoluteRotation, bool bNewAbsoluteScale); // Function Engine.SceneComponent.SetAbsolute
	void ResetRelativeTransform(); // Function Engine.SceneComponent.ResetRelativeTransform
	void OnRep_Visibility(bool oldValue); // Function Engine.SceneComponent.OnRep_Visibility
	void OnRep_Transform(); // Function Engine.SceneComponent.OnRep_Transform
	void OnRep_AttachSocketName(); // Function Engine.SceneComponent.OnRep_AttachSocketName
	void OnRep_AttachParent(); // Function Engine.SceneComponent.OnRep_AttachParent
	void OnRep_AttachChildren(); // Function Engine.SceneComponent.OnRep_AttachChildren
	void K2_SetWorldTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldTransform
	void K2_SetWorldRotation(struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldRotation
	void K2_SetWorldLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldLocationAndRotation
	void K2_SetWorldLocation(struct FVector NewLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldLocation
	void K2_SetRelativeTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeTransform
	void K2_SetRelativeRotation(struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeRotation
	void K2_SetRelativeLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeLocationAndRotation
	void K2_SetRelativeLocation(struct FVector NewLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeLocation
	struct FTransform K2_GetComponentToWorld(); // Function Engine.SceneComponent.K2_GetComponentToWorld
	struct FVector K2_GetComponentScale(); // Function Engine.SceneComponent.K2_GetComponentScale
	struct FRotator K2_GetComponentRotation(); // Function Engine.SceneComponent.K2_GetComponentRotation
	struct FVector K2_GetComponentLocation(); // Function Engine.SceneComponent.K2_GetComponentLocation
	void K2_DetachFromComponent(uint8_t  LocationRule, uint8_t  RotationRule, uint8_t  ScaleRule, bool bCallModify); // Function Engine.SceneComponent.K2_DetachFromComponent
	bool K2_AttachToComponent(struct USceneComponent* Parent, struct FName SocketName, uint8_t  LocationRule, uint8_t  RotationRule, uint8_t  ScaleRule, bool bWeldSimulatedBodies); // Function Engine.SceneComponent.K2_AttachToComponent
	bool K2_AttachTo(struct USceneComponent* InParent, struct FName InSocketName, char EAttachLocation AttachType, bool bWeldSimulatedBodies); // Function Engine.SceneComponent.K2_AttachTo
	void K2_AddWorldTransformKeepScale(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldTransformKeepScale
	void K2_AddWorldTransform(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldTransform
	void K2_AddWorldRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldRotation
	void K2_AddWorldOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldOffset
	void K2_AddRelativeRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddRelativeRotation
	void K2_AddRelativeLocation(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddRelativeLocation
	void K2_AddLocalTransform(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalTransform
	void K2_AddLocalRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalRotation
	void K2_AddLocalOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalOffset
	bool IsVisible(); // Function Engine.SceneComponent.IsVisible
	bool IsSimulatingPhysics(struct FName BoneName); // Function Engine.SceneComponent.IsSimulatingPhysics
	bool IsAnySimulatingPhysics(); // Function Engine.SceneComponent.IsAnySimulatingPhysics
	struct FVector GetUpVector(); // Function Engine.SceneComponent.GetUpVector
	struct FTransform GetSocketTransform(struct FName InSocketName, char ERelativeTransformSpace TransformSpace); // Function Engine.SceneComponent.GetSocketTransform
	struct FRotator GetSocketRotation(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketRotation
	struct FQuat GetSocketQuaternion(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketQuaternion
	struct FVector GetSocketLocation(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketLocation
	bool GetShouldUpdatePhysicsVolume(); // Function Engine.SceneComponent.GetShouldUpdatePhysicsVolume
	struct FVector GetRightVector(); // Function Engine.SceneComponent.GetRightVector
	struct FTransform GetRelativeTransform(); // Function Engine.SceneComponent.GetRelativeTransform
	struct APhysicsVolume* GetPhysicsVolume(); // Function Engine.SceneComponent.GetPhysicsVolume
	void GetParentComponents(struct TArray<struct USceneComponent*>& Parents); // Function Engine.SceneComponent.GetParentComponents
	int32_t GetNumChildrenComponents(); // Function Engine.SceneComponent.GetNumChildrenComponents
	struct FVector GetForwardVector(); // Function Engine.SceneComponent.GetForwardVector
	struct FVector GetComponentVelocity(); // Function Engine.SceneComponent.GetComponentVelocity
	void GetChildrenComponents(bool bIncludeAllDescendants, struct TArray<struct USceneComponent*>& Children); // Function Engine.SceneComponent.GetChildrenComponents
	struct USceneComponent* GetChildComponent(int32_t ChildIndex); // Function Engine.SceneComponent.GetChildComponent
	struct FName GetAttachSocketName(); // Function Engine.SceneComponent.GetAttachSocketName
	struct USceneComponent* GetAttachParent(); // Function Engine.SceneComponent.GetAttachParent
	struct TArray<struct FName> GetAllSocketNames(); // Function Engine.SceneComponent.GetAllSocketNames
	bool DoesSocketExist(struct FName InSocketName); // Function Engine.SceneComponent.DoesSocketExist
	void DetachFromParent(bool bMaintainWorldPosition, bool bCallModify); // Function Engine.SceneComponent.DetachFromParent
}; 



// Class Engine.ParticleModuleTypeDataBeam2
// Size: 0x150(Inherited: 0x30) 
struct UParticleModuleTypeDataBeam2 : public UParticleModuleTypeDataBase
{
	char EBeam2Method BeamMethod;  // 0x30(0x1)
	char pad_49[3];  // 0x31(0x3)
	int32_t TextureTile;  // 0x34(0x4)
	float TextureTileDistance;  // 0x38(0x4)
	int32_t Sheets;  // 0x3C(0x4)
	int32_t MaxBeamCount;  // 0x40(0x4)
	float Speed;  // 0x44(0x4)
	int32_t InterpolationPoints;  // 0x48(0x4)
	char bAlwaysOn : 1;  // 0x4C(0x1)
	char pad_76_1 : 7;  // 0x4C(0x1)
	char pad_77[4];  // 0x4D(0x4)
	int32_t UpVectorStepSize;  // 0x50(0x4)
	struct FName BranchParentName;  // 0x54(0x8)
	char pad_92[4];  // 0x5C(0x4)
	struct FRawDistributionFloat Distance;  // 0x60(0x30)
	char EBeamTaperMethod TaperMethod;  // 0x90(0x1)
	char pad_145[7];  // 0x91(0x7)
	struct FRawDistributionFloat TaperFactor;  // 0x98(0x30)
	struct FRawDistributionFloat TaperScale;  // 0xC8(0x30)
	char RenderGeometry : 1;  // 0xF8(0x1)
	char RenderDirectLine : 1;  // 0xF8(0x1)
	char RenderLines : 1;  // 0xF8(0x1)
	char RenderTessellation : 1;  // 0xF8(0x1)
	char pad_248_1 : 4;  // 0xF8(0x1)
	char pad_249[88];  // 0xF9(0x58)

}; 



// Class Engine.SkinnedMeshComponent
// Size: 0x6A0(Inherited: 0x480) 
struct USkinnedMeshComponent : public UMeshComponent
{
	struct USkeletalMesh* SkeletalMesh;  // 0x480(0x8)
	struct TWeakObjectPtr<USkinnedMeshComponent> MasterPoseComponent;  // 0x488(0x8)
	struct TArray<uint8_t > SkinCacheUsage;  // 0x490(0x10)
	struct TArray<struct FVertexOffsetUsage> VertexOffsetUsage;  // 0x4A0(0x10)
	char pad_1200[248];  // 0x4B0(0xF8)
	struct UPhysicsAsset* PhysicsAssetOverride;  // 0x5A8(0x8)
	int32_t ForcedLodModel;  // 0x5B0(0x4)
	int32_t MinLodModel;  // 0x5B4(0x4)
	char pad_1464[8];  // 0x5B8(0x8)
	float StreamingDistanceMultiplier;  // 0x5C0(0x4)
	char pad_1476[12];  // 0x5C4(0xC)
	struct TArray<struct FSkelMeshComponentLODInfo> LODInfo;  // 0x5D0(0x10)
	char pad_1504[36];  // 0x5E0(0x24)
	uint8_t  VisibilityBasedAnimTickOption;  // 0x604(0x1)
	char pad_1541[1];  // 0x605(0x1)
	char pad_1542_1 : 3;  // 0x606(0x1)
	char bOverrideMinLOD : 1;  // 0x606(0x1)
	char bUseBoundsFromMasterPoseComponent : 1;  // 0x606(0x1)
	char bForceWireframe : 1;  // 0x606(0x1)
	char bDisplayBones : 1;  // 0x606(0x1)
	char bDisableMorphTarget : 1;  // 0x606(0x1)
	char bHideSkin : 1;  // 0x607(0x1)
	char bPerBoneMotionBlur : 1;  // 0x607(0x1)
	char bComponentUseFixedSkelBounds : 1;  // 0x607(0x1)
	char bConsiderAllBodiesForBounds : 1;  // 0x607(0x1)
	char bSyncAttachParentLOD : 1;  // 0x607(0x1)
	char bCanHighlightSelectedSections : 1;  // 0x607(0x1)
	char bRecentlyRendered : 1;  // 0x607(0x1)
	char bCastCapsuleDirectShadow : 1;  // 0x607(0x1)
	char bCastCapsuleIndirectShadow : 1;  // 0x608(0x1)
	char bCPUSkinning : 1;  // 0x608(0x1)
	char bEnableUpdateRateOptimizations : 1;  // 0x608(0x1)
	char bDisplayDebugUpdateRateOptimizations : 1;  // 0x608(0x1)
	char bRenderStatic : 1;  // 0x608(0x1)
	char bIgnoreMasterPoseComponentLOD : 1;  // 0x608(0x1)
	char pad_1544_1 : 2;  // 0x608(0x1)
	char bCachedLocalBoundsUpToDate : 1;  // 0x609(0x1)
	char pad_1545_1 : 1;  // 0x609(0x1)
	char bForceMeshObjectUpdate : 1;  // 0x609(0x1)
	char pad_1545_2 : 5;  // 0x609(0x1)
	char pad_1546[3];  // 0x60A(0x3)
	float CapsuleIndirectShadowMinVisibility;  // 0x60C(0x4)
	char pad_1552[16];  // 0x610(0x10)
	struct FBoxSphereBounds CachedWorldSpaceBounds;  // 0x620(0x1C)
	char pad_1596[4];  // 0x63C(0x4)
	struct FMatrix CachedWorldToLocalTransform;  // 0x640(0x40)
	char pad_1664[32];  // 0x680(0x20)

	void UnloadSkinWeightProfile(struct FName InProfileName); // Function Engine.SkinnedMeshComponent.UnloadSkinWeightProfile
	void UnHideBoneByName(struct FName BoneName); // Function Engine.SkinnedMeshComponent.UnHideBoneByName
	void TransformToBoneSpace(struct FName BoneName, struct FVector InPosition, struct FRotator InRotation, struct FVector& OutPosition, struct FRotator& OutRotation); // Function Engine.SkinnedMeshComponent.TransformToBoneSpace
	void TransformFromBoneSpace(struct FName BoneName, struct FVector InPosition, struct FRotator InRotation, struct FVector& OutPosition, struct FRotator& OutRotation); // Function Engine.SkinnedMeshComponent.TransformFromBoneSpace
	void ShowMaterialSection(int32_t MaterialID, int32_t SectionIndex, bool bShow, int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ShowMaterialSection
	void ShowAllMaterialSections(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ShowAllMaterialSections
	void SetVertexOffsetUsage(int32_t LODIndex, int32_t Usage); // Function Engine.SkinnedMeshComponent.SetVertexOffsetUsage
	void SetVertexColorOverride_LinearColor(int32_t LODIndex, struct TArray<struct FLinearColor>& VertexColors); // Function Engine.SkinnedMeshComponent.SetVertexColorOverride_LinearColor
	bool SetSkinWeightProfile(struct FName InProfileName); // Function Engine.SkinnedMeshComponent.SetSkinWeightProfile
	void SetSkinWeightOverride(int32_t LODIndex, struct TArray<struct FSkelMeshSkinWeightInfo>& SkinWeights); // Function Engine.SkinnedMeshComponent.SetSkinWeightOverride
	void SetSkeletalMesh(struct USkeletalMesh* NewMesh, bool bReinitPose); // Function Engine.SkinnedMeshComponent.SetSkeletalMesh
	void SetRenderStatic(bool bNewValue); // Function Engine.SkinnedMeshComponent.SetRenderStatic
	void SetPreSkinningOffsets(int32_t LODIndex, struct TArray<struct FVector> Offsets); // Function Engine.SkinnedMeshComponent.SetPreSkinningOffsets
	void SetPostSkinningOffsets(int32_t LODIndex, struct TArray<struct FVector> Offsets); // Function Engine.SkinnedMeshComponent.SetPostSkinningOffsets
	void SetPhysicsAsset(struct UPhysicsAsset* NewPhysicsAsset, bool bForceReInit); // Function Engine.SkinnedMeshComponent.SetPhysicsAsset
	void SetMinLOD(int32_t InNewMinLOD); // Function Engine.SkinnedMeshComponent.SetMinLOD
	void SetMasterPoseComponent(struct USkinnedMeshComponent* NewMasterBoneComponent, bool bForceUpdate); // Function Engine.SkinnedMeshComponent.SetMasterPoseComponent
	void SetForcedLOD(int32_t InNewForcedLOD); // Function Engine.SkinnedMeshComponent.SetForcedLOD
	void SetCastCapsuleIndirectShadow(bool bNewValue); // Function Engine.SkinnedMeshComponent.SetCastCapsuleIndirectShadow
	void SetCastCapsuleDirectShadow(bool bNewValue); // Function Engine.SkinnedMeshComponent.SetCastCapsuleDirectShadow
	void SetCapsuleIndirectShadowMinVisibility(float NewValue); // Function Engine.SkinnedMeshComponent.SetCapsuleIndirectShadowMinVisibility
	bool IsUsingSkinWeightProfile(); // Function Engine.SkinnedMeshComponent.IsUsingSkinWeightProfile
	bool IsMaterialSectionShown(int32_t MaterialID, int32_t LODIndex); // Function Engine.SkinnedMeshComponent.IsMaterialSectionShown
	bool IsBoneHiddenByName(struct FName BoneName); // Function Engine.SkinnedMeshComponent.IsBoneHiddenByName
	void HideBoneByName(struct FName BoneName, char EPhysBodyOp PhysBodyOption); // Function Engine.SkinnedMeshComponent.HideBoneByName
	int32_t GetVertexOffsetUsage(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.GetVertexOffsetUsage
	bool GetTwistAndSwingAngleOfDeltaRotationFromRefPose(struct FName BoneName, float& OutTwistAngle, float& OutSwingAngle); // Function Engine.SkinnedMeshComponent.GetTwistAndSwingAngleOfDeltaRotationFromRefPose
	struct FName GetSocketBoneName(struct FName InSocketName); // Function Engine.SkinnedMeshComponent.GetSocketBoneName
	struct FVector GetRefPosePosition(int32_t BoneIndex); // Function Engine.SkinnedMeshComponent.GetRefPosePosition
	struct FName GetParentBone(struct FName BoneName); // Function Engine.SkinnedMeshComponent.GetParentBone
	int32_t GetNumLODs(); // Function Engine.SkinnedMeshComponent.GetNumLODs
	int32_t GetNumBones(); // Function Engine.SkinnedMeshComponent.GetNumBones
	int32_t GetForcedLOD(); // Function Engine.SkinnedMeshComponent.GetForcedLOD
	struct FTransform GetDeltaTransformFromRefPose(struct FName BoneName, struct FName BaseName); // Function Engine.SkinnedMeshComponent.GetDeltaTransformFromRefPose
	struct FName GetCurrentSkinWeightProfileName(); // Function Engine.SkinnedMeshComponent.GetCurrentSkinWeightProfileName
	struct FName GetBoneName(int32_t BoneIndex); // Function Engine.SkinnedMeshComponent.GetBoneName
	int32_t GetBoneIndex(struct FName BoneName); // Function Engine.SkinnedMeshComponent.GetBoneIndex
	struct FName FindClosestBone_K2(struct FVector TestLocation, struct FVector& BoneLocation, float IgnoreScale, bool bRequirePhysicsAsset); // Function Engine.SkinnedMeshComponent.FindClosestBone_K2
	void ClearVertexColorOverride(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ClearVertexColorOverride
	void ClearSkinWeightProfile(); // Function Engine.SkinnedMeshComponent.ClearSkinWeightProfile
	void ClearSkinWeightOverride(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ClearSkinWeightOverride
	bool BoneIsChildOf(struct FName BoneName, struct FName ParentBoneName); // Function Engine.SkinnedMeshComponent.BoneIsChildOf
}; 



// Class Engine.SoundSubmixWithParentBase
// Size: 0x40(Inherited: 0x38) 
struct USoundSubmixWithParentBase : public USoundSubmixBase
{
	struct USoundSubmixBase* ParentSubmix;  // 0x38(0x8)

}; 



// Class Engine.MaterialExpressionDecalDerivative
// Size: 0x40(Inherited: 0x40) 
struct UMaterialExpressionDecalDerivative : public UMaterialExpression
{

}; 



// Class Engine.MovementComponent
// Size: 0xF0(Inherited: 0xB0) 
struct UMovementComponent : public UActorComponent
{
	struct USceneComponent* UpdatedComponent;  // 0xB0(0x8)
	struct UPrimitiveComponent* UpdatedPrimitive;  // 0xB8(0x8)
	char pad_192[4];  // 0xC0(0x4)
	struct FVector Velocity;  // 0xC4(0xC)
	struct FVector PlaneConstraintNormal;  // 0xD0(0xC)
	struct FVector PlaneConstraintOrigin;  // 0xDC(0xC)
	char bUpdateOnlyIfRendered : 1;  // 0xE8(0x1)
	char bAutoUpdateTickRegistration : 1;  // 0xE8(0x1)
	char bTickBeforeOwner : 1;  // 0xE8(0x1)
	char bAutoRegisterUpdatedComponent : 1;  // 0xE8(0x1)
	char bConstrainToPlane : 1;  // 0xE8(0x1)
	char bSnapToPlaneAtStart : 1;  // 0xE8(0x1)
	char bAutoRegisterPhysicsVolumeUpdates : 1;  // 0xE8(0x1)
	char bComponentShouldUpdatePhysicsVolume : 1;  // 0xE8(0x1)
	char pad_233[2];  // 0xE9(0x2)
	uint8_t  PlaneConstraintAxisSetting;  // 0xEB(0x1)
	char pad_236[4];  // 0xEC(0x4)

	void StopMovementImmediately(); // Function Engine.MovementComponent.StopMovementImmediately
	void SnapUpdatedComponentToPlane(); // Function Engine.MovementComponent.SnapUpdatedComponentToPlane
	void SetUpdatedComponent(struct USceneComponent* NewUpdatedComponent); // Function Engine.MovementComponent.SetUpdatedComponent
	void SetPlaneConstraintOrigin(struct FVector PlaneOrigin); // Function Engine.MovementComponent.SetPlaneConstraintOrigin
	void SetPlaneConstraintNormal(struct FVector PlaneNormal); // Function Engine.MovementComponent.SetPlaneConstraintNormal
	void SetPlaneConstraintFromVectors(struct FVector Forward, struct FVector Up); // Function Engine.MovementComponent.SetPlaneConstraintFromVectors
	void SetPlaneConstraintEnabled(bool bEnabled); // Function Engine.MovementComponent.SetPlaneConstraintEnabled
	void SetPlaneConstraintAxisSetting(uint8_t  NewAxisSetting); // Function Engine.MovementComponent.SetPlaneConstraintAxisSetting
	void PhysicsVolumeChanged(struct APhysicsVolume* NewVolume); // Function Engine.MovementComponent.PhysicsVolumeChanged
	bool K2_MoveUpdatedComponent(struct FVector Delta, struct FRotator NewRotation, struct FHitResult& OutHit, bool bSweep, bool bTeleport); // Function Engine.MovementComponent.K2_MoveUpdatedComponent
	float K2_GetModifiedMaxSpeed(); // Function Engine.MovementComponent.K2_GetModifiedMaxSpeed
	float K2_GetMaxSpeedModifier(); // Function Engine.MovementComponent.K2_GetMaxSpeedModifier
	bool IsExceedingMaxSpeed(float MaxSpeed); // Function Engine.MovementComponent.IsExceedingMaxSpeed
	struct FVector GetPlaneConstraintOrigin(); // Function Engine.MovementComponent.GetPlaneConstraintOrigin
	struct FVector GetPlaneConstraintNormal(); // Function Engine.MovementComponent.GetPlaneConstraintNormal
	uint8_t  GetPlaneConstraintAxisSetting(); // Function Engine.MovementComponent.GetPlaneConstraintAxisSetting
	struct APhysicsVolume* GetPhysicsVolume(); // Function Engine.MovementComponent.GetPhysicsVolume
	float GetMaxSpeed(); // Function Engine.MovementComponent.GetMaxSpeed
	float GetGravityZ(); // Function Engine.MovementComponent.GetGravityZ
	struct FVector ConstrainNormalToPlane(struct FVector Normal); // Function Engine.MovementComponent.ConstrainNormalToPlane
	struct FVector ConstrainLocationToPlane(struct FVector Location); // Function Engine.MovementComponent.ConstrainLocationToPlane
	struct FVector ConstrainDirectionToPlane(struct FVector Direction); // Function Engine.MovementComponent.ConstrainDirectionToPlane
}; 



// Class Engine.MeshComponent
// Size: 0x480(Inherited: 0x450) 
struct UMeshComponent : public UPrimitiveComponent
{
	struct TArray<struct UMaterialInterface*> OverrideMaterials;  // 0x450(0x10)
	char pad_1120[16];  // 0x460(0x10)
	char bEnableMaterialParameterCaching : 1;  // 0x470(0x1)
	char pad_1136_1 : 7;  // 0x470(0x1)
	char pad_1137[16];  // 0x471(0x10)

	void SetVectorParameterValueOnMaterials(struct FName ParameterName, struct FVector ParameterValue); // Function Engine.MeshComponent.SetVectorParameterValueOnMaterials
	void SetScalarParameterValueOnMaterials(struct FName ParameterName, float ParameterValue); // Function Engine.MeshComponent.SetScalarParameterValueOnMaterials
	void PrestreamTextures(float Seconds, bool bPrioritizeCharacterTextures, int32_t CinematicTextureGroups); // Function Engine.MeshComponent.PrestreamTextures
	bool IsMaterialSlotNameValid(struct FName MaterialSlotName); // Function Engine.MeshComponent.IsMaterialSlotNameValid
	struct TArray<struct FName> GetMaterialSlotNames(); // Function Engine.MeshComponent.GetMaterialSlotNames
	struct TArray<struct UMaterialInterface*> GetMaterials(); // Function Engine.MeshComponent.GetMaterials
	int32_t GetMaterialIndex(struct FName MaterialSlotName); // Function Engine.MeshComponent.GetMaterialIndex
}; 



// Class Engine.MaterialExpressionVertexNormalWS
// Size: 0x40(Inherited: 0x40) 
struct UMaterialExpressionVertexNormalWS : public UMaterialExpression
{

}; 



// Class Engine.OnlineBlueprintCallProxyBase
// Size: 0x30(Inherited: 0x30) 
struct UOnlineBlueprintCallProxyBase : public UBlueprintAsyncActionBase
{

}; 



// Class Engine.NavMovementComponent
// Size: 0x130(Inherited: 0xF0) 
struct UNavMovementComponent : public UMovementComponent
{
	struct FNavAgentProperties NavAgentProps;  // 0xF0(0x30)
	float FixedPathBrakingDistance;  // 0x120(0x4)
	char bUpdateNavAgentWithOwnersCollision : 1;  // 0x124(0x1)
	char bUseAccelerationForPaths : 1;  // 0x124(0x1)
	char bUseFixedBrakingDistanceForPaths : 1;  // 0x124(0x1)
	char pad_292_1 : 5;  // 0x124(0x1)
	struct FMovementProperties MovementState;  // 0x125(0x1)
	char pad_294[2];  // 0x126(0x2)
	struct UObject* PathFollowingComp;  // 0x128(0x8)

	void StopMovementKeepPathing(); // Function Engine.NavMovementComponent.StopMovementKeepPathing
	void StopActiveMovement(); // Function Engine.NavMovementComponent.StopActiveMovement
	bool IsSwimming(); // Function Engine.NavMovementComponent.IsSwimming
	bool IsMovingOnGround(); // Function Engine.NavMovementComponent.IsMovingOnGround
	bool IsFlying(); // Function Engine.NavMovementComponent.IsFlying
	bool IsFalling(); // Function Engine.NavMovementComponent.IsFalling
	bool IsCrouching(); // Function Engine.NavMovementComponent.IsCrouching
}; 



// Class Engine.BoneMaskFilter
// Size: 0x38(Inherited: 0x28) 
struct UBoneMaskFilter : public UObject
{
	struct TArray<struct FInputBlendPose> BlendPoses;  // 0x28(0x10)

}; 



// Class Engine.SoundEffectSourcePreset
// Size: 0x68(Inherited: 0x68) 
struct USoundEffectSourcePreset : public USoundEffectPreset
{

}; 



// Class Engine.PawnMovementComponent
// Size: 0x138(Inherited: 0x130) 
struct UPawnMovementComponent : public UNavMovementComponent
{
	struct APawn* PawnOwner;  // 0x130(0x8)

	struct FVector K2_GetInputVector(); // Function Engine.PawnMovementComponent.K2_GetInputVector
	bool IsMoveInputIgnored(); // Function Engine.PawnMovementComponent.IsMoveInputIgnored
	struct FVector GetPendingInputVector(); // Function Engine.PawnMovementComponent.GetPendingInputVector
	struct APawn* GetPawnOwner(); // Function Engine.PawnMovementComponent.GetPawnOwner
	struct FVector GetLastInputVector(); // Function Engine.PawnMovementComponent.GetLastInputVector
	struct FVector ConsumeInputVector(); // Function Engine.PawnMovementComponent.ConsumeInputVector
	void AddInputVector(struct FVector WorldVector, bool bForce); // Function Engine.PawnMovementComponent.AddInputVector
}; 



// Class Engine.OnlineEngineInterface
// Size: 0x28(Inherited: 0x28) 
struct UOnlineEngineInterface : public UObject
{

}; 



// Class Engine.DataAsset
// Size: 0x30(Inherited: 0x28) 
struct UDataAsset : public UObject
{
	UDataAsset* NativeClass;  // 0x28(0x8)

}; 



// Class Engine.KismetMaterialLibrary
// Size: 0x28(Inherited: 0x28) 
struct UKismetMaterialLibrary : public UBlueprintFunctionLibrary
{

	void SetVectorParameterValue(struct UObject* WorldContextObject, struct UMaterialParameterCollection* Collection, struct FName ParameterName, struct FLinearColor& ParameterValue); // Function Engine.KismetMaterialLibrary.SetVectorParameterValue
	void SetScalarParameterValue(struct UObject* WorldContextObject, struct UMaterialParameterCollection* Collection, struct FName ParameterName, float ParameterValue); // Function Engine.KismetMaterialLibrary.SetScalarParameterValue
	struct FLinearColor GetVectorParameterValue(struct UObject* WorldContextObject, struct UMaterialParameterCollection* Collection, struct FName ParameterName); // Function Engine.KismetMaterialLibrary.GetVectorParameterValue
	float GetScalarParameterValue(struct UObject* WorldContextObject, struct UMaterialParameterCollection* Collection, struct FName ParameterName); // Function Engine.KismetMaterialLibrary.GetScalarParameterValue
	struct UMaterialInstanceDynamic* CreateDynamicMaterialInstance(struct UObject* WorldContextObject, struct UMaterialInterface* Parent, struct FName OptionalName, uint8_t  CreationFlags); // Function Engine.KismetMaterialLibrary.CreateDynamicMaterialInstance
}; 



// Class Engine.PackageMapClient
// Size: 0x408(Inherited: 0xE0) 
struct UPackageMapClient : public UPackageMap
{
	char pad_224[808];  // 0xE0(0x328)

}; 



// Class Engine.BookMark
// Size: 0x50(Inherited: 0x28) 
struct UBookMark : public UBookmarkBase
{
	struct FVector Location;  // 0x28(0xC)
	struct FRotator Rotation;  // 0x34(0xC)
	struct TArray<struct FString> HiddenLevels;  // 0x40(0x10)

}; 



// Class Engine.InterpTrackParticleReplay
// Size: 0x80(Inherited: 0x70) 
struct UInterpTrackParticleReplay : public UInterpTrack
{
	struct TArray<struct FParticleReplayTrackKey> TrackKeys;  // 0x70(0x10)

}; 



// Class Engine.ParticleModuleColorScaleOverLife
// Size: 0xB0(Inherited: 0x30) 
struct UParticleModuleColorScaleOverLife : public UParticleModuleColorBase
{
	struct FRawDistributionVector ColorScaleOverLife;  // 0x30(0x48)
	struct FRawDistributionFloat AlphaScaleOverLife;  // 0x78(0x30)
	char bEmitterTime : 1;  // 0xA8(0x1)
	char pad_168_1 : 7;  // 0xA8(0x1)
	char pad_169[8];  // 0xA9(0x8)

}; 



// Class Engine.BlueprintFunctionLibrary
// Size: 0x28(Inherited: 0x28) 
struct UBlueprintFunctionLibrary : public UObject
{

}; 



// Class Engine.MaterialFunctionMaterialLayerBlend
// Size: 0x58(Inherited: 0x58) 
struct UMaterialFunctionMaterialLayerBlend : public UMaterialFunction
{

}; 



// Class Engine.LightComponentBase
// Size: 0x230(Inherited: 0x200) 
struct ULightComponentBase : public USceneComponent
{
	struct FGuid LightGuid;  // 0x1F8(0x10)
	float Brightness;  // 0x208(0x4)
	float Intensity;  // 0x20C(0x4)
	struct FColor LightColor;  // 0x210(0x4)
	char bAffectsWorld : 1;  // 0x214(0x1)
	char CastShadows : 1;  // 0x214(0x1)
	char CastStaticShadows : 1;  // 0x214(0x1)
	char CastDynamicShadows : 1;  // 0x214(0x1)
	char bAffectTranslucentLighting : 1;  // 0x214(0x1)
	char bTransmission : 1;  // 0x214(0x1)
	char bCastVolumetricShadow : 1;  // 0x214(0x1)
	char bCastDeepShadow : 1;  // 0x214(0x1)
	char bCastRaytracedShadow : 1;  // 0x215(0x1)
	char bAffectReflection : 1;  // 0x215(0x1)
	char bAffectGlobalIllumination : 1;  // 0x215(0x1)
	float DeepShadowLayerDistribution;  // 0x218(0x4)
	float IndirectLightingIntensity;  // 0x21C(0x4)
	float VolumetricScatteringIntensity;  // 0x220(0x4)
	int32_t SamplesPerPixel;  // 0x224(0x4)
	char pad_557_1 : 5;  // 0x22D(0x1)
	char pad_558[3];  // 0x22E(0x3)

	void SetSamplesPerPixel(int32_t NewValue); // Function Engine.LightComponentBase.SetSamplesPerPixel
	void SetCastVolumetricShadow(bool bNewValue); // Function Engine.LightComponentBase.SetCastVolumetricShadow
	void SetCastShadows(bool bNewValue); // Function Engine.LightComponentBase.SetCastShadows
	void SetCastRaytracedShadow(bool bNewValue); // Function Engine.LightComponentBase.SetCastRaytracedShadow
	void SetCastDeepShadow(bool bNewValue); // Function Engine.LightComponentBase.SetCastDeepShadow
	void SetAffectReflection(bool bNewValue); // Function Engine.LightComponentBase.SetAffectReflection
	void SetAffectGlobalIllumination(bool bNewValue); // Function Engine.LightComponentBase.SetAffectGlobalIllumination
	struct FLinearColor GetLightColor(); // Function Engine.LightComponentBase.GetLightColor
}; 



// Class Engine.SplineMeshComponent
// Size: 0x580(Inherited: 0x4E0) 
struct USplineMeshComponent : public UStaticMeshComponent
{
	char pad_1248[8];  // 0x4E0(0x8)
	struct FSplineMeshParams SplineParams;  // 0x4E8(0x58)
	struct FVector SplineUpDir;  // 0x540(0xC)
	float SplineBoundaryMin;  // 0x54C(0x4)
	struct FGuid CachedMeshBodySetupGuid;  // 0x550(0x10)
	struct UBodySetup* BodySetup;  // 0x560(0x8)
	float SplineBoundaryMax;  // 0x568(0x4)
	char bAllowSplineEditingPerInstance : 1;  // 0x56C(0x1)
	char bSmoothInterpRollScale : 1;  // 0x56C(0x1)
	char bMeshDirty : 1;  // 0x56C(0x1)
	char pad_1388_1 : 5;  // 0x56C(0x1)
	char ESplineMeshAxis ForwardAxis;  // 0x56D(0x1)
	char pad_1390[2];  // 0x56E(0x2)
	float VirtualTextureMainPassMaxDrawDistance;  // 0x570(0x4)
	char pad_1396[12];  // 0x574(0xC)

	void UpdateMesh(); // Function Engine.SplineMeshComponent.UpdateMesh
	void SetStartTangent(struct FVector StartTangent, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetStartTangent
	void SetStartScale(struct FVector2D StartScale, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetStartScale
	void SetStartRoll(float StartRoll, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetStartRoll
	void SetStartPosition(struct FVector StartPos, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetStartPosition
	void SetStartOffset(struct FVector2D StartOffset, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetStartOffset
	void SetStartAndEnd(struct FVector StartPos, struct FVector StartTangent, struct FVector EndPos, struct FVector EndTangent, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetStartAndEnd
	void SetSplineUpDir(struct FVector& InSplineUpDir, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetSplineUpDir
	void SetForwardAxis(char ESplineMeshAxis InForwardAxis, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetForwardAxis
	void SetEndTangent(struct FVector EndTangent, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetEndTangent
	void SetEndScale(struct FVector2D EndScale, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetEndScale
	void SetEndRoll(float EndRoll, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetEndRoll
	void SetEndPosition(struct FVector EndPos, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetEndPosition
	void SetEndOffset(struct FVector2D EndOffset, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetEndOffset
	void SetBoundaryMin(float InBoundaryMin, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetBoundaryMin
	void SetBoundaryMax(float InBoundaryMax, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetBoundaryMax
	struct FVector GetStartTangent(); // Function Engine.SplineMeshComponent.GetStartTangent
	struct FVector2D GetStartScale(); // Function Engine.SplineMeshComponent.GetStartScale
	float GetStartRoll(); // Function Engine.SplineMeshComponent.GetStartRoll
	struct FVector GetStartPosition(); // Function Engine.SplineMeshComponent.GetStartPosition
	struct FVector2D GetStartOffset(); // Function Engine.SplineMeshComponent.GetStartOffset
	struct FVector GetSplineUpDir(); // Function Engine.SplineMeshComponent.GetSplineUpDir
	char ESplineMeshAxis GetForwardAxis(); // Function Engine.SplineMeshComponent.GetForwardAxis
	struct FVector GetEndTangent(); // Function Engine.SplineMeshComponent.GetEndTangent
	struct FVector2D GetEndScale(); // Function Engine.SplineMeshComponent.GetEndScale
	float GetEndRoll(); // Function Engine.SplineMeshComponent.GetEndRoll
	struct FVector GetEndPosition(); // Function Engine.SplineMeshComponent.GetEndPosition
	struct FVector2D GetEndOffset(); // Function Engine.SplineMeshComponent.GetEndOffset
	float GetBoundaryMin(); // Function Engine.SplineMeshComponent.GetBoundaryMin
	float GetBoundaryMax(); // Function Engine.SplineMeshComponent.GetBoundaryMax
}; 



// Class Engine.CameraShakeBase
// Size: 0xB0(Inherited: 0x28) 
struct UCameraShakeBase : public UObject
{
	char pad_40_1 : 7;  // 0x28(0x1)
	bool bSingleInstance : 1;  // 0x28(0x1)
	char pad_41[3];  // 0x29(0x3)
	float ShakeScale;  // 0x2C(0x4)
	struct UCameraShakePattern* RootShakePattern;  // 0x30(0x8)
	struct APlayerCameraManager* cameraManager;  // 0x38(0x8)
	char pad_64[112];  // 0x40(0x70)

	void SetRootShakePattern(struct UCameraShakePattern* InPattern); // Function Engine.CameraShakeBase.SetRootShakePattern
	struct UCameraShakePattern* GetRootShakePattern(); // Function Engine.CameraShakeBase.GetRootShakePattern
}; 



// Class Engine.CurveVector
// Size: 0x1B0(Inherited: 0x30) 
struct UCurveVector : public UCurveBase
{
	struct FRichCurve FloatCurves[3];  // 0x30(0x180)

	struct FVector GetVectorValue(float InTime); // Function Engine.CurveVector.GetVectorValue
}; 



// Class Engine.MaterialExpressionPrecomputedAOMask
// Size: 0x40(Inherited: 0x40) 
struct UMaterialExpressionPrecomputedAOMask : public UMaterialExpression
{

}; 



// Class Engine.CameraShakePattern
// Size: 0x28(Inherited: 0x28) 
struct UCameraShakePattern : public UObject
{

}; 



// Class Engine.TargetPoint
// Size: 0x220(Inherited: 0x220) 
struct ATargetPoint : public AActor
{

}; 



// Class Engine.AssetImportData
// Size: 0x28(Inherited: 0x28) 
struct UAssetImportData : public UObject
{

}; 



// Class Engine.TimecodeProvider
// Size: 0x30(Inherited: 0x28) 
struct UTimecodeProvider : public UObject
{
	float FrameDelay;  // 0x28(0x4)
	char pad_44[4];  // 0x2C(0x4)

	struct FTimecode GetTimecode(); // Function Engine.TimecodeProvider.GetTimecode
	uint8_t  GetSynchronizationState(); // Function Engine.TimecodeProvider.GetSynchronizationState
	struct FQualifiedFrameTime GetQualifiedFrameTime(); // Function Engine.TimecodeProvider.GetQualifiedFrameTime
	struct FFrameRate GetFrameRate(); // Function Engine.TimecodeProvider.GetFrameRate
	struct FTimecode GetDelayedTimecode(); // Function Engine.TimecodeProvider.GetDelayedTimecode
	struct FQualifiedFrameTime GetDelayedQualifiedFrameTime(); // Function Engine.TimecodeProvider.GetDelayedQualifiedFrameTime
	bool FetchTimecode(struct FQualifiedFrameTime& OutFrameTime); // Function Engine.TimecodeProvider.FetchTimecode
	void FetchAndUpdate(); // Function Engine.TimecodeProvider.FetchAndUpdate
}; 



// Class Engine.Font
// Size: 0x1D0(Inherited: 0x28) 
struct UFont : public UObject
{
	char pad_40[8];  // 0x28(0x8)
	uint8_t  FontCacheType;  // 0x30(0x1)
	char pad_49[7];  // 0x31(0x7)
	struct TArray<struct FFontCharacter> Characters;  // 0x38(0x10)
	struct TArray<struct UTexture2D*> Textures;  // 0x48(0x10)
	int32_t IsRemapped;  // 0x58(0x4)
	float EmScale;  // 0x5C(0x4)
	float Ascent;  // 0x60(0x4)
	float Descent;  // 0x64(0x4)
	float Leading;  // 0x68(0x4)
	int32_t Kerning;  // 0x6C(0x4)
	struct FFontImportOptionsData ImportOptions;  // 0x70(0xB0)
	int32_t NumCharacters;  // 0x120(0x4)
	char pad_292[4];  // 0x124(0x4)
	struct TArray<int32_t> MaxCharHeight;  // 0x128(0x10)
	float ScalingFactor;  // 0x138(0x4)
	int32_t LegacyFontSize;  // 0x13C(0x4)
	struct FName LegacyFontName;  // 0x140(0x8)
	struct FCompositeFont CompositeFont;  // 0x148(0x38)
	char pad_384[80];  // 0x180(0x50)

}; 



// Class Engine.PlayerStartPIE
// Size: 0x250(Inherited: 0x250) 
struct APlayerStartPIE : public APlayerStart
{

}; 



// Class Engine.AnimCompress_LeastDestructive
// Size: 0x40(Inherited: 0x40) 
struct UAnimCompress_LeastDestructive : public UAnimCompress_BitwiseCompressOnly
{

}; 



// Class Engine.SpotLight
// Size: 0x238(Inherited: 0x230) 
struct ASpotLight : public ALight
{
	struct USpotLightComponent* SpotLightComponent;  // 0x230(0x8)

	void SetOuterConeAngle(float NewOuterConeAngle); // Function Engine.SpotLight.SetOuterConeAngle
	void SetInnerConeAngle(float NewInnerConeAngle); // Function Engine.SpotLight.SetInnerConeAngle
}; 



// Class Engine.InterpTrackLinearColorProp
// Size: 0x98(Inherited: 0x90) 
struct UInterpTrackLinearColorProp : public UInterpTrackLinearColorBase
{
	struct FName PropertyName;  // 0x90(0x8)

}; 



// Class Engine.AudioComponent
// Size: 0x860(Inherited: 0x200) 
struct UAudioComponent : public USceneComponent
{
	struct USoundBase* Sound;  // 0x1F8(0x8)
	struct TArray<struct FAudioComponentParam> InstanceParameters;  // 0x200(0x10)
	struct USoundClass* SoundClassOverride;  // 0x210(0x8)
	char bAutoDestroy : 1;  // 0x218(0x1)
	char bStopWhenOwnerDestroyed : 1;  // 0x218(0x1)
	char bShouldRemainActiveIfDropped : 1;  // 0x218(0x1)
	char bAllowSpatialization : 1;  // 0x218(0x1)
	char bOverrideAttenuation : 1;  // 0x218(0x1)
	char bOverrideSubtitlePriority : 1;  // 0x218(0x1)
	char bIsUISound : 1;  // 0x218(0x1)
	char bEnableLowPassFilter : 1;  // 0x218(0x1)
	char bOverridePriority : 1;  // 0x219(0x1)
	char bSuppressSubtitles : 1;  // 0x219(0x1)
	char pad_545_1 : 2;  // 0x221(0x1)
	char bAutoManageAttachment : 1;  // 0x21A(0x1)
	struct FName AudioComponentUserID;  // 0x220(0x8)
	float PitchModulationMin;  // 0x228(0x4)
	float PitchModulationMax;  // 0x22C(0x4)
	float VolumeModulationMin;  // 0x230(0x4)
	float VolumeModulationMax;  // 0x234(0x4)
	float VolumeMultiplier;  // 0x238(0x4)
	int32_t EnvelopeFollowerAttackTime;  // 0x23C(0x4)
	int32_t EnvelopeFollowerReleaseTime;  // 0x240(0x4)
	float Priority;  // 0x244(0x4)
	float SubtitlePriority;  // 0x248(0x4)
	char pad_589_1 : 3;  // 0x24D(0x1)
	char pad_590[3];  // 0x24E(0x3)
	struct USoundEffectSourcePresetChain* SourceEffectChain;  // 0x250(0x8)
	float PitchMultiplier;  // 0x258(0x4)
	float LowPassFilterFrequency;  // 0x25C(0x4)
	char pad_608[8];  // 0x260(0x8)
	struct USoundAttenuation* AttenuationSettings;  // 0x268(0x8)
	struct FSoundAttenuationSettings AttenuationOverrides;  // 0x270(0x3A0)
	struct USoundConcurrency* ConcurrencySettings;  // 0x610(0x8)
	struct TSet<struct USoundConcurrency*> ConcurrencySet;  // 0x618(0x50)
	char pad_1640[12];  // 0x668(0xC)
	uint8_t  AutoAttachLocationRule;  // 0x674(0x1)
	uint8_t  AutoAttachRotationRule;  // 0x675(0x1)
	uint8_t  AutoAttachScaleRule;  // 0x676(0x1)
	char pad_1655[1];  // 0x677(0x1)
	struct FSoundModulationDefaultRoutingSettings ModulationRouting;  // 0x678(0x48)
	struct FMulticastInlineDelegate OnAudioPlayStateChanged;  // 0x6C0(0x10)
	char pad_1744[24];  // 0x6D0(0x18)
	struct FMulticastInlineDelegate OnAudioVirtualizationChanged;  // 0x6E8(0x10)
	char pad_1784[24];  // 0x6F8(0x18)
	struct FMulticastInlineDelegate OnAudioFinished;  // 0x710(0x10)
	char pad_1824[24];  // 0x720(0x18)
	struct FMulticastInlineDelegate OnAudioPlaybackPercent;  // 0x738(0x10)
	char pad_1864[24];  // 0x748(0x18)
	struct FMulticastInlineDelegate OnAudioSingleEnvelopeValue;  // 0x760(0x10)
	char pad_1904[24];  // 0x770(0x18)
	struct FMulticastInlineDelegate OnAudioMultiEnvelopeValue;  // 0x788(0x10)
	char pad_1944[24];  // 0x798(0x18)
	struct FDelegate OnQueueSubtitles;  // 0x7B0(0x10)
	struct TWeakObjectPtr<USceneComponent> AutoAttachParent;  // 0x7C0(0x8)
	struct FName AutoAttachSocketName;  // 0x7C8(0x8)
	char pad_2000[144];  // 0x7D0(0x90)

	void StopDelayed(float DelayTime); // Function Engine.AudioComponent.StopDelayed
	void Stop(); // Function Engine.AudioComponent.Stop
	void SetWaveParameter(struct FName InName, struct USoundWave* InWave); // Function Engine.AudioComponent.SetWaveParameter
	void SetVolumeMultiplier(float NewVolumeMultiplier); // Function Engine.AudioComponent.SetVolumeMultiplier
	void SetUISound(bool bInUISound); // Function Engine.AudioComponent.SetUISound
	void SetSubmixSend(struct USoundSubmixBase* Submix, float SendLevel); // Function Engine.AudioComponent.SetSubmixSend
	void SetSourceBusSendPreEffect(struct USoundSourceBus* SoundSourceBus, float SourceBusSendLevel); // Function Engine.AudioComponent.SetSourceBusSendPreEffect
	void SetSourceBusSendPostEffect(struct USoundSourceBus* SoundSourceBus, float SourceBusSendLevel); // Function Engine.AudioComponent.SetSourceBusSendPostEffect
	void SetSound(struct USoundBase* NewSound); // Function Engine.AudioComponent.SetSound
	void SetPitchMultiplier(float NewPitchMultiplier); // Function Engine.AudioComponent.SetPitchMultiplier
	void SetPaused(bool bPause); // Function Engine.AudioComponent.SetPaused
	void SetOutputToBusOnly(bool bInOutputToBusOnly); // Function Engine.AudioComponent.SetOutputToBusOnly
	void SetLowPassFilterFrequency(float InLowPassFilterFrequency); // Function Engine.AudioComponent.SetLowPassFilterFrequency
	void SetLowPassFilterEnabled(bool InLowPassFilterEnabled); // Function Engine.AudioComponent.SetLowPassFilterEnabled
	void SetIntParameter(struct FName InName, int32_t inInt); // Function Engine.AudioComponent.SetIntParameter
	void SetFloatParameter(struct FName InName, float InFloat); // Function Engine.AudioComponent.SetFloatParameter
	void SetBoolParameter(struct FName InName, bool InBool); // Function Engine.AudioComponent.SetBoolParameter
	void SetAudioBusSendPreEffect(struct UAudioBus* AudioBus, float AudioBusSendLevel); // Function Engine.AudioComponent.SetAudioBusSendPreEffect
	void SetAudioBusSendPostEffect(struct UAudioBus* AudioBus, float AudioBusSendLevel); // Function Engine.AudioComponent.SetAudioBusSendPostEffect
	void PlayQuantized(struct UObject* WorldContextObject, struct UQuartzClockHandle*& InClockHandle, struct FQuartzQuantizationBoundary& InQuantizationBoundary, struct FDelegate& InDelegate, float InStartTime, float InFadeInDuration, float InFadeVolumeLevel, uint8_t  InFadeCurve); // Function Engine.AudioComponent.PlayQuantized
	void Play(float StartTime); // Function Engine.AudioComponent.Play
	bool IsVirtualized(); // Function Engine.AudioComponent.IsVirtualized
	bool IsPlaying(); // Function Engine.AudioComponent.IsPlaying
	bool HasCookedFFTData(); // Function Engine.AudioComponent.HasCookedFFTData
	bool HasCookedAmplitudeEnvelopeData(); // Function Engine.AudioComponent.HasCookedAmplitudeEnvelopeData
	uint8_t  GetPlayState(); // Function Engine.AudioComponent.GetPlayState
	bool GetCookedFFTDataForAllPlayingSounds(struct TArray<struct FSoundWaveSpectralDataPerSound>& OutSoundWaveSpectralData); // Function Engine.AudioComponent.GetCookedFFTDataForAllPlayingSounds
	bool GetCookedFFTData(struct TArray<float>& FrequenciesToGet, struct TArray<struct FSoundWaveSpectralData>& OutSoundWaveSpectralData); // Function Engine.AudioComponent.GetCookedFFTData
	bool GetCookedEnvelopeDataForAllPlayingSounds(struct TArray<struct FSoundWaveEnvelopeDataPerSound>& OutEnvelopeData); // Function Engine.AudioComponent.GetCookedEnvelopeDataForAllPlayingSounds
	bool GetCookedEnvelopeData(float& OutEnvelopeData); // Function Engine.AudioComponent.GetCookedEnvelopeData
	void FadeOut(float FadeOutDuration, float FadeVolumeLevel, uint8_t  FadeCurve); // Function Engine.AudioComponent.FadeOut
	void FadeIn(float FadeInDuration, float FadeVolumeLevel, float StartTime, uint8_t  FadeCurve); // Function Engine.AudioComponent.FadeIn
	bool BP_GetAttenuationSettingsToApply(struct FSoundAttenuationSettings& OutAttenuationSettings); // Function Engine.AudioComponent.BP_GetAttenuationSettingsToApply
	void AdjustVolume(float AdjustVolumeDuration, float AdjustVolumeLevel, uint8_t  FadeCurve); // Function Engine.AudioComponent.AdjustVolume
	void AdjustAttenuation(struct FSoundAttenuationSettings& InAttenuationSettings); // Function Engine.AudioComponent.AdjustAttenuation
}; 



// Class Engine.BlueprintGeneratedClass
// Size: 0x328(Inherited: 0x230) 
struct UBlueprintGeneratedClass : public UClass
{
	int32_t NumReplicatedProperties;  // 0x230(0x4)
	char bHasNativizedParent : 1;  // 0x234(0x1)
	char bHasCookedComponentInstancingData : 1;  // 0x234(0x1)
	char pad_564_1 : 6;  // 0x234(0x1)
	char pad_565[4];  // 0x235(0x4)
	struct TArray<struct UDynamicBlueprintBinding*> DynamicBindingObjects;  // 0x238(0x10)
	struct TArray<struct UActorComponent*> ComponentTemplates;  // 0x248(0x10)
	struct TArray<struct UTimelineTemplate*> Timelines;  // 0x258(0x10)
	struct TArray<struct FBPComponentClassOverride> ComponentClassOverrides;  // 0x268(0x10)
	struct USimpleConstructionScript* SimpleConstructionScript;  // 0x278(0x8)
	struct UInheritableComponentHandler* InheritableComponentHandler;  // 0x280(0x8)
	struct UStructProperty* UberGraphFramePointerProperty;  // 0x288(0x8)
	char pad_656[8];  // 0x290(0x8)
	struct UFunction* UberGraphFunction;  // 0x298(0x8)
	struct TMap<struct FName, struct FBlueprintCookedComponentInstancingData> CookedComponentInstancingData;  // 0x2A0(0x50)
	char pad_752[56];  // 0x2F0(0x38)

}; 



// Class Engine.FXSystemComponent
// Size: 0x450(Inherited: 0x450) 
struct UFXSystemComponent : public UPrimitiveComponent
{

	void SetVectorParameter(struct FName ParameterName, struct FVector Param); // Function Engine.FXSystemComponent.SetVectorParameter
	void SetUseAutoManageAttachment(bool bAutoManage); // Function Engine.FXSystemComponent.SetUseAutoManageAttachment
	void SetIntParameter(struct FName ParameterName, int32_t Param); // Function Engine.FXSystemComponent.SetIntParameter
	void SetFloatParameter(struct FName ParameterName, float Param); // Function Engine.FXSystemComponent.SetFloatParameter
	void SetEmitterEnable(struct FName EmitterName, bool bNewEnableState); // Function Engine.FXSystemComponent.SetEmitterEnable
	void SetColorParameter(struct FName ParameterName, struct FLinearColor Param); // Function Engine.FXSystemComponent.SetColorParameter
	void SetBoolParameter(struct FName ParameterName, bool Param); // Function Engine.FXSystemComponent.SetBoolParameter
	void SetAutoAttachmentParameters(struct USceneComponent* Parent, struct FName SocketName, uint8_t  LocationRule, uint8_t  RotationRule, uint8_t  ScaleRule); // Function Engine.FXSystemComponent.SetAutoAttachmentParameters
	void SetActorParameter(struct FName ParameterName, struct AActor* Param); // Function Engine.FXSystemComponent.SetActorParameter
	void ReleaseToPool(); // Function Engine.FXSystemComponent.ReleaseToPool
	struct UFXSystemAsset* GetFXSystemAsset(); // Function Engine.FXSystemComponent.GetFXSystemAsset
}; 



// Class Engine.DPICustomScalingRule
// Size: 0x28(Inherited: 0x28) 
struct UDPICustomScalingRule : public UObject
{

}; 



// Class Engine.ParticleModuleEventReceiverSpawn
// Size: 0xD8(Inherited: 0x40) 
struct UParticleModuleEventReceiverSpawn : public UParticleModuleEventReceiverBase
{
	struct FRawDistributionFloat SpawnCount;  // 0x40(0x30)
	char bUseParticleTime : 1;  // 0x70(0x1)
	char bUsePSysLocation : 1;  // 0x70(0x1)
	char bInheritVelocity : 1;  // 0x70(0x1)
	char pad_112_1 : 5;  // 0x70(0x1)
	char pad_113[8];  // 0x71(0x8)
	struct FRawDistributionVector InheritVelocityScale;  // 0x78(0x48)
	struct TArray<struct UPhysicalMaterial*> PhysicalMaterials;  // 0xC0(0x10)
	char bBanPhysicalMaterials : 1;  // 0xD0(0x1)
	char pad_208_1 : 7;  // 0xD0(0x1)
	char pad_209[8];  // 0xD1(0x8)

}; 



// Class Engine.FXSystemAsset
// Size: 0x30(Inherited: 0x28) 
struct UFXSystemAsset : public UObject
{
	uint32_t MaxPoolSize;  // 0x28(0x4)
	uint32_t PoolPrimeSize;  // 0x2C(0x4)

}; 



// Class Engine.SoundEffectPreset
// Size: 0x68(Inherited: 0x28) 
struct USoundEffectPreset : public UObject
{
	char pad_40[64];  // 0x28(0x40)

}; 



// Class Engine.InterpTrackFloatParticleParam
// Size: 0x98(Inherited: 0x90) 
struct UInterpTrackFloatParticleParam : public UInterpTrackFloatBase
{
	struct FName ParamName;  // 0x90(0x8)

}; 



// Class Engine.LightmassCharacterIndirectDetailVolume
// Size: 0x258(Inherited: 0x258) 
struct ALightmassCharacterIndirectDetailVolume : public AVolume
{

}; 



// Class Engine.HLODProxy
// Size: 0x88(Inherited: 0x28) 
struct UHLODProxy : public UObject
{
	struct TArray<struct FHLODProxyMesh> ProxyMeshes;  // 0x28(0x10)
	struct TMap<struct UHLODProxyDesc*, struct FHLODProxyMesh> HLODActors;  // 0x38(0x50)

}; 



// Class Engine.MaterialExpressionShadowReplace
// Size: 0x68(Inherited: 0x40) 
struct UMaterialExpressionShadowReplace : public UMaterialExpression
{
	struct FExpressionInput Default;  // 0x40(0x14)
	struct FExpressionInput Shadow;  // 0x54(0x14)

}; 



// Class Engine.AnimNotifyState
// Size: 0x30(Inherited: 0x28) 
struct UAnimNotifyState : public UObject
{
	char pad_40[8];  // 0x28(0x8)

	bool Received_NotifyTick(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, float FrameDeltaTime); // Function Engine.AnimNotifyState.Received_NotifyTick
	bool Received_NotifyEnd(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Engine.AnimNotifyState.Received_NotifyEnd
	bool Received_NotifyBegin(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, float TotalDuration); // Function Engine.AnimNotifyState.Received_NotifyBegin
	struct FString GetNotifyName(); // Function Engine.AnimNotifyState.GetNotifyName
}; 



// Class Engine.NetConnection
// Size: 0x1BA8(Inherited: 0x48) 
struct UNetConnection : public UPlayer
{
	struct TArray<struct UChildConnection*> Children;  // 0x48(0x10)
	struct UNetDriver* Driver;  // 0x58(0x8)
	UPackageMap* PackageMapClass;  // 0x60(0x8)
	struct UPackageMap* PackageMap;  // 0x68(0x8)
	struct TArray<struct UChannel*> OpenChannels;  // 0x70(0x10)
	struct TArray<struct AActor*> SentTemporaries;  // 0x80(0x10)
	struct AActor* ViewTarget;  // 0x90(0x8)
	struct AActor* OwningActor;  // 0x98(0x8)
	int32_t MaxPacket;  // 0xA0(0x4)
	char InternalAck : 1;  // 0xA4(0x1)
	char pad_164_1 : 7;  // 0xA4(0x1)
	char pad_165[188];  // 0xA5(0xBC)
	struct FUniqueNetIdRepl PlayerId;  // 0x160(0x28)
	char pad_392[72];  // 0x188(0x48)
	double LastReceiveTime;  // 0x1D0(0x8)
	char pad_472[4920];  // 0x1D8(0x1338)
	struct TArray<struct UChannel*> ChannelsToTick;  // 0x1510(0x10)
	char pad_5408[1672];  // 0x1520(0x688)

}; 



// Class Engine.SoundEffectSourcePresetChain
// Size: 0x40(Inherited: 0x28) 
struct USoundEffectSourcePresetChain : public UObject
{
	struct TArray<struct FSourceEffectChainEntry> Chain;  // 0x28(0x10)
	char bPlayEffectChainTails : 1;  // 0x38(0x1)
	char pad_56_1 : 7;  // 0x38(0x1)
	char pad_57[8];  // 0x39(0x8)

}; 



// Class Engine.DirectionalLight
// Size: 0x230(Inherited: 0x230) 
struct ADirectionalLight : public ALight
{

}; 



// Class Engine.MaterialExpressionTextureSampleParameter2D
// Size: 0x80(Inherited: 0x80) 
struct UMaterialExpressionTextureSampleParameter2D : public UMaterialExpressionTextureSampleParameter
{

}; 



// Class Engine.NetDriver
// Size: 0x770(Inherited: 0x28) 
struct UNetDriver : public UObject
{
	char pad_40[8];  // 0x28(0x8)
	struct FString NetConnectionClassName;  // 0x30(0x10)
	struct FString ReplicationDriverClassName;  // 0x40(0x10)
	int32_t MaxDownloadSize;  // 0x50(0x4)
	char bClampListenServerTickRate : 1;  // 0x54(0x1)
	char pad_84_1 : 7;  // 0x54(0x1)
	char pad_85[4];  // 0x55(0x4)
	int32_t bClampBandwithDeltaTime;  // 0x58(0x4)
	float MinBandwithDeltaTime;  // 0x5C(0x4)
	float DeltaBitsMultiplier;  // 0x60(0x4)
	int32_t NetServerMaxTickRate;  // 0x64(0x4)
	int32_t MaxNetTickRate;  // 0x68(0x4)
	int32_t MaxInternetClientRate;  // 0x6C(0x4)
	int32_t MaxClientRate;  // 0x70(0x4)
	float ServerTravelPause;  // 0x74(0x4)
	float SpawnPrioritySeconds;  // 0x78(0x4)
	float RelevantTimeout;  // 0x7C(0x4)
	float KeepAliveTime;  // 0x80(0x4)
	float InitialConnectTimeout;  // 0x84(0x4)
	float ConnectionTimeout;  // 0x88(0x4)
	float TimeoutMultiplierForUnoptimizedBuilds;  // 0x8C(0x4)
	char pad_144_1 : 7;  // 0x90(0x1)
	bool bNoTimeouts : 1;  // 0x90(0x1)
	char pad_145_1 : 7;  // 0x91(0x1)
	bool bNeverApplyNetworkEmulationSettings : 1;  // 0x91(0x1)
	char pad_146[6];  // 0x92(0x6)
	struct UNetConnection* ServerConnection;  // 0x98(0x8)
	struct TArray<struct UNetConnection*> ClientConnections;  // 0xA0(0x10)
	char pad_176[96];  // 0xB0(0x60)
	int32_t RecentlyDisconnectedTrackingTime;  // 0x110(0x4)
	char pad_276[60];  // 0x114(0x3C)
	struct UWorld* World;  // 0x150(0x8)
	struct UPackage* WorldPackage;  // 0x158(0x8)
	char pad_352[32];  // 0x160(0x20)
	UObject* NetConnectionClass;  // 0x180(0x8)
	UObject* ReplicationDriverClass;  // 0x188(0x8)
	char pad_400[16];  // 0x190(0x10)
	struct FName NetDriverName;  // 0x1A0(0x8)
	struct TArray<struct FChannelDefinition> ChannelDefinitions;  // 0x1A8(0x10)
	struct TMap<struct FName, struct FChannelDefinition> ChannelDefinitionMap;  // 0x1B8(0x50)
	struct TArray<struct UChannel*> ActorChannelPool;  // 0x208(0x10)
	char pad_536[8];  // 0x218(0x8)
	float Time;  // 0x220(0x4)
	char pad_548[1260];  // 0x224(0x4EC)
	struct UReplicationDriver* ReplicationDriver;  // 0x710(0x8)
	char pad_1816[88];  // 0x718(0x58)

}; 



// Class Engine.InputSettings
// Size: 0x140(Inherited: 0x28) 
struct UInputSettings : public UObject
{
	struct TArray<struct FInputAxisConfigEntry> AxisConfig;  // 0x28(0x10)
	char bAltEnterTogglesFullscreen : 1;  // 0x38(0x1)
	char bF11TogglesFullscreen : 1;  // 0x38(0x1)
	char bUseMouseForTouch : 1;  // 0x38(0x1)
	char bEnableMouseSmoothing : 1;  // 0x38(0x1)
	char bEnableFOVScaling : 1;  // 0x38(0x1)
	char bCaptureMouseOnLaunch : 1;  // 0x38(0x1)
	char bDefaultViewportMouseLock : 1;  // 0x38(0x1)
	char bAlwaysShowTouchInterface : 1;  // 0x38(0x1)
	char bShowConsoleOnFourFingerTap : 1;  // 0x39(0x1)
	char bEnableGestureRecognizer : 1;  // 0x39(0x1)
	char pad_57_1 : 6;  // 0x39(0x1)
	char pad_58_1 : 7;  // 0x3A(0x1)
	bool bUseAutocorrect : 1;  // 0x3A(0x1)
	char pad_59[5];  // 0x3B(0x5)
	struct TArray<struct FString> ExcludedAutocorrectOS;  // 0x40(0x10)
	struct TArray<struct FString> ExcludedAutocorrectCultures;  // 0x50(0x10)
	struct TArray<struct FString> ExcludedAutocorrectDeviceModels;  // 0x60(0x10)
	uint8_t  DefaultViewportMouseCaptureMode;  // 0x70(0x1)
	uint8_t  DefaultViewportMouseLockMode;  // 0x71(0x1)
	char pad_114[2];  // 0x72(0x2)
	float FOVScale;  // 0x74(0x4)
	float DoubleClickTime;  // 0x78(0x4)
	char pad_124[4];  // 0x7C(0x4)
	struct TArray<struct FInputActionKeyMapping> ActionMappings;  // 0x80(0x10)
	struct TArray<struct FInputAxisKeyMapping> AxisMappings;  // 0x90(0x10)
	struct TArray<struct FInputActionSpeechMapping> SpeechMappings;  // 0xA0(0x10)
	struct TSoftClassPtr<UObject> DefaultPlayerInputClass;  // 0xB0(0x28)
	struct TSoftClassPtr<UObject> DefaultInputComponentClass;  // 0xD8(0x28)
	struct FSoftObjectPath DefaultTouchInterface;  // 0x100(0x18)
	struct FKey ConsoleKey;  // 0x118(0x18)
	struct TArray<struct FKey> ConsoleKeys;  // 0x130(0x10)

	void SaveKeyMappings(); // Function Engine.InputSettings.SaveKeyMappings
	void RemoveAxisMapping(struct FInputAxisKeyMapping& KeyMapping, bool bForceRebuildKeymaps); // Function Engine.InputSettings.RemoveAxisMapping
	void RemoveActionMapping(struct FInputActionKeyMapping& KeyMapping, bool bForceRebuildKeymaps); // Function Engine.InputSettings.RemoveActionMapping
	struct UInputSettings* GetInputSettings(); // Function Engine.InputSettings.GetInputSettings
	void GetAxisNames(struct TArray<struct FName>& AxisNames); // Function Engine.InputSettings.GetAxisNames
	void GetAxisMappingByName(struct FName InAxisName, struct TArray<struct FInputAxisKeyMapping>& OutMappings); // Function Engine.InputSettings.GetAxisMappingByName
	void GetActionNames(struct TArray<struct FName>& ActionNames); // Function Engine.InputSettings.GetActionNames
	void GetActionMappingByName(struct FName InActionName, struct TArray<struct FInputActionKeyMapping>& OutMappings); // Function Engine.InputSettings.GetActionMappingByName
	void ForceRebuildKeymaps(); // Function Engine.InputSettings.ForceRebuildKeymaps
	void AddAxisMapping(struct FInputAxisKeyMapping& KeyMapping, bool bForceRebuildKeymaps); // Function Engine.InputSettings.AddAxisMapping
	void AddActionMapping(struct FInputActionKeyMapping& KeyMapping, bool bForceRebuildKeymaps); // Function Engine.InputSettings.AddActionMapping
}; 



// Class Engine.ExponentialHeightFog
// Size: 0x230(Inherited: 0x220) 
struct AExponentialHeightFog : public AInfo
{
	struct UExponentialHeightFogComponent* Component;  // 0x220(0x8)
	char bEnabled : 1;  // 0x228(0x1)
	char pad_552_1 : 7;  // 0x228(0x1)
	char pad_553[8];  // 0x229(0x8)

	void OnRep_bEnabled(); // Function Engine.ExponentialHeightFog.OnRep_bEnabled
}; 



// Class Engine.BlueprintAsyncActionBase
// Size: 0x30(Inherited: 0x28) 
struct UBlueprintAsyncActionBase : public UObject
{
	char pad_40[8];  // 0x28(0x8)

	void Activate(); // Function Engine.BlueprintAsyncActionBase.Activate
}; 



// Class Engine.SoundWave
// Size: 0x370(Inherited: 0x170) 
struct USoundWave : public USoundBase
{
	int32_t CompressionQuality;  // 0x170(0x4)
	int32_t StreamingPriority;  // 0x174(0x4)
	uint8_t  SampleRateQuality;  // 0x178(0x1)
	char pad_377[1];  // 0x179(0x1)
	char ESoundGroup SoundGroup;  // 0x17A(0x1)
	char bLooping : 1;  // 0x17B(0x1)
	char bStreaming : 1;  // 0x17B(0x1)
	char bSeekableStreaming : 1;  // 0x17B(0x1)
	char pad_379_1 : 5;  // 0x17B(0x1)
	uint8_t  LoadingBehavior;  // 0x17C(0x1)
	char pad_381_1 : 6;  // 0x17D(0x1)
	char bMature : 1;  // 0x17D(0x1)
	char bManualWordWrap : 1;  // 0x17D(0x1)
	char bSingleLine : 1;  // 0x17E(0x1)
	char bIsAmbisonics : 1;  // 0x17E(0x1)
	char pad_382_1 : 6;  // 0x17E(0x1)
	char pad_383[2];  // 0x17F(0x2)
	struct FSoundModulationDefaultRoutingSettings ModulationSettings;  // 0x180(0x48)
	struct TArray<float> FrequenciesToAnalyze;  // 0x1C8(0x10)
	struct TArray<struct FSoundWaveSpectralTimeData> CookedSpectralTimeData;  // 0x1D8(0x10)
	struct TArray<struct FSoundWaveEnvelopeTimeData> CookedEnvelopeTimeData;  // 0x1E8(0x10)
	int32_t InitialChunkSize;  // 0x1F8(0x4)
	char pad_508[68];  // 0x1FC(0x44)
	struct FString SpokenText;  // 0x240(0x10)
	float SubtitlePriority;  // 0x250(0x4)
	float Volume;  // 0x254(0x4)
	float Pitch;  // 0x258(0x4)
	int32_t NumChannels;  // 0x25C(0x4)
	int32_t SampleRate;  // 0x260(0x4)
	char pad_612[12];  // 0x264(0xC)
	struct TArray<struct FSubtitleCue> Subtitles;  // 0x270(0x10)
	struct UCurveTable* Curves;  // 0x280(0x8)
	struct UCurveTable* InternalCurves;  // 0x288(0x8)
	char pad_656[224];  // 0x290(0xE0)

}; 



// Class Engine.OnlineSession
// Size: 0x28(Inherited: 0x28) 
struct UOnlineSession : public UObject
{

}; 



// Class Engine.BoneReferenceSkeletonProvider
// Size: 0x28(Inherited: 0x28) 
struct UBoneReferenceSkeletonProvider : public UInterface
{

}; 



// Class Engine.MaterialExpressionTextureBase
// Size: 0x48(Inherited: 0x40) 
struct UMaterialExpressionTextureBase : public UMaterialExpression
{
	struct UTexture* Texture;  // 0x40(0x8)

}; 



// Class Engine.AnimNotify_PauseClothingSimulation
// Size: 0x38(Inherited: 0x38) 
struct UAnimNotify_PauseClothingSimulation : public UAnimNotify
{

}; 



// Class Engine.AssetUserData
// Size: 0x28(Inherited: 0x28) 
struct UAssetUserData : public UObject
{

}; 



// Class Engine.SoundBase
// Size: 0x170(Inherited: 0x28) 
struct USoundBase : public UObject
{
	char pad_40[8];  // 0x28(0x8)
	struct USoundClass* SoundClassObject;  // 0x30(0x8)
	char bDebug : 1;  // 0x38(0x1)
	char bOverrideConcurrency : 1;  // 0x38(0x1)
	char bEnableBusSends : 1;  // 0x38(0x1)
	char bEnableBaseSubmix : 1;  // 0x38(0x1)
	char bEnableSubmixSends : 1;  // 0x38(0x1)
	char bHasDelayNode : 1;  // 0x38(0x1)
	char bHasConcatenatorNode : 1;  // 0x38(0x1)
	char bBypassVolumeScaleForPriority : 1;  // 0x38(0x1)
	uint8_t  VirtualizationMode;  // 0x39(0x1)
	char pad_58[86];  // 0x3A(0x56)
	struct TSet<struct USoundConcurrency*> ConcurrencySet;  // 0x90(0x50)
	struct FSoundConcurrencySettings ConcurrencyOverrides;  // 0xE0(0x28)
	float Duration;  // 0x108(0x4)
	float MaxDistance;  // 0x10C(0x4)
	float TotalSamples;  // 0x110(0x4)
	float Priority;  // 0x114(0x4)
	struct USoundAttenuation* AttenuationSettings;  // 0x118(0x8)
	struct USoundSubmixBase* SoundSubmixObject;  // 0x120(0x8)
	struct TArray<struct FSoundSubmixSendInfo> SoundSubmixSends;  // 0x128(0x10)
	struct USoundEffectSourcePresetChain* SourceEffectChain;  // 0x138(0x8)
	struct TArray<struct FSoundSourceBusSendInfo> BusSends;  // 0x140(0x10)
	struct TArray<struct FSoundSourceBusSendInfo> PreEffectBusSends;  // 0x150(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData;  // 0x160(0x10)

}; 



// Class Engine.GameInstance
// Size: 0x1A8(Inherited: 0x28) 
struct UGameInstance : public UObject
{
	char pad_40[16];  // 0x28(0x10)
	struct TArray<struct ULocalPlayer*> LocalPlayers;  // 0x38(0x10)
	struct UOnlineSession* OnlineSession;  // 0x48(0x8)
	struct TArray<struct UObject*> ReferencedObjects;  // 0x50(0x10)
	char pad_96[24];  // 0x60(0x18)
	struct FMulticastInlineDelegate OnPawnControllerChangedDelegates;  // 0x78(0x10)
	char pad_136[288];  // 0x88(0x120)

	void ReceiveShutdown(); // Function Engine.GameInstance.ReceiveShutdown
	void ReceiveInit(); // Function Engine.GameInstance.ReceiveInit
	void HandleTravelError(char ETravelFailure FailureType); // Function Engine.GameInstance.HandleTravelError
	void HandleNetworkError(char ENetworkFailure FailureType, bool bIsServer); // Function Engine.GameInstance.HandleNetworkError
	void DebugRemovePlayer(int32_t ControllerId); // Function Engine.GameInstance.DebugRemovePlayer
	void DebugCreatePlayer(int32_t ControllerId); // Function Engine.GameInstance.DebugCreatePlayer
}; 



// Class Engine.CurveTable
// Size: 0xA0(Inherited: 0x28) 
struct UCurveTable : public UObject
{
	char pad_40[120];  // 0x28(0x78)

}; 



// Class Engine.PlatformInterfaceWebResponse
// Size: 0xB0(Inherited: 0x28) 
struct UPlatformInterfaceWebResponse : public UObject
{
	struct FString OriginalURL;  // 0x28(0x10)
	int32_t ResponseCode;  // 0x38(0x4)
	int32_t Tag;  // 0x3C(0x4)
	struct FString StringResponse;  // 0x40(0x10)
	struct TArray<char> BinaryResponse;  // 0x50(0x10)
	char pad_96[80];  // 0x60(0x50)

	int32_t GetNumHeaders(); // Function Engine.PlatformInterfaceWebResponse.GetNumHeaders
	struct FString GetHeaderValue(struct FString HeaderName); // Function Engine.PlatformInterfaceWebResponse.GetHeaderValue
	void GetHeader(int32_t HeaderIndex, struct FString& Header, struct FString& Value); // Function Engine.PlatformInterfaceWebResponse.GetHeader
}; 



// Class Engine.Channel
// Size: 0x68(Inherited: 0x28) 
struct UChannel : public UObject
{
	struct UNetConnection* Connection;  // 0x28(0x8)
	char pad_48[56];  // 0x30(0x38)

}; 



// Class Engine.ExponentialHeightFogComponent
// Size: 0x2A0(Inherited: 0x200) 
struct UExponentialHeightFogComponent : public USceneComponent
{
	float FogDensity;  // 0x1F8(0x4)
	float FogHeightFalloff;  // 0x1FC(0x4)
	struct FExponentialHeightFogData SecondFogData;  // 0x200(0xC)
	struct FLinearColor FogInscatteringColor;  // 0x20C(0x10)
	struct UTextureCube* InscatteringColorCubemap;  // 0x220(0x8)
	float InscatteringColorCubemapAngle;  // 0x228(0x4)
	struct FLinearColor InscatteringTextureTint;  // 0x22C(0x10)
	float FullyDirectionalInscatteringColorDistance;  // 0x23C(0x4)
	float NonDirectionalInscatteringColorDistance;  // 0x240(0x4)
	float DirectionalInscatteringExponent;  // 0x244(0x4)
	float DirectionalInscatteringStartDistance;  // 0x248(0x4)
	struct FLinearColor DirectionalInscatteringColor;  // 0x24C(0x10)
	float FogMaxOpacity;  // 0x25C(0x4)
	float StartDistance;  // 0x260(0x4)
	float FogCutoffDistance;  // 0x264(0x4)
	char pad_620_1 : 7;  // 0x26C(0x1)
	bool bEnableVolumetricFog : 1;  // 0x268(0x1)
	float VolumetricFogScatteringDistribution;  // 0x26C(0x4)
	struct FColor VolumetricFogAlbedo;  // 0x270(0x4)
	struct FLinearColor VolumetricFogEmissive;  // 0x274(0x10)
	float VolumetricFogExtinctionScale;  // 0x284(0x4)
	float VolumetricFogDistance;  // 0x288(0x4)
	float VolumetricFogStaticLightingScatteringIntensity;  // 0x28C(0x4)
	char pad_657_1 : 7;  // 0x291(0x1)
	bool bOverrideLightColorsWithFogInscatteringColors : 1;  // 0x290(0x1)
	char pad_658[14];  // 0x292(0xE)

	void SetVolumetricFogScatteringDistribution(float NewValue); // Function Engine.ExponentialHeightFogComponent.SetVolumetricFogScatteringDistribution
	void SetVolumetricFogExtinctionScale(float NewValue); // Function Engine.ExponentialHeightFogComponent.SetVolumetricFogExtinctionScale
	void SetVolumetricFogEmissive(struct FLinearColor NewValue); // Function Engine.ExponentialHeightFogComponent.SetVolumetricFogEmissive
	void SetVolumetricFogDistance(float NewValue); // Function Engine.ExponentialHeightFogComponent.SetVolumetricFogDistance
	void SetVolumetricFogAlbedo(struct FColor NewValue); // Function Engine.ExponentialHeightFogComponent.SetVolumetricFogAlbedo
	void SetVolumetricFog(bool bNewValue); // Function Engine.ExponentialHeightFogComponent.SetVolumetricFog
	void SetStartDistance(float Value); // Function Engine.ExponentialHeightFogComponent.SetStartDistance
	void SetNonDirectionalInscatteringColorDistance(float Value); // Function Engine.ExponentialHeightFogComponent.SetNonDirectionalInscatteringColorDistance
	void SetInscatteringTextureTint(struct FLinearColor Value); // Function Engine.ExponentialHeightFogComponent.SetInscatteringTextureTint
	void SetInscatteringColorCubemapAngle(float Value); // Function Engine.ExponentialHeightFogComponent.SetInscatteringColorCubemapAngle
	void SetInscatteringColorCubemap(struct UTextureCube* Value); // Function Engine.ExponentialHeightFogComponent.SetInscatteringColorCubemap
	void SetFullyDirectionalInscatteringColorDistance(float Value); // Function Engine.ExponentialHeightFogComponent.SetFullyDirectionalInscatteringColorDistance
	void SetFogMaxOpacity(float Value); // Function Engine.ExponentialHeightFogComponent.SetFogMaxOpacity
	void SetFogInscatteringColor(struct FLinearColor Value); // Function Engine.ExponentialHeightFogComponent.SetFogInscatteringColor
	void SetFogHeightFalloff(float Value); // Function Engine.ExponentialHeightFogComponent.SetFogHeightFalloff
	void SetFogDensity(float Value); // Function Engine.ExponentialHeightFogComponent.SetFogDensity
	void SetFogCutoffDistance(float Value); // Function Engine.ExponentialHeightFogComponent.SetFogCutoffDistance
	void SetDirectionalInscatteringStartDistance(float Value); // Function Engine.ExponentialHeightFogComponent.SetDirectionalInscatteringStartDistance
	void SetDirectionalInscatteringExponent(float Value); // Function Engine.ExponentialHeightFogComponent.SetDirectionalInscatteringExponent
	void SetDirectionalInscatteringColor(struct FLinearColor Value); // Function Engine.ExponentialHeightFogComponent.SetDirectionalInscatteringColor
}; 



// Class Engine.Subsystem
// Size: 0x30(Inherited: 0x28) 
struct USubsystem : public UObject
{
	char pad_40[8];  // 0x28(0x8)

}; 



// Class Engine.MaterialExpressionTextureSample
// Size: 0x60(Inherited: 0x48) 
struct UMaterialExpressionTextureSample : public UMaterialExpressionTextureBase
{
	struct FExpressionInput Coordinates;  // 0x48(0x14)
	char pad_92[4];  // 0x5C(0x4)

}; 



// Class Engine.InterpTrackMoveAxis
// Size: 0xA8(Inherited: 0x90) 
struct UInterpTrackMoveAxis : public UInterpTrackFloatBase
{
	char EInterpMoveAxis MoveAxis;  // 0x90(0x1)
	char pad_145[7];  // 0x91(0x7)
	struct FInterpLookupTrack LookupTrack;  // 0x98(0x10)

}; 



// Class Engine.GameInstanceSubsystem
// Size: 0x30(Inherited: 0x30) 
struct UGameInstanceSubsystem : public USubsystem
{

}; 



// Class Engine.TextureRenderTargetCube
// Size: 0x1A0(Inherited: 0x180) 
struct UTextureRenderTargetCube : public UTextureRenderTarget
{
	int32_t SizeX;  // 0x180(0x4)
	struct FLinearColor ClearColor;  // 0x184(0x10)
	char EPixelFormat OverrideFormat;  // 0x194(0x1)
	char bHDR : 1;  // 0x195(0x1)
	char bForceLinearGamma : 1;  // 0x195(0x1)
	char pad_405_1 : 6;  // 0x195(0x1)
	char pad_406[11];  // 0x196(0xB)

}; 



// Class Engine.EdGraphNode_Documentation
// Size: 0xB8(Inherited: 0x98) 
struct UEdGraphNode_Documentation : public UEdGraphNode
{
	struct FString Link;  // 0x98(0x10)
	struct FString Excerpt;  // 0xA8(0x10)

}; 



// Class Engine.Info
// Size: 0x220(Inherited: 0x220) 
struct AInfo : public AActor
{

}; 



// Class Engine.Light
// Size: 0x230(Inherited: 0x220) 
struct ALight : public AActor
{
	struct ULightComponent* LightComponent;  // 0x220(0x8)
	char bEnabled : 1;  // 0x228(0x1)
	char pad_552_1 : 7;  // 0x228(0x1)
	char pad_553[8];  // 0x229(0x8)

	void ToggleEnabled(); // Function Engine.Light.ToggleEnabled
	void SetLightFunctionScale(struct FVector NewLightFunctionScale); // Function Engine.Light.SetLightFunctionScale
	void SetLightFunctionMaterial(struct UMaterialInterface* NewLightFunctionMaterial); // Function Engine.Light.SetLightFunctionMaterial
	void SetLightFunctionFadeDistance(float NewLightFunctionFadeDistance); // Function Engine.Light.SetLightFunctionFadeDistance
	void SetLightColor(struct FLinearColor NewLightColor); // Function Engine.Light.SetLightColor
	void SetEnabled(bool bSetEnabled); // Function Engine.Light.SetEnabled
	void SetCastShadows(bool bNewValue); // Function Engine.Light.SetCastShadows
	void SetBrightness(float NewBrightness); // Function Engine.Light.SetBrightness
	void SetAffectTranslucentLighting(bool bNewValue); // Function Engine.Light.SetAffectTranslucentLighting
	void OnRep_bEnabled(); // Function Engine.Light.OnRep_bEnabled
	bool IsEnabled(); // Function Engine.Light.IsEnabled
	struct FLinearColor GetLightColor(); // Function Engine.Light.GetLightColor
	float GetBrightness(); // Function Engine.Light.GetBrightness
}; 



// Class Engine.Controller
// Size: 0x298(Inherited: 0x220) 
struct AController : public AActor
{
	char pad_544[8];  // 0x220(0x8)
	struct APlayerState* PlayerState;  // 0x228(0x8)
	char pad_560[8];  // 0x230(0x8)
	struct FMulticastInlineDelegate OnInstigatedAnyDamage;  // 0x238(0x10)
	struct FName StateName;  // 0x248(0x8)
	struct APawn* Pawn;  // 0x250(0x8)
	char pad_600[8];  // 0x258(0x8)
	struct ACharacter* Character;  // 0x260(0x8)
	struct USceneComponent* TransformComponent;  // 0x268(0x8)
	char pad_624[24];  // 0x270(0x18)
	struct FRotator ControlRotation;  // 0x288(0xC)
	char bAttachToPawn : 1;  // 0x294(0x1)
	char pad_660_1 : 7;  // 0x294(0x1)
	char pad_661[4];  // 0x295(0x4)

	void UnPossess(); // Function Engine.Controller.UnPossess
	void StopMovement(); // Function Engine.Controller.StopMovement
	void SetInitialLocationAndRotation(struct FVector& NewLocation, struct FRotator& NewRotation); // Function Engine.Controller.SetInitialLocationAndRotation
	void SetIgnoreMoveInput(bool bNewMoveInput); // Function Engine.Controller.SetIgnoreMoveInput
	void SetIgnoreLookInput(bool bNewLookInput); // Function Engine.Controller.SetIgnoreLookInput
	void SetControlRotation(struct FRotator& NewRotation); // Function Engine.Controller.SetControlRotation
	void ResetIgnoreMoveInput(); // Function Engine.Controller.ResetIgnoreMoveInput
	void ResetIgnoreLookInput(); // Function Engine.Controller.ResetIgnoreLookInput
	void ResetIgnoreInputFlags(); // Function Engine.Controller.ResetIgnoreInputFlags
	void ReceiveUnPossess(struct APawn* UnpossessedPawn); // Function Engine.Controller.ReceiveUnPossess
	void ReceivePossess(struct APawn* PossessedPawn); // Function Engine.Controller.ReceivePossess
	void ReceiveInstigatedAnyDamage(float Damage, struct UDamageType* DamageType, struct AActor* DamagedActor, struct AActor* DamageCauser); // Function Engine.Controller.ReceiveInstigatedAnyDamage
	void Possess(struct APawn* InPawn); // Function Engine.Controller.Possess
	void OnRep_PlayerState(); // Function Engine.Controller.OnRep_PlayerState
	void OnRep_Pawn(); // Function Engine.Controller.OnRep_Pawn
	bool LineOfSightTo(struct AActor* Other, struct FVector ViewPoint, bool bAlternateChecks); // Function Engine.Controller.LineOfSightTo
	struct APawn* K2_GetPawn(); // Function Engine.Controller.K2_GetPawn
	bool IsPlayerController(); // Function Engine.Controller.IsPlayerController
	bool IsMoveInputIgnored(); // Function Engine.Controller.IsMoveInputIgnored
	bool IsLookInputIgnored(); // Function Engine.Controller.IsLookInputIgnored
	bool IsLocalPlayerController(); // Function Engine.Controller.IsLocalPlayerController
	bool IsLocalController(); // Function Engine.Controller.IsLocalController
	struct AActor* GetViewTarget(); // Function Engine.Controller.GetViewTarget
	struct FRotator GetDesiredRotation(); // Function Engine.Controller.GetDesiredRotation
	struct FRotator GetControlRotation(); // Function Engine.Controller.GetControlRotation
	void ClientSetRotation(struct FRotator NewRotation, bool bResetCamera); // Function Engine.Controller.ClientSetRotation
	void ClientSetLocation(struct FVector NewLocation, struct FRotator NewRotation); // Function Engine.Controller.ClientSetLocation
	struct APlayerController* CastToPlayerController(); // Function Engine.Controller.CastToPlayerController
}; 



// Class Engine.Distribution
// Size: 0x30(Inherited: 0x28) 
struct UDistribution : public UObject
{
	char pad_40[8];  // 0x28(0x8)

}; 



// Class Engine.ParticleModuleVectorFieldScale
// Size: 0x68(Inherited: 0x30) 
struct UParticleModuleVectorFieldScale : public UParticleModuleVectorFieldBase
{
	struct UDistributionFloat* VectorFieldScale;  // 0x30(0x8)
	struct FRawDistributionFloat VectorFieldScaleRaw;  // 0x38(0x30)

}; 



// Class Engine.ParticleModuleAcceleration
// Size: 0x88(Inherited: 0x38) 
struct UParticleModuleAcceleration : public UParticleModuleAccelerationBase
{
	struct FRawDistributionVector Acceleration;  // 0x38(0x48)
	char bApplyOwnerScale : 1;  // 0x80(0x1)
	char pad_128_1 : 7;  // 0x80(0x1)
	char pad_129[8];  // 0x81(0x8)

}; 



// Class Engine.Brush
// Size: 0x258(Inherited: 0x220) 
struct ABrush : public AActor
{
	char EBrushType BrushType;  // 0x220(0x1)
	char pad_545[3];  // 0x221(0x3)
	struct FColor BrushColor;  // 0x224(0x4)
	int32_t PolyFlags;  // 0x228(0x4)
	char bColored : 1;  // 0x22C(0x1)
	char bSolidWhenSelected : 1;  // 0x22C(0x1)
	char bPlaceableFromClassBrowser : 1;  // 0x22C(0x1)
	char bNotForClientOrServer : 1;  // 0x22C(0x1)
	char pad_556_1 : 4;  // 0x22C(0x1)
	char pad_557[4];  // 0x22D(0x4)
	struct UModel* Brush;  // 0x230(0x8)
	struct UBrushComponent* BrushComponent;  // 0x238(0x8)
	char bInManipulation : 1;  // 0x240(0x1)
	char pad_576_1 : 7;  // 0x240(0x1)
	char pad_577[8];  // 0x241(0x8)
	struct TArray<struct FGeomSelection> SavedSelections;  // 0x248(0x10)

}; 



// Class Engine.MaterialExpressionConstant4Vector
// Size: 0x50(Inherited: 0x40) 
struct UMaterialExpressionConstant4Vector : public UMaterialExpression
{
	struct FLinearColor Constant;  // 0x40(0x10)

}; 



// Class Engine.Volume
// Size: 0x258(Inherited: 0x258) 
struct AVolume : public ABrush
{

}; 



// Class Engine.DialogueWave
// Size: 0x70(Inherited: 0x28) 
struct UDialogueWave : public UObject
{
	char bMature : 1;  // 0x28(0x1)
	char bOverride_SubtitleOverride : 1;  // 0x28(0x1)
	char pad_40_1 : 6;  // 0x28(0x1)
	char pad_41[8];  // 0x29(0x8)
	struct FString SpokenText;  // 0x30(0x10)
	struct FString SubtitleOverride;  // 0x40(0x10)
	struct TArray<struct FDialogueContextMapping> ContextMappings;  // 0x50(0x10)
	struct FGuid LocalizationGUID;  // 0x60(0x10)

}; 



// Class Engine.ParticleModuleTrailBase
// Size: 0x30(Inherited: 0x30) 
struct UParticleModuleTrailBase : public UParticleModule
{

}; 



// Class Engine.Character
// Size: 0x4D0(Inherited: 0x280) 
struct ACharacter : public APawn
{
	struct USkeletalMeshComponent* Mesh;  // 0x280(0x8)
	struct UCharacterMovementComponent* CharacterMovement;  // 0x288(0x8)
	struct UCapsuleComponent* CapsuleComponent;  // 0x290(0x8)
	struct FBasedMovementInfo BasedMovement;  // 0x298(0x30)
	struct FBasedMovementInfo ReplicatedBasedMovement;  // 0x2C8(0x30)
	float AnimRootMotionTranslationScale;  // 0x2F8(0x4)
	struct FVector BaseTranslationOffset;  // 0x2FC(0xC)
	char pad_776[8];  // 0x308(0x8)
	struct FQuat BaseRotationOffset;  // 0x310(0x10)
	float ReplicatedServerLastTransformUpdateTimeStamp;  // 0x320(0x4)
	float ReplayLastTransformUpdateTimeStamp;  // 0x324(0x4)
	char ReplicatedMovementMode;  // 0x328(0x1)
	char pad_809_1 : 7;  // 0x329(0x1)
	bool bInBaseReplication : 1;  // 0x329(0x1)
	char pad_810[2];  // 0x32A(0x2)
	float CrouchedEyeHeight;  // 0x32C(0x4)
	char bIsCrouched : 1;  // 0x330(0x1)
	char pad_816_1 : 7;  // 0x330(0x1)
	char pad_817[4];  // 0x331(0x4)
	uint32_t ReplicatedCrouchedStateAndCapsuleHalfHeight;  // 0x334(0x4)
	char bProxyIsJumpForceApplied : 1;  // 0x338(0x1)
	char bPressedJump : 1;  // 0x338(0x1)
	char bClientUpdating : 1;  // 0x338(0x1)
	char bClientWasFalling : 1;  // 0x338(0x1)
	char bClientResimulateRootMotion : 1;  // 0x338(0x1)
	char bClientResimulateRootMotionSources : 1;  // 0x338(0x1)
	char bSimGravityDisabled : 1;  // 0x338(0x1)
	char bClientCheckEncroachmentOnNetUpdate : 1;  // 0x338(0x1)
	char bServerMoveIgnoreRootMotion : 1;  // 0x339(0x1)
	char bWasJumping : 1;  // 0x339(0x1)
	char pad_825_1 : 6;  // 0x339(0x1)
	char pad_826[3];  // 0x33A(0x3)
	float JumpKeyHoldTime;  // 0x33C(0x4)
	float JumpForceTimeRemaining;  // 0x340(0x4)
	float ProxyJumpForceStartedTime;  // 0x344(0x4)
	float JumpMaxHoldTime;  // 0x348(0x4)
	int32_t JumpMaxCount;  // 0x34C(0x4)
	int32_t JumpCurrentCount;  // 0x350(0x4)
	int32_t JumpCurrentCountPreJump;  // 0x354(0x4)
	char pad_856[8];  // 0x358(0x8)
	struct FMulticastInlineDelegate OnReachedJumpApex;  // 0x360(0x10)
	char pad_880[16];  // 0x370(0x10)
	struct FMulticastInlineDelegate MovementModeChangedDelegate;  // 0x380(0x10)
	struct FMulticastInlineDelegate OnCharacterMovementUpdated;  // 0x390(0x10)
	struct FRootMotionSourceGroup SavedRootMotion;  // 0x3A0(0x38)
	char pad_984[8];  // 0x3D8(0x8)
	struct FRootMotionMovementParams ClientRootMotionParams;  // 0x3E0(0x40)
	struct TArray<struct FSimulatedRootMotionReplicatedMove> RootMotionRepMoves;  // 0x420(0x10)
	struct FRepRootMotionMontage RepRootMotion;  // 0x430(0x98)
	char pad_1224[8];  // 0x4C8(0x8)

	void UnCrouch(bool bClientSimulation); // Function Engine.Character.UnCrouch
	void StopJumping(); // Function Engine.Character.StopJumping
	void StopAnimMontage(struct UAnimMontage* AnimMontage); // Function Engine.Character.StopAnimMontage
	void ServerMovePacked(struct FCharacterServerMovePackedBits PackedBits); // Function Engine.Character.ServerMovePacked
	void ServerMoveOld(float OldTimeStamp, struct FVector_NetQuantize10 OldAccel, char OldMoveFlags, float InCrouchedHalfHeight); // Function Engine.Character.ServerMoveOld
	void ServerMoveNoBase(float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, char CompressedMoveFlags, char ClientRoll, uint32_t View, char ClientMovementMode, float InCrouchedHalfHeight); // Function Engine.Character.ServerMoveNoBase
	void ServerMoveDualNoBase(float TimeStamp0, struct FVector_NetQuantize10 InAccel0, char PendingFlags, uint32_t View0, float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, char NewFlags, char ClientRoll, uint32_t View, char ClientMovementMode, float InCrouchedHalfHeight); // Function Engine.Character.ServerMoveDualNoBase
	void ServerMoveDualHybridRootMotion(float TimeStamp0, struct FVector_NetQuantize10 InAccel0, char PendingFlags, uint32_t View0, float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, char NewFlags, char ClientRoll, uint32_t View, struct UPrimitiveComponent* ClientMovementBase, struct FName ClientBaseBoneName, char ClientMovementMode, float InCrouchedHalfHeight); // Function Engine.Character.ServerMoveDualHybridRootMotion
	void ServerMoveDual(float TimeStamp0, struct FVector_NetQuantize10 InAccel0, char PendingFlags, uint32_t View0, float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, char NewFlags, char ClientRoll, uint32_t View, struct UPrimitiveComponent* ClientMovementBase, struct FName ClientBaseBoneName, char ClientMovementMode, float InCrouchedHalfHeight); // Function Engine.Character.ServerMoveDual
	void ServerMove(float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, char CompressedMoveFlags, char ClientRoll, uint32_t View, struct UPrimitiveComponent* ClientMovementBase, struct FName ClientBaseBoneName, char ClientMovementMode, float InCrouchedHalfHeight); // Function Engine.Character.ServerMove
	void RootMotionDebugClientPrintOnScreen(struct FString inString); // Function Engine.Character.RootMotionDebugClientPrintOnScreen
	float PlayAnimMontage(struct UAnimMontage* AnimMontage, float InPlayRate, struct FName StartSectionName); // Function Engine.Character.PlayAnimMontage
	void OnWalkingOffLedge(struct FVector& PreviousFloorImpactNormal, struct FVector& PreviousFloorContactNormal, struct FVector& PreviousLocation, float TimeDelta); // Function Engine.Character.OnWalkingOffLedge
	void OnRep_RootMotion(); // Function Engine.Character.OnRep_RootMotion
	void OnRep_ReplicatedCrouchedStateAndCapsuleHalfHeight(); // Function Engine.Character.OnRep_ReplicatedCrouchedStateAndCapsuleHalfHeight
	void OnRep_ReplicatedBasedMovement(); // Function Engine.Character.OnRep_ReplicatedBasedMovement
	void OnRep_ReplayLastTransformUpdateTimeStamp(); // Function Engine.Character.OnRep_ReplayLastTransformUpdateTimeStamp
	void OnLaunched(struct FVector LaunchVelocity, bool bXYOverride, bool bZOverride); // Function Engine.Character.OnLaunched
	void OnLanded(struct FHitResult& Hit); // Function Engine.Character.OnLanded
	void OnJumped(); // Function Engine.Character.OnJumped
	void LaunchCharacter(struct FVector LaunchVelocity, bool bXYOverride, bool bZOverride); // Function Engine.Character.LaunchCharacter
	void K2_UpdateCustomMovement(float DeltaTime); // Function Engine.Character.K2_UpdateCustomMovement
	void K2_OnStartCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function Engine.Character.K2_OnStartCrouch
	void K2_OnMovementModeChanged(char EMovementMode PrevMovementMode, char EMovementMode NewMovementMode, char PrevCustomMode, char NewCustomMode); // Function Engine.Character.K2_OnMovementModeChanged
	void K2_OnEndCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function Engine.Character.K2_OnEndCrouch
	void Jump(); // Function Engine.Character.Jump
	bool IsPlayingRootMotion(); // Function Engine.Character.IsPlayingRootMotion
	bool IsPlayingNetworkedRootMotionMontage(); // Function Engine.Character.IsPlayingNetworkedRootMotionMontage
	bool IsJumpProvidingForce(); // Function Engine.Character.IsJumpProvidingForce
	bool HasAnyRootMotion(); // Function Engine.Character.HasAnyRootMotion
	struct UAnimMontage* GetCurrentMontage(); // Function Engine.Character.GetCurrentMontage
	struct FVector GetBaseTranslationOffset(); // Function Engine.Character.GetBaseTranslationOffset
	struct FRotator GetBaseRotationOffsetRotator(); // Function Engine.Character.GetBaseRotationOffsetRotator
	float GetAnimRootMotionTranslationScale(); // Function Engine.Character.GetAnimRootMotionTranslationScale
	void Crouch(bool bClientSimulation); // Function Engine.Character.Crouch
	void ClientVeryShortAdjustPosition(float Timestamp, struct FVector NewLoc, struct UPrimitiveComponent* NewBase, struct FName NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, char ServerMovementMode); // Function Engine.Character.ClientVeryShortAdjustPosition
	void ClientMoveResponsePacked(struct FCharacterMoveResponsePackedBits PackedBits); // Function Engine.Character.ClientMoveResponsePacked
	void ClientCheatWalk(); // Function Engine.Character.ClientCheatWalk
	void ClientCheatGhost(); // Function Engine.Character.ClientCheatGhost
	void ClientCheatFly(); // Function Engine.Character.ClientCheatFly
	void ClientAdjustRootMotionSourcePosition(float Timestamp, struct FRootMotionSourceGroup ServerRootMotion, bool bHasAnimRootMotion, float ServerMontageTrackPosition, struct FVector ServerLoc, struct FVector_NetQuantizeNormal ServerRotation, float ServerVelZ, struct UPrimitiveComponent* ServerBase, struct FName ServerBoneName, bool bHasBase, bool bBaseRelativePosition, char ServerMovementMode); // Function Engine.Character.ClientAdjustRootMotionSourcePosition
	void ClientAdjustRootMotionPosition(float Timestamp, float ServerMontageTrackPosition, struct FVector ServerLoc, struct FVector_NetQuantizeNormal ServerRotation, float ServerVelZ, struct UPrimitiveComponent* ServerBase, struct FName ServerBoneName, bool bHasBase, bool bBaseRelativePosition, char ServerMovementMode); // Function Engine.Character.ClientAdjustRootMotionPosition
	void ClientAdjustPosition(float Timestamp, struct FVector NewLoc, struct FVector NewVel, struct UPrimitiveComponent* NewBase, struct FName NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, char ServerMovementMode); // Function Engine.Character.ClientAdjustPosition
	void ClientAckGoodMove(float Timestamp); // Function Engine.Character.ClientAckGoodMove
	bool CanJumpInternal(); // Function Engine.Character.CanJumpInternal
	bool CanJump(); // Function Engine.Character.CanJump
	bool CanCrouch(); // Function Engine.Character.CanCrouch
	void CacheInitialMeshOffset(struct FVector MeshRelativeLocation, struct FRotator MeshRelativeRotation); // Function Engine.Character.CacheInitialMeshOffset
}; 



// Class Engine.MaterialExpressionDistanceFieldGradient
// Size: 0x58(Inherited: 0x40) 
struct UMaterialExpressionDistanceFieldGradient : public UMaterialExpression
{
	struct FExpressionInput position;  // 0x40(0x14)
	char pad_84[4];  // 0x54(0x4)

}; 



// Class Engine.WorldSettings
// Size: 0x380(Inherited: 0x220) 
struct AWorldSettings : public AInfo
{
	char pad_544[8];  // 0x220(0x8)
	int32_t VisibilityCellSize;  // 0x228(0x4)
	char EVisibilityAggressiveness VisibilityAggressiveness;  // 0x22C(0x1)
	char bPrecomputeVisibility : 1;  // 0x22D(0x1)
	char bPlaceCellsOnlyAlongCameraTracks : 1;  // 0x22D(0x1)
	char bEnableWorldBoundsChecks : 1;  // 0x22D(0x1)
	char bEnableNavigationSystem : 1;  // 0x22D(0x1)
	char bEnableAISystem : 1;  // 0x22D(0x1)
	char bEnableWorldComposition : 1;  // 0x22D(0x1)
	char bUseClientSideLevelStreamingVolumes : 1;  // 0x22D(0x1)
	char bEnableWorldOriginRebasing : 1;  // 0x22D(0x1)
	char bWorldGravitySet : 1;  // 0x22E(0x1)
	char bGlobalGravitySet : 1;  // 0x22E(0x1)
	char bMinimizeBSPSections : 1;  // 0x22E(0x1)
	char bForceNoPrecomputedLighting : 1;  // 0x22E(0x1)
	char bHighPriorityLoading : 1;  // 0x22E(0x1)
	char bHighPriorityLoadingLocal : 1;  // 0x22E(0x1)
	char bOverrideDefaultBroadphaseSettings : 1;  // 0x22E(0x1)
	char pad_558_1 : 1;  // 0x22E(0x1)
	char pad_559[2];  // 0x22F(0x2)
	struct UNavigationSystemConfig* NavigationSystemConfig;  // 0x230(0x8)
	struct UNavigationSystemConfig* NavigationSystemConfigOverride;  // 0x238(0x8)
	float WorldToMeters;  // 0x240(0x4)
	float KillZ;  // 0x244(0x4)
	UDamageType* KillZDamageType;  // 0x248(0x8)
	float WorldGravityZ;  // 0x250(0x4)
	float GlobalGravityZ;  // 0x254(0x4)
	ADefaultPhysicsVolume* DefaultPhysicsVolumeClass;  // 0x258(0x8)
	UPhysicsCollisionHandler* PhysicsCollisionHandlerClass;  // 0x260(0x8)
	AGameModeBase* DefaultGameMode;  // 0x268(0x8)
	AGameNetworkManager* GameNetworkManagerClass;  // 0x270(0x8)
	int32_t PackedLightAndShadowMapTextureSize;  // 0x278(0x4)
	struct FVector DefaultColorScale;  // 0x27C(0xC)
	float DefaultMaxDistanceFieldOcclusionDistance;  // 0x288(0x4)
	float GlobalDistanceFieldViewDistance;  // 0x28C(0x4)
	float DynamicIndirectShadowsSelfShadowingIntensity;  // 0x290(0x4)
	char pad_660[4];  // 0x294(0x4)
	struct FReverbSettings DefaultReverbSettings;  // 0x298(0x20)
	struct FInteriorSettings DefaultAmbientZoneSettings;  // 0x2B8(0x24)
	char pad_732[4];  // 0x2DC(0x4)
	struct USoundMix* DefaultBaseSoundMix;  // 0x2E0(0x8)
	float TimeDilation;  // 0x2E8(0x4)
	float MatineeTimeDilation;  // 0x2EC(0x4)
	float DemoPlayTimeDilation;  // 0x2F0(0x4)
	float MinGlobalTimeDilation;  // 0x2F4(0x4)
	float MaxGlobalTimeDilation;  // 0x2F8(0x4)
	float MinUndilatedFrameTime;  // 0x2FC(0x4)
	float MaxUndilatedFrameTime;  // 0x300(0x4)
	struct FBroadphaseSettings BroadphaseSettings;  // 0x304(0x24)
	struct APlayerState* Pauser;  // 0x328(0x8)
	struct TArray<struct FNetViewer> ReplicationViewers;  // 0x330(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData;  // 0x340(0x10)
	struct APlayerState* PauserPlayerState;  // 0x350(0x8)
	int32_t MaxNumberOfBookmarks;  // 0x358(0x4)
	char pad_860[4];  // 0x35C(0x4)
	UBookmarkBase* DefaultBookmarkClass;  // 0x360(0x8)
	struct TArray<struct UBookmarkBase*> BookmarkArray;  // 0x368(0x10)
	UBookmarkBase* LastBookmarkClass;  // 0x378(0x8)

	void OnRep_WorldGravityZ(); // Function Engine.WorldSettings.OnRep_WorldGravityZ
}; 



// Class Engine.InputKeyDelegateBinding
// Size: 0x38(Inherited: 0x28) 
struct UInputKeyDelegateBinding : public UInputDelegateBinding
{
	struct TArray<struct FBlueprintInputKeyDelegateBinding> InputKeyDelegateBindings;  // 0x28(0x10)

}; 



// Class Engine.MaterialExpressionArctangentFast
// Size: 0x58(Inherited: 0x40) 
struct UMaterialExpressionArctangentFast : public UMaterialExpression
{
	struct FExpressionInput Input;  // 0x40(0x14)
	char pad_84[4];  // 0x54(0x4)

}; 



// Class Engine.SphereReflectionCaptureComponent
// Size: 0x280(Inherited: 0x270) 
struct USphereReflectionCaptureComponent : public UReflectionCaptureComponent
{
	float InfluenceRadius;  // 0x270(0x4)
	float CaptureDistanceScale;  // 0x274(0x4)
	struct UDrawSphereComponent* PreviewInfluenceRadius;  // 0x278(0x8)

}; 



// Class Engine.World
// Size: 0x7B0(Inherited: 0x28) 
struct UWorld : public UObject
{
	char pad_40[8];  // 0x28(0x8)
	struct ULevel* PersistentLevel;  // 0x30(0x8)
	struct UNetDriver* NetDriver;  // 0x38(0x8)
	struct ULineBatchComponent* LineBatcher;  // 0x40(0x8)
	struct ULineBatchComponent* PersistentLineBatcher;  // 0x48(0x8)
	struct ULineBatchComponent* ForegroundLineBatcher;  // 0x50(0x8)
	struct AGameNetworkManager* NetworkManager;  // 0x58(0x8)
	struct UPhysicsCollisionHandler* PhysicsCollisionHandler;  // 0x60(0x8)
	struct TArray<struct UObject*> ExtraReferencedObjects;  // 0x68(0x10)
	struct TArray<struct UObject*> PerModuleDataObjects;  // 0x78(0x10)
	struct TArray<struct ULevelStreaming*> StreamingLevels;  // 0x88(0x10)
	struct FStreamingLevelsToConsider StreamingLevelsToConsider;  // 0x98(0x28)
	struct FString StreamingLevelsPrefix;  // 0xC0(0x10)
	struct ULevel* CurrentLevelPendingVisibility;  // 0xD0(0x8)
	struct ULevel* CurrentLevelPendingInvisibility;  // 0xD8(0x8)
	struct UDemoNetDriver* DemoNetDriver;  // 0xE0(0x8)
	struct AParticleEventManager* MyParticleEventManager;  // 0xE8(0x8)
	struct APhysicsVolume* DefaultPhysicsVolume;  // 0xF0(0x8)
	char pad_248[22];  // 0xF8(0x16)
	char pad_270_1 : 2;  // 0x10E(0x1)
	char bAreConstraintsDirty : 1;  // 0x10E(0x1)
	char pad_270_2 : 5;  // 0x10E(0x1)
	char pad_271[2];  // 0x10F(0x2)
	struct UNavigationSystemBase* NavigationSystem;  // 0x110(0x8)
	struct AGameModeBase* AuthorityGameMode;  // 0x118(0x8)
	struct AGameStateBase* GameState;  // 0x120(0x8)
	struct UAISystemBase* AISystem;  // 0x128(0x8)
	struct UAvoidanceManager* AvoidanceManager;  // 0x130(0x8)
	struct TArray<struct ULevel*> Levels;  // 0x138(0x10)
	struct TArray<struct FLevelCollection> LevelCollections;  // 0x148(0x10)
	char pad_344[40];  // 0x158(0x28)
	struct UGameInstance* OwningGameInstance;  // 0x180(0x8)
	struct TArray<struct UMaterialParameterCollectionInstance*> ParameterCollectionInstances;  // 0x188(0x10)
	struct UCanvas* CanvasForRenderingToTarget;  // 0x198(0x8)
	struct UCanvas* CanvasForDrawMaterialToRenderTarget;  // 0x1A0(0x8)
	char pad_424[80];  // 0x1A8(0x50)
	struct UPhysicsFieldComponent* PhysicsField;  // 0x1F8(0x8)
	struct TSet<struct UActorComponent*> ComponentsThatNeedPreEndOfFrameSync;  // 0x200(0x50)
	struct TArray<struct UActorComponent*> ComponentsThatNeedEndOfFrameUpdate;  // 0x250(0x10)
	struct TArray<struct UActorComponent*> ComponentsThatNeedEndOfFrameUpdate_OnGameThread;  // 0x260(0x10)
	char pad_624[880];  // 0x270(0x370)
	struct UWorldComposition* WorldComposition;  // 0x5E0(0x8)
	char pad_1512[168];  // 0x5E8(0xA8)
	struct FWorldPSCPool PSCPool;  // 0x690(0x58)
	char pad_1768[200];  // 0x6E8(0xC8)

	struct AWorldSettings* K2_GetWorldSettings(); // Function Engine.World.K2_GetWorldSettings
	void HandleTimelineScrubbed(); // Function Engine.World.HandleTimelineScrubbed
}; 



// Class Engine.ControlChannel
// Size: 0x80(Inherited: 0x68) 
struct UControlChannel : public UChannel
{
	char pad_104[24];  // 0x68(0x18)

}; 



// Class Engine.InterpTrackInst
// Size: 0x28(Inherited: 0x28) 
struct UInterpTrackInst : public UObject
{

}; 



// Class Engine.TimelineTemplate
// Size: 0xB8(Inherited: 0x28) 
struct UTimelineTemplate : public UObject
{
	float TimelineLength;  // 0x28(0x4)
	char ETimelineLengthMode LengthMode;  // 0x2C(0x1)
	char bAutoPlay : 1;  // 0x2D(0x1)
	char bLoop : 1;  // 0x2D(0x1)
	char bReplicated : 1;  // 0x2D(0x1)
	char bIgnoreTimeDilation : 1;  // 0x2D(0x1)
	char pad_45_1 : 4;  // 0x2D(0x1)
	char pad_46[3];  // 0x2E(0x3)
	struct TArray<struct FTTEventTrack> EventTracks;  // 0x30(0x10)
	struct TArray<struct FTTFloatTrack> FloatTracks;  // 0x40(0x10)
	struct TArray<struct FTTVectorTrack> VectorTracks;  // 0x50(0x10)
	struct TArray<struct FTTLinearColorTrack> LinearColorTracks;  // 0x60(0x10)
	struct TArray<struct FBPVariableMetaDataEntry> MetaDataArray;  // 0x70(0x10)
	struct FGuid TimelineGuid;  // 0x80(0x10)
	char ETickingGroup TimelineTickGroup;  // 0x90(0x1)
	char pad_145[3];  // 0x91(0x3)
	struct FName VariableName;  // 0x94(0x8)
	struct FName DirectionPropertyName;  // 0x9C(0x8)
	struct FName UpdateFunctionName;  // 0xA4(0x8)
	struct FName FinishedFunctionName;  // 0xAC(0x8)
	char pad_180[4];  // 0xB4(0x4)

}; 



// Class Engine.NavPathObserverInterface
// Size: 0x28(Inherited: 0x28) 
struct UNavPathObserverInterface : public UInterface
{

}; 



// Class Engine.WorldSubsystem
// Size: 0x30(Inherited: 0x30) 
struct UWorldSubsystem : public USubsystem
{

}; 



// Class Engine.MaterialExpression
// Size: 0x40(Inherited: 0x28) 
struct UMaterialExpression : public UObject
{
	struct UMaterial* Material;  // 0x28(0x8)
	struct UMaterialFunction* Function;  // 0x30(0x8)
	char bIsParameterExpression : 1;  // 0x38(0x1)
	char pad_56_1 : 7;  // 0x38(0x1)
	char pad_57[8];  // 0x39(0x8)

}; 



// Class Engine.SoundNodeParamCrossFade
// Size: 0x60(Inherited: 0x58) 
struct USoundNodeParamCrossFade : public USoundNodeDistanceCrossFade
{
	struct FName ParamName;  // 0x58(0x8)

}; 



// Class Engine.SoundEffectSubmixPreset
// Size: 0x68(Inherited: 0x68) 
struct USoundEffectSubmixPreset : public USoundEffectPreset
{

}; 



// Class Engine.LevelPartitionInterface
// Size: 0x28(Inherited: 0x28) 
struct ULevelPartitionInterface : public UInterface
{

}; 



// Class Engine.SplineComponent
// Size: 0x550(Inherited: 0x450) 
struct USplineComponent : public UPrimitiveComponent
{
	struct FSplineCurves SplineCurves;  // 0x450(0x70)
	struct FInterpCurveVector SplineInfo;  // 0x4C0(0x18)
	struct FInterpCurveQuat SplineRotInfo;  // 0x4D8(0x18)
	struct FInterpCurveVector SplineScaleInfo;  // 0x4F0(0x18)
	struct FInterpCurveFloat SplineReparamTable;  // 0x508(0x18)
	char pad_1312_1 : 7;  // 0x520(0x1)
	bool bAllowSplineEditingPerInstance : 1;  // 0x520(0x1)
	char pad_1313[3];  // 0x521(0x3)
	int32_t ReparamStepsPerSegment;  // 0x524(0x4)
	float Duration;  // 0x528(0x4)
	char pad_1324_1 : 7;  // 0x52C(0x1)
	bool bStationaryEndpoints : 1;  // 0x52C(0x1)
	char pad_1325_1 : 7;  // 0x52D(0x1)
	bool bSplineHasBeenEdited : 1;  // 0x52D(0x1)
	char pad_1326_1 : 7;  // 0x52E(0x1)
	bool bModifiedByConstructionScript : 1;  // 0x52E(0x1)
	char pad_1327_1 : 7;  // 0x52F(0x1)
	bool bInputSplinePointsToConstructionScript : 1;  // 0x52F(0x1)
	char pad_1328_1 : 7;  // 0x530(0x1)
	bool bDrawDebug : 1;  // 0x530(0x1)
	char pad_1329_1 : 7;  // 0x531(0x1)
	bool bClosedLoop : 1;  // 0x531(0x1)
	char pad_1330_1 : 7;  // 0x532(0x1)
	bool bLoopPositionOverride : 1;  // 0x532(0x1)
	char pad_1331[1];  // 0x533(0x1)
	float LoopPosition;  // 0x534(0x4)
	struct FVector DefaultUpVector;  // 0x538(0xC)
	char pad_1348[12];  // 0x544(0xC)

	void UpdateSpline(); // Function Engine.SplineComponent.UpdateSpline
	void SetWorldLocationAtSplinePoint(int32_t PointIndex, struct FVector& InLocation); // Function Engine.SplineComponent.SetWorldLocationAtSplinePoint
	void SetUpVectorAtSplinePoint(int32_t PointIndex, struct FVector& InUpVector, char ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetUpVectorAtSplinePoint
	void SetUnselectedSplineSegmentColor(struct FLinearColor& SegmentColor); // Function Engine.SplineComponent.SetUnselectedSplineSegmentColor
	void SetTangentsAtSplinePoint(int32_t PointIndex, struct FVector& InArriveTangent, struct FVector& InLeaveTangent, char ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetTangentsAtSplinePoint
	void SetTangentColor(struct FLinearColor& TangentColor); // Function Engine.SplineComponent.SetTangentColor
	void SetTangentAtSplinePoint(int32_t PointIndex, struct FVector& InTangent, char ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetTangentAtSplinePoint
	void SetSplineWorldPoints(struct TArray<struct FVector>& Points); // Function Engine.SplineComponent.SetSplineWorldPoints
	void SetSplinePointType(int32_t PointIndex, char ESplinePointType Type, bool bUpdateSpline); // Function Engine.SplineComponent.SetSplinePointType
	void SetSplinePoints(struct TArray<struct FVector>& Points, char ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetSplinePoints
	void SetSplineLocalPoints(struct TArray<struct FVector>& Points); // Function Engine.SplineComponent.SetSplineLocalPoints
	void SetSelectedSplineSegmentColor(struct FLinearColor& SegmentColor); // Function Engine.SplineComponent.SetSelectedSplineSegmentColor
	void SetScaleAtSplinePoint(int32_t PointIndex, struct FVector& InScaleVector, bool bUpdateSpline); // Function Engine.SplineComponent.SetScaleAtSplinePoint
	void SetRotationAtSplinePoint(int32_t PointIndex, struct FRotator& InRotation, char ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetRotationAtSplinePoint
	void SetLocationAtSplinePoint(int32_t PointIndex, struct FVector& InLocation, char ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetLocationAtSplinePoint
	void SetDrawDebug(bool bShow); // Function Engine.SplineComponent.SetDrawDebug
	void SetDefaultUpVector(struct FVector& UpVector, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.SetDefaultUpVector
	void SetClosedLoopAtPosition(bool bInClosedLoop, float Key, bool bUpdateSpline); // Function Engine.SplineComponent.SetClosedLoopAtPosition
	void SetClosedLoop(bool bInClosedLoop, bool bUpdateSpline); // Function Engine.SplineComponent.SetClosedLoop
	void RemoveSplinePoint(int32_t Index, bool bUpdateSpline); // Function Engine.SplineComponent.RemoveSplinePoint
	bool IsClosedLoop(); // Function Engine.SplineComponent.IsClosedLoop
	struct FVector GetWorldTangentAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldTangentAtDistanceAlongSpline
	struct FRotator GetWorldRotationAtTime(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetWorldRotationAtTime
	struct FRotator GetWorldRotationAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldRotationAtDistanceAlongSpline
	struct FVector GetWorldLocationAtTime(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetWorldLocationAtTime
	struct FVector GetWorldLocationAtSplinePoint(int32_t PointIndex); // Function Engine.SplineComponent.GetWorldLocationAtSplinePoint
	struct FVector GetWorldLocationAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldLocationAtDistanceAlongSpline
	struct FVector GetWorldDirectionAtTime(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetWorldDirectionAtTime
	struct FVector GetWorldDirectionAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldDirectionAtDistanceAlongSpline
	struct FVector GetVectorPropertyAtSplinePoint(int32_t Index, struct FName PropertyName); // Function Engine.SplineComponent.GetVectorPropertyAtSplinePoint
	struct FVector GetVectorPropertyAtSplineInputKey(float InKey, struct FName PropertyName); // Function Engine.SplineComponent.GetVectorPropertyAtSplineInputKey
	struct FVector GetUpVectorAtTime(float Time, char ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetUpVectorAtTime
	struct FVector GetUpVectorAtSplinePoint(int32_t PointIndex, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetUpVectorAtSplinePoint
	struct FVector GetUpVectorAtSplineInputKey(float InKey, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetUpVectorAtSplineInputKey
	struct FVector GetUpVectorAtDistanceAlongSpline(float Distance, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetUpVectorAtDistanceAlongSpline
	struct FTransform GetTransformAtTime(float Time, char ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity, bool bUseScale); // Function Engine.SplineComponent.GetTransformAtTime
	struct FTransform GetTransformAtSplinePoint(int32_t PointIndex, char ESplineCoordinateSpace CoordinateSpace, bool bUseScale); // Function Engine.SplineComponent.GetTransformAtSplinePoint
	struct FTransform GetTransformAtSplineInputKey(float InKey, char ESplineCoordinateSpace CoordinateSpace, bool bUseScale); // Function Engine.SplineComponent.GetTransformAtSplineInputKey
	struct FTransform GetTransformAtDistanceAlongSpline(float Distance, char ESplineCoordinateSpace CoordinateSpace, bool bUseScale); // Function Engine.SplineComponent.GetTransformAtDistanceAlongSpline
	struct FVector GetTangentAtTime(float Time, char ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetTangentAtTime
	struct FVector GetTangentAtSplinePoint(int32_t PointIndex, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetTangentAtSplinePoint
	struct FVector GetTangentAtSplineInputKey(float InKey, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetTangentAtSplineInputKey
	struct FVector GetTangentAtDistanceAlongSpline(float Distance, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetTangentAtDistanceAlongSpline
	char ESplinePointType GetSplinePointType(int32_t PointIndex); // Function Engine.SplineComponent.GetSplinePointType
	float GetSplineLength(); // Function Engine.SplineComponent.GetSplineLength
	struct FVector GetScaleAtTime(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetScaleAtTime
	struct FVector GetScaleAtSplinePoint(int32_t PointIndex); // Function Engine.SplineComponent.GetScaleAtSplinePoint
	struct FVector GetScaleAtSplineInputKey(float InKey); // Function Engine.SplineComponent.GetScaleAtSplineInputKey
	struct FVector GetScaleAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetScaleAtDistanceAlongSpline
	struct FRotator GetRotationAtTime(float Time, char ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetRotationAtTime
	struct FRotator GetRotationAtSplinePoint(int32_t PointIndex, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRotationAtSplinePoint
	struct FRotator GetRotationAtSplineInputKey(float InKey, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRotationAtSplineInputKey
	struct FRotator GetRotationAtDistanceAlongSpline(float Distance, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRotationAtDistanceAlongSpline
	float GetRollAtTime(float Time, char ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetRollAtTime
	float GetRollAtSplinePoint(int32_t PointIndex, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRollAtSplinePoint
	float GetRollAtSplineInputKey(float InKey, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRollAtSplineInputKey
	float GetRollAtDistanceAlongSpline(float Distance, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRollAtDistanceAlongSpline
	struct FVector GetRightVectorAtTime(float Time, char ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetRightVectorAtTime
	struct FVector GetRightVectorAtSplinePoint(int32_t PointIndex, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRightVectorAtSplinePoint
	struct FVector GetRightVectorAtSplineInputKey(float InKey, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRightVectorAtSplineInputKey
	struct FVector GetRightVectorAtDistanceAlongSpline(float Distance, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRightVectorAtDistanceAlongSpline
	int32_t GetNumberOfSplineSegments(); // Function Engine.SplineComponent.GetNumberOfSplineSegments
	int32_t GetNumberOfSplinePoints(); // Function Engine.SplineComponent.GetNumberOfSplinePoints
	struct FVector GetLocationAtTime(float Time, char ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetLocationAtTime
	struct FVector GetLocationAtSplinePoint(int32_t PointIndex, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetLocationAtSplinePoint
	struct FVector GetLocationAtSplineInputKey(float InKey, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetLocationAtSplineInputKey
	struct FVector GetLocationAtDistanceAlongSpline(float Distance, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetLocationAtDistanceAlongSpline
	void GetLocationAndTangentAtSplinePoint(int32_t PointIndex, struct FVector& Location, struct FVector& Tangent, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetLocationAndTangentAtSplinePoint
	void GetLocalLocationAndTangentAtSplinePoint(int32_t PointIndex, struct FVector& LocalLocation, struct FVector& LocalTangent); // Function Engine.SplineComponent.GetLocalLocationAndTangentAtSplinePoint
	struct FVector GetLeaveTangentAtSplinePoint(int32_t PointIndex, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetLeaveTangentAtSplinePoint
	float GetInputKeyAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetInputKeyAtDistanceAlongSpline
	float GetFloatPropertyAtSplinePoint(int32_t Index, struct FName PropertyName); // Function Engine.SplineComponent.GetFloatPropertyAtSplinePoint
	float GetFloatPropertyAtSplineInputKey(float InKey, struct FName PropertyName); // Function Engine.SplineComponent.GetFloatPropertyAtSplineInputKey
	float GetDistanceAlongSplineAtSplinePoint(int32_t PointIndex); // Function Engine.SplineComponent.GetDistanceAlongSplineAtSplinePoint
	float GetDistanceAlongSplineAtSplineInputKey(float InKey); // Function Engine.SplineComponent.GetDistanceAlongSplineAtSplineInputKey
	struct FVector GetDirectionAtTime(float Time, char ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetDirectionAtTime
	struct FVector GetDirectionAtSplinePoint(int32_t PointIndex, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetDirectionAtSplinePoint
	struct FVector GetDirectionAtSplineInputKey(float InKey, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetDirectionAtSplineInputKey
	struct FVector GetDirectionAtDistanceAlongSpline(float Distance, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetDirectionAtDistanceAlongSpline
	struct FVector GetDefaultUpVector(char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetDefaultUpVector
	struct FVector GetArriveTangentAtSplinePoint(int32_t PointIndex, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetArriveTangentAtSplinePoint
	struct FVector FindUpVectorClosestToWorldLocation(struct FVector& WorldLocation, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindUpVectorClosestToWorldLocation
	struct FTransform FindTransformClosestToWorldLocation(struct FVector& WorldLocation, char ESplineCoordinateSpace CoordinateSpace, bool bUseScale); // Function Engine.SplineComponent.FindTransformClosestToWorldLocation
	struct FVector FindTangentClosestToWorldLocation(struct FVector& WorldLocation, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindTangentClosestToWorldLocation
	struct FVector FindScaleClosestToWorldLocation(struct FVector& WorldLocation); // Function Engine.SplineComponent.FindScaleClosestToWorldLocation
	struct FRotator FindRotationClosestToWorldLocation(struct FVector& WorldLocation, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindRotationClosestToWorldLocation
	float FindRollClosestToWorldLocation(struct FVector& WorldLocation, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindRollClosestToWorldLocation
	struct FVector FindRightVectorClosestToWorldLocation(struct FVector& WorldLocation, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindRightVectorClosestToWorldLocation
	struct FVector FindLocationClosestToWorldLocation(struct FVector& WorldLocation, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindLocationClosestToWorldLocation
	float FindInputKeyClosestToWorldLocation(struct FVector& WorldLocation); // Function Engine.SplineComponent.FindInputKeyClosestToWorldLocation
	struct FVector FindDirectionClosestToWorldLocation(struct FVector& WorldLocation, char ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindDirectionClosestToWorldLocation
	void ClearSplinePoints(bool bUpdateSpline); // Function Engine.SplineComponent.ClearSplinePoints
	void AddSplineWorldPoint(struct FVector& position); // Function Engine.SplineComponent.AddSplineWorldPoint
	void AddSplinePointAtIndex(struct FVector& position, int32_t Index, char ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.AddSplinePointAtIndex
	void AddSplinePoint(struct FVector& position, char ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.AddSplinePoint
	void AddSplineLocalPoint(struct FVector& position); // Function Engine.SplineComponent.AddSplineLocalPoint
	void AddPoints(struct TArray<struct FSplinePoint>& Points, bool bUpdateSpline); // Function Engine.SplineComponent.AddPoints
	void AddPoint(struct FSplinePoint& Point, bool bUpdateSpline); // Function Engine.SplineComponent.AddPoint
}; 



// Class Engine.Commandlet
// Size: 0x80(Inherited: 0x28) 
struct UCommandlet : public UObject
{
	struct FString HelpDescription;  // 0x28(0x10)
	struct FString HelpUsage;  // 0x38(0x10)
	struct FString HelpWebLink;  // 0x48(0x10)
	struct TArray<struct FString> HelpParamNames;  // 0x58(0x10)
	struct TArray<struct FString> HelpParamDescriptions;  // 0x68(0x10)
	char IsServer : 1;  // 0x78(0x1)
	char IsClient : 1;  // 0x78(0x1)
	char IsEditor : 1;  // 0x78(0x1)
	char LogToConsole : 1;  // 0x78(0x1)
	char ShowErrorCount : 1;  // 0x78(0x1)
	char ShowProgress : 1;  // 0x78(0x1)
	char pad_120_1 : 2;  // 0x78(0x1)
	char pad_121[8];  // 0x79(0x8)

}; 



// Class Engine.AtmosphericFog
// Size: 0x228(Inherited: 0x220) 
struct AAtmosphericFog : public AInfo
{
	struct UAtmosphericFogComponent* AtmosphericFogComponent;  // 0x220(0x8)

}; 



// Class Engine.CharacterMovementComponent
// Size: 0xAF0(Inherited: 0x138) 
struct UCharacterMovementComponent : public UPawnMovementComponent
{
	char pad_312[16];  // 0x138(0x10)
	struct ACharacter* CharacterOwner;  // 0x148(0x8)
	float GravityScale;  // 0x150(0x4)
	float MaxStepHeight;  // 0x154(0x4)
	float JumpZVelocity;  // 0x158(0x4)
	float JumpOffJumpZFactor;  // 0x15C(0x4)
	float WalkableFloorAngle;  // 0x160(0x4)
	float WalkableFloorZ;  // 0x164(0x4)
	char EMovementMode MovementMode;  // 0x168(0x1)
	char CustomMovementMode;  // 0x169(0x1)
	uint8_t  NetworkSmoothingMode;  // 0x16A(0x1)
	char pad_363[1];  // 0x16B(0x1)
	float GroundFriction;  // 0x16C(0x4)
	char pad_368[28];  // 0x170(0x1C)
	float MaxWalkSpeed;  // 0x18C(0x4)
	float MaxWalkSpeedCrouched;  // 0x190(0x4)
	float MaxSwimSpeed;  // 0x194(0x4)
	float MaxFlySpeed;  // 0x198(0x4)
	float MaxCustomMovementSpeed;  // 0x19C(0x4)
	float MaxAcceleration;  // 0x1A0(0x4)
	float MinAnalogWalkSpeed;  // 0x1A4(0x4)
	float BrakingFrictionFactor;  // 0x1A8(0x4)
	float BrakingFriction;  // 0x1AC(0x4)
	float BrakingSubStepTime;  // 0x1B0(0x4)
	float BrakingDecelerationWalking;  // 0x1B4(0x4)
	float BrakingDecelerationFalling;  // 0x1B8(0x4)
	float BrakingDecelerationSwimming;  // 0x1BC(0x4)
	float BrakingDecelerationFlying;  // 0x1C0(0x4)
	float AirControl;  // 0x1C4(0x4)
	float AirControlBoostMultiplier;  // 0x1C8(0x4)
	float AirControlBoostVelocityThreshold;  // 0x1CC(0x4)
	float FallingLateralFriction;  // 0x1D0(0x4)
	float CrouchedHalfHeight;  // 0x1D4(0x4)
	float Buoyancy;  // 0x1D8(0x4)
	float PerchRadiusThreshold;  // 0x1DC(0x4)
	float PerchAdditionalHeight;  // 0x1E0(0x4)
	struct FRotator RotationRate;  // 0x1E4(0xC)
	char bUseSeparateBrakingFriction : 1;  // 0x1F0(0x1)
	char bApplyGravityWhileJumping : 1;  // 0x1F0(0x1)
	char bUseControllerDesiredRotation : 1;  // 0x1F0(0x1)
	char bOrientRotationToMovement : 1;  // 0x1F0(0x1)
	char bSweepWhileNavWalking : 1;  // 0x1F0(0x1)
	char pad_496_1 : 1;  // 0x1F0(0x1)
	char bMovementInProgress : 1;  // 0x1F0(0x1)
	char bEnableScopedMovementUpdates : 1;  // 0x1F0(0x1)
	char bEnableServerDualMoveScopedMovementUpdates : 1;  // 0x1F1(0x1)
	char bForceMaxAccel : 1;  // 0x1F1(0x1)
	char bRunPhysicsWithNoController : 1;  // 0x1F1(0x1)
	char bForceNextFloorCheck : 1;  // 0x1F1(0x1)
	char bShrinkProxyCapsule : 1;  // 0x1F1(0x1)
	char bCanWalkOffLedges : 1;  // 0x1F1(0x1)
	char bCanWalkOffLedgesWhenCrouching : 1;  // 0x1F1(0x1)
	char pad_497_1 : 1;  // 0x1F1(0x1)
	char pad_498_1 : 1;  // 0x1F2(0x1)
	char bNetworkSkipProxyPredictionOnNetUpdate : 1;  // 0x1F2(0x1)
	char bNetworkAlwaysReplicateTransformUpdateTimestamp : 1;  // 0x1F2(0x1)
	char bDeferUpdateMoveComponent : 1;  // 0x1F2(0x1)
	char bEnablePhysicsInteraction : 1;  // 0x1F2(0x1)
	char bTouchForceScaledToMass : 1;  // 0x1F2(0x1)
	char bPushForceScaledToMass : 1;  // 0x1F2(0x1)
	char bPushForceUsingZOffset : 1;  // 0x1F2(0x1)
	char bScalePushForceToVelocity : 1;  // 0x1F3(0x1)
	char pad_499_1 : 7;  // 0x1F3(0x1)
	char pad_500[5];  // 0x1F4(0x5)
	struct USceneComponent* DeferredUpdatedMoveComponent;  // 0x1F8(0x8)
	float MaxOutOfWaterStepHeight;  // 0x200(0x4)
	float OutofWaterZ;  // 0x204(0x4)
	float Mass;  // 0x208(0x4)
	float StandingDownwardForceScale;  // 0x20C(0x4)
	float InitialPushForceFactor;  // 0x210(0x4)
	float PushForceFactor;  // 0x214(0x4)
	float PushForcePointZOffsetFactor;  // 0x218(0x4)
	float TouchForceFactor;  // 0x21C(0x4)
	float MinTouchForce;  // 0x220(0x4)
	float MaxTouchForce;  // 0x224(0x4)
	float RepulsionForce;  // 0x228(0x4)
	struct FVector Acceleration;  // 0x22C(0xC)
	char pad_568[8];  // 0x238(0x8)
	struct FQuat LastUpdateRotation;  // 0x240(0x10)
	struct FVector LastUpdateLocation;  // 0x250(0xC)
	struct FVector LastUpdateVelocity;  // 0x25C(0xC)
	float ServerLastTransformUpdateTimeStamp;  // 0x268(0x4)
	float ServerLastClientGoodMoveAckTime;  // 0x26C(0x4)
	float ServerLastClientAdjustmentTime;  // 0x270(0x4)
	struct FVector PendingImpulseToApply;  // 0x274(0xC)
	struct FVector PendingForceToApply;  // 0x280(0xC)
	float AnalogInputModifier;  // 0x28C(0x4)
	char pad_656[12];  // 0x290(0xC)
	float MaxSimulationTimeStep;  // 0x29C(0x4)
	int32_t MaxSimulationIterations;  // 0x2A0(0x4)
	int32_t MaxJumpApexAttemptsPerSimulation;  // 0x2A4(0x4)
	float MaxDepenetrationWithGeometry;  // 0x2A8(0x4)
	float MaxDepenetrationWithGeometryAsProxy;  // 0x2AC(0x4)
	float MaxDepenetrationWithPawn;  // 0x2B0(0x4)
	float MaxDepenetrationWithPawnAsProxy;  // 0x2B4(0x4)
	float NetworkSimulatedSmoothLocationTime;  // 0x2B8(0x4)
	float NetworkSimulatedSmoothRotationTime;  // 0x2BC(0x4)
	float ListenServerNetworkSimulatedSmoothLocationTime;  // 0x2C0(0x4)
	float ListenServerNetworkSimulatedSmoothRotationTime;  // 0x2C4(0x4)
	float NetProxyShrinkRadius;  // 0x2C8(0x4)
	float NetProxyShrinkHalfHeight;  // 0x2CC(0x4)
	float NetworkMaxSmoothUpdateDistance;  // 0x2D0(0x4)
	float NetworkNoSmoothUpdateDistance;  // 0x2D4(0x4)
	float NetworkMinTimeBetweenClientAckGoodMoves;  // 0x2D8(0x4)
	float NetworkMinTimeBetweenClientAdjustments;  // 0x2DC(0x4)
	float NetworkMinTimeBetweenClientAdjustmentsLargeCorrection;  // 0x2E0(0x4)
	float NetworkLargeClientCorrectionDistance;  // 0x2E4(0x4)
	float LedgeCheckThreshold;  // 0x2E8(0x4)
	float JumpOutOfWaterPitch;  // 0x2EC(0x4)
	struct FFindFloorResult CurrentFloor;  // 0x2F0(0x94)
	char EMovementMode DefaultLandMovementMode;  // 0x384(0x1)
	char EMovementMode DefaultWaterMovementMode;  // 0x385(0x1)
	char EMovementMode GroundMovementMode;  // 0x386(0x1)
	char bMaintainHorizontalGroundVelocity : 1;  // 0x387(0x1)
	char bImpartBaseVelocityX : 1;  // 0x387(0x1)
	char bImpartBaseVelocityY : 1;  // 0x387(0x1)
	char bImpartBaseVelocityZ : 1;  // 0x387(0x1)
	char bImpartBaseAngularVelocity : 1;  // 0x387(0x1)
	char bJustTeleported : 1;  // 0x387(0x1)
	char bNetworkUpdateReceived : 1;  // 0x387(0x1)
	char bNetworkMovementModeChanged : 1;  // 0x387(0x1)
	char bIgnoreClientMovementErrorChecksAndCorrection : 1;  // 0x388(0x1)
	char bServerAcceptClientAuthoritativePosition : 1;  // 0x388(0x1)
	char bNotifyApex : 1;  // 0x388(0x1)
	char bCheatFlying : 1;  // 0x388(0x1)
	char bWantsToCrouch : 1;  // 0x388(0x1)
	char bCrouchMaintainsBaseLocation : 1;  // 0x388(0x1)
	char bIgnoreBaseRotation : 1;  // 0x388(0x1)
	char bFastAttachedMove : 1;  // 0x388(0x1)
	char bAlwaysCheckFloor : 1;  // 0x389(0x1)
	char bUseFlatBaseForFloorChecks : 1;  // 0x389(0x1)
	char bPerformingJumpOff : 1;  // 0x389(0x1)
	char bWantsToLeaveNavWalking : 1;  // 0x389(0x1)
	char bUseRVOAvoidance : 1;  // 0x389(0x1)
	char bRequestedMoveUseAcceleration : 1;  // 0x389(0x1)
	char pad_905_1 : 1;  // 0x389(0x1)
	char bWasSimulatingRootMotion : 1;  // 0x389(0x1)
	char bAllowPhysicsRotationDuringAnimRootMotion : 1;  // 0x38A(0x1)
	char bHasRequestedVelocity : 1;  // 0x38A(0x1)
	char bRequestedMoveWithMaxSpeed : 1;  // 0x38A(0x1)
	char bWasAvoidanceUpdated : 1;  // 0x38A(0x1)
	char pad_906_1 : 2;  // 0x38A(0x1)
	char bProjectNavMeshWalking : 1;  // 0x38A(0x1)
	char bProjectNavMeshOnBothWorldChannels : 1;  // 0x38A(0x1)
	char pad_907[17];  // 0x38B(0x11)
	float AvoidanceConsiderationRadius;  // 0x39C(0x4)
	struct FVector RequestedVelocity;  // 0x3A0(0xC)
	int32_t AvoidanceUID;  // 0x3AC(0x4)
	struct FNavAvoidanceMask AvoidanceGroup;  // 0x3B0(0x4)
	struct FNavAvoidanceMask GroupsToAvoid;  // 0x3B4(0x4)
	struct FNavAvoidanceMask GroupsToIgnore;  // 0x3B8(0x4)
	float AvoidanceWeight;  // 0x3BC(0x4)
	struct FVector PendingLaunchVelocity;  // 0x3C0(0xC)
	char pad_972[164];  // 0x3CC(0xA4)
	float NavMeshProjectionInterval;  // 0x470(0x4)
	float NavMeshProjectionTimer;  // 0x474(0x4)
	float NavMeshProjectionInterpSpeed;  // 0x478(0x4)
	float NavMeshProjectionHeightScaleUp;  // 0x47C(0x4)
	float NavMeshProjectionHeightScaleDown;  // 0x480(0x4)
	float NavWalkingFloorDistTolerance;  // 0x484(0x4)
	struct FCharacterMovementComponentPostPhysicsTickFunction PostPhysicsTickFunction;  // 0x488(0x30)
	char pad_1208[24];  // 0x4B8(0x18)
	float MinTimeBetweenTimeStampResets;  // 0x4D0(0x4)
	char pad_1236[1196];  // 0x4D4(0x4AC)
	struct FRootMotionSourceGroup CurrentRootMotion;  // 0x980(0x38)
	struct FRootMotionSourceGroup ServerCorrectionRootMotion;  // 0x9B8(0x38)
	char pad_2544[144];  // 0x9F0(0x90)
	struct FRootMotionMovementParams RootMotionParams;  // 0xA80(0x40)
	struct FVector AnimRootMotionVelocity;  // 0xAC0(0xC)
	char pad_2764[36];  // 0xACC(0x24)

	void SetWalkableFloorZ(float InWalkableFloorZ); // Function Engine.CharacterMovementComponent.SetWalkableFloorZ
	void SetWalkableFloorAngle(float InWalkableFloorAngle); // Function Engine.CharacterMovementComponent.SetWalkableFloorAngle
	void SetMovementMode(char EMovementMode NewMovementMode, char NewCustomMode); // Function Engine.CharacterMovementComponent.SetMovementMode
	void SetGroupsToIgnoreMask(struct FNavAvoidanceMask& GroupMask); // Function Engine.CharacterMovementComponent.SetGroupsToIgnoreMask
	void SetGroupsToIgnore(int32_t GroupFlags); // Function Engine.CharacterMovementComponent.SetGroupsToIgnore
	void SetGroupsToAvoidMask(struct FNavAvoidanceMask& GroupMask); // Function Engine.CharacterMovementComponent.SetGroupsToAvoidMask
	void SetGroupsToAvoid(int32_t GroupFlags); // Function Engine.CharacterMovementComponent.SetGroupsToAvoid
	void SetAvoidanceGroupMask(struct FNavAvoidanceMask& GroupMask); // Function Engine.CharacterMovementComponent.SetAvoidanceGroupMask
	void SetAvoidanceGroup(int32_t GroupFlags); // Function Engine.CharacterMovementComponent.SetAvoidanceGroup
	void SetAvoidanceEnabled(bool bEnable); // Function Engine.CharacterMovementComponent.SetAvoidanceEnabled
	float K2_GetWalkableFloorZ(); // Function Engine.CharacterMovementComponent.K2_GetWalkableFloorZ
	float K2_GetWalkableFloorAngle(); // Function Engine.CharacterMovementComponent.K2_GetWalkableFloorAngle
	float K2_GetModifiedMaxAcceleration(); // Function Engine.CharacterMovementComponent.K2_GetModifiedMaxAcceleration
	void K2_FindFloor(struct FVector CapsuleLocation, struct FFindFloorResult& FloorResult); // Function Engine.CharacterMovementComponent.K2_FindFloor
	void K2_ComputeFloorDist(struct FVector CapsuleLocation, float LineDistance, float SweepDistance, float SweepRadius, struct FFindFloorResult& FloorResult); // Function Engine.CharacterMovementComponent.K2_ComputeFloorDist
	bool IsWalking(); // Function Engine.CharacterMovementComponent.IsWalking
	bool IsWalkable(struct FHitResult& Hit); // Function Engine.CharacterMovementComponent.IsWalkable
	float GetValidPerchRadius(); // Function Engine.CharacterMovementComponent.GetValidPerchRadius
	float GetPerchRadiusThreshold(); // Function Engine.CharacterMovementComponent.GetPerchRadiusThreshold
	struct UPrimitiveComponent* GetMovementBase(); // Function Engine.CharacterMovementComponent.GetMovementBase
	float GetMinAnalogSpeed(); // Function Engine.CharacterMovementComponent.GetMinAnalogSpeed
	float GetMaxJumpHeightWithJumpTime(); // Function Engine.CharacterMovementComponent.GetMaxJumpHeightWithJumpTime
	float GetMaxJumpHeight(); // Function Engine.CharacterMovementComponent.GetMaxJumpHeight
	float GetMaxBrakingDeceleration(); // Function Engine.CharacterMovementComponent.GetMaxBrakingDeceleration
	float GetMaxAcceleration(); // Function Engine.CharacterMovementComponent.GetMaxAcceleration
	struct FVector GetLastUpdateVelocity(); // Function Engine.CharacterMovementComponent.GetLastUpdateVelocity
	struct FRotator GetLastUpdateRotation(); // Function Engine.CharacterMovementComponent.GetLastUpdateRotation
	struct FVector GetLastUpdateLocation(); // Function Engine.CharacterMovementComponent.GetLastUpdateLocation
	struct FVector GetImpartedMovementBaseVelocity(); // Function Engine.CharacterMovementComponent.GetImpartedMovementBaseVelocity
	struct FVector GetCurrentAcceleration(); // Function Engine.CharacterMovementComponent.GetCurrentAcceleration
	struct ACharacter* GetCharacterOwner(); // Function Engine.CharacterMovementComponent.GetCharacterOwner
	float GetAnalogInputModifier(); // Function Engine.CharacterMovementComponent.GetAnalogInputModifier
	void DisableMovement(); // Function Engine.CharacterMovementComponent.DisableMovement
	void ClearAccumulatedForces(); // Function Engine.CharacterMovementComponent.ClearAccumulatedForces
	void CapsuleTouched(struct UPrimitiveComponent* OverlappedComp, struct AActor* Other, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function Engine.CharacterMovementComponent.CapsuleTouched
	void CalcVelocity(float DeltaTime, float Friction, bool bFluid, float BrakingDeceleration); // Function Engine.CharacterMovementComponent.CalcVelocity
	void AddImpulse(struct FVector Impulse, bool bVelocityChange); // Function Engine.CharacterMovementComponent.AddImpulse
	void AddForce(struct FVector force); // Function Engine.CharacterMovementComponent.AddForce
}; 



// Class Engine.AnimNotifyState_TimedParticleEffect
// Size: 0x60(Inherited: 0x30) 
struct UAnimNotifyState_TimedParticleEffect : public UAnimNotifyState
{
	struct UParticleSystem* PSTemplate;  // 0x30(0x8)
	struct FName SocketName;  // 0x38(0x8)
	struct FVector LocationOffset;  // 0x40(0xC)
	struct FRotator RotationOffset;  // 0x4C(0xC)
	char pad_88_1 : 7;  // 0x58(0x1)
	bool bDestroyAtEnd : 1;  // 0x58(0x1)
	char pad_89[7];  // 0x59(0x7)

}; 



// Class Engine.DistributionFloatUniformCurve
// Size: 0x50(Inherited: 0x38) 
struct UDistributionFloatUniformCurve : public UDistributionFloat
{
	struct FInterpCurveVector2D ConstantCurve;  // 0x38(0x18)

}; 



// Class Engine.StereoLayerComponent
// Size: 0x2E0(Inherited: 0x200) 
struct UStereoLayerComponent : public USceneComponent
{
	char bLiveTexture : 1;  // 0x1F8(0x1)
	char bSupportsDepth : 1;  // 0x1F8(0x1)
	char bNoAlphaChannel : 1;  // 0x1F8(0x1)
	struct UTexture* Texture;  // 0x200(0x8)
	struct UTexture* LeftTexture;  // 0x208(0x8)
	char bQuadPreserveTextureRatio : 1;  // 0x210(0x1)
	char pad_528_1 : 4;  // 0x210(0x1)
	char pad_529[4];  // 0x211(0x4)
	struct FVector2D QuadSize;  // 0x214(0x8)
	struct FBox2D UVRect;  // 0x21C(0x14)
	float CylinderRadius;  // 0x230(0x4)
	float CylinderOverlayArc;  // 0x234(0x4)
	int32_t CylinderHeight;  // 0x238(0x4)
	struct FEquirectProps EquirectProps;  // 0x23C(0x48)
	char EStereoLayerType StereoLayerType;  // 0x284(0x1)
	char EStereoLayerShape StereoLayerShape;  // 0x285(0x1)
	char pad_646[2];  // 0x286(0x2)
	struct UStereoLayerShape* Shape;  // 0x288(0x8)
	int32_t Priority;  // 0x290(0x4)
	char pad_660[76];  // 0x294(0x4C)

	void SetUVRect(struct FBox2D InUVRect); // Function Engine.StereoLayerComponent.SetUVRect
	void SetTexture(struct UTexture* InTexture); // Function Engine.StereoLayerComponent.SetTexture
	void SetQuadSize(struct FVector2D InQuadSize); // Function Engine.StereoLayerComponent.SetQuadSize
	void SetPriority(int32_t InPriority); // Function Engine.StereoLayerComponent.SetPriority
	void SetLeftTexture(struct UTexture* InTexture); // Function Engine.StereoLayerComponent.SetLeftTexture
	void SetEquirectProps(struct FEquirectProps InScaleBiases); // Function Engine.StereoLayerComponent.SetEquirectProps
	void MarkTextureForUpdate(); // Function Engine.StereoLayerComponent.MarkTextureForUpdate
	struct FBox2D GetUVRect(); // Function Engine.StereoLayerComponent.GetUVRect
	struct UTexture* GetTexture(); // Function Engine.StereoLayerComponent.GetTexture
	struct FVector2D GetQuadSize(); // Function Engine.StereoLayerComponent.GetQuadSize
	int32_t GetPriority(); // Function Engine.StereoLayerComponent.GetPriority
	struct UTexture* GetLeftTexture(); // Function Engine.StereoLayerComponent.GetLeftTexture
}; 



// Class Engine.DataTableFunctionLibrary
// Size: 0x28(Inherited: 0x28) 
struct UDataTableFunctionLibrary : public UBlueprintFunctionLibrary
{

	void GetDataTableRowNames(struct UDataTable* Table, struct TArray<struct FName>& OutRowNames); // Function Engine.DataTableFunctionLibrary.GetDataTableRowNames
	bool GetDataTableRowFromName(struct UDataTable* Table, struct FName RowName, struct FTableRowBase& OutRow); // Function Engine.DataTableFunctionLibrary.GetDataTableRowFromName
	struct TArray<struct FString> GetDataTableColumnAsString(struct UDataTable* DataTable, struct FName PropertyName); // Function Engine.DataTableFunctionLibrary.GetDataTableColumnAsString
	void EvaluateCurveTableRow(struct UCurveTable* CurveTable, struct FName RowName, float InXY, char EEvaluateCurveTableResult& OutResult, float& OutXY, struct FString ContextString); // Function Engine.DataTableFunctionLibrary.EvaluateCurveTableRow
	bool DoesDataTableRowExist(struct UDataTable* Table, struct FName RowName); // Function Engine.DataTableFunctionLibrary.DoesDataTableRowExist
}; 



// Class Engine.SphereReflectionCapture
// Size: 0x230(Inherited: 0x228) 
struct ASphereReflectionCapture : public AReflectionCapture
{
	struct UDrawSphereComponent* DrawCaptureRadius;  // 0x228(0x8)

}; 



// Class Engine.InstancedStaticMeshComponent
// Size: 0x590(Inherited: 0x4E0) 
struct UInstancedStaticMeshComponent : public UStaticMeshComponent
{
	struct TArray<struct FInstancedStaticMeshInstanceData> PerInstanceSMData;  // 0x4E0(0x10)
	int32_t NumCustomDataFloats;  // 0x4F0(0x4)
	char pad_1268_1 : 7;  // 0x4F4(0x1)
	bool bKeepInstanceBufferCPUAccess : 1;  // 0x4F4(0x1)
	char pad_1269[3];  // 0x4F5(0x3)
	struct TArray<float> PerInstanceSMCustomData;  // 0x4F8(0x10)
	int32_t InstancingRandomSeed;  // 0x508(0x4)
	int32_t InstanceStartCullDistance;  // 0x50C(0x4)
	int32_t InstanceEndCullDistance;  // 0x510(0x4)
	char pad_1300[4];  // 0x514(0x4)
	struct TArray<int32_t> InstanceReorderTable;  // 0x518(0x10)
	char pad_1320[72];  // 0x528(0x48)
	int32_t NumPendingLightmaps;  // 0x570(0x4)
	char pad_1396[4];  // 0x574(0x4)
	struct TArray<struct FInstancedStaticMeshMappingInfo> CachedMappings;  // 0x578(0x10)
	char pad_1416[8];  // 0x588(0x8)

	bool UpdateInstanceTransform(int32_t InstanceIndex, struct FTransform& NewInstanceTransform, bool bWorldSpace, bool bMarkRenderStateDirty, bool bTeleport); // Function Engine.InstancedStaticMeshComponent.UpdateInstanceTransform
	bool SetCustomDataValue(int32_t InstanceIndex, int32_t CustomDataIndex, float CustomDataValue, bool bMarkRenderStateDirty); // Function Engine.InstancedStaticMeshComponent.SetCustomDataValue
	void SetCullDistances(int32_t StartCullDistance, int32_t EndCullDistance); // Function Engine.InstancedStaticMeshComponent.SetCullDistances
	bool RemoveInstance(int32_t InstanceIndex); // Function Engine.InstancedStaticMeshComponent.RemoveInstance
	bool GetInstanceTransform(int32_t InstanceIndex, struct FTransform& OutInstanceTransform, bool bWorldSpace); // Function Engine.InstancedStaticMeshComponent.GetInstanceTransform
	struct TArray<int32_t> GetInstancesOverlappingSphere(struct FVector& Center, float Radius, bool bSphereInWorldSpace); // Function Engine.InstancedStaticMeshComponent.GetInstancesOverlappingSphere
	struct TArray<int32_t> GetInstancesOverlappingBox(struct FBox& Box, bool bBoxInWorldSpace); // Function Engine.InstancedStaticMeshComponent.GetInstancesOverlappingBox
	int32_t GetInstanceCount(); // Function Engine.InstancedStaticMeshComponent.GetInstanceCount
	void ClearInstances(); // Function Engine.InstancedStaticMeshComponent.ClearInstances
	bool BatchUpdateInstancesTransforms(int32_t StartInstanceIndex, struct TArray<struct FTransform>& NewInstancesTransforms, bool bWorldSpace, bool bMarkRenderStateDirty, bool bTeleport); // Function Engine.InstancedStaticMeshComponent.BatchUpdateInstancesTransforms
	bool BatchUpdateInstancesTransform(int32_t StartInstanceIndex, int32_t NumInstances, struct FTransform& NewInstancesTransform, bool bWorldSpace, bool bMarkRenderStateDirty, bool bTeleport); // Function Engine.InstancedStaticMeshComponent.BatchUpdateInstancesTransform
	int32_t AddInstanceWorldSpace(struct FTransform& WorldTransform); // Function Engine.InstancedStaticMeshComponent.AddInstanceWorldSpace
	struct TArray<int32_t> AddInstances(struct TArray<struct FTransform>& InstanceTransforms, bool bShouldReturnIndices); // Function Engine.InstancedStaticMeshComponent.AddInstances
	int32_t AddInstance(struct FTransform& InstanceTransform); // Function Engine.InstancedStaticMeshComponent.AddInstance
}; 



// Class Engine.AnimMetaData
// Size: 0x28(Inherited: 0x28) 
struct UAnimMetaData : public UObject
{

}; 



// Class Engine.MaterialExpressionDecalLifetimeOpacity
// Size: 0x40(Inherited: 0x40) 
struct UMaterialExpressionDecalLifetimeOpacity : public UMaterialExpression
{

}; 



// Class Engine.ParticleModuleCollisionGPU
// Size: 0xA8(Inherited: 0x30) 
struct UParticleModuleCollisionGPU : public UParticleModuleCollisionBase
{
	struct FRawDistributionFloat Resilience;  // 0x30(0x30)
	struct FRawDistributionFloat ResilienceScaleOverLife;  // 0x60(0x30)
	float Friction;  // 0x90(0x4)
	float RandomSpread;  // 0x94(0x4)
	float RandomDistribution;  // 0x98(0x4)
	float RadiusScale;  // 0x9C(0x4)
	float RadiusBias;  // 0xA0(0x4)
	char EParticleCollisionResponse Response;  // 0xA4(0x1)
	char EParticleCollisionMode CollisionMode;  // 0xA5(0x1)
	char pad_166[2];  // 0xA6(0x2)

}; 



// Class Engine.MaterialParameterCollection
// Size: 0x70(Inherited: 0x28) 
struct UMaterialParameterCollection : public UObject
{
	struct FGuid StateId;  // 0x28(0x10)
	struct TArray<struct FCollectionScalarParameter> ScalarParameters;  // 0x38(0x10)
	struct TArray<struct FCollectionVectorParameter> VectorParameters;  // 0x48(0x10)
	char pad_88[24];  // 0x58(0x18)

}; 



// Class Engine.MaterialExpressionQualitySwitch
// Size: 0xA8(Inherited: 0x40) 
struct UMaterialExpressionQualitySwitch : public UMaterialExpression
{
	struct FExpressionInput Default;  // 0x40(0x14)
	struct FExpressionInput Inputs[4];  // 0x54(0x50)
	char pad_164[4];  // 0xA4(0x4)

}; 



// Class Engine.EngineSubsystem
// Size: 0x30(Inherited: 0x30) 
struct UEngineSubsystem : public UDynamicSubsystem
{

}; 



// Class Engine.InterpTrackInstVectorProp
// Size: 0x68(Inherited: 0x50) 
struct UInterpTrackInstVectorProp : public UInterpTrackInstProperty
{
	char pad_80[8];  // 0x50(0x8)
	struct FVector ResetVector;  // 0x58(0xC)
	char pad_100[4];  // 0x64(0x4)

}; 



// Class Engine.LocalPlayer
// Size: 0x258(Inherited: 0x48) 
struct ULocalPlayer : public UPlayer
{
	char pad_72[40];  // 0x48(0x28)
	struct UGameViewportClient* ViewportClient;  // 0x70(0x8)
	char pad_120[28];  // 0x78(0x1C)
	char EAspectRatioAxisConstraint AspectRatioAxisConstraint;  // 0x94(0x1)
	char pad_149[3];  // 0x95(0x3)
	APlayerController* PendingLevelPlayerControllerClass;  // 0x98(0x8)
	char bSentSplitJoin : 1;  // 0xA0(0x1)
	char pad_160_1 : 7;  // 0xA0(0x1)
	char pad_161[24];  // 0xA1(0x18)
	int32_t ControllerId;  // 0xB8(0x4)
	char pad_188[412];  // 0xBC(0x19C)

}; 



// Class Engine.MaterialExpressionPixelNormalWS
// Size: 0x40(Inherited: 0x40) 
struct UMaterialExpressionPixelNormalWS : public UMaterialExpression
{

}; 



// Class Engine.PlayerController
// Size: 0x570(Inherited: 0x298) 
struct APlayerController : public AController
{
	struct UPlayer* Player;  // 0x298(0x8)
	struct APawn* AcknowledgedPawn;  // 0x2A0(0x8)
	struct UInterpTrackInstDirector* ControllingDirTrackInst;  // 0x2A8(0x8)
	struct AHUD* MyHUD;  // 0x2B0(0x8)
	struct APlayerCameraManager* PlayerCameraManager;  // 0x2B8(0x8)
	APlayerCameraManager* PlayerCameraManagerClass;  // 0x2C0(0x8)
	char pad_712_1 : 7;  // 0x2C8(0x1)
	bool bAutoManageActiveCameraTarget : 1;  // 0x2C8(0x1)
	char pad_713[3];  // 0x2C9(0x3)
	struct FRotator TargetViewRotation;  // 0x2CC(0xC)
	char pad_728[12];  // 0x2D8(0xC)
	float SmoothTargetViewRotationSpeed;  // 0x2E4(0x4)
	char pad_744[8];  // 0x2E8(0x8)
	struct TArray<struct AActor*> HiddenActors;  // 0x2F0(0x10)
	struct TArray<struct TWeakObjectPtr<UPrimitiveComponent>> HiddenPrimitiveComponents;  // 0x300(0x10)
	char pad_784[4];  // 0x310(0x4)
	float LastSpectatorStateSynchTime;  // 0x314(0x4)
	struct FVector LastSpectatorSyncLocation;  // 0x318(0xC)
	struct FRotator LastSpectatorSyncRotation;  // 0x324(0xC)
	int32_t ClientCap;  // 0x330(0x4)
	char pad_820[4];  // 0x334(0x4)
	struct UCheatManager* CheatManager;  // 0x338(0x8)
	UCheatManager* CheatClass;  // 0x340(0x8)
	struct UPlayerInput* PlayerInput;  // 0x348(0x8)
	struct TArray<struct FActiveForceFeedbackEffect> ActiveForceFeedbackEffects;  // 0x350(0x10)
	char pad_864[112];  // 0x360(0x70)
	char pad_976_1 : 4;  // 0x3D0(0x1)
	char bPlayerIsWaiting : 1;  // 0x3D0(0x1)
	char pad_976_2 : 3;  // 0x3D0(0x1)
	char pad_977[4];  // 0x3D1(0x4)
	char NetPlayerIndex;  // 0x3D4(0x1)
	char pad_981[59];  // 0x3D5(0x3B)
	struct UNetConnection* PendingSwapConnection;  // 0x410(0x8)
	struct UNetConnection* NetConnection;  // 0x418(0x8)
	char pad_1056[12];  // 0x420(0xC)
	float InputYawScale;  // 0x42C(0x4)
	float InputPitchScale;  // 0x430(0x4)
	float InputRollScale;  // 0x434(0x4)
	char bShowMouseCursor : 1;  // 0x438(0x1)
	char bEnableClickEvents : 1;  // 0x438(0x1)
	char bEnableTouchEvents : 1;  // 0x438(0x1)
	char bEnableMouseOverEvents : 1;  // 0x438(0x1)
	char bEnableTouchOverEvents : 1;  // 0x438(0x1)
	char bForceFeedbackEnabled : 1;  // 0x438(0x1)
	char pad_1080_1 : 2;  // 0x438(0x1)
	char pad_1081[4];  // 0x439(0x4)
	float ForceFeedbackScale;  // 0x43C(0x4)
	struct TArray<struct FKey> ClickEventKeys;  // 0x440(0x10)
	char EMouseCursor DefaultMouseCursor;  // 0x450(0x1)
	char EMouseCursor CurrentMouseCursor;  // 0x451(0x1)
	char ECollisionChannel DefaultClickTraceChannel;  // 0x452(0x1)
	char ECollisionChannel CurrentClickTraceChannel;  // 0x453(0x1)
	float HitResultTraceDistance;  // 0x454(0x4)
	uint16_t SeamlessTravelCount;  // 0x458(0x2)
	uint16_t LastCompletedSeamlessTravelCount;  // 0x45A(0x2)
	char pad_1116[116];  // 0x45C(0x74)
	struct UInputComponent* InactiveStateInputComponent;  // 0x4D0(0x8)
	char pad_1240_1 : 2;  // 0x4D8(0x1)
	char bShouldPerformFullTickWhenPaused : 1;  // 0x4D8(0x1)
	char pad_1240_2 : 5;  // 0x4D8(0x1)
	char pad_1241[24];  // 0x4D9(0x18)
	struct UTouchInterface* CurrentTouchInterface;  // 0x4F0(0x8)
	char pad_1272[80];  // 0x4F8(0x50)
	struct ASpectatorPawn* SpectatorPawn;  // 0x548(0x8)
	char pad_1360[4];  // 0x550(0x4)
	char pad_1364_1 : 7;  // 0x554(0x1)
	bool bIsLocalPlayerController : 1;  // 0x554(0x1)
	char pad_1365[3];  // 0x555(0x3)
	struct FVector SpawnLocation;  // 0x558(0xC)
	char pad_1380[12];  // 0x564(0xC)

	bool WasInputKeyJustReleased(struct FKey Key); // Function Engine.PlayerController.WasInputKeyJustReleased
	bool WasInputKeyJustPressed(struct FKey Key); // Function Engine.PlayerController.WasInputKeyJustPressed
	void ToggleSpeaking(bool bInSpeaking); // Function Engine.PlayerController.ToggleSpeaking
	void TestServerLevelVisibilityChange(struct FName PackageName, struct FName Filename); // Function Engine.PlayerController.TestServerLevelVisibilityChange
	void SwitchLevel(struct FString URL); // Function Engine.PlayerController.SwitchLevel
	void StopHapticEffect(uint8_t  Hand); // Function Engine.PlayerController.StopHapticEffect
	void StartFire(char FireModeNum); // Function Engine.PlayerController.StartFire
	void SetVirtualJoystickVisibility(bool bVisible); // Function Engine.PlayerController.SetVirtualJoystickVisibility
	void SetViewTargetWithBlend(struct AActor* NewViewTarget, float BlendTime, char EViewTargetBlendFunction BlendFunc, float BlendExp, bool bLockOutgoing); // Function Engine.PlayerController.SetViewTargetWithBlend
	void SetName(struct FString S); // Function Engine.PlayerController.SetName
	void SetMouseLocation(int32_t X, int32_t Y); // Function Engine.PlayerController.SetMouseLocation
	void SetMouseCursorWidget(char EMouseCursor Cursor, struct UUserWidget* CursorWidget); // Function Engine.PlayerController.SetMouseCursorWidget
	void SetHapticsByValue(float Frequency, float Amplitude, uint8_t  Hand); // Function Engine.PlayerController.SetHapticsByValue
	void SetDisableHaptics(bool bNewDisabled); // Function Engine.PlayerController.SetDisableHaptics
	void SetControllerLightColor(struct FColor Color); // Function Engine.PlayerController.SetControllerLightColor
	void SetCinematicMode(bool bInCinematicMode, bool bHidePlayer, bool bAffectsHUD, bool bAffectsMovement, bool bAffectsTurning); // Function Engine.PlayerController.SetCinematicMode
	void SetAudioListenerOverride(struct USceneComponent* AttachToComponent, struct FVector Location, struct FRotator Rotation); // Function Engine.PlayerController.SetAudioListenerOverride
	void SetAudioListenerAttenuationOverride(struct USceneComponent* AttachToComponent, struct FVector AttenuationLocationOVerride); // Function Engine.PlayerController.SetAudioListenerAttenuationOverride
	void ServerViewSelf(struct FViewTargetTransitionParams TransitionParams); // Function Engine.PlayerController.ServerViewSelf
	void ServerViewPrevPlayer(); // Function Engine.PlayerController.ServerViewPrevPlayer
	void ServerViewNextPlayer(); // Function Engine.PlayerController.ServerViewNextPlayer
	void ServerVerifyViewTarget(); // Function Engine.PlayerController.ServerVerifyViewTarget
	void ServerUpdateMultipleLevelsVisibility(struct TArray<struct FUpdateLevelVisibilityLevelInfo> LevelVisibilities); // Function Engine.PlayerController.ServerUpdateMultipleLevelsVisibility
	void ServerUpdateLevelVisibility(struct FUpdateLevelVisibilityLevelInfo LevelVisibility); // Function Engine.PlayerController.ServerUpdateLevelVisibility
	void ServerUpdateCamera(struct FVector_NetQuantize CamLoc, int32_t CamPitchAndYaw); // Function Engine.PlayerController.ServerUpdateCamera
	void ServerUnmutePlayer(struct FUniqueNetIdRepl PlayerId); // Function Engine.PlayerController.ServerUnmutePlayer
	void ServerToggleAILogging(); // Function Engine.PlayerController.ServerToggleAILogging
	void ServerShortTimeout(); // Function Engine.PlayerController.ServerShortTimeout
	void ServerSetSpectatorWaiting(bool bWaiting); // Function Engine.PlayerController.ServerSetSpectatorWaiting
	void ServerSetSpectatorLocation(struct FVector NewLoc, struct FRotator NewRot); // Function Engine.PlayerController.ServerSetSpectatorLocation
	void ServerRestartPlayer(); // Function Engine.PlayerController.ServerRestartPlayer
	void ServerPause(); // Function Engine.PlayerController.ServerPause
	void ServerNotifyLoadedWorld(struct FName WorldPackageName); // Function Engine.PlayerController.ServerNotifyLoadedWorld
	void ServerMutePlayer(struct FUniqueNetIdRepl PlayerId); // Function Engine.PlayerController.ServerMutePlayer
	void ServerExecRPC(struct FString Msg); // Function Engine.PlayerController.ServerExecRPC
	void ServerExec(struct FString Msg); // Function Engine.PlayerController.ServerExec
	void ServerCheckClientPossessionReliable(); // Function Engine.PlayerController.ServerCheckClientPossessionReliable
	void ServerCheckClientPossession(); // Function Engine.PlayerController.ServerCheckClientPossession
	void ServerChangeName(struct FString S); // Function Engine.PlayerController.ServerChangeName
	void ServerCamera(struct FName NewMode); // Function Engine.PlayerController.ServerCamera
	void ServerAcknowledgePossession(struct APawn* P); // Function Engine.PlayerController.ServerAcknowledgePossession
	void SendToConsole(struct FString Command); // Function Engine.PlayerController.SendToConsole
	void RestartLevel(); // Function Engine.PlayerController.RestartLevel
	void ResetControllerLightColor(); // Function Engine.PlayerController.ResetControllerLightColor
	bool ProjectWorldLocationToScreen(struct FVector WorldLocation, struct FVector2D& ScreenLocation, bool bPlayerViewportRelative); // Function Engine.PlayerController.ProjectWorldLocationToScreen
	void PlayHapticEffect(struct UHapticFeedbackEffect_Base* HapticEffect, uint8_t  Hand, float Scale, bool bLoop); // Function Engine.PlayerController.PlayHapticEffect
	void PlayDynamicForceFeedback(float Intensity, float Duration, bool bAffectsLeftLarge, bool bAffectsLeftSmall, bool bAffectsRightLarge, bool bAffectsRightSmall, char EDynamicForceFeedbackAction Action, struct FLatentActionInfo LatentInfo); // Function Engine.PlayerController.PlayDynamicForceFeedback
	void Pause(); // Function Engine.PlayerController.Pause
	void OnServerStartedVisualLogger(bool bIsLogging); // Function Engine.PlayerController.OnServerStartedVisualLogger
	void LocalTravel(struct FString URL); // Function Engine.PlayerController.LocalTravel
	void K2_ClientPlayForceFeedback(struct UForceFeedbackEffect* ForceFeedbackEffect, struct FName Tag, bool bLooping, bool bIgnoreTimeDilation, bool bPlayWhilePaused); // Function Engine.PlayerController.K2_ClientPlayForceFeedback
	bool IsInputKeyDown(struct FKey Key); // Function Engine.PlayerController.IsInputKeyDown
	void GetViewportSize(int32_t& SizeX, int32_t& SizeY); // Function Engine.PlayerController.GetViewportSize
	struct ASpectatorPawn* GetSpectatorPawn(); // Function Engine.PlayerController.GetSpectatorPawn
	bool GetMousePosition(float& LocationX, float& LocationY); // Function Engine.PlayerController.GetMousePosition
	struct FVector GetInputVectorKeyState(struct FKey Key); // Function Engine.PlayerController.GetInputVectorKeyState
	void GetInputTouchState(char ETouchIndex FingerIndex, float& LocationX, float& LocationY, bool& bIsCurrentlyPressed); // Function Engine.PlayerController.GetInputTouchState
	void GetInputMouseDelta(float& DeltaX, float& DeltaY); // Function Engine.PlayerController.GetInputMouseDelta
	void GetInputMotionState(struct FVector& Tilt, struct FVector& RotationRate, struct FVector& Gravity, struct FVector& Acceleration); // Function Engine.PlayerController.GetInputMotionState
	float GetInputKeyTimeDown(struct FKey Key); // Function Engine.PlayerController.GetInputKeyTimeDown
	void GetInputAnalogStickState(char EControllerAnalogStick WhichStick, float& StickX, float& StickY); // Function Engine.PlayerController.GetInputAnalogStickState
	float GetInputAnalogKeyState(struct FKey Key); // Function Engine.PlayerController.GetInputAnalogKeyState
	struct AHUD* GetHUD(); // Function Engine.PlayerController.GetHUD
	bool GetHitResultUnderFingerForObjects(char ETouchIndex FingerIndex, struct TArray<char EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, struct FHitResult& HitResult); // Function Engine.PlayerController.GetHitResultUnderFingerForObjects
	bool GetHitResultUnderFingerByChannel(char ETouchIndex FingerIndex, char ETraceTypeQuery TraceChannel, bool bTraceComplex, struct FHitResult& HitResult); // Function Engine.PlayerController.GetHitResultUnderFingerByChannel
	bool GetHitResultUnderFinger(char ETouchIndex FingerIndex, char ECollisionChannel TraceChannel, bool bTraceComplex, struct FHitResult& HitResult); // Function Engine.PlayerController.GetHitResultUnderFinger
	bool GetHitResultUnderCursorForObjects(struct TArray<char EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, struct FHitResult& HitResult); // Function Engine.PlayerController.GetHitResultUnderCursorForObjects
	bool GetHitResultUnderCursorByChannel(char ETraceTypeQuery TraceChannel, bool bTraceComplex, struct FHitResult& HitResult); // Function Engine.PlayerController.GetHitResultUnderCursorByChannel
	bool GetHitResultUnderCursor(char ECollisionChannel TraceChannel, bool bTraceComplex, struct FHitResult& HitResult); // Function Engine.PlayerController.GetHitResultUnderCursor
	struct FVector GetFocalLocation(); // Function Engine.PlayerController.GetFocalLocation
	void FOV(float NewFOV); // Function Engine.PlayerController.FOV
	void EnableCheats(); // Function Engine.PlayerController.EnableCheats
	bool DeprojectScreenPositionToWorld(float ScreenX, float ScreenY, struct FVector& WorldLocation, struct FVector& WorldDirection); // Function Engine.PlayerController.DeprojectScreenPositionToWorld
	bool DeprojectMousePositionToWorld(struct FVector& WorldLocation, struct FVector& WorldDirection); // Function Engine.PlayerController.DeprojectMousePositionToWorld
	void ConsoleKey(struct FKey Key); // Function Engine.PlayerController.ConsoleKey
	void ClientWasKicked(struct FText KickReason); // Function Engine.PlayerController.ClientWasKicked
	void ClientVoiceHandshakeComplete(); // Function Engine.PlayerController.ClientVoiceHandshakeComplete
	void ClientUpdateMultipleLevelsStreamingStatus(struct TArray<struct FUpdateLevelStreamingLevelStatus> LevelStatuses); // Function Engine.PlayerController.ClientUpdateMultipleLevelsStreamingStatus
	void ClientUpdateLevelStreamingStatus(struct FName PackageName, bool bNewShouldBeLoaded, bool bNewShouldBeVisible, bool bNewShouldBlockOnLoad, int32_t LODIndex); // Function Engine.PlayerController.ClientUpdateLevelStreamingStatus
	void ClientUnmutePlayer(struct FUniqueNetIdRepl PlayerId); // Function Engine.PlayerController.ClientUnmutePlayer
	void ClientTravelInternal(struct FString URL, char ETravelType TravelType, bool bSeamless, struct FGuid MapPackageGuid); // Function Engine.PlayerController.ClientTravelInternal
	void ClientTravel(struct FString URL, char ETravelType TravelType, bool bSeamless, struct FGuid MapPackageGuid); // Function Engine.PlayerController.ClientTravel
	void ClientTeamMessage(struct APlayerState* SenderPlayerState, struct FString S, struct FName Type, float MsgLifeTime); // Function Engine.PlayerController.ClientTeamMessage
	void ClientStopForceFeedback(struct UForceFeedbackEffect* ForceFeedbackEffect, struct FName Tag); // Function Engine.PlayerController.ClientStopForceFeedback
	void ClientStopCameraShakesFromSource(struct UCameraShakeSourceComponent* SourceComponent, bool bImmediately); // Function Engine.PlayerController.ClientStopCameraShakesFromSource
	void ClientStopCameraShake(UCameraShakeBase* Shake, bool bImmediately); // Function Engine.PlayerController.ClientStopCameraShake
	void ClientStopCameraAnim(struct UCameraAnim* AnimToStop); // Function Engine.PlayerController.ClientStopCameraAnim
	void ClientStartOnlineSession(); // Function Engine.PlayerController.ClientStartOnlineSession
	void ClientStartCameraShakeFromSource(UCameraShakeBase* Shake, struct UCameraShakeSourceComponent* SourceComponent); // Function Engine.PlayerController.ClientStartCameraShakeFromSource
	void ClientStartCameraShake(UCameraShakeBase* Shake, float Scale, uint8_t  PlaySpace, struct FRotator UserPlaySpaceRot); // Function Engine.PlayerController.ClientStartCameraShake
	void ClientSpawnCameraLensEffect(AEmitterCameraLensEffectBase* LensEffectEmitterClass); // Function Engine.PlayerController.ClientSpawnCameraLensEffect
	void ClientSetViewTarget(struct AActor* A, struct FViewTargetTransitionParams TransitionParams); // Function Engine.PlayerController.ClientSetViewTarget
	void ClientSetSpectatorWaiting(bool bWaiting); // Function Engine.PlayerController.ClientSetSpectatorWaiting
	void ClientSetHUD(AHUD* NewHUDClass); // Function Engine.PlayerController.ClientSetHUD
	void ClientSetForceMipLevelsToBeResident(struct UMaterialInterface* Material, float ForceDuration, int32_t CinematicTextureGroups); // Function Engine.PlayerController.ClientSetForceMipLevelsToBeResident
	void ClientSetCinematicMode(bool bInCinematicMode, bool bAffectsMovement, bool bAffectsTurning, bool bAffectsHUD); // Function Engine.PlayerController.ClientSetCinematicMode
	void ClientSetCameraMode(struct FName NewCamMode); // Function Engine.PlayerController.ClientSetCameraMode
	void ClientSetCameraFade(bool bEnableFading, struct FColor FadeColor, struct FVector2D FadeAlpha, float FadeTime, bool bFadeAudio, bool bHoldWhenFinished); // Function Engine.PlayerController.ClientSetCameraFade
	void ClientSetBlockOnAsyncLoading(); // Function Engine.PlayerController.ClientSetBlockOnAsyncLoading
	void ClientReturnToMainMenuWithTextReason(struct FText ReturnReason); // Function Engine.PlayerController.ClientReturnToMainMenuWithTextReason
	void ClientReturnToMainMenu(struct FString ReturnReason); // Function Engine.PlayerController.ClientReturnToMainMenu
	void ClientRetryClientRestart(struct APawn* NewPawn); // Function Engine.PlayerController.ClientRetryClientRestart
	void ClientRestart(struct APawn* NewPawn); // Function Engine.PlayerController.ClientRestart
	void ClientReset(); // Function Engine.PlayerController.ClientReset
	void ClientRepObjRef(struct UObject* Object); // Function Engine.PlayerController.ClientRepObjRef
	void ClientReceiveLocalizedMessage(ULocalMessage* Message, int32_t Switch, struct APlayerState* RelatedPlayerState_2, struct APlayerState* RelatedPlayerState_3, struct UObject* OptionalObject); // Function Engine.PlayerController.ClientReceiveLocalizedMessage
	void ClientPrestreamTextures(struct AActor* ForcedActor, float ForceDuration, bool bEnableStreaming, int32_t CinematicTextureGroups); // Function Engine.PlayerController.ClientPrestreamTextures
	void ClientPrepareMapChange(struct FName LevelName, bool bFirst, bool bLast); // Function Engine.PlayerController.ClientPrepareMapChange
	void ClientPlaySoundAtLocation(struct USoundBase* Sound, struct FVector Location, float VolumeMultiplier, float PitchMultiplier); // Function Engine.PlayerController.ClientPlaySoundAtLocation
	void ClientPlaySound(struct USoundBase* Sound, float VolumeMultiplier, float PitchMultiplier); // Function Engine.PlayerController.ClientPlaySound
	void ClientPlayForceFeedback_Internal(struct UForceFeedbackEffect* ForceFeedbackEffect, struct FForceFeedbackParameters Params); // Function Engine.PlayerController.ClientPlayForceFeedback_Internal
	void ClientPlayCameraAnim(struct UCameraAnim* AnimToPlay, float Scale, float Rate, float BlendInTime, float BlendOutTime, bool bLoop, bool bRandomStartTime, uint8_t  Space, struct FRotator CustomPlaySpace); // Function Engine.PlayerController.ClientPlayCameraAnim
	void ClientMutePlayer(struct FUniqueNetIdRepl PlayerId); // Function Engine.PlayerController.ClientMutePlayer
	void ClientMessage(struct FString S, struct FName Type, float MsgLifeTime); // Function Engine.PlayerController.ClientMessage
	void ClientIgnoreMoveInput(bool bIgnore); // Function Engine.PlayerController.ClientIgnoreMoveInput
	void ClientIgnoreLookInput(bool bIgnore); // Function Engine.PlayerController.ClientIgnoreLookInput
	void ClientGotoState(struct FName NewState); // Function Engine.PlayerController.ClientGotoState
	void ClientGameEnded(struct AActor* EndGameFocus, bool bIsWinner); // Function Engine.PlayerController.ClientGameEnded
	void ClientForceGarbageCollection(); // Function Engine.PlayerController.ClientForceGarbageCollection
	void ClientFlushLevelStreaming(); // Function Engine.PlayerController.ClientFlushLevelStreaming
	void ClientEndOnlineSession(); // Function Engine.PlayerController.ClientEndOnlineSession
	void ClientEnableNetworkVoice(bool bEnable); // Function Engine.PlayerController.ClientEnableNetworkVoice
	void ClientCommitMapChange(); // Function Engine.PlayerController.ClientCommitMapChange
	void ClientClearCameraLensEffects(); // Function Engine.PlayerController.ClientClearCameraLensEffects
	void ClientCapBandwidth(int32_t Cap); // Function Engine.PlayerController.ClientCapBandwidth
	void ClientCancelPendingMapChange(); // Function Engine.PlayerController.ClientCancelPendingMapChange
	void ClientAddTextureStreamingLoc(struct FVector InLoc, float Duration, bool bOverrideLocation); // Function Engine.PlayerController.ClientAddTextureStreamingLoc
	void ClearAudioListenerOverride(); // Function Engine.PlayerController.ClearAudioListenerOverride
	void ClearAudioListenerAttenuationOverride(); // Function Engine.PlayerController.ClearAudioListenerAttenuationOverride
	bool CanRestartPlayer(); // Function Engine.PlayerController.CanRestartPlayer
	void Camera(struct FName NewMode); // Function Engine.PlayerController.Camera
	void AddYawInput(float Val); // Function Engine.PlayerController.AddYawInput
	void AddRollInput(float Val); // Function Engine.PlayerController.AddRollInput
	void AddPitchInput(float Val); // Function Engine.PlayerController.AddPitchInput
	void ActivateTouchInterface(struct UTouchInterface* NewTouchInterface); // Function Engine.PlayerController.ActivateTouchInterface
}; 



// Class Engine.BlueprintExtension
// Size: 0x28(Inherited: 0x28) 
struct UBlueprintExtension : public UObject
{

}; 



// Class Engine.CompositeCurveTable
// Size: 0xC8(Inherited: 0xA0) 
struct UCompositeCurveTable : public UCurveTable
{
	struct TArray<struct UCurveTable*> ParentTables;  // 0xA0(0x10)
	struct TArray<struct UCurveTable*> OldParentTables;  // 0xB0(0x10)
	char pad_192[8];  // 0xC0(0x8)

}; 



// Class Engine.ChildActorComponent
// Size: 0x230(Inherited: 0x200) 
struct UChildActorComponent : public USceneComponent
{
	AActor* ChildActorClass;  // 0x1F8(0x8)
	struct AActor* ChildActor;  // 0x200(0x8)
	struct AActor* ChildActorTemplate;  // 0x208(0x8)
	char pad_536[24];  // 0x218(0x18)

	void SetChildActorClass(AActor* InClass); // Function Engine.ChildActorComponent.SetChildActorClass
}; 



// Class Engine.Interface_ActorSubobject
// Size: 0x28(Inherited: 0x28) 
struct UInterface_ActorSubobject : public UInterface
{

}; 



