#pragma once 
#include <Slate_Structs.h>
 
 
 
// Class Slate.EditableTextBoxWidgetStyle
// Size: 0x828(Inherited: 0x30) 
struct UEditableTextBoxWidgetStyle : public USlateWidgetStyleContainerBase
{
	struct FEditableTextBoxStyle EditableTextBoxStyle;  // 0x30(0x7F8)

}; 



// Class Slate.ButtonWidgetStyle
// Size: 0x2A8(Inherited: 0x30) 
struct UButtonWidgetStyle : public USlateWidgetStyleContainerBase
{
	struct FButtonStyle ButtonStyle;  // 0x30(0x278)

}; 



// Class Slate.CheckBoxWidgetStyle
// Size: 0x5B0(Inherited: 0x30) 
struct UCheckBoxWidgetStyle : public USlateWidgetStyleContainerBase
{
	struct FCheckBoxStyle CheckBoxStyle;  // 0x30(0x580)

}; 



// Class Slate.ProgressWidgetStyle
// Size: 0x1D0(Inherited: 0x30) 
struct UProgressWidgetStyle : public USlateWidgetStyleContainerBase
{
	struct FProgressBarStyle ProgressBarStyle;  // 0x30(0x1A0)

}; 



// Class Slate.EditableTextWidgetStyle
// Size: 0x250(Inherited: 0x30) 
struct UEditableTextWidgetStyle : public USlateWidgetStyleContainerBase
{
	struct FEditableTextStyle EditableTextStyle;  // 0x30(0x220)

}; 



// Class Slate.ComboBoxWidgetStyle
// Size: 0x420(Inherited: 0x30) 
struct UComboBoxWidgetStyle : public USlateWidgetStyleContainerBase
{
	struct FComboBoxStyle ComboBoxStyle;  // 0x30(0x3F0)

}; 



// Class Slate.SlateSettings
// Size: 0x30(Inherited: 0x28) 
struct USlateSettings : public UObject
{
	char pad_40_1 : 7;  // 0x28(0x1)
	bool bExplicitCanvasChildZOrder : 1;  // 0x28(0x1)
	char pad_41[7];  // 0x29(0x7)

}; 



// Class Slate.ScrollBarWidgetStyle
// Size: 0x500(Inherited: 0x30) 
struct UScrollBarWidgetStyle : public USlateWidgetStyleContainerBase
{
	struct FScrollBarStyle ScrollBarStyle;  // 0x30(0x4D0)

}; 



// Class Slate.ComboButtonWidgetStyle
// Size: 0x3E8(Inherited: 0x30) 
struct UComboButtonWidgetStyle : public USlateWidgetStyleContainerBase
{
	struct FComboButtonStyle ComboButtonStyle;  // 0x30(0x3B8)

}; 



// Class Slate.ScrollBoxWidgetStyle
// Size: 0x258(Inherited: 0x30) 
struct UScrollBoxWidgetStyle : public USlateWidgetStyleContainerBase
{
	struct FScrollBoxStyle ScrollBoxStyle;  // 0x30(0x228)

}; 



// Class Slate.SpinBoxWidgetStyle
// Size: 0x318(Inherited: 0x30) 
struct USpinBoxWidgetStyle : public USlateWidgetStyleContainerBase
{
	struct FSpinBoxStyle SpinBoxStyle;  // 0x30(0x2E8)

}; 



// Class Slate.TextBlockWidgetStyle
// Size: 0x2A0(Inherited: 0x30) 
struct UTextBlockWidgetStyle : public USlateWidgetStyleContainerBase
{
	struct FTextBlockStyle TextBlockStyle;  // 0x30(0x270)

}; 



// Class Slate.ToolMenuBase
// Size: 0x28(Inherited: 0x28) 
struct UToolMenuBase : public UObject
{

}; 



