#pragma once 
#include <UI_CookingUtilityFilterDropdown_Content_Structs.h>
 
 
 
// WidgetBlueprintGeneratedClass UI_CookingUtilityFilterDropdown_Content.UI_CookingUtilityFilterDropdown_Content_C
// Size: 0x2C0(Inherited: 0x268) 
struct UUI_CookingUtilityFilterDropdown_Content_C : public UVerticalScrollBoxDropdownContent
{
	struct UUI_SimpleTextDropdownEntryWithCheckbox_C* UI_SimpleTextDropdownEntryWithCheckbox;  // 0x268(0x8)
	struct UUI_SimpleTextDropdownEntryWithCheckbox_C* UI_SimpleTextDropdownEntryWithCheckbox_2;  // 0x270(0x8)
	struct UUI_SimpleTextDropdownEntryWithCheckbox_C* UI_SimpleTextDropdownEntryWithCheckbox_3;  // 0x278(0x8)
	struct UUI_SimpleTextDropdownEntryWithCheckbox_C* UI_SimpleTextDropdownEntryWithCheckbox_4;  // 0x280(0x8)
	struct UUI_SimpleTextDropdownEntryWithCheckbox_C* UI_SimpleTextDropdownEntryWithCheckbox_5;  // 0x288(0x8)
	struct UUI_SimpleTextDropdownEntryWithCheckbox_C* UI_SimpleTextDropdownEntryWithCheckbox_6;  // 0x290(0x8)
	struct UUI_SimpleTextDropdownEntryWithCheckbox_C* UI_SimpleTextDropdownEntryWithCheckbox_7;  // 0x298(0x8)
	struct UUI_SimpleTextDropdownEntryWithCheckbox_C* UI_SimpleTextDropdownEntryWithCheckbox_8;  // 0x2A0(0x8)
	struct UUI_SimpleTextDropdownEntryWithCheckbox_C* UI_SimpleTextDropdownEntryWithCheckbox_9;  // 0x2A8(0x8)
	struct UUI_SimpleTextDropdownEntryWithCheckbox_C* UI_SimpleTextDropdownEntryWithCheckbox_10;  // 0x2B0(0x8)
	struct UUI_SimpleTextDropdownEntryWithCheckbox_C* UI_SimpleTextDropdownEntryWithCheckbox_11;  // 0x2B8(0x8)

}; 



