#pragma once 
#include <UI_CookingRecipesPanel_Structs.h>
 
 
 
// WidgetBlueprintGeneratedClass UI_CookingRecipesPanel.UI_CookingRecipesPanel_C
// Size: 0x430(Inherited: 0x380) 
struct UUI_CookingRecipesPanel_C : public UCookingRecipesPanel
{
	struct UUI_CookingCategoryButton_C* _btnBBQGrill;  // 0x380(0x8)
	struct UUI_CookingCategoryButton_C* _btnBBQGrill_Rice;  // 0x388(0x8)
	struct UUI_CookingCategoryButton_C* _btnCakes;  // 0x390(0x8)
	struct UUI_CookingCategoryButton_C* _btnCasseroles;  // 0x398(0x8)
	struct UUI_CookingCategoryButton_C* _btnDrinks;  // 0x3A0(0x8)
	struct UUI_CookingCategoryButton_C* _btnGrilledMeatVegetables;  // 0x3A8(0x8)
	struct UUI_CookingCategoryButton_C* _btnPasta;  // 0x3B0(0x8)
	struct UUI_CookingCategoryButton_C* _btnPizza;  // 0x3B8(0x8)
	struct UUI_CookingCategoryButton_C* _btnRice;  // 0x3C0(0x8)
	struct UUI_CookingCategoryButton_C* _btnSalads;  // 0x3C8(0x8)
	struct UUI_CookingCategoryButton_C* _btnSkewers;  // 0x3D0(0x8)
	struct UUI_CookingCategoryButton_C* _btnSmokedSlowCooked;  // 0x3D8(0x8)
	struct UUI_CookingCategoryButton_C* _btnSoups;  // 0x3E0(0x8)
	struct UUI_CookingCategoryButton_C* _btnSpitRoasts;  // 0x3E8(0x8)
	struct UUI_CookingCategoryButton_C* _btnStews;  // 0x3F0(0x8)
	struct UUI_CookingCategoryButton_C* _btnUnderTheBell;  // 0x3F8(0x8)
	struct UCookingRecipeCategoryPanel* _catAll;  // 0x400(0x8)
	struct UCookingRecipeCategoryPanel* _catBBQGrill;  // 0x408(0x8)
	struct UUI_CookingRecipeButton_C* UI_CookingRecipeButton;  // 0x410(0x8)
	struct UUI_CookingRecipeButton_C* UI_CookingRecipeButton_2;  // 0x418(0x8)
	struct UUI_CookingRecipeButton_C* UI_CookingRecipeButton_3;  // 0x420(0x8)
	struct UUI_CookingRecipeButton_C* UI_CookingRecipeButton_4;  // 0x428(0x8)

}; 



