#pragma once 
#include <UI_CookingCategoryDropdown_Content_Structs.h>
 
 
 
// WidgetBlueprintGeneratedClass UI_CookingCategoryDropdown_Content.UI_CookingCategoryDropdown_Content_C
// Size: 0x2C0(Inherited: 0x268) 
struct UUI_CookingCategoryDropdown_Content_C : public UVerticalScrollBoxDropdownContent
{
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry;  // 0x268(0x8)
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_2;  // 0x270(0x8)
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_3;  // 0x278(0x8)
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_4;  // 0x280(0x8)
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_5;  // 0x288(0x8)
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_6;  // 0x290(0x8)
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_7;  // 0x298(0x8)
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_8;  // 0x2A0(0x8)
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_9;  // 0x2A8(0x8)
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_10;  // 0x2B0(0x8)
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_11;  // 0x2B8(0x8)

}; 



