#pragma once 
#include "SDK.h" 
 
 
// Function UI_CustomZoneSettings_HandlingMethodSelector.UI_CustomZoneSettings_HandlingMethodSelector_C.GetIgnoreToolTipWidget
// Size: 0x28(Inherited: 0x0) 
struct FGetIgnoreToolTipWidget
{
	struct UWidget* ReturnValue;  // 0x0(0x8)
	struct FText CallFunc_GetHandlingMethodDescription_ReturnValue;  // 0x8(0x18)
	struct UUI_CustomZoneSettings_ToolTip_C* CallFunc_Create_ReturnValue;  // 0x20(0x8)

}; 
// Function UI_CustomZoneSettings_HandlingMethodSelector.UI_CustomZoneSettings_HandlingMethodSelector_C.GetBlockToolTipWidget
// Size: 0x28(Inherited: 0x0) 
struct FGetBlockToolTipWidget
{
	struct UWidget* ReturnValue;  // 0x0(0x8)
	struct FText CallFunc_GetHandlingMethodDescription_ReturnValue;  // 0x8(0x18)
	struct UUI_CustomZoneSettings_ToolTip_C* CallFunc_Create_ReturnValue;  // 0x20(0x8)

}; 
// Function UI_CustomZoneSettings_HandlingMethodSelector.UI_CustomZoneSettings_HandlingMethodSelector_C.GetAllowToolTipWidget
// Size: 0x28(Inherited: 0x0) 
struct FGetAllowToolTipWidget
{
	struct UWidget* ReturnValue;  // 0x0(0x8)
	struct FText CallFunc_GetHandlingMethodDescription_ReturnValue;  // 0x8(0x18)
	struct UUI_CustomZoneSettings_ToolTip_C* CallFunc_Create_ReturnValue;  // 0x20(0x8)

}; 
// Function UI_CustomZoneSettings_HandlingMethodSelector.UI_CustomZoneSettings_HandlingMethodSelector_C.GetToolTipWidget
// Size: 0x10(Inherited: 0x0) 
struct FGetToolTipWidget
{
	struct UWidget* ReturnValue;  // 0x0(0x8)
	struct UUI_CustomZoneSettings_ToolTip_C* CallFunc_Create_ReturnValue;  // 0x8(0x8)

}; 
