#pragma once 
#include "SDK.h" 
 
 
// Function UI_CustomZoneSettings_Region.UI_CustomZoneSettings_Region_C.GetToolTipWidget
// Size: 0x48(Inherited: 0x0) 
struct FGetToolTipWidget
{
	struct UWidget* ReturnValue;  // 0x0(0x8)
	struct UUI_CustomZoneSettings_ToolTip_C* CallFunc_Create_ReturnValue;  // 0x8(0x8)
	struct FText Temp_text_Variable;  // 0x10(0x18)
	uint8_t  CallFunc_GetDefaultZoneState_ReturnValue;  // 0x28(0x1)
	char pad_41_1 : 7;  // 0x29(0x1)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue : 1;  // 0x29(0x1)
	uint8_t  Temp_byte_Variable;  // 0x2A(0x1)
	char pad_43[5];  // 0x2B(0x5)
	struct FText K2Node_Select_Default;  // 0x30(0x18)

}; 
