#pragma once 
#include <UI_CookingRecipeDetails_Structs.h>
 
 
 
// WidgetBlueprintGeneratedClass UI_CookingRecipeDetails.UI_CookingRecipeDetails_C
// Size: 0x3A8(Inherited: 0x308) 
struct UUI_CookingRecipeDetails_C : public UCookingRecipeDetailsWidget
{
	struct UImage* Image_637;  // 0x308(0x8)
	struct UUI_CookingIngredientInfoWidget_C* UI_CookingIngredientInfoWidget;  // 0x310(0x8)
	struct UUI_CookingIngredientInfoWidget_C* UI_CookingIngredientInfoWidget_2;  // 0x318(0x8)
	struct UUI_CookingIngredientInfoWidget_C* UI_CookingIngredientInfoWidget_3;  // 0x320(0x8)
	struct UUI_CookingIngredientInfoWidget_C* UI_CookingIngredientInfoWidget_4;  // 0x328(0x8)
	struct UUI_CookingIngredientInfoWidget_C* UI_CookingIngredientInfoWidget_5;  // 0x330(0x8)
	struct UUI_CookingIngredientInfoWidget_C* UI_CookingIngredientInfoWidget_6;  // 0x338(0x8)
	struct UUI_CookingIngredientInfoWidget_C* UI_CookingIngredientInfoWidget_7;  // 0x340(0x8)
	struct UUI_CookingIngredientInfoWidget_C* UI_CookingIngredientInfoWidget_8;  // 0x348(0x8)
	struct UUI_CookingIngredientInfoWidget_C* UI_CookingIngredientInfoWidget_9;  // 0x350(0x8)
	struct UUI_CookingIngredientInfoWidget_C* UI_CookingIngredientInfoWidget_10;  // 0x358(0x8)
	struct UUI_PossibleCookingIngredientWidget_C* UI_PossibleCookingIngredientWidget;  // 0x360(0x8)
	struct UUI_PossibleCookingIngredientWidget_C* UI_PossibleCookingIngredientWidget_2;  // 0x368(0x8)
	struct UUI_PossibleCookingIngredientWidget_C* UI_PossibleCookingIngredientWidget_3;  // 0x370(0x8)
	struct UUI_PossibleCookingIngredientWidget_C* UI_PossibleCookingIngredientWidget_4;  // 0x378(0x8)
	struct UUI_PossibleCookingIngredientWidget_C* UI_PossibleCookingIngredientWidget_5;  // 0x380(0x8)
	struct UUI_PossibleCookingIngredientWidget_C* UI_PossibleCookingIngredientWidget_6;  // 0x388(0x8)
	struct UUI_PossibleCookingIngredientWidget_C* UI_PossibleCookingIngredientWidget_7;  // 0x390(0x8)
	struct UUI_PossibleCookingIngredientWidget_C* UI_PossibleCookingIngredientWidget_8;  // 0x398(0x8)
	struct UUI_PossibleCookingIngredientWidget_C* UI_PossibleCookingIngredientWidget_9;  // 0x3A0(0x8)

}; 



