#pragma once 
#include <UI_DialLockWidget_Structs.h>
 
 
 
// WidgetBlueprintGeneratedClass UI_DialLockWidget.UI_DialLockWidget_C
// Size: 0x2E0(Inherited: 0x2A0) 
struct UUI_DialLockWidget_C : public UDialLockWidget
{
	struct UImage* Image;  // 0x2A0(0x8)
	struct UImage* Image_62;  // 0x2A8(0x8)
	struct UCanvasPanel* InfoPanelSecondary;  // 0x2B0(0x8)
	struct URetainerBox* MaskRetainerBox;  // 0x2B8(0x8)
	struct UImage* RenderedMinigame;  // 0x2C0(0x8)
	struct UImage* TextBackground;  // 0x2C8(0x8)
	struct UCircularThrobber* Throbber;  // 0x2D0(0x8)
	struct UImage* ThrobberBackground;  // 0x2D8(0x8)

}; 



