#pragma once 
#include <UI_DoorUpgrade_Structs.h>
 
 
 
// WidgetBlueprintGeneratedClass UI_DoorUpgrade.UI_DoorUpgrade_C
// Size: 0x3F8(Inherited: 0x360) 
struct UUI_DoorUpgrade_C : public UDoorUpgradeWidget
{
	struct UImage* CraftingTitle;  // 0x360(0x8)
	struct UImage* CraftingTitle_2;  // 0x368(0x8)
	struct UImage* CraftingTitle_3;  // 0x370(0x8)
	struct UImage* CraftingTitle_4;  // 0x378(0x8)
	struct UImage* Image;  // 0x380(0x8)
	struct UImage* Image_1;  // 0x388(0x8)
	struct UImage* Image_2;  // 0x390(0x8)
	struct UImage* Image_3;  // 0x398(0x8)
	struct UTextBlock* TitleText;  // 0x3A0(0x8)
	struct UTextBlock* TitleText_2;  // 0x3A8(0x8)
	struct UTextBlock* TitleText_5;  // 0x3B0(0x8)
	struct UTextBlock* TitleText_9;  // 0x3B8(0x8)
	struct UUI_DoorBCULockUpgradeSlot_C* UI_DoorBCULockUpgradeSlot2;  // 0x3C0(0x8)
	struct UUI_DoorRemoteSensorUpgradeSlot_C* UI_DoorRemoteSensorUpgradeSlot_3;  // 0x3C8(0x8)
	struct UUI_DoorSecurityUpgradeSlot_C* UI_DoorSecurityUpgradeSlot_2;  // 0x3D0(0x8)
	struct UUI_DoorSecurityUpgradeSlot_C* UI_DoorSecurityUpgradeSlot_3;  // 0x3D8(0x8)
	struct UUI_DoorUpgradeSlot_C* UI_DoorUpgradeSlot;  // 0x3E0(0x8)
	struct UUI_DoorUpgradeSlot_C* UI_DoorUpgradeSlot_1;  // 0x3E8(0x8)
	struct UUI_DoorUpgradeSlot_C* UI_DoorUpgradeSlot_2;  // 0x3F0(0x8)

}; 



