#pragma once 
#include <UI_FoodTooltipPanelSingleUse_Structs.h>
 
 
 
// WidgetBlueprintGeneratedClass UI_FoodTooltipPanelSingleUse.UI_FoodTooltipPanelSingleUse_C
// Size: 0x448(Inherited: 0x2B0) 
struct UUI_FoodTooltipPanelSingleUse_C : public UItemTooltipPanel
{
	struct UImage* Image_1;  // 0x2B0(0x8)
	struct UImage* Image_2;  // 0x2B8(0x8)
	struct UImage* Image_3;  // 0x2C0(0x8)
	struct UImage* Image_5;  // 0x2C8(0x8)
	struct UImage* Image_6;  // 0x2D0(0x8)
	struct UImage* Image_7;  // 0x2D8(0x8)
	struct UUI_TooltipOverviewTextElement_C* UI_TooltipOverviewTextElement;  // 0x2E0(0x8)
	struct UUI_TooltipOverviewTextElement_C* UI_TooltipOverviewTextElement_C_1;  // 0x2E8(0x8)
	struct UUI_TooltipOverviewTextElement_C* UI_TooltipOverviewTextElement_C_2;  // 0x2F0(0x8)
	struct UUI_TooltipOverviewTextElement_C* UI_TooltipOverviewTextElement_C_3;  // 0x2F8(0x8)
	struct UUI_TooltipOverviewTextElement_C* UI_TooltipOverviewTextElement_C_4;  // 0x300(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement;  // 0x308(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_2;  // 0x310(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_1;  // 0x318(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_2;  // 0x320(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_3;  // 0x328(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_4;  // 0x330(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_5;  // 0x338(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_6;  // 0x340(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_7;  // 0x348(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_8;  // 0x350(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_9;  // 0x358(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_10;  // 0x360(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_11;  // 0x368(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_12;  // 0x370(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_13;  // 0x378(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_14;  // 0x380(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_15;  // 0x388(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_16;  // 0x390(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_17;  // 0x398(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_18;  // 0x3A0(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_19;  // 0x3A8(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_20;  // 0x3B0(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_21;  // 0x3B8(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_22;  // 0x3C0(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_23;  // 0x3C8(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_24;  // 0x3D0(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_25;  // 0x3D8(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_26;  // 0x3E0(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_27;  // 0x3E8(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_28;  // 0x3F0(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_37;  // 0x3F8(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_39;  // 0x400(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_40;  // 0x408(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_41;  // 0x410(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_42;  // 0x418(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_43;  // 0x420(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_44;  // 0x428(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_45;  // 0x430(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_46;  // 0x438(0x8)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_47;  // 0x440(0x8)

}; 



