#pragma once 
#include "SDK.h" 
 
 
// Function UI_HealthWidget2.UI_HealthWidget2_C.ExecuteUbergraph_UI_HealthWidget2
// Size: 0x40(Inherited: 0x0) 
struct FExecuteUbergraph_UI_HealthWidget2
{
	int32_t EntryPoint;  // 0x0(0x4)
	float K2Node_Event_value_2;  // 0x4(0x4)
	float K2Node_Event_value;  // 0x8(0x4)
	float CallFunc_FClamp_ReturnValue;  // 0xC(0x4)
	float CallFunc_FClamp_ReturnValue_2;  // 0x10(0x4)
	char pad_20[4];  // 0x14(0x4)
	struct UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue;  // 0x18(0x8)
	float CallFunc_GetFloatValue_ReturnValue;  // 0x20(0x4)
	struct FLinearColor CallFunc_LinearColorLerp_ReturnValue;  // 0x24(0x10)
	char pad_52[4];  // 0x34(0x4)
	struct UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_2;  // 0x38(0x8)

}; 
// Function UI_HealthWidget2.UI_HealthWidget2_C.SetMaxHealthPercentage
// Size: 0x4(Inherited: 0x4) 
struct FSetMaxHealthPercentage : public FSetMaxHealthPercentage
{
	float Value;  // 0x0(0x4)

}; 
// Function UI_HealthWidget2.UI_HealthWidget2_C.SetHealthPercentage
// Size: 0x4(Inherited: 0x4) 
struct FSetHealthPercentage : public FSetHealthPercentage
{
	float Value;  // 0x0(0x4)

}; 
