#pragma once 
#include <UI_ItemInventoryVicinity_Structs.h>
 
 
 
// WidgetBlueprintGeneratedClass UI_ItemInventoryVicinity.UI_ItemInventoryVicinity_C
// Size: 0x390(Inherited: 0x2F8) 
struct UUI_ItemInventoryVicinity_C : public UItemInventoryWidget2
{
	struct UHorizontalBox* _weightHorizontalBox;  // 0x2F8(0x8)
	struct UImage* DeadCellsImage;  // 0x300(0x8)
	struct UImage* ExtraSlotBackground;  // 0x308(0x8)
	struct UOverlay* ExtraSlotsOverlay;  // 0x310(0x8)
	struct UTextBlock* GreenText;  // 0x318(0x8)
	struct UImage* Image_1;  // 0x320(0x8)
	struct UImage* Image_2;  // 0x328(0x8)
	struct UImage* Image_3;  // 0x330(0x8)
	struct UImage* Image_4;  // 0x338(0x8)
	struct UImage* Image_5;  // 0x340(0x8)
	struct UImage* Image_7;  // 0x348(0x8)
	struct UImage* Image_84;  // 0x350(0x8)
	struct UImage* LoadingBackground;  // 0x358(0x8)
	struct UImage* MainExtraSlotImage;  // 0x360(0x8)
	struct UProgressBar* ProgressBar_1;  // 0x368(0x8)
	struct UTextBlock* RedText;  // 0x370(0x8)
	struct UOverlay* SeparatorOverlay;  // 0x378(0x8)
	struct UTextBlock* SlotsText;  // 0x380(0x8)
	struct USizeBox* WeightAndExpandSizeBox;  // 0x388(0x8)

}; 



