#pragma once 
#include <UI_IngredientsForRecipeWidget_Structs.h>
 
 
 
// WidgetBlueprintGeneratedClass UI_IngredientsForRecipeWidget.UI_IngredientsForRecipeWidget_C
// Size: 0x2E0(Inherited: 0x280) 
struct UUI_IngredientsForRecipeWidget_C : public UIngredientsForRecipeWidget
{
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget;  // 0x280(0x8)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_2;  // 0x288(0x8)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_3;  // 0x290(0x8)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_4;  // 0x298(0x8)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_5;  // 0x2A0(0x8)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_6;  // 0x2A8(0x8)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_7;  // 0x2B0(0x8)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_8;  // 0x2B8(0x8)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_9;  // 0x2C0(0x8)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_10;  // 0x2C8(0x8)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_11;  // 0x2D0(0x8)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_12;  // 0x2D8(0x8)

}; 



