#pragma once 
#include <UI_ItemInventory2_Structs.h>
 
 
 
// WidgetBlueprintGeneratedClass UI_ItemInventory2.UI_ItemInventory2_C
// Size: 0x388(Inherited: 0x2F8) 
struct UUI_ItemInventory2_C : public UItemInventoryWidget2
{
	struct UHorizontalBox* _weightHorizontalBox;  // 0x2F8(0x8)
	struct UImage* DeadCellsImage;  // 0x300(0x8)
	struct UImage* ExtraSlotBackground;  // 0x308(0x8)
	struct UOverlay* ExtraSlotsOverlay;  // 0x310(0x8)
	struct UTextBlock* GreenText;  // 0x318(0x8)
	struct UImage* Image_1;  // 0x320(0x8)
	struct UImage* Image_2;  // 0x328(0x8)
	struct UImage* Image_3;  // 0x330(0x8)
	struct UImage* Image_4;  // 0x338(0x8)
	struct UImage* Image_5;  // 0x340(0x8)
	struct UImage* Image_6;  // 0x348(0x8)
	struct UImage* Image_7;  // 0x350(0x8)
	struct UImage* MainExtraSlotImage;  // 0x358(0x8)
	struct UProgressBar* ProgressBar_1;  // 0x360(0x8)
	struct UTextBlock* RedText;  // 0x368(0x8)
	struct UOverlay* SeparatorOverlay;  // 0x370(0x8)
	struct UTextBlock* SlotsText;  // 0x378(0x8)
	struct USizeBox* WeightAndExpandSizeBox;  // 0x380(0x8)

}; 



