#pragma once 
#include <UI_JournalObjectiveContainer_Structs.h>
 
 
 
// WidgetBlueprintGeneratedClass UI_JournalObjectiveContainer.UI_JournalObjectiveContainer_C
// Size: 0x398(Inherited: 0x340) 
struct UUI_JournalObjectiveContainer_C : public UJournalObjectiveContainer
{
	struct UImage* _activateButtonBackground;  // 0x340(0x8)
	struct UImage* _background;  // 0x348(0x8)
	struct UImage* _descriptionBackground;  // 0x350(0x8)
	struct UImage* _dividerBottom;  // 0x358(0x8)
	struct UImage* _headerBackground;  // 0x360(0x8)
	struct UImage* _objectivesBg;  // 0x368(0x8)
	struct UImage* _resetButtonBackground;  // 0x370(0x8)
	struct UImage* _restartMissionButtonBackground;  // 0x378(0x8)
	struct UImage* _rewardsBackground;  // 0x380(0x8)
	struct UImage* _sectionBackground;  // 0x388(0x8)
	struct UImage* _untrackButtonBackground;  // 0x390(0x8)

}; 



