#pragma once 
#include "SDK.h" 
 
 
// Function UI_KillNotification.UI_KillNotification_C.ExecuteUbergraph_UI_KillNotification
// Size: 0x4(Inherited: 0x0) 
struct FExecuteUbergraph_UI_KillNotification
{
	int32_t EntryPoint;  // 0x0(0x4)

}; 
// Function UI_KillNotification.UI_KillNotification_C.GetMessageVisibility
// Size: 0x5C(Inherited: 0x0) 
struct FGetMessageVisibility
{
	uint8_t  ReturnValue;  // 0x0(0x1)
	char pad_1_1 : 7;  // 0x1(0x1)
	bool Temp_bool_Variable : 1;  // 0x1(0x1)
	uint8_t  Temp_byte_Variable;  // 0x2(0x1)
	uint8_t  Temp_byte_Variable_2;  // 0x3(0x1)
	char pad_4[4];  // 0x4(0x4)
	struct FText CallFunc_GetText_ReturnValue;  // 0x8(0x18)
	struct FText CallFunc_GetText_ReturnValue_2;  // 0x20(0x18)
	char pad_56_1 : 7;  // 0x38(0x1)
	bool CallFunc_TextIsEmpty_ReturnValue : 1;  // 0x38(0x1)
	char pad_57_1 : 7;  // 0x39(0x1)
	bool CallFunc_TextIsEmpty_ReturnValue_2 : 1;  // 0x39(0x1)
	char pad_58[6];  // 0x3A(0x6)
	struct FText CallFunc_GetText_ReturnValue_3;  // 0x40(0x18)
	char pad_88_1 : 7;  // 0x58(0x1)
	bool CallFunc_TextIsEmpty_ReturnValue_3 : 1;  // 0x58(0x1)
	char pad_89_1 : 7;  // 0x59(0x1)
	bool CallFunc_BooleanAND_ReturnValue : 1;  // 0x59(0x1)
	char pad_90_1 : 7;  // 0x5A(0x1)
	bool CallFunc_BooleanAND_ReturnValue_2 : 1;  // 0x5A(0x1)
	uint8_t  K2Node_Select_Default;  // 0x5B(0x1)

}; 
