#pragma once 
#include "SDK.h" 
 
 
// Function UI_Lockpicking.UI_Lockpicking_C.ExecuteUbergraph_UI_Lockpicking
// Size: 0xB0(Inherited: 0x0) 
struct FExecuteUbergraph_UI_Lockpicking
{
	int32_t EntryPoint;  // 0x0(0x4)
	int32_t CallFunc_GetTensionToolCount_ReturnValue;  // 0x4(0x4)
	int32_t CallFunc_Subtract_IntInt_ReturnValue;  // 0x8(0x4)
	struct FGeometry K2Node_Event_MyGeometry;  // 0xC(0x38)
	float K2Node_Event_InDeltaTime;  // 0x44(0x4)
	struct FText CallFunc_Conv_IntToText_ReturnValue;  // 0x48(0x18)
	float CallFunc_GetRemainingTime_ReturnValue;  // 0x60(0x4)
	float CallFunc_GetDuration_ReturnValue;  // 0x64(0x4)
	int32_t CallFunc_Round_ReturnValue;  // 0x68(0x4)
	float CallFunc_Divide_FloatFloat_ReturnValue;  // 0x6C(0x4)
	struct FText CallFunc_Conv_IntToText_ReturnValue_2;  // 0x70(0x18)
	struct UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue;  // 0x88(0x8)
	int32_t CallFunc_GetLockpicksCount_ReturnValue;  // 0x90(0x4)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_2;  // 0x94(0x4)
	struct FText CallFunc_Conv_IntToText_ReturnValue_3;  // 0x98(0x18)

}; 
// Function UI_Lockpicking.UI_Lockpicking_C.Tick
// Size: 0x3C(Inherited: 0x3C) 
struct FTick : public FTick
{
	struct FGeometry MyGeometry;  // 0x0(0x38)
	float InDeltaTime;  // 0x38(0x4)

}; 
