#pragma once 
#include "SDK.h" 
 
 
// Function UI_NightVisionResourceIndicatorWidget.UI_NightVisionResourceIndicatorWidget_C.ExecuteUbergraph_UI_NightVisionResourceIndicatorWidget
// Size: 0x50(Inherited: 0x0) 
struct FExecuteUbergraph_UI_NightVisionResourceIndicatorWidget
{
	int32_t EntryPoint;  // 0x0(0x4)
	float CallFunc_GetResourceAmountRatio_ReturnValue;  // 0x4(0x4)
	struct FGeometry K2Node_Event_MyGeometry;  // 0x8(0x38)
	float K2Node_Event_InDeltaTime;  // 0x40(0x4)
	char pad_68[4];  // 0x44(0x4)
	struct UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue;  // 0x48(0x8)

}; 
// Function UI_NightVisionResourceIndicatorWidget.UI_NightVisionResourceIndicatorWidget_C.Tick
// Size: 0x3C(Inherited: 0x3C) 
struct FTick : public FTick
{
	struct FGeometry MyGeometry;  // 0x0(0x38)
	float InDeltaTime;  // 0x38(0x4)

}; 
