#pragma once 
#include <UI_SpawnMenuWidget_Structs.h>
 
 
 
// WidgetBlueprintGeneratedClass UI_SpawnMenuWidget.UI_SpawnMenuWidget_C
// Size: 0x398(Inherited: 0x340) 
struct UUI_SpawnMenuWidget_C : public USpawnMenuWidget
{
	struct UBorder* Border_2;  // 0x340(0x8)
	struct UTextBlock* CurrentCurrencyText;  // 0x348(0x8)
	struct UImage* Image;  // 0x350(0x8)
	struct UImage* Image_2;  // 0x358(0x8)
	struct UImage* Image_3;  // 0x360(0x8)
	struct UImage* Image_4;  // 0x368(0x8)
	struct UImage* Image_5;  // 0x370(0x8)
	struct UTextBlock* MainStateLabel;  // 0x378(0x8)
	struct UTextBlock* RemainingCurrencyText;  // 0x380(0x8)
	struct UHorizontalBox* SpawnInterface;  // 0x388(0x8)
	struct UTextBlock* TotalPricetext;  // 0x390(0x8)

}; 



