#pragma once 
#include <UI_TournamentScoreboardWidget_Structs.h>
 
 
 
// WidgetBlueprintGeneratedClass UI_TournamentScoreboardWidget.UI_TournamentScoreboardWidget_C
// Size: 0x350(Inherited: 0x278) 
struct UUI_TournamentScoreboardWidget_C : public UTournamentScoreboardWidget
{
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow;  // 0x278(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_2;  // 0x280(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_3;  // 0x288(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_4;  // 0x290(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_5;  // 0x298(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_6;  // 0x2A0(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_7;  // 0x2A8(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_8;  // 0x2B0(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_9;  // 0x2B8(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_10;  // 0x2C0(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_11;  // 0x2C8(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_12;  // 0x2D0(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_13;  // 0x2D8(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_14;  // 0x2E0(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_15;  // 0x2E8(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_16;  // 0x2F0(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_17;  // 0x2F8(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_18;  // 0x300(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_19;  // 0x308(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_20;  // 0x310(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_21;  // 0x318(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_22;  // 0x320(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_23;  // 0x328(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_24;  // 0x330(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_25;  // 0x338(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_26;  // 0x340(0x8)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_40;  // 0x348(0x8)

}; 



