#pragma once 
#include <UI_Trader_BuyPanel_Structs.h>
 
 
 
// WidgetBlueprintGeneratedClass UI_Trader_BuyPanel.UI_Trader_BuyPanel_C
// Size: 0x968(Inherited: 0x478) 
struct UUI_Trader_BuyPanel_C : public UTraderBuyPanel
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x478(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnAmmo;  // 0x480(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnArmor;  // 0x488(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnArrows;  // 0x490(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnAssault;  // 0x498(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnBallisticVests;  // 0x4A0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnBaseBuildingExpansion;  // 0x4A8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnBayonets;  // 0x4B0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnBicycles;  // 0x4B8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnBlunt;  // 0x4C0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnBolts;  // 0x4C8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnBows;  // 0x4D0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnBullets;  // 0x4D8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnC4;  // 0x4E0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCityBike;  // 0x4E8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianBags;  // 0x4F0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianClothing;  // 0x4F8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianFootwear;  // 0x500(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianGloves;  // 0x508(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianHeadwear;  // 0x510(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianHeadwearCaps;  // 0x518(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianHeadwearEyewear;  // 0x520(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianHeadwearHelmets;  // 0x528(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianHeadwearMasks;  // 0x530(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianPants;  // 0x538(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianPantsLong;  // 0x540(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianPantsShort;  // 0x548(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianTops;  // 0x550(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianTopsJackets;  // 0x558(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianTopsLongSleeves;  // 0x560(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianTopsShirts;  // 0x568(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianUnderwear;  // 0x570(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnClothing;  // 0x578(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCombatHelmets;  // 0x580(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCraftingMaterials;  // 0x588(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCrossbows;  // 0x590(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnCutting;  // 0x598(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnDetonators;  // 0x5A0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnDirtbikeParts;  // 0x5A8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnExplosives;  // 0x5B0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnFarming;  // 0x5B8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnFarmingTools;  // 0x5C0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnFertilizers;  // 0x5C8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnFlashlights;  // 0x5D0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnFood;  // 0x5D8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnFoodCooked;  // 0x5E0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnFoodDrinks;  // 0x5E8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnFoodFresh;  // 0x5F0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnFoodFreshFruit;  // 0x5F8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnFoodFreshMeat;  // 0x600(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnFoodFreshMushrooms;  // 0x608(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnFoodFreshVegetables;  // 0x610(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnFoodProcessed;  // 0x618(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnFourWheels;  // 0x620(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnGhillieWraps;  // 0x628(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnGrenadeLaunchers;  // 0x630(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnGrenades;  // 0x638(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnHandguns;  // 0x640(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnHelmets;  // 0x648(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnLaikaParts;  // 0x650(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnLMGs;  // 0x658(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMagazines;  // 0x660(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMedical;  // 0x668(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMeleeWeapons;  // 0x670(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryBags;  // 0x678(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryBagsAssault;  // 0x680(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryBagsHiking;  // 0x688(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryBagsWaist;  // 0x690(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryBoots;  // 0x698(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryBootsAssault;  // 0x6A0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryBootsHiking;  // 0x6A8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryClothing;  // 0x6B0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryGloves;  // 0x6B8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryHeadwear;  // 0x6C0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryHeadwearBalaclava;  // 0x6C8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryHeadwearCaps;  // 0x6D0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryHeadwearGasMasks;  // 0x6D8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryHeadwearGoggles;  // 0x6E0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryHelmets;  // 0x6E8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryHolsters;  // 0x6F0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryPants;  // 0x6F8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryPantsCargo;  // 0x700(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryPantsGhillie;  // 0x708(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryPantsShorts;  // 0x710(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryPantsTactical;  // 0x718(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryScarfs;  // 0x720(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryTops;  // 0x728(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryTopsGhillies;  // 0x730(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryTopsJackets;  // 0x738(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryTopsShirts;  // 0x740(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryTopsSweaters;  // 0x748(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMines;  // 0x750(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMiscellaneous;  // 0x758(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMOtorbikes;  // 0x760(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMotorboats;  // 0x768(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnMountainBike;  // 0x770(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnPesticides;  // 0x778(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnPiercing;  // 0x780(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnPoliceVests;  // 0x788(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnQuivers;  // 0x790(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnRafts;  // 0x798(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnRails;  // 0x7A0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnRangedWeapons;  // 0x7A8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnRifles;  // 0x7B0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnScopes;  // 0x7B8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnSeeds;  // 0x7C0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnServices;  // 0x7C8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnShotguns;  // 0x7D0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnSights;  // 0x7D8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnSMGs;  // 0x7E0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnStabproofVests;  // 0x7E8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnStorage;  // 0x7F0(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnSUP;  // 0x7F8(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnSuppressors;  // 0x800(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnTacticalVests;  // 0x808(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnTools;  // 0x810(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnToolsFishing;  // 0x818(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnToolsLockpicking;  // 0x820(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnToolsRepair;  // 0x828(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnToolsRepairOther;  // 0x830(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnToolsRepairVehicle;  // 0x838(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnTwoWheels;  // 0x840(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnVests;  // 0x848(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnVintageHelmets;  // 0x850(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnWeaponAccessories;  // 0x858(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnWeaponParts;  // 0x860(0x8)
	struct UUI_Trader_ItemCategoryButton_C* _btnWolfsWagenParts;  // 0x868(0x8)
	struct UWrapBox* _cat2wdVehicles;  // 0x870(0x8)
	struct UWrapBox* _cat4wdVehicles;  // 0x878(0x8)
	struct UWrapBox* _catAmmo;  // 0x880(0x8)
	struct UWrapBox* _catArmor;  // 0x888(0x8)
	struct UWrapBox* _catArmorHelmets;  // 0x890(0x8)
	struct UWrapBox* _catArmorVests;  // 0x898(0x8)
	struct UWrapBox* _catBicycles;  // 0x8A0(0x8)
	struct UWrapBox* _catClothing;  // 0x8A8(0x8)
	struct UWrapBox* _catClothingCivilian;  // 0x8B0(0x8)
	struct UWrapBox* _catClothingCivilianHeadwear;  // 0x8B8(0x8)
	struct UWrapBox* _catClothingCivilianPants;  // 0x8C0(0x8)
	struct UWrapBox* _catClothingCivilianTops;  // 0x8C8(0x8)
	struct UWrapBox* _catClothingMilitary;  // 0x8D0(0x8)
	struct UWrapBox* _catClothingMilitaryBags;  // 0x8D8(0x8)
	struct UWrapBox* _catClothingMilitaryBoots;  // 0x8E0(0x8)
	struct UWrapBox* _catClothingMilitaryHeadwear;  // 0x8E8(0x8)
	struct UWrapBox* _catClothingMilitaryPants;  // 0x8F0(0x8)
	struct UWrapBox* _catClothingMilitaryTops;  // 0x8F8(0x8)
	struct UWrapBox* _catExplosives;  // 0x900(0x8)
	struct UWrapBox* _catFarming;  // 0x908(0x8)
	struct UWrapBox* _catFood;  // 0x910(0x8)
	struct UWrapBox* _catFoodFresh;  // 0x918(0x8)
	struct UWrapBox* _catMeleeWeapons;  // 0x920(0x8)
	struct UWrapBox* _catMotorbikes;  // 0x928(0x8)
	struct UWrapBox* _catRangedWeapons;  // 0x930(0x8)
	struct UWrapBox* _catTools;  // 0x938(0x8)
	struct UWrapBox* _catToolsRepair;  // 0x940(0x8)
	struct UWrapBox* _catVehiclesAndItems;  // 0x948(0x8)
	struct UWrapBox* _catWeaponAccessories;  // 0x950(0x8)
	struct UScrollBox* _mainScrollBox;  // 0x958(0x8)
	struct UImage* Image_32;  // 0x960(0x8)

	void Construct(); // Function UI_Trader_BuyPanel.UI_Trader_BuyPanel_C.Construct
	void ExecuteUbergraph_UI_Trader_BuyPanel(int32_t EntryPoint); // Function UI_Trader_BuyPanel.UI_Trader_BuyPanel_C.ExecuteUbergraph_UI_Trader_BuyPanel
}; 



