#pragma once 
#include <UI_WeaponOverviewTooltipPanelAbsolute_Structs.h>
 
 
 
// WidgetBlueprintGeneratedClass UI_WeaponOverviewTooltipPanelAbsolute.UI_WeaponOverviewTooltipPanelAbsolute_C
// Size: 0x2F0(Inherited: 0x2B0) 
struct UUI_WeaponOverviewTooltipPanelAbsolute_C : public UItemTooltipPanel
{
	struct UImage* Image_9;  // 0x2B0(0x8)
	struct UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_1;  // 0x2B8(0x8)
	struct UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_2;  // 0x2C0(0x8)
	struct UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_3;  // 0x2C8(0x8)
	struct UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_4;  // 0x2D0(0x8)
	struct UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_5;  // 0x2D8(0x8)
	struct UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_6;  // 0x2E0(0x8)
	struct UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_7;  // 0x2E8(0x8)

}; 



